{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8504",
  "eid" : "e858c1a0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778469562,
  "textBody" : "Dublin (,  ) is the capital of and largest city in Ireland. Dublin is located in the province of Leinster on the east coast of Ireland, at the mouth of the River Liffey and bordered on the South by the Wicklow Mountains. The city has an urban area population of 1,173,179. The population of the Dublin Region, , was 1,347,359 people, and the population of the Greater Dublin area was 1,904,806.\n\nThere is archaeological debate regarding precisely where Dublin was established by Celtic-speaking people in the 7th century. Later expanded as a Viking settlement, the Kingdom of Dublin became Ireland's principal city following the Norman invasion. The city expanded rapidly from the 17th century and was briefly the second largest city in the British Empire before the Acts of Union in 1800. Following the partition of Ireland in 1922, Dublin became the capital of the Irish Free State, later renamed Ireland.\n\nAs of 2010, Dublin was listed by the Globalization and World Cities Research Network (GaWC) as a global city, with a ranking of \"Alpha-\", which places it amongst the top thirty cities in the world. It is a historical and contemporary centre for education, the arts, administration, economy and industry.\n\nEtymology\n\nThe name Dublin comes from the Irish word Dubhlinn, early Classical Irish Dubhlind/Duibhlind, from dubh (,,) meaning \"black, dark\", and lind \"pool\", referring to a dark tidal pool. This tidal pool was located where the River Poddle entered the Liffey, on the site of the castle gardens at the rear of Dublin Castle. In Modern Irish the name is Duibhlinn, and Irish rhymes from Dublin County show that in Dublin Leinster Irish it was pronounced Duílinn. The original pronunciation is preserved in the names for the city in other languages such as Old English Difelin, Old Norse Dyflin, modern Icelandic Dyflinn and modern Manx Divlyn as well as Welsh Dulyn. Other localities in Ireland also bear the name Duibhlinn, variously anglicized as Devlin, Divlin and Difflin. Historically, scribes using the Gaelic script wrote bh with a dot over the b, rendering Duḃlinn or Duiḃlinn. Those without knowledge of Irish omitted the dot, spelling the name as Dublin. Variations on the name are also found in traditionally Gaelic-speaking areas of Scotland (Gàidhealtachd, cognate with Irish Gaeltachta), such as An Linne Dhubh (\"the black pool\"), which is part of Loch Linnhe.\n\nIt is now thought that the Viking settlement was preceded by a Christian ecclesiastical settlement known as Duibhlinn, from which Dyflin took its name. Beginning in the 9th and 10th century, there were two settlements where the modern city stands. The Viking settlement of about 841, Dyflin, and a Gaelic settlement, Áth Cliath (\"ford of hurdles\") further up river, at the present day Father Mathew Bridge (also known as Dublin Bridge), at the bottom of Church Street. ', meaning \"town of the hurdled ford\", is the common name for the city in modern Irish. ' is a place name referring to a fording point of the River Liffey near Father Mathew Bridge. ' was an early Christian monastery, believed to have been in the area of Aungier Street, currently occupied by Whitefriar Street Carmelite Church. There are other towns of the same name, such as Àth Cliath in East Ayrshire, Scotland, which is Anglicised as Hurlford.\n\nHistory\n\nThe area of Dublin Bay has been inhabited by humans since prehistoric times, but the writings of Ptolemy (the Greco-Roman astronomer and cartographer) in about AD 140 provide possibly the earliest reference to a settlement there. He called the settlement Eblana polis ().\n\nDublin celebrated its 'official' millennium in 1988, meaning that the Irish government recognised 988 as the year in which the city was settled and that this first settlement would later become the city of Dublin.\n\nIt is now thoughtClarke, Howard (1995). Medieval Dublin, the making of a metropolis. Irish Academic Press. p. 44.  that the Viking settlement was preceded by a Christian ecclesiastical settlement known as Duibhlinn, from which Dyflin took its name. Beginning in the 9th and 10th century, there were two settlements which later became the modern Dublin. The subsequent Scandinavian settlement centred on the River Poddle, a tributary of the Liffey in an area now known as Wood Quay. The Dubhlinn was a small lake used to moor ships; the Poddle connected the lake with the Liffey. This lake was covered during the early 18th century as the city grew. The Dubhlinn lay where the Castle Garden is now located, opposite the Chester Beatty Library in Dublin Castle. Táin Bó Cuailgne (\"The Cattle Raid of Cooley\") refers to Dublind rissa ratter Áth Cliath, meaning \"Dublin, which is called Ath Cliath\".\n\nMiddle Ages\n\nDublin was established as a Viking settlement in the 10th century and, despite a number of rebellions by the native\nIrish, it remained largely under Viking control until the Norman invasion of Ireland was launched from Wales in 1169. It was upon the death of Muirchertach Mac Lochlainn in early 1166 that Ruaidrí Ua Conchobair, King of Connacht, proceeded to Dublin and was inaugurated King of Ireland without opposition. Arguably, he was the primitive undebated full king of Ireland and also the only Gaelic one.\n\nAccording to some historians, part of the city's early economic growth is attributed to a trade in slaves. Slavery in Ireland and Dublin reached its pinnacle in the 9th and 10th centuries. Prisoners of slave raids and kidnappings which captured men, women and children brought revenue to the Celtic Irish Sea raiders, as well as to the Vikings who had initiated the practice. The victims came from Wales, England, Normandy and beyond.\n\nThe King of Leinster, Diarmait Mac Murchada, after his exile by Ruaidhrí, enlisted the help of Strongbow, the Earl of Pembroke, to conquer Dublin. Following Mac Murrough's death, Strongbow declared himself King of Leinster after gaining control of the city. In response to Strongbow's successful invasion, King Henry II of England reaffirmed his sovereignty by mounting a larger invasion in 1171 and pronounced himself Lord of Ireland. Around this time, the county of the City of Dublin was established along with certain liberties adjacent to the city proper. This continued down to 1840 when the barony of Dublin City was separated from the barony of Dublin. Since 2001, both baronies have been redesignated the City of Dublin.\n\nDublin Castle, which became the centre of Norman power in Ireland, was founded in 1204 as a major defensive work on the orders of King John of England. Following the appointment of the first Lord Mayor of Dublin in 1229, the city expanded and had a population of 8,000 by the end of the 13th century. Dublin prospered as a trade centre, despite an attempt by King Robert I of Scotland to capture the city in 1317. It remained a relatively small walled medieval town during the 14th century and was under constant threat from the surrounding native clans. In 1348, the Black Death, a lethal plague which had ravaged Europe, took hold in Dublin and killed thousands over the following decade.\"[https://books.google.com/books?id\nR688at3KskQC&pgPA49&dq&hl\nen#vonepage&q\n&ffalse The Story of Ireland]\". Brian Igoe (2009). p.49.\"[https://books.google.com/books?id\nyw3HmjRvVQMC&pgPA58&dq&hl\nen#vonepage&q\n&f=false Black Death]\". Joseph Patrick Byrne (2004). p.58. \n\nDublin was incorporated into the English Crown as the Pale, which was a narrow strip of English settlement along the eastern seaboard. The Tudor conquest of Ireland in the 16th century spelt a new era for Dublin, with the city enjoying a renewed prominence as the centre of administrative rule in Ireland. Determined to make Dublin a Protestant city, Queen Elizabeth I of England established Trinity College in 1592 as a solely Protestant university and ordered that the Catholic St. Patrick's and Christ Church cathedrals be converted to Protestant.\n\nThe city had a population of 21,000 in 1640 before a plague in 1649–51 wiped out almost half of the city's inhabitants. However, the city prospered again soon after as a result of the wool and linen trade with England, reaching a population of over 50,000 in 1700.\"[https://books.google.com/books?idgI8MYY6ASdcC&pg\nPA34&dq&hlen#v\nonepage&q&f\nfalse Dublin: a cultural history]\". Siobhán Marie Kilfeather (2005). Oxford University Press US. pp. 34–35. \n\nEarly modern\n\nAs the city continued to prosper during the 18th century, Georgian Dublin became, for a short period, the second largest city of the British Empire and the fifth largest city in Europe, with the population exceeding 130,000. The vast majority of Dublin's most notable architecture dates from this period, such as the Four Courts and the Custom House. Temple Bar and Grafton Street are two of the few remaining areas that were not affected by the wave of Georgian reconstruction and maintained their medieval character.\n\nDublin grew even more dramatically during the 18th century, with the construction of many new districts and buildings, such as Merrion Square, Parliament House and the Royal Exchange. The Wide Streets Commission was established in 1757 at the request of Dublin Corporation to govern architectural standards on the layout of streets, bridges and buildings. In 1759, the founding of the Guinness brewery resulted in a considerable economic gain for the city. For much of the time since its foundation, the brewery was Dublin's largest employer.\n\nLate modern and contemporary\n\nDublin suffered a period of political and economic decline during the 19th century following the Acts of Union 1800, under which the seat of government was transferred to the Westminster Parliament in London. The city played no major role in the Industrial Revolution, but remained the centre of administration and a transport hub for most of the island. Ireland had no significant sources of coal, the fuel of the time, and Dublin was not a centre of ship manufacturing, the other main driver of industrial development in Britain and Ireland. Belfast developed faster than Dublin during this period on a mixture of international trade, factory-based linen cloth production and shipbuilding.\n\nThe Easter Rising of 1916, the Irish War of Independence, and the subsequent Irish Civil War resulted in a significant amount of physical destruction in central Dublin. The Government of the Irish Free State rebuilt the city centre and located the new parliament, the Oireachtas, in Leinster House. Since the beginning of Norman rule in the 12th century, the city has functioned as the capital in varying geopolitical entities: Lordship of Ireland (1171–1541), Kingdom of Ireland (1541–1800), as part of the United Kingdom of Great Britain and Ireland (1801–1922), and the Irish Republic (1919–1922). Following the partition of Ireland in 1922, it became the capital of the Irish Free State (1922–1937) and now is the capital of Ireland. One of the memorials to commemorate that time is the Garden of Remembrance.\n\nDublin was also victim to the Northern Irish Troubles. During this 30 year conflict, violence mainly engulfed Northern Ireland. However, the Provisional IRA drew some support from within the Republic, including from Dublin. A Loyalist paramilitary group, the Ulster Volunteer Force, bombed the city during this time - notably in an atrocity known as the Dublin and Monaghan bombings in which 34 people died, mainly in Dublin itself.\n\nSince 1997, the landscape of Dublin has changed. The city was at the forefront of Ireland’s economic expansion during the Celtic Tiger period, with private sector and state development of housing, transport and business. Following an economic decline during the Great Recession, Dublin has rebounded and as of 2017 has close to full employment.\n\nGovernment\n\nLocal\n\nFrom 1842, the boundaries of the city were comprehended by the baronies of Dublin City and the Barony of Dublin. In 1930, the boundaries were extended by the Local Government (Dublin) Act.Irish Statute Book. [http://www.irishstatutebook.ie/1930/en/act/pub/0027/sched1.html#sched1 Local Government (Dublin) Act] Later, in 1953, the boundaries were again extended by the Local Government Provisional Order Confirmation Act.\n\nDublin City Council is a unicameral assembly of 63 members elected every five years from Local Election Areas. It is presided over by the Lord Mayor, who is elected for a yearly term and resides in Dublin's Mansion House. Council meetings occur at Dublin City Hall, while most of its administrative activities are based in the Civic Offices on Wood Quay. The party or coalition of parties, with the majority of seats adjudicates committee members, introduces policies, and appoints the Lord Mayor. The Council passes an annual budget for spending on areas such as housing, traffic management, refuse, drainage, and planning. The Dublin City Manager is responsible for implementing City Council decisions.\n\nNational\n\nAs the capital city, Dublin is the seat of the national parliament of Ireland, the Oireachtas. It is composed of the President of Ireland, Seanad Éireann as the upper house, and Dáil Éireann as the lower house. The President resides in Áras an Uachtaráin in Phoenix Park, while both houses of the Oireachtas meet in Leinster House, a former ducal palace on Kildare Street. It has been the home of the Irish parliament since the creation of the Irish Free State in 1922. The old Irish Houses of Parliament of the Kingdom of Ireland are located in College Green.\n\nGovernment Buildings house the Department of the Taoiseach, the Council Chamber, the Department of Finance and the Office of the Attorney General. It consists of a main building (completed 1911) with two wings (completed 1921). It was designed by Thomas Manley Dean and Sir Aston Webb as the Royal College of Science. The First Dáil originally met in the Mansion House in 1919. The Irish Free State government took over the two wings of the building to serve as a temporary home for some ministries, while the central building became the College of Technology until 1989.Department of the Taoiseach: Guide to Government Buildings (2005) Although both it and Leinster House were intended to be temporary, they became the permanent homes of parliament from then on.\n\nFor elections to Dáil Éireann, the city is divided into five constituencies: Dublin Central (3 seats), Dublin Bay North (5 seats), Dublin North-West (3 seats), Dublin South-Central (4 seats) and Dublin Bay South (4 seats). Nineteen TD's are elected in total.\n\nPolitics\n\nIn the 2016 general election the Dublin Region elected 14 Fine Gael, 7 Sinn Féin, 6 Fianna Fáil, 3 People Before Profit Alliance, 2 Socialist Party, 2 Labour Party, 2 Green Party, 1 Social Democrats and 7 Independent TDs.\n\nGeography\n\nLandscape\n\nDublin is situated at the mouth of the River Liffey and encompasses a land area of approximately 115 km2 in east-central Ireland. It is bordered by a low mountain range to the south and surrounded by flat farmland to the north and west. The\nLiffey divides the city in two between the Northside and the Southside. Each of these is further divided by two lesser rivers – the River Tolka running southeast into Dublin Bay, and the River Dodder running northeast to the mouth of the Liffey. Two further water bodies – the Grand Canal on the southside and the Royal Canal on the northside – ring the inner city on their way from the west and the River Shannon.\n\nThe River Liffey bends at Leixlip from a northeasterly route to a predominantly eastward direction, and this point also marks the transition to urban development from more agricultural land usage.\n\nCultural divide\n\nA north-south division at one time did traditionally exist, with the River Liffey as the divider. The Northside was generally seen as working class to lower middle class, while the Southside was seen as middle class to upper-middle class. In recent decades this has changed with both Northside and Southside seeing urban and economic redevelopment bringing prosperity especially to the Northside. Dublin's economic divide was also previously an east-west as well as a north-south. There were also social divisions evident between the coastal suburbs in the east of the city, and the newer developments further to the west.\n\nIn some tourism and real-estate marketing contexts, Dublin is sometimes divided into a number of quarters or districts. These include, the 'Medieval Quarter' (in the area of Dublin Castle, Christ Church and St Patrick's Cathedral and the old city walls), the 'Georgian Quarter' (including the area around St Stephen's Green, Trinity College, and Merrion Square), the 'Docklands Quarter' (around the Dublin Docklands and Silicon Docks), the 'Cultural Quarter' (around Temple Bar), and 'Creative Quarter' (between South William Street and George's Street).\n\nClimate\n\nSimilar to much of the rest of northwestern Europe, Dublin experiences a maritime climate (Cfb) with cool summers, mild winters, and a lack of temperature extremes. The average maximum January temperature is , while the average maximum July temperature is . On average, the sunniest months are May and June, while the wettest month is October with 76 mm of rain, and the driest month is February with 46 mm. Rainfall is evenly distributed throughout the year.\n\nDublin's sheltered location on the east coast makes it the driest place in Ireland, receiving only about half the rainfall of the west coast. Ringsend in the south of the city records the lowest rainfall in the country, with an average annual precipitation of 683 mm, with the average annual precipitation in the city centre being 714 mm. The main precipitation in winter is rain; however snow showers do occur between November and March. Hail is more common than snow. The city experiences long summer days and short winter days. Strong Atlantic winds are most common in autumn. These winds can affect Dublin, but due to its easterly location it is least affected compared to other parts of the country. However, in winter, easterly winds render the city colder and more prone to snow showers.\n\nIn the 20th century, smog and air-pollution were an issue in the city, precipitating a ban on bituminous fuels across Dublin. The ban was implemented in 1990 to address black smoke concentrations, that had been linked to cardiovascular and respiratory deaths in residents. Since the ban, non-trauma death rates, respiratory death rates and cardiovascular death rates have declined - by an estimated 350 deaths annually.\n\nPlaces of interest\n\nLandmarks\n\nDublin has many landmarks and monuments dating back hundreds of years. One of the oldest is Dublin Castle, which was first founded as a major defensive work on the orders of England's King John in 1204, shortly after the Norman invasion of Ireland in 1169, when it was commanded that a castle be built with strong walls and good ditches for the defence of the city, the administration of justice, and the protection of the King's treasure. Largely complete by 1230, the castle was of typical Norman courtyard design, with a central square without a keep, bounded on all sides by tall defensive walls and protected at each corner by a circular tower. Sited to the south-east of Norman Dublin, the castle formed one corner of the outer perimeter of the city, using the River Poddle as a natural means of defence.\n\nOne of Dublin's newest monuments is the Spire of Dublin, or officially titled \"Monument of Light\".\n It is a  conical spire made of stainless steel and is located on O'Connell Street. It replaces Nelson's Pillar and is intended to mark Dublin's place in the 21st century. The spire was designed by Ian Ritchie Architects, who sought an \"Elegant and dynamic simplicity bridging art and technology\". The base of the monument is lit and the top is illuminated to provide a beacon in the night sky across the city. The Book of Kells, located in the library of Trinity College, Dublin, is one of the city's most visited sites. The Book of Kells is an illustrated manuscript created by Irish monks circa 800 AD. The Ha'penny Bridge, an iron footbridge over the River Liffey, is one of the most photographed sights in Dublin and is considered to be one of Dublin's most iconic landmarks.\n\nOther landmarks and monuments include the Mansion House, the Anna Livia monument, the Molly Malone statue, Christ Church Cathedral, St Patrick's Cathedral, Saint Francis Xavier Church on Upper Gardiner Street near Mountjoy Square, The Custom House and Áras an Uachtaráin. The Poolbeg Towers are also landmark features of Dublin, and visible from various spots around the city.\n\nParks\n\nThere are many green-spaces around the city, and Dublin City Council manages over 1500 ha of parks. Public parks include the Phoenix Park, Herbert Park and St Stephen's Green. The Phoenix Park is about 3 km west of the city centre, north of the River Liffey. Its 16 km perimeter wall encloses 707 ha, making it one of the largest walled city parks in Europe.It is larger than all of London’s city parks put together, and more than twice the area of New York’s Central Park.  It includes large areas of grassland and tree-lined avenues, and since the 17th century has been home to a herd of wild Fallow deer. The residence of the President of Ireland (Áras an Uachtaráin), which was built in 1751, is located in the park. The park is also home to Dublin Zoo, Ashtown Castle, and the official residence of the United States Ambassador. Music concerts are also sometimes held in the park.\n\nSt Stephen's Green is adjacent to one of Dublin's main shopping streets, Grafton Street, and to a shopping centre named for it, while on its surrounding streets are the offices of a number of public bodies and the city terminus of one of Dublin's Luas tram lines. Saint Anne's Park is a public park and recreational facility, shared between Raheny and Clontarf, both suburbs on the North Side of Dublin.\nThe park, the second largest municipal park in Dublin, is part of a former 2 km² estate assembled by members of the Guinness family, beginning with Benjamin Lee Guinness in 1835 (the largest municipal park is nearby (North) Bull Island, also shared between Clontarf and Raheny).\n\nEconomy\n\nThe Dublin region is the economic centre of Ireland, and was at the forefront of the country's economic expansion during the Celtic Tiger period. In 2009, Dublin was listed as the fourth richest city in the world by purchasing power and 10th richest by personal income. According to Mercer's 2011 Worldwide Cost of Living Survey, Dublin is the 13th most expensive city in the European Union (down from 10th in 2010) and the 58th most expensive place to live in the world (down from 42nd in 2010). , approximately 800,000 people were employed in the Greater Dublin Area, of whom around 600,000 were employed in the services sector and 200,000 in the industrial sector. \n\nA number of Dublin's traditional industries, such as food processing, textile manufacturing, brewing, and distilling have gradually declined, although Guinness has been brewed at the St. James's Gate Brewery since 1759. Economic improvements in the 1990s attracted a number of global pharmaceutical, information and communications technology companies to the city and Greater Dublin Area. Companies such as Microsoft, Google, Amazon, eBay, PayPal, Yahoo!, Facebook, Twitter, Accenture and Pfizer now have European headquarters and/or operational bases in the city, with several located in enterprise clusters like the Digital Hub and Silicon Docks. This presence of these companies has driven economic expansion in the city and led to Dublin sometimes being referred to as the \"Tech Capital of Europe\".\n\nFinancial services have also become important to the city since the establishment of Dublin's International Financial Services Centre in 1987. More than 500 operations are approved to trade under the IFSC programme. The centre is host to half of the world's top 50 banks and to half of the top 20 insurance companies. Many international firms have established major headquarters in the city, such as Citibank and Commerzbank. The Irish Stock Exchange (ISEQ), Internet Neutral Exchange (INEX) and Irish Enterprise Exchange (IEX) are also located in Dublin. Dublin has been positioned as one of the main cities vying to host Financial Services companies hoping to retain access to the Eurozone after Brexit. The Celtic Tiger also led to a temporary boom in construction, with large redevelopment projects in the Dublin Docklands and Spencer Dock. Completed projects include the Convention Centre, the 3Arena, and the Bord Gáis Energy Theatre.\n\nTransport\n\nRoad\n\nThe road network in Ireland is primarily focused on Dublin. The M50 motorway, a semi-ring road which runs around the south, west and north of the city, connects important national primary routes to the rest of the country. In 2008, the West-Link toll bridge was replaced by the eFlow barrier-free tolling system, with a three-tiered charge system based on electronic tags and car pre-registration.\n\nThe first phase of a proposed eastern bypass for the city is the Dublin Port Tunnel, which officially opened in 2006 to mainly cater for heavy vehicles. The tunnel connects Dublin Port and the M1 motorway close to Dublin Airport. The city is also surrounded by an inner and outer orbital route. The inner orbital route runs approximately around the heart of the Georgian city and the outer orbital route runs primarily along the natural circle formed by Dublin's two canals, the Grand Canal and the Royal Canal, as well as the North and South Circular Roads.\n\nThe 2016 TomTom Traffic Index ranked Dublin the 15th most congested city in the world and the 7th most congested in Europe.\n\nDublin is served by a network of nearly 200 bus routes which cover the city and suburbs. The majority of these are controlled by Dublin Bus, but a number of smaller companies also operate. Fares are generally calculated on a stage system based on distance travelled. There are several different levels of fares, which apply on most services. A \"Real Time Passenger Information\" system was introduced at Dublin Bus bus stops in 2012. Electronically displayed signs relay information about the time of the next bus' arrival based on its GPS determined position. The National Transport Authority is responsible for integration of bus and rail services in Dublin and has been involved in introducing a pre-paid smart card, called a Leap card, which can be used on all of Dublin’s public transport services.\n\nRail and tram\n\nHeuston and Connolly stations are the two main railway stations in Dublin. Operated by Iarnród Éireann, the Dublin Suburban Rail network consists of five railway lines serving the Greater Dublin Area and commuter towns such as Drogheda and Dundalk in County Louth. One of these lines is the electrified Dublin Area Rapid Transit (DART) line, which runs primarily along the coast of Dublin, comprising 31 stations, from Malahide and Howth southwards as far as Greystones in County Wicklow. Commuter rail operates on the other four lines using Irish Rail diesel multiple units. In 2013, passengers for DART and Dublin Suburban lines were 16 million and 11.7 million, respectively (around 75% of all Irish Rail passengers).\n\nThe Luas is a light rail system, run by Transdev Ireland (under contract from Transport Infrastructure Ireland), and has been operating since 2004, carrying over 34 million passengers annually. The network consists of two interconnecting tram lines; the Red Line links the Docklands and city centre with the south-western suburbs of Tallaght and Saggart, while the Green Line connects northern inner city suburbs and the main city centre with suburbs to the south of the city including Sandyford and Brides Glen. Together these lines comprise a total 67 stations and  of track. Construction of a 6 km extension to the Green Line, bringing it into the north of the city, commenced in June 2013 and was opened for passenger travel on December 9, 2017.\n\nRail and ferry\n\nDublin Connolly is connected by bus to Dublin Port and ferries run by Irish Ferries and Stena Line to Holyhead for connecting trains on the North Wales Coast Line to Chester, Crewe and London Euston. Dublin Connolly to Dublin Port can be reached via Amiens Street, Dublin into Store Street or by Luas via Busáras where Dublin Bus operates services to the Ferry Terminal.\n\nAirport\n\n Dublin Airport (owned and operated by DAA) is located north of Dublin City in the administrative county of Fingal. It is the headquarters of Ireland's flag carrier Aer Lingus, low-cost carrier Ryanair, and regional airlines Stobart Air and CityJet. The airport offers a short and medium haul network, as well as domestic services to several regional airports in Ireland. There are also long-haul services to the United States, Canada and the Middle East. Dublin Airport is the busiest airport in Ireland, followed by Cork and Shannon. Construction of a second terminal began in 2007 and was officially opened on 19 November 2010.\n\nIn 2014, Dublin Airport was the 18th busiest airport in Europe, serving over 21 million passengers. By 2016 this increased to 27.9 million passengers passing through the airport, establishing an all-time record supported by growth in both short- and long-haul networks.\n\nIn 2015 and 2016, transatlantic traffic grew somewhat. For example, in the summer of 2015, Dublin Airport had 158 flights a week to North America, making it the sixth largest European hub for that route over the year. Transatlantic traffic was also the fastest-growing segment of the market for the airport in 2016, in which a 16% increase from 2015 brought the yearly number of passengers traveling between Dublin and North America to 2.9 million.\n\nFrom 2010 to 2016, Dublin Airport saw an increase of nearly 9.5 million passengers in its annual traffic, as the number of commercial aircraft movements has similarly followed a growth trend from 163,703 in 2013 to 191,233 in 2015.\n\nCycling\n\nDublin City Council began installing cycle lanes and tracks throughout the city in the 1990s, and  the city had over 200 km of specific on- and off-road tracks for cyclists. In 2011, the city was ranked 9th of major world cities on the Copenhagenize Index of Bicycle-Friendly Cities. The same index also showed a fall to 15th in 2015.\n\nDublinbikes is a self-service bicycle rental scheme which has been in operation in Dublin since 2009. Sponsored by JCDecaux and Just Eat, the scheme consists of 550 French-made unisex bicycles stationed at 44 terminals throughout the city centre. Users must make a subscription for either an annual Long Term Hire Card or purchase a three-day ticket. As of 2011, Dublinbikes had over 58,000 subscribers and had plans to expand the service across the city and suburbs to provide for up to 5,000 bicycles and approximately 300 terminals.\n\nThe 2011 Census revealed that 5.9 percent of commuters in Dublin cycled. A 2013 report by Dublin City Council on traffic flows crossing the canals in and out of the city found that just under 10% of all traffic was made up of cyclists, representing an increase of 14.1% over 2012 and an 87.2% increase over 2006 levels and is attributed to measures, such as, the Dublinbikes bike rental scheme, the provision of cycle lanes, public awareness campaigns to promote cycling and the introduction of the 30kph city centre speed limit.\n\nHigher education\n\nDublin is one of the primary centres of education in Ireland, and is home to three universities, Dublin Institute of Technology and a number of other higher education institutions. There are 20 third-level institutes in the city and in surrounding towns and suburbs.\nDublin was European Capital of Science in 2012.\n\nThe University of Dublin is the oldest university in Ireland dating from the 16th century, and is located in the city centre. Its sole constituent college, Trinity College (TCD), was established by Royal Charter in 1592 under Elizabeth I. It was closed to Roman Catholics until Catholic Emancipation, and the Catholic hierarchy then banned Roman Catholics from attending until 1970. It is situated in the city centre, on College Green, and has 15,000 students.\n\nThe National University of Ireland (NUI) has its seat in Dublin, which is also the location of the associated constituent university of University College Dublin (UCD), which has over 30,000 students. Founded in 1854, it is now the largest university in Ireland. UCD's main campus is at Belfield, about 5 km from the city centre in the southeastern suburbs.\n\nWith a continuous history dating back to 1887, Dublin's principal, and Ireland's largest, institution for technological education and research, Dublin Institute of Technology (DIT) has over 23,000 students. DIT specialises in engineering, architecture, sciences, health, journalism, digital media, hospitality and business but also offers art, design, music and humanities programmes. DIT has campuses, buildings and research facilities at several locations, including buildings at Kevin Street, Aungier Street, Bolton Street and Cathal Brugha Street in central Dublin. It has commenced consolidation to a new campus in Grangegorman.\n\nDublin City University (DCU), formerly known as the National Institute for Higher Education (NIHE), offers courses in business, engineering, science, communication courses, languages and primary education. It has around 16,000 students, and its main campus, the Glasnevin Campus, is located about 7 km from the city centre in the northern suburbs. It has two campuses on the Northside of the river, the DCU Glasnevin Campus and the DCU Drumcondra Campus. The Drumcondra campus includes St Patrick's College of Education, the nearby Mater Dei Institute and students from the Church of Ireland College of Education.\n\nThe Royal College of Surgeons in Ireland (RCSI) is a medical school which is a recognised college of the NUI, and is situated at St. Stephen's Green in the city centre. The Institute of European Affairs is also in Dublin. Dublin Business School (DBS) is Ireland's largest private third level institution with over 9,000 students located on Aungier Street. The National College of Art and Design (NCAD) supports training and research in art, design and media. The National College of Ireland (NCI) is also based in Dublin. The Economic and Social Research Institute, a social science research institute, is based on Sir John Rogerson's Quay.\n\nThe Irish public administration and management training centre has its base in Dublin, the Institute of Public Administration provides a range of undergraduate and post graduate awards via the National University of Ireland and in some instances, Queen's University Belfast. There are also smaller specialised colleges, including Griffith College Dublin, The Gaiety School of Acting and the New Media Technology College.\n\nOutside of the city, the towns of Tallaght in South Dublin and Dún Laoghaire in Dún Laoghaire–Rathdown have regional colleges:\nThe Institute of Technology, Tallaght has full and part-time courses in a wide range of technical subjects and the Dún Laoghaire Institute of Art, Design and Technology (IADT) supports training and research in art, design, business, psychology and media technology.\nThe western suburb of Blanchardstown offers childcare and sports management courses along with languages and technical subjects at the Institute of Technology, Blanchardstown.\n\nDemographics\n\nThe City of Dublin is the area administered by Dublin City Council, but the term \"Dublin\" is also used to refer to the contiguous urban area which includes parts of the adjacent local authority areas of Dún Laoghaire–Rathdown, Fingal and South Dublin. Together, the four areas form the traditional County Dublin. This area is sometimes known as the Dublin Region. The population of the administrative area controlled by the City Council was 553,165 in the 2016 census, while the population of the urban area was 1,173,179. The County Dublin population was 1,273,069 and that of the Greater Dublin Area 1,904,806. The area's population is expanding rapidly, and it is estimated by the Central Statistics Office that it will reach 2.1 million by 2020.[http://www.rte.ie/news/2007/0402/87392-dublin/ Call for improved infrastructure for Dublin] 2 April 2007\n\nThe percentage of Protestants in Dublin has dropped from over 10% in 1891 to 3-4% today.\n\nSince the late 1990s, Dublin has experienced a significant level of net immigration, with the greatest numbers coming from the European Union, especially the United Kingdom, Poland and Lithuania.\"[https://www.theguardian.com/media/2006/mar/12/pressandpublishing.business3 Dublin heralds a new era in publishing for immigrants]\". The Guardian 12 March 2006. There is also immigration from outside Europe, including from India, Pakistan, China and Nigeria. Dublin is home to a greater proportion of newer arrivals than any other part of the country. Sixty percent of Ireland's Asian population lives in Dublin.[http://www.rte.ie/news/2007/0726/91717-census/ Foreign nationals now 10% of Irish population] 26 July 2007 Over 15% of Dublin's population was foreign-born in 2006.\"Dublin\". OPENCities, a British Council project.  This number decreased during the Great Recession as foreign-born immigrants returned due to high unemployment.\n\nThe capital attracts the largest proportion of non-Catholic migrants from other countries. Increased secularisation in Ireland has prompted a drop in regular Catholic church attendance in Dublin from over 90 percent in the mid-1970s down to 14 percent according to a 2011 survey.[https://www.nytimes.com/2016/01/22/world/europe/ireland-catholic-baptism-school.html?hp&actionclick&pgtype\nHomepage&clickSourcestory-heading&module\nsecond-column-region&regiontop-news&WT.nav\ntop-news Catholic Church's Hold on Schools at Issue in Changing Ireland] The New York Times, 21 January 2016\n\nAccording to the 2011 census, the population of Dublin was 90% white (including 400,749 white Irish [78%], 57,748 other white [11%] and 1,923 white Irish traveller), 1% black, and 4% Asian. In terms of religion, 75% identified as Catholic, 10% as other stated religions, with 14% having no religion or no religion stated.http://airo.maynoothuniversity.ie/external-content/dublin-city\n\nCulture\n\nThe arts\n\nDublin has a significant literary history, and produced many literary figures, including Nobel laureates William Butler Yeats, George Bernard Shaw and Samuel Beckett. Other influential writers and playwrights include Oscar Wilde, Jonathan Swift and the creator of Dracula, Bram Stoker. It is also the location of key and notable works of James Joyce, including Ulysses, which is set in Dublin and includes much topical detail. Dubliners is a collection of short stories by Joyce about incidents and typical characters of the city during the early 20th century. Other renowned writers include J. M. Synge, Seán O'Casey, Brendan Behan, Maeve Binchy, and Roddy Doyle. Ireland's biggest libraries and literary museums are found in Dublin, including the National Print Museum of Ireland and National Library of Ireland. In July 2010, Dublin was named as a UNESCO City of Literature, joining Edinburgh, Melbourne and Iowa City with the permanent title.[http://www.independent.ie/irish-news/delight-at-city-of-literature-accolade-for-dublin-26666430.html Irish Independent – Delight at City of Literature accolade for Dublin]. Retrieved 26 July 2010.\n\nThere are several theatres within the city centre, and various well-known actors have emerged from the Dublin theatrical scene, including Noel Purcell, Michael Gambon, Brendan Gleeson, Stephen Rea, Colin Farrell, Colm Meaney and Gabriel Byrne. The best known theatres include the Gaiety, Abbey, Olympia, Gate, and Grand Canal. The Gaiety specialises in musical and operatic productions, and also opens its doors after the evening theatre production to host a variety of live music, dancing, and films. The Abbey was founded in 1904 by a group that included Yeats with the aim of promoting indigenous literary talent. It went on to provide a breakthrough for some of the city's most famous writers, such as Synge, Yeats himself and George Bernard Shaw. The Gate was founded in 1928 to promote European and American Avant Garde works. The Grand Canal Theatre is a newer 2,111 capacity theatre which opened in 2010 in the Grand Canal Dock area.\n\nApart from being the focus of the country's literature and theatre, Dublin is also the focal point for much of Irish art and the Irish artistic scene. The Book of Kells, a world-famous manuscript produced by Celtic Monks in AD 800 and an example of Insular art, is on display in Trinity College. The Chester Beatty Library houses a collection of manuscripts, miniature paintings, prints, drawings, rare books and decorative arts assembled by American mining millionaire (and honorary Irish citizen) Sir Alfred Chester Beatty (1875–1968). The collections date from 2700 BC onwards and are drawn from Asia, the Middle East, North Africa and Europe.\n\nIn addition public art galleries are found across the city, including the Irish Museum of Modern Art, the National Gallery, the Hugh Lane Municipal Gallery, the Douglas Hyde Gallery, the Project Arts Centre and the Royal Hibernian Academy. Some of the leading private galleries include Green on Red Gallery, Kerlin Gallery, Kevin Kavangh Gallery and Mother's Tankstation.\n\nThree branches of the National Museum of Ireland are located in Dublin: Archaeology in Kildare Street, Decorative Arts and History in Collins Barracks and Natural History in Merrion Street. The same area is also home to a number of smaller museums such as Number 29 on Fitzwilliam Street and the Little Museum of Dublin on St. Stephen's Green. Dublin is home to the National College of Art and Design, which dates from 1746, and Dublin Institute of Design, founded in 1991. Dublinia is a living history attraction showcasing the Viking and Medieval history of the city.\n\nDublin has long had an 'underground' arts scene, with Temple Bar hosting artists in the 1980s, and spaces such as the Project Arts Centre acting as a hub for collectives and new exhibitions. The Guardian noted that Dublin's independent and underground arts flourished during the economic recession of c.2010. Dublin also has many dramatic, musical and operatic companies, including Festival Productions, Lyric Opera Productions, the Pioneers' Musical & Dramatic Society, the Glasnevin Musical Society, Second Age Theatre Company, Opera Theatre Company and Opera Ireland.\n\nDublin was shortlisted to be World Design Capital 2014. Taoiseach Enda Kenny was quoted to say that Dublin \"would be an ideal candidate to host the World Design Capital in 2014\".\n\nEntertainment\n\nDublin has a vibrant nightlife and is reputedly one of Europe's most youthful cities, with an estimate of 50% of citizens being younger than 25. There are many pubs across the city centre, with the area around St. Stephen's Green and Grafton Street, especially Harcourt Street, Camden Street, Wexford Street and Leeson Street, the location of many nightclubs and pubs.\n\nThe best known area for nightlife is Temple Bar, south of the River Liffey. The area has become popular among tourists, including stag and hen parties from Britain.[http://news.bbc.co.uk/2/hi/uk_news/scotland/3578303.stm Article on stag/hen parties in Edinburgh, Scotland (which mentions their popularity in Dublin)], mentioning Dublin. Retrieved 15 February 2009. It was developed as Dublin's cultural quarter and does retain this spirit as a centre for small arts productions, photographic and artists' studios, and in the form of street performers and small music venues. However, it has been criticised as overpriced, false and dirty by Lonely Planet. In 2014, Temple Bar was listed by the Huffington Post as one of the ten most disappointing destinations in the world. The areas around Leeson Street, Harcourt Street, South William Street and Camden/George's Street are popular nightlife spots for locals.\n\nLive music is popularly played on streets and at venues throughout Dublin, and the city has produced several musicians and groups of international success, including The Dubliners, Thin Lizzy, The Boomtown Rats, U2, The Script, Sinéad O'Connor, Boyzone, Kodaline and Westlife. The two best known cinemas in the city centre are the Savoy Cinema and the Cineworld Cinema, both north of the Liffey. Alternative and special-interest cinema can be found in the Irish Film Institute in Temple Bar and in the Light House Cinema in Smithfield. Large modern multiscreen cinemas are located across suburban Dublin. The 3Arena venue in the Dublin Docklands has played host to many world-renowned performers.\n\nShopping\n\nDublin city centre is a popular shopping destination for both locals and tourists. The city has numerous shopping districts, particularly around Grafton Street and Henry Street. The city centre is also the location of large department stores, including Arnotts, Brown Thomas and (prior to its 2015 closure) Clerys.\n\nThe city retains a thriving market culture, despite new shopping developments and the loss of some traditional market sites. Amongst several historic locations, Moore Street remains one of the city's oldest trading districts. There has also been some growth in local farmers' markets and other markets. In 2007, Dublin Food Co-op relocated to a warehouse in The Liberties area, where it is home to market and community events.[http://dublinfood.coop/ Dublin Food Co-op website] ref. Markets / News and Events / Recent Events / Events Archive Suburban Dublin has several modern retail centres, including Dundrum Town Centre, Blanchardstown Centre, the Square in Tallaght, Liffey Valley Shopping Centre in Clondalkin, Omni Shopping Centre in Santry, Nutgrove Shopping Centre in Rathfarnham, and Swords Pavilions in Swords.\n\nMedia\n\nDublin is the centre of both media and communications in Ireland, with many newspapers, radio stations, television stations and telephone companies based there. RTÉ is Ireland's national state broadcaster, and is based in Donnybrook. Fair City is RTÉ's soap opera, located in the fictional Dublin suburb of Carraigstown. TV3 Media, UTV Ireland, Setanta Sports, MTV Ireland and Sky News are also based in the city. The headquarters of An Post and telecommunications companies such as Eir, as well as mobile operators Meteor, Vodafone and 3 are all located there. Dublin is also the headquarters of national newspapers such as The Irish Times and Irish Independent, as well as local newspapers such as The Evening Herald.\n\nAs well as being home to RTÉ Radio, Dublin also hosts the national radio networks Today FM and Newstalk, and local stations. Commercial radio stations based in the city include 4fm (94.9 MHz), Dublin's 98FM (98.1 MHz), Radio Nova 100FM (100.3 MHz), Q102 (102.2 MHz), SPIN 1038 (103.8 MHz), FM104 (104.4 MHz), Sunshine 106.8 (106.8 MHz). There are also numerous community and special interest stations, including Dublin City FM (103.2 MHz), Dublin South FM (93.9 MHz), Liffey Sound FM (96.4 MHz), Near FM (90.3 MHz), and Raidió na Life (106.4 MHz).\n\nSport\n\nGAA\n\nCroke Park is the largest sport stadium in Ireland. The headquarters of the Gaelic Athletic Association, it has a capacity of 82,300. It is the third-largest stadium in Europe after Nou Camp in Barcelona and Wembley Stadium in London. It hosts the premier Gaelic football and hurling games, international rules football and irregularly other sporting and non-sporting events including concerts. Muhammad Ali fought there in 1972 and it played host to the opening and closing ceremonies of the 2003 Special Olympics. It also has conference and banqueting facilities. There is a GAA Museum there and tours of the stadium are offered, including a rooftop walk of the stadium. During the redevelopment of Lansdowne Road, Croke Park played host to the Irish Rugby Union Team and Republic of Ireland national football team as well as hosting the Heineken Cup rugby 2008–09 semi-final between Munster and Leinster which set a world record attendance for a club rugby match. The Dublin GAA team plays most of their home league hurling games at Parnell Park.\n\nRugby\n\nI.R.F.U. Stadium Lansdowne Road was laid out in 1874. This was the venue for home games of both the Irish Rugby Union Team and the Republic of Ireland national football team. A joint venture between the Irish Rugby Football Union, the FAI and the Government, saw it redeveloped into a new state-of-the-art 50,000 seat Aviva Stadium, which opened in May 2010. Aviva Stadium hosted the 2011 UEFA Europa League Final. Rugby union team Leinster Rugby play their competitive home games in the RDS Arena & the Aviva Stadium while Donnybrook Stadium hosts their friendlies and A games, Ireland A and Women, Leinster Schools and Youths and the home club games of All Ireland League clubs Old Wesley and Bective Rangers. County Dublin is home for 13 of the senior rugby union clubs in Ireland including 5 of the 10 sides in the top division 1A.[http://www.irishrugby.ie/ulsterbankleague/tables.php Irish Rugby : Club & Community : Ulster Bank League : Ulster Bank League Tables] \n\nFootball\n\nCounty Dublin is home to six League of Ireland association clubs; Bohemian F.C., Shamrock Rovers, St Patrick's Athletic, University College Dublin, Shelbourne and Cabinteely. The first Irish side to reach the group stages of a European competition (2011–12 UEFA Europa League group stage) are Shamrock Rovers, who play at Tallaght Stadium in South Dublin. Bohemian F.C play at Dalymount Park, the oldest football stadium in the country, and home ground for the Ireland football team from 1904 to 1990. St Patrick's Athletic play at Richmond Park; University College Dublin at the UCD Bowl in Dún Laoghaire–Rathdown; and Shelbourne at Tolka Park. Tolka Park, Dalymount Park, UCD Bowl and Tallaght Stadium, along with the Carlisle Grounds in Bray, hosted all Group 3 games in the intermediary round of the 2011 UEFA Regions' Cup.\n\nCricket\n\nDublin has two ODI Cricket grounds in Castle Avenue, Clontarf and Malahide Cricket Club. The Castle Avenue hosted its first one day international match on May 21, 1999 as part of the 1999 Cricket World Cup when Bangladesh played against the West Indies. College Park has Test status and played host to Ireland's only Test cricket match to date, a women's match against Pakistan in 2000.\n\nOther\n\nThe Dublin Marathon has been run since 1980 at the end of October, having been staged on the final Monday in October from 1980 to 2015, before moving to the final Sunday in 2016 and 2017. The Women's Mini Marathon has been run since 1983 on the first Monday in June, which is also a bank holiday in Ireland. It is said to be the largest all female event of its kind in the world.\n\nThe Dublin area hosts greyhound racing at Shelbourne Park and horse racing at Leopardstown. The Dublin Horse Show takes place at the RDS, which hosted the Show Jumping World Championships in 1982. The national boxing arena is located in The National Stadium on the South Circular Road. The National Basketball Arena is located in Tallaght, is the home of the Irish basketball team, the venue for the basketball league finals, and has also hosted boxing and wrestling events. The National Aquatic Centre in Blanchardstown is Ireland's largest indoor water leisure facility. There are also Gaelic Handball, hockey and athletics stadia, most notably Morton Stadium in Santry, which held the athletics events of the 2003 Special Olympics.\n\nCuisine\n\nHaute cuisine in Dublin was dominated by French restaurants and chefs. However, Irish-born Kevin Thornton was awarded two Michelin stars in 2001. The Dublin Institute of Technology commenced a bachelor's degree in culinary skills in 1999. By 2016, Dublin had five restaurants sharing six Michelin stars, with Restaurant Patrick Guilbaud holding two stars. Many awarded restaurants have Irish head chefs.\n\nHistorically, Irish coffee house were associated with those working in media. Since the beginning of the 21st century, with the growth of apartment living in the city, Dublin's cafés attracted younger patrons looking for an informal gathering place and an ad hoc office. Cafés became more popular in the city, and Irish-owned coffee chains like Java Republic, Insomnia, and O'Brien's Sandwich Bars now compete internationally. In 2008, Irish barista Stephen Morrissey won the title of World Barista Champion.\n\nIrish language\n\nThere are 12,950 students in the Dublin region attending 34 gaelscoileanna (Irish-language primary schools) and 10 gaelcholáistí (Irish-language secondary schools). Dublin has the highest number of Irish-medium schools in the country. There may be also up to another 10,000 Gaeltacht speakers living in Dublin. Two Irish language radio stations Raidió Na Life and RTÉ Raidió na Gaeltachta have studios in the city, and the online and DAB station Raidió Rí-Rá broadcasts from studios in the city. Many other radio stations in the city broadcast at least an hour of Irish language programming per week. A number of Irish language agencies are also located in the capital. Conradh na Gaeilge offers language classes, has a book shop and is a meeting place for different groups. The closest Gaeltacht to Dublin is the County Meath Gaeltacht of Ráth Cairn and Baile Ghib which is 55 km away.\n\nTwin cities\n\nDublin is twinned with the following places:\n\nThe city is also in talks to twin with Rio de Janeiro, and Mexican city Guadalajara.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Dublin" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8504" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Dublin (,  ) is the capital of and largest city in Ireland. Dublin is located in the province of Leinster on the east coast of Ireland, at the mouth of the River Liffey and bordered on the South by the Wicklow Mountains. The city has an urban area population of 1,173,179. The population of the Dublin Region, , was 1,347,359 people, and the population of the Greater Dublin area was 1,904,806.\n\nThere is archaeological debate regarding precisely where Dublin was established by Celtic-speaking people in the 7th century. Later expanded as a Viking settlement, the Kingdom of Dublin became Ireland's principal city following the Norman invasion. The city expanded rapidly from the 17th century and was briefly the second largest city in the British Empire before the Acts of Union in 1800. Following the partition of Ireland in 1922, Dublin became the capital of the Irish Free State, later renamed Ireland.\n\nAs of 2010, Dublin was listed by the Globalization and World Cities Research Network (GaWC) as a global city, with a ranking of \"Alpha-\", which places it amongst the top thirty cities in the world. It is a historical and contemporary centre for education, the arts, administration, economy and industry.\n\nEtymology\n\nThe name Dublin comes from the Irish word Dubhlinn, early Classical Irish Dubhlind/Duibhlind, from dubh (,,) meaning \"black, dark\", and lind \"pool\", referring to a dark tidal pool. This tidal pool was located where the River Poddle entered the Liffey, on the site of the castle gardens at the rear of Dublin Castle. In Modern Irish the name is Duibhlinn, and Irish rhymes from Dublin County show that in Dublin Leinster Irish it was pronounced Duílinn. The original pronunciation is preserved in the names for the city in other languages such as Old English Difelin, Old Norse Dyflin, modern Icelandic Dyflinn and modern Manx Divlyn as well as Welsh Dulyn. Other localities in Ireland also bear the name Duibhlinn, variously anglicized as Devlin, Divlin and Difflin. Historically, scribes using the Gaelic script wrote bh with a dot over the b, rendering Duḃlinn or Duiḃlinn. Those without knowledge of Irish omitted the dot, spelling the name as Dublin. Variations on the name are also found in traditionally Gaelic-speaking areas of Scotland (Gàidhealtachd, cognate with Irish Gaeltachta), such as An Linne Dhubh (\"the black pool\"), which is part of Loch Linnhe.\n\nIt is now thought that the Viking settlement was preceded by a Christian ecclesiastical settlement known as Duibhlinn, from which Dyflin took its name. Beginning in the 9th and 10th century, there were two settlements where the modern city stands. The Viking settlement of about 841, Dyflin, and a Gaelic settlement, Áth Cliath (\"ford of hurdles\") further up river, at the present day Father Mathew Bridge (also known as Dublin Bridge), at the bottom of Church Street. ', meaning \"town of the hurdled ford\", is the common name for the city in modern Irish. ' is a place name referring to a fording point of the River Liffey near Father Mathew Bridge. ' was an early Christian monastery, believed to have been in the area of Aungier Street, currently occupied by Whitefriar Street Carmelite Church. There are other towns of the same name, such as Àth Cliath in East Ayrshire, Scotland, which is Anglicised as Hurlford.\n\nHistory\n\nThe area of Dublin Bay has been inhabited by humans since prehistoric times, but the writings of Ptolemy (the Greco-Roman astronomer and cartographer) in about AD 140 provide possibly the earliest reference to a settlement there. He called the settlement Eblana polis ().\n\nDublin celebrated its 'official' millennium in 1988, meaning that the Irish government recognised 988 as the year in which the city was settled and that this first settlement would later become the city of Dublin.\n\nIt is now thoughtClarke, Howard (1995). Medieval Dublin, the making of a metropolis. Irish Academic Press. p. 44.  that the Viking settlement was preceded by a Christian ecclesiastical settlement known as Duibhlinn, from which Dyflin took its name. Beginning in the 9th and 10th century, there were two settlements which later became the modern Dublin. The subsequent Scandinavian settlement centred on the River Poddle, a tributary of the Liffey in an area now known as Wood Quay. The Dubhlinn was a small lake used to moor ships; the Poddle connected the lake with the Liffey. This lake was covered during the early 18th century as the city grew. The Dubhlinn lay where the Castle Garden is now located, opposite the Chester Beatty Library in Dublin Castle. Táin Bó Cuailgne (\"The Cattle Raid of Cooley\") refers to Dublind rissa ratter Áth Cliath, meaning \"Dublin, which is called Ath Cliath\".\n\nMiddle Ages\n\nDublin was established as a Viking settlement in the 10th century and, despite a number of rebellions by the native\nIrish, it remained largely under Viking control until the Norman invasion of Ireland was launched from Wales in 1169. It was upon the death of Muirchertach Mac Lochlainn in early 1166 that Ruaidrí Ua Conchobair, King of Connacht, proceeded to Dublin and was inaugurated King of Ireland without opposition. Arguably, he was the primitive undebated full king of Ireland and also the only Gaelic one.\n\nAccording to some historians, part of the city's early economic growth is attributed to a trade in slaves. Slavery in Ireland and Dublin reached its pinnacle in the 9th and 10th centuries. Prisoners of slave raids and kidnappings which captured men, women and children brought revenue to the Celtic Irish Sea raiders, as well as to the Vikings who had initiated the practice. The victims came from Wales, England, Normandy and beyond.\n\nThe King of Leinster, Diarmait Mac Murchada, after his exile by Ruaidhrí, enlisted the help of Strongbow, the Earl of Pembroke, to conquer Dublin. Following Mac Murrough's death, Strongbow declared himself King of Leinster after gaining control of the city. In response to Strongbow's successful invasion, King Henry II of England reaffirmed his sovereignty by mounting a larger invasion in 1171 and pronounced himself Lord of Ireland. Around this time, the county of the City of Dublin was established along with certain liberties adjacent to the city proper. This continued down to 1840 when the barony of Dublin City was separated from the barony of Dublin. Since 2001, both baronies have been redesignated the City of Dublin.\n\nDublin Castle, which became the centre of Norman power in Ireland, was founded in 1204 as a major defensive work on the orders of King John of England. Following the appointment of the first Lord Mayor of Dublin in 1229, the city expanded and had a population of 8,000 by the end of the 13th century. Dublin prospered as a trade centre, despite an attempt by King Robert I of Scotland to capture the city in 1317. It remained a relatively small walled medieval town during the 14th century and was under constant threat from the surrounding native clans. In 1348, the Black Death, a lethal plague which had ravaged Europe, took hold in Dublin and killed thousands over the following decade.\"[https://books.google.com/books?id\nR688at3KskQC&pgPA49&dq&hl\nen#vonepage&q\n&ffalse The Story of Ireland]\". Brian Igoe (2009). p.49.\"[https://books.google.com/books?id\nyw3HmjRvVQMC&pgPA58&dq&hl\nen#vonepage&q\n&f=false Black Death]\". Joseph Patrick Byrne (2004). p.58. \n\nDublin was incorporated into the English Crown as the Pale, which was a narrow strip of English settlement along the eastern seaboard. The Tudor conquest of Ireland in the 16th century spelt a new era for Dublin, with the city enjoying a renewed prominence as the centre of administrative rule in Ireland. Determined to make Dublin a Protestant city, Queen Elizabeth I of England established Trinity College in 1592 as a solely Protestant university and ordered that the Catholic St. Patrick's and Christ Church cathedrals be converted to Protestant.\n\nThe city had a population of 21,000 in 1640 before a plague in 1649–51 wiped out almost half of the city's inhabitants. However, the city prospered again soon after as a result of the wool and linen trade with England, reaching a population of over 50,000 in 1700.\"[https://books.google.com/books?idgI8MYY6ASdcC&pg\nPA34&dq&hlen#v\nonepage&q&f\nfalse Dublin: a cultural history]\". Siobhán Marie Kilfeather (2005). Oxford University Press US. pp. 34–35. \n\nEarly modern\n\nAs the city continued to prosper during the 18th century, Georgian Dublin became, for a short period, the second largest city of the British Empire and the fifth largest city in Europe, with the population exceeding 130,000. The vast majority of Dublin's most notable architecture dates from this period, such as the Four Courts and the Custom House. Temple Bar and Grafton Street are two of the few remaining areas that were not affected by the wave of Georgian reconstruction and maintained their medieval character.\n\nDublin grew even more dramatically during the 18th century, with the construction of many new districts and buildings, such as Merrion Square, Parliament House and the Royal Exchange. The Wide Streets Commission was established in 1757 at the request of Dublin Corporation to govern architectural standards on the layout of streets, bridges and buildings. In 1759, the founding of the Guinness brewery resulted in a considerable economic gain for the city. For much of the time since its foundation, the brewery was Dublin's largest employer.\n\nLate modern and contemporary\n\nDublin suffered a period of political and economic decline during the 19th century following the Acts of Union 1800, under which the seat of government was transferred to the Westminster Parliament in London. The city played no major role in the Industrial Revolution, but remained the centre of administration and a transport hub for most of the island. Ireland had no significant sources of coal, the fuel of the time, and Dublin was not a centre of ship manufacturing, the other main driver of industrial development in Britain and Ireland. Belfast developed faster than Dublin during this period on a mixture of international trade, factory-based linen cloth production and shipbuilding.\n\nThe Easter Rising of 1916, the Irish War of Independence, and the subsequent Irish Civil War resulted in a significant amount of physical destruction in central Dublin. The Government of the Irish Free State rebuilt the city centre and located the new parliament, the Oireachtas, in Leinster House. Since the beginning of Norman rule in the 12th century, the city has functioned as the capital in varying geopolitical entities: Lordship of Ireland (1171–1541), Kingdom of Ireland (1541–1800), as part of the United Kingdom of Great Britain and Ireland (1801–1922), and the Irish Republic (1919–1922). Following the partition of Ireland in 1922, it became the capital of the Irish Free State (1922–1937) and now is the capital of Ireland. One of the memorials to commemorate that time is the Garden of Remembrance.\n\nDublin was also victim to the Northern Irish Troubles. During this 30 year conflict, violence mainly engulfed Northern Ireland. However, the Provisional IRA drew some support from within the Republic, including from Dublin. A Loyalist paramilitary group, the Ulster Volunteer Force, bombed the city during this time - notably in an atrocity known as the Dublin and Monaghan bombings in which 34 people died, mainly in Dublin itself.\n\nSince 1997, the landscape of Dublin has changed. The city was at the forefront of Ireland’s economic expansion during the Celtic Tiger period, with private sector and state development of housing, transport and business. Following an economic decline during the Great Recession, Dublin has rebounded and as of 2017 has close to full employment.\n\nGovernment\n\nLocal\n\nFrom 1842, the boundaries of the city were comprehended by the baronies of Dublin City and the Barony of Dublin. In 1930, the boundaries were extended by the Local Government (Dublin) Act.Irish Statute Book. [http://www.irishstatutebook.ie/1930/en/act/pub/0027/sched1.html#sched1 Local Government (Dublin) Act] Later, in 1953, the boundaries were again extended by the Local Government Provisional Order Confirmation Act.\n\nDublin City Council is a unicameral assembly of 63 members elected every five years from Local Election Areas. It is presided over by the Lord Mayor, who is elected for a yearly term and resides in Dublin's Mansion House. Council meetings occur at Dublin City Hall, while most of its administrative activities are based in the Civic Offices on Wood Quay. The party or coalition of parties, with the majority of seats adjudicates committee members, introduces policies, and appoints the Lord Mayor. The Council passes an annual budget for spending on areas such as housing, traffic management, refuse, drainage, and planning. The Dublin City Manager is responsible for implementing City Council decisions.\n\nNational\n\nAs the capital city, Dublin is the seat of the national parliament of Ireland, the Oireachtas. It is composed of the President of Ireland, Seanad Éireann as the upper house, and Dáil Éireann as the lower house. The President resides in Áras an Uachtaráin in Phoenix Park, while both houses of the Oireachtas meet in Leinster House, a former ducal palace on Kildare Street. It has been the home of the Irish parliament since the creation of the Irish Free State in 1922. The old Irish Houses of Parliament of the Kingdom of Ireland are located in College Green.\n\nGovernment Buildings house the Department of the Taoiseach, the Council Chamber, the Department of Finance and the Office of the Attorney General. It consists of a main building (completed 1911) with two wings (completed 1921). It was designed by Thomas Manley Dean and Sir Aston Webb as the Royal College of Science. The First Dáil originally met in the Mansion House in 1919. The Irish Free State government took over the two wings of the building to serve as a temporary home for some ministries, while the central building became the College of Technology until 1989.Department of the Taoiseach: Guide to Government Buildings (2005) Although both it and Leinster House were intended to be temporary, they became the permanent homes of parliament from then on.\n\nFor elections to Dáil Éireann, the city is divided into five constituencies: Dublin Central (3 seats), Dublin Bay North (5 seats), Dublin North-West (3 seats), Dublin South-Central (4 seats) and Dublin Bay South (4 seats). Nineteen TD's are elected in total.\n\nPolitics\n\nIn the 2016 general election the Dublin Region elected 14 Fine Gael, 7 Sinn Féin, 6 Fianna Fáil, 3 People Before Profit Alliance, 2 Socialist Party, 2 Labour Party, 2 Green Party, 1 Social Democrats and 7 Independent TDs.\n\nGeography\n\nLandscape\n\nDublin is situated at the mouth of the River Liffey and encompasses a land area of approximately 115 km2 in east-central Ireland. It is bordered by a low mountain range to the south and surrounded by flat farmland to the north and west. The\nLiffey divides the city in two between the Northside and the Southside. Each of these is further divided by two lesser rivers – the River Tolka running southeast into Dublin Bay, and the River Dodder running northeast to the mouth of the Liffey. Two further water bodies – the Grand Canal on the southside and the Royal Canal on the northside – ring the inner city on their way from the west and the River Shannon.\n\nThe River Liffey bends at Leixlip from a northeasterly route to a predominantly eastward direction, and this point also marks the transition to urban development from more agricultural land usage.\n\nCultural divide\n\nA north-south division at one time did traditionally exist, with the River Liffey as the divider. The Northside was generally seen as working class to lower middle class, while the Southside was seen as middle class to upper-middle class. In recent decades this has changed with both Northside and Southside seeing urban and economic redevelopment bringing prosperity especially to the Northside. Dublin's economic divide was also previously an east-west as well as a north-south. There were also social divisions evident between the coastal suburbs in the east of the city, and the newer developments further to the west.\n\nIn some tourism and real-estate marketing contexts, Dublin is sometimes divided into a number of quarters or districts. These include, the 'Medieval Quarter' (in the area of Dublin Castle, Christ Church and St Patrick's Cathedral and the old city walls), the 'Georgian Quarter' (including the area around St Stephen's Green, Trinity College, and Merrion Square), the 'Docklands Quarter' (around the Dublin Docklands and Silicon Docks), the 'Cultural Quarter' (around Temple Bar), and 'Creative Quarter' (between South William Street and George's Street).\n\nClimate\n\nSimilar to much of the rest of northwestern Europe, Dublin experiences a maritime climate (Cfb) with cool summers, mild winters, and a lack of temperature extremes. The average maximum January temperature is , while the average maximum July temperature is . On average, the sunniest months are May and June, while the wettest month is October with 76 mm of rain, and the driest month is February with 46 mm. Rainfall is evenly distributed throughout the year.\n\nDublin's sheltered location on the east coast makes it the driest place in Ireland, receiving only about half the rainfall of the west coast. Ringsend in the south of the city records the lowest rainfall in the country, with an average annual precipitation of 683 mm, with the average annual precipitation in the city centre being 714 mm. The main precipitation in winter is rain; however snow showers do occur between November and March. Hail is more common than snow. The city experiences long summer days and short winter days. Strong Atlantic winds are most common in autumn. These winds can affect Dublin, but due to its easterly location it is least affected compared to other parts of the country. However, in winter, easterly winds render the city colder and more prone to snow showers.\n\nIn the 20th century, smog and air-pollution were an issue in the city, precipitating a ban on bituminous fuels across Dublin. The ban was implemented in 1990 to address black smoke concentrations, that had been linked to cardiovascular and respiratory deaths in residents. Since the ban, non-trauma death rates, respiratory death rates and cardiovascular death rates have declined - by an estimated 350 deaths annually.\n\nPlaces of interest\n\nLandmarks\n\nDublin has many landmarks and monuments dating back hundreds of years. One of the oldest is Dublin Castle, which was first founded as a major defensive work on the orders of England's King John in 1204, shortly after the Norman invasion of Ireland in 1169, when it was commanded that a castle be built with strong walls and good ditches for the defence of the city, the administration of justice, and the protection of the King's treasure. Largely complete by 1230, the castle was of typical Norman courtyard design, with a central square without a keep, bounded on all sides by tall defensive walls and protected at each corner by a circular tower. Sited to the south-east of Norman Dublin, the castle formed one corner of the outer perimeter of the city, using the River Poddle as a natural means of defence.\n\nOne of Dublin's newest monuments is the Spire of Dublin, or officially titled \"Monument of Light\".\n It is a  conical spire made of stainless steel and is located on O'Connell Street. It replaces Nelson's Pillar and is intended to mark Dublin's place in the 21st century. The spire was designed by Ian Ritchie Architects, who sought an \"Elegant and dynamic simplicity bridging art and technology\". The base of the monument is lit and the top is illuminated to provide a beacon in the night sky across the city. The Book of Kells, located in the library of Trinity College, Dublin, is one of the city's most visited sites. The Book of Kells is an illustrated manuscript created by Irish monks circa 800 AD. The Ha'penny Bridge, an iron footbridge over the River Liffey, is one of the most photographed sights in Dublin and is considered to be one of Dublin's most iconic landmarks.\n\nOther landmarks and monuments include the Mansion House, the Anna Livia monument, the Molly Malone statue, Christ Church Cathedral, St Patrick's Cathedral, Saint Francis Xavier Church on Upper Gardiner Street near Mountjoy Square, The Custom House and Áras an Uachtaráin. The Poolbeg Towers are also landmark features of Dublin, and visible from various spots around the city.\n\nParks\n\nThere are many green-spaces around the city, and Dublin City Council manages over 1500 ha of parks. Public parks include the Phoenix Park, Herbert Park and St Stephen's Green. The Phoenix Park is about 3 km west of the city centre, north of the River Liffey. Its 16 km perimeter wall encloses 707 ha, making it one of the largest walled city parks in Europe.It is larger than all of London’s city parks put together, and more than twice the area of New York’s Central Park.  It includes large areas of grassland and tree-lined avenues, and since the 17th century has been home to a herd of wild Fallow deer. The residence of the President of Ireland (Áras an Uachtaráin), which was built in 1751, is located in the park. The park is also home to Dublin Zoo, Ashtown Castle, and the official residence of the United States Ambassador. Music concerts are also sometimes held in the park.\n\nSt Stephen's Green is adjacent to one of Dublin's main shopping streets, Grafton Street, and to a shopping centre named for it, while on its surrounding streets are the offices of a number of public bodies and the city terminus of one of Dublin's Luas tram lines. Saint Anne's Park is a public park and recreational facility, shared between Raheny and Clontarf, both suburbs on the North Side of Dublin.\nThe park, the second largest municipal park in Dublin, is part of a former 2 km² estate assembled by members of the Guinness family, beginning with Benjamin Lee Guinness in 1835 (the largest municipal park is nearby (North) Bull Island, also shared between Clontarf and Raheny).\n\nEconomy\n\nThe Dublin region is the economic centre of Ireland, and was at the forefront of the country's economic expansion during the Celtic Tiger period. In 2009, Dublin was listed as the fourth richest city in the world by purchasing power and 10th richest by personal income. According to Mercer's 2011 Worldwide Cost of Living Survey, Dublin is the 13th most expensive city in the European Union (down from 10th in 2010) and the 58th most expensive place to live in the world (down from 42nd in 2010). , approximately 800,000 people were employed in the Greater Dublin Area, of whom around 600,000 were employed in the services sector and 200,000 in the industrial sector. \n\nA number of Dublin's traditional industries, such as food processing, textile manufacturing, brewing, and distilling have gradually declined, although Guinness has been brewed at the St. James's Gate Brewery since 1759. Economic improvements in the 1990s attracted a number of global pharmaceutical, information and communications technology companies to the city and Greater Dublin Area. Companies such as Microsoft, Google, Amazon, eBay, PayPal, Yahoo!, Facebook, Twitter, Accenture and Pfizer now have European headquarters and/or operational bases in the city, with several located in enterprise clusters like the Digital Hub and Silicon Docks. This presence of these companies has driven economic expansion in the city and led to Dublin sometimes being referred to as the \"Tech Capital of Europe\".\n\nFinancial services have also become important to the city since the establishment of Dublin's International Financial Services Centre in 1987. More than 500 operations are approved to trade under the IFSC programme. The centre is host to half of the world's top 50 banks and to half of the top 20 insurance companies. Many international firms have established major headquarters in the city, such as Citibank and Commerzbank. The Irish Stock Exchange (ISEQ), Internet Neutral Exchange (INEX) and Irish Enterprise Exchange (IEX) are also located in Dublin. Dublin has been positioned as one of the main cities vying to host Financial Services companies hoping to retain access to the Eurozone after Brexit. The Celtic Tiger also led to a temporary boom in construction, with large redevelopment projects in the Dublin Docklands and Spencer Dock. Completed projects include the Convention Centre, the 3Arena, and the Bord Gáis Energy Theatre.\n\nTransport\n\nRoad\n\nThe road network in Ireland is primarily focused on Dublin. The M50 motorway, a semi-ring road which runs around the south, west and north of the city, connects important national primary routes to the rest of the country. In 2008, the West-Link toll bridge was replaced by the eFlow barrier-free tolling system, with a three-tiered charge system based on electronic tags and car pre-registration.\n\nThe first phase of a proposed eastern bypass for the city is the Dublin Port Tunnel, which officially opened in 2006 to mainly cater for heavy vehicles. The tunnel connects Dublin Port and the M1 motorway close to Dublin Airport. The city is also surrounded by an inner and outer orbital route. The inner orbital route runs approximately around the heart of the Georgian city and the outer orbital route runs primarily along the natural circle formed by Dublin's two canals, the Grand Canal and the Royal Canal, as well as the North and South Circular Roads.\n\nThe 2016 TomTom Traffic Index ranked Dublin the 15th most congested city in the world and the 7th most congested in Europe.\n\nDublin is served by a network of nearly 200 bus routes which cover the city and suburbs. The majority of these are controlled by Dublin Bus, but a number of smaller companies also operate. Fares are generally calculated on a stage system based on distance travelled. There are several different levels of fares, which apply on most services. A \"Real Time Passenger Information\" system was introduced at Dublin Bus bus stops in 2012. Electronically displayed signs relay information about the time of the next bus' arrival based on its GPS determined position. The National Transport Authority is responsible for integration of bus and rail services in Dublin and has been involved in introducing a pre-paid smart card, called a Leap card, which can be used on all of Dublin’s public transport services.\n\nRail and tram\n\nHeuston and Connolly stations are the two main railway stations in Dublin. Operated by Iarnród Éireann, the Dublin Suburban Rail network consists of five railway lines serving the Greater Dublin Area and commuter towns such as Drogheda and Dundalk in County Louth. One of these lines is the electrified Dublin Area Rapid Transit (DART) line, which runs primarily along the coast of Dublin, comprising 31 stations, from Malahide and Howth southwards as far as Greystones in County Wicklow. Commuter rail operates on the other four lines using Irish Rail diesel multiple units. In 2013, passengers for DART and Dublin Suburban lines were 16 million and 11.7 million, respectively (around 75% of all Irish Rail passengers).\n\nThe Luas is a light rail system, run by Transdev Ireland (under contract from Transport Infrastructure Ireland), and has been operating since 2004, carrying over 34 million passengers annually. The network consists of two interconnecting tram lines; the Red Line links the Docklands and city centre with the south-western suburbs of Tallaght and Saggart, while the Green Line connects northern inner city suburbs and the main city centre with suburbs to the south of the city including Sandyford and Brides Glen. Together these lines comprise a total 67 stations and  of track. Construction of a 6 km extension to the Green Line, bringing it into the north of the city, commenced in June 2013 and was opened for passenger travel on December 9, 2017.\n\nRail and ferry\n\nDublin Connolly is connected by bus to Dublin Port and ferries run by Irish Ferries and Stena Line to Holyhead for connecting trains on the North Wales Coast Line to Chester, Crewe and London Euston. Dublin Connolly to Dublin Port can be reached via Amiens Street, Dublin into Store Street or by Luas via Busáras where Dublin Bus operates services to the Ferry Terminal.\n\nAirport\n\n Dublin Airport (owned and operated by DAA) is located north of Dublin City in the administrative county of Fingal. It is the headquarters of Ireland's flag carrier Aer Lingus, low-cost carrier Ryanair, and regional airlines Stobart Air and CityJet. The airport offers a short and medium haul network, as well as domestic services to several regional airports in Ireland. There are also long-haul services to the United States, Canada and the Middle East. Dublin Airport is the busiest airport in Ireland, followed by Cork and Shannon. Construction of a second terminal began in 2007 and was officially opened on 19 November 2010.\n\nIn 2014, Dublin Airport was the 18th busiest airport in Europe, serving over 21 million passengers. By 2016 this increased to 27.9 million passengers passing through the airport, establishing an all-time record supported by growth in both short- and long-haul networks.\n\nIn 2015 and 2016, transatlantic traffic grew somewhat. For example, in the summer of 2015, Dublin Airport had 158 flights a week to North America, making it the sixth largest European hub for that route over the year. Transatlantic traffic was also the fastest-growing segment of the market for the airport in 2016, in which a 16% increase from 2015 brought the yearly number of passengers traveling between Dublin and North America to 2.9 million.\n\nFrom 2010 to 2016, Dublin Airport saw an increase of nearly 9.5 million passengers in its annual traffic, as the number of commercial aircraft movements has similarly followed a growth trend from 163,703 in 2013 to 191,233 in 2015.\n\nCycling\n\nDublin City Council began installing cycle lanes and tracks throughout the city in the 1990s, and  the city had over 200 km of specific on- and off-road tracks for cyclists. In 2011, the city was ranked 9th of major world cities on the Copenhagenize Index of Bicycle-Friendly Cities. The same index also showed a fall to 15th in 2015.\n\nDublinbikes is a self-service bicycle rental scheme which has been in operation in Dublin since 2009. Sponsored by JCDecaux and Just Eat, the scheme consists of 550 French-made unisex bicycles stationed at 44 terminals throughout the city centre. Users must make a subscription for either an annual Long Term Hire Card or purchase a three-day ticket. As of 2011, Dublinbikes had over 58,000 subscribers and had plans to expand the service across the city and suburbs to provide for up to 5,000 bicycles and approximately 300 terminals.\n\nThe 2011 Census revealed that 5.9 percent of commuters in Dublin cycled. A 2013 report by Dublin City Council on traffic flows crossing the canals in and out of the city found that just under 10% of all traffic was made up of cyclists, representing an increase of 14.1% over 2012 and an 87.2% increase over 2006 levels and is attributed to measures, such as, the Dublinbikes bike rental scheme, the provision of cycle lanes, public awareness campaigns to promote cycling and the introduction of the 30kph city centre speed limit.\n\nHigher education\n\nDublin is one of the primary centres of education in Ireland, and is home to three universities, Dublin Institute of Technology and a number of other higher education institutions. There are 20 third-level institutes in the city and in surrounding towns and suburbs.\nDublin was European Capital of Science in 2012.\n\nThe University of Dublin is the oldest university in Ireland dating from the 16th century, and is located in the city centre. Its sole constituent college, Trinity College (TCD), was established by Royal Charter in 1592 under Elizabeth I. It was closed to Roman Catholics until Catholic Emancipation, and the Catholic hierarchy then banned Roman Catholics from attending until 1970. It is situated in the city centre, on College Green, and has 15,000 students.\n\nThe National University of Ireland (NUI) has its seat in Dublin, which is also the location of the associated constituent university of University College Dublin (UCD), which has over 30,000 students. Founded in 1854, it is now the largest university in Ireland. UCD's main campus is at Belfield, about 5 km from the city centre in the southeastern suburbs.\n\nWith a continuous history dating back to 1887, Dublin's principal, and Ireland's largest, institution for technological education and research, Dublin Institute of Technology (DIT) has over 23,000 students. DIT specialises in engineering, architecture, sciences, health, journalism, digital media, hospitality and business but also offers art, design, music and humanities programmes. DIT has campuses, buildings and research facilities at several locations, including buildings at Kevin Street, Aungier Street, Bolton Street and Cathal Brugha Street in central Dublin. It has commenced consolidation to a new campus in Grangegorman.\n\nDublin City University (DCU), formerly known as the National Institute for Higher Education (NIHE), offers courses in business, engineering, science, communication courses, languages and primary education. It has around 16,000 students, and its main campus, the Glasnevin Campus, is located about 7 km from the city centre in the northern suburbs. It has two campuses on the Northside of the river, the DCU Glasnevin Campus and the DCU Drumcondra Campus. The Drumcondra campus includes St Patrick's College of Education, the nearby Mater Dei Institute and students from the Church of Ireland College of Education.\n\nThe Royal College of Surgeons in Ireland (RCSI) is a medical school which is a recognised college of the NUI, and is situated at St. Stephen's Green in the city centre. The Institute of European Affairs is also in Dublin. Dublin Business School (DBS) is Ireland's largest private third level institution with over 9,000 students located on Aungier Street. The National College of Art and Design (NCAD) supports training and research in art, design and media. The National College of Ireland (NCI) is also based in Dublin. The Economic and Social Research Institute, a social science research institute, is based on Sir John Rogerson's Quay.\n\nThe Irish public administration and management training centre has its base in Dublin, the Institute of Public Administration provides a range of undergraduate and post graduate awards via the National University of Ireland and in some instances, Queen's University Belfast. There are also smaller specialised colleges, including Griffith College Dublin, The Gaiety School of Acting and the New Media Technology College.\n\nOutside of the city, the towns of Tallaght in South Dublin and Dún Laoghaire in Dún Laoghaire–Rathdown have regional colleges:\nThe Institute of Technology, Tallaght has full and part-time courses in a wide range of technical subjects and the Dún Laoghaire Institute of Art, Design and Technology (IADT) supports training and research in art, design, business, psychology and media technology.\nThe western suburb of Blanchardstown offers childcare and sports management courses along with languages and technical subjects at the Institute of Technology, Blanchardstown.\n\nDemographics\n\nThe City of Dublin is the area administered by Dublin City Council, but the term \"Dublin\" is also used to refer to the contiguous urban area which includes parts of the adjacent local authority areas of Dún Laoghaire–Rathdown, Fingal and South Dublin. Together, the four areas form the traditional County Dublin. This area is sometimes known as the Dublin Region. The population of the administrative area controlled by the City Council was 553,165 in the 2016 census, while the population of the urban area was 1,173,179. The County Dublin population was 1,273,069 and that of the Greater Dublin Area 1,904,806. The area's population is expanding rapidly, and it is estimated by the Central Statistics Office that it will reach 2.1 million by 2020.[http://www.rte.ie/news/2007/0402/87392-dublin/ Call for improved infrastructure for Dublin] 2 April 2007\n\nThe percentage of Protestants in Dublin has dropped from over 10% in 1891 to 3-4% today.\n\nSince the late 1990s, Dublin has experienced a significant level of net immigration, with the greatest numbers coming from the European Union, especially the United Kingdom, Poland and Lithuania.\"[https://www.theguardian.com/media/2006/mar/12/pressandpublishing.business3 Dublin heralds a new era in publishing for immigrants]\". The Guardian 12 March 2006. There is also immigration from outside Europe, including from India, Pakistan, China and Nigeria. Dublin is home to a greater proportion of newer arrivals than any other part of the country. Sixty percent of Ireland's Asian population lives in Dublin.[http://www.rte.ie/news/2007/0726/91717-census/ Foreign nationals now 10% of Irish population] 26 July 2007 Over 15% of Dublin's population was foreign-born in 2006.\"Dublin\". OPENCities, a British Council project.  This number decreased during the Great Recession as foreign-born immigrants returned due to high unemployment.\n\nThe capital attracts the largest proportion of non-Catholic migrants from other countries. Increased secularisation in Ireland has prompted a drop in regular Catholic church attendance in Dublin from over 90 percent in the mid-1970s down to 14 percent according to a 2011 survey.[https://www.nytimes.com/2016/01/22/world/europe/ireland-catholic-baptism-school.html?hp&actionclick&pgtype\nHomepage&clickSourcestory-heading&module\nsecond-column-region&regiontop-news&WT.nav\ntop-news Catholic Church's Hold on Schools at Issue in Changing Ireland] The New York Times, 21 January 2016\n\nAccording to the 2011 census, the population of Dublin was 90% white (including 400,749 white Irish [78%], 57,748 other white [11%] and 1,923 white Irish traveller), 1% black, and 4% Asian. In terms of religion, 75% identified as Catholic, 10% as other stated religions, with 14% having no religion or no religion stated.http://airo.maynoothuniversity.ie/external-content/dublin-city\n\nCulture\n\nThe arts\n\nDublin has a significant literary history, and produced many literary figures, including Nobel laureates William Butler Yeats, George Bernard Shaw and Samuel Beckett. Other influential writers and playwrights include Oscar Wilde, Jonathan Swift and the creator of Dracula, Bram Stoker. It is also the location of key and notable works of James Joyce, including Ulysses, which is set in Dublin and includes much topical detail. Dubliners is a collection of short stories by Joyce about incidents and typical characters of the city during the early 20th century. Other renowned writers include J. M. Synge, Seán O'Casey, Brendan Behan, Maeve Binchy, and Roddy Doyle. Ireland's biggest libraries and literary museums are found in Dublin, including the National Print Museum of Ireland and National Library of Ireland. In July 2010, Dublin was named as a UNESCO City of Literature, joining Edinburgh, Melbourne and Iowa City with the permanent title.[http://www.independent.ie/irish-news/delight-at-city-of-literature-accolade-for-dublin-26666430.html Irish Independent – Delight at City of Literature accolade for Dublin]. Retrieved 26 July 2010.\n\nThere are several theatres within the city centre, and various well-known actors have emerged from the Dublin theatrical scene, including Noel Purcell, Michael Gambon, Brendan Gleeson, Stephen Rea, Colin Farrell, Colm Meaney and Gabriel Byrne. The best known theatres include the Gaiety, Abbey, Olympia, Gate, and Grand Canal. The Gaiety specialises in musical and operatic productions, and also opens its doors after the evening theatre production to host a variety of live music, dancing, and films. The Abbey was founded in 1904 by a group that included Yeats with the aim of promoting indigenous literary talent. It went on to provide a breakthrough for some of the city's most famous writers, such as Synge, Yeats himself and George Bernard Shaw. The Gate was founded in 1928 to promote European and American Avant Garde works. The Grand Canal Theatre is a newer 2,111 capacity theatre which opened in 2010 in the Grand Canal Dock area.\n\nApart from being the focus of the country's literature and theatre, Dublin is also the focal point for much of Irish art and the Irish artistic scene. The Book of Kells, a world-famous manuscript produced by Celtic Monks in AD 800 and an example of Insular art, is on display in Trinity College. The Chester Beatty Library houses a collection of manuscripts, miniature paintings, prints, drawings, rare books and decorative arts assembled by American mining millionaire (and honorary Irish citizen) Sir Alfred Chester Beatty (1875–1968). The collections date from 2700 BC onwards and are drawn from Asia, the Middle East, North Africa and Europe.\n\nIn addition public art galleries are found across the city, including the Irish Museum of Modern Art, the National Gallery, the Hugh Lane Municipal Gallery, the Douglas Hyde Gallery, the Project Arts Centre and the Royal Hibernian Academy. Some of the leading private galleries include Green on Red Gallery, Kerlin Gallery, Kevin Kavangh Gallery and Mother's Tankstation.\n\nThree branches of the National Museum of Ireland are located in Dublin: Archaeology in Kildare Street, Decorative Arts and History in Collins Barracks and Natural History in Merrion Street. The same area is also home to a number of smaller museums such as Number 29 on Fitzwilliam Street and the Little Museum of Dublin on St. Stephen's Green. Dublin is home to the National College of Art and Design, which dates from 1746, and Dublin Institute of Design, founded in 1991. Dublinia is a living history attraction showcasing the Viking and Medieval history of the city.\n\nDublin has long had an 'underground' arts scene, with Temple Bar hosting artists in the 1980s, and spaces such as the Project Arts Centre acting as a hub for collectives and new exhibitions. The Guardian noted that Dublin's independent and underground arts flourished during the economic recession of c.2010. Dublin also has many dramatic, musical and operatic companies, including Festival Productions, Lyric Opera Productions, the Pioneers' Musical & Dramatic Society, the Glasnevin Musical Society, Second Age Theatre Company, Opera Theatre Company and Opera Ireland.\n\nDublin was shortlisted to be World Design Capital 2014. Taoiseach Enda Kenny was quoted to say that Dublin \"would be an ideal candidate to host the World Design Capital in 2014\".\n\nEntertainment\n\nDublin has a vibrant nightlife and is reputedly one of Europe's most youthful cities, with an estimate of 50% of citizens being younger than 25. There are many pubs across the city centre, with the area around St. Stephen's Green and Grafton Street, especially Harcourt Street, Camden Street, Wexford Street and Leeson Street, the location of many nightclubs and pubs.\n\nThe best known area for nightlife is Temple Bar, south of the River Liffey. The area has become popular among tourists, including stag and hen parties from Britain.[http://news.bbc.co.uk/2/hi/uk_news/scotland/3578303.stm Article on stag/hen parties in Edinburgh, Scotland (which mentions their popularity in Dublin)], mentioning Dublin. Retrieved 15 February 2009. It was developed as Dublin's cultural quarter and does retain this spirit as a centre for small arts productions, photographic and artists' studios, and in the form of street performers and small music venues. However, it has been criticised as overpriced, false and dirty by Lonely Planet. In 2014, Temple Bar was listed by the Huffington Post as one of the ten most disappointing destinations in the world. The areas around Leeson Street, Harcourt Street, South William Street and Camden/George's Street are popular nightlife spots for locals.\n\nLive music is popularly played on streets and at venues throughout Dublin, and the city has produced several musicians and groups of international success, including The Dubliners, Thin Lizzy, The Boomtown Rats, U2, The Script, Sinéad O'Connor, Boyzone, Kodaline and Westlife. The two best known cinemas in the city centre are the Savoy Cinema and the Cineworld Cinema, both north of the Liffey. Alternative and special-interest cinema can be found in the Irish Film Institute in Temple Bar and in the Light House Cinema in Smithfield. Large modern multiscreen cinemas are located across suburban Dublin. The 3Arena venue in the Dublin Docklands has played host to many world-renowned performers.\n\nShopping\n\nDublin city centre is a popular shopping destination for both locals and tourists. The city has numerous shopping districts, particularly around Grafton Street and Henry Street. The city centre is also the location of large department stores, including Arnotts, Brown Thomas and (prior to its 2015 closure) Clerys.\n\nThe city retains a thriving market culture, despite new shopping developments and the loss of some traditional market sites. Amongst several historic locations, Moore Street remains one of the city's oldest trading districts. There has also been some growth in local farmers' markets and other markets. In 2007, Dublin Food Co-op relocated to a warehouse in The Liberties area, where it is home to market and community events.[http://dublinfood.coop/ Dublin Food Co-op website] ref. Markets / News and Events / Recent Events / Events Archive Suburban Dublin has several modern retail centres, including Dundrum Town Centre, Blanchardstown Centre, the Square in Tallaght, Liffey Valley Shopping Centre in Clondalkin, Omni Shopping Centre in Santry, Nutgrove Shopping Centre in Rathfarnham, and Swords Pavilions in Swords.\n\nMedia\n\nDublin is the centre of both media and communications in Ireland, with many newspapers, radio stations, television stations and telephone companies based there. RTÉ is Ireland's national state broadcaster, and is based in Donnybrook. Fair City is RTÉ's soap opera, located in the fictional Dublin suburb of Carraigstown. TV3 Media, UTV Ireland, Setanta Sports, MTV Ireland and Sky News are also based in the city. The headquarters of An Post and telecommunications companies such as Eir, as well as mobile operators Meteor, Vodafone and 3 are all located there. Dublin is also the headquarters of national newspapers such as The Irish Times and Irish Independent, as well as local newspapers such as The Evening Herald.\n\nAs well as being home to RTÉ Radio, Dublin also hosts the national radio networks Today FM and Newstalk, and local stations. Commercial radio stations based in the city include 4fm (94.9 MHz), Dublin's 98FM (98.1 MHz), Radio Nova 100FM (100.3 MHz), Q102 (102.2 MHz), SPIN 1038 (103.8 MHz), FM104 (104.4 MHz), Sunshine 106.8 (106.8 MHz). There are also numerous community and special interest stations, including Dublin City FM (103.2 MHz), Dublin South FM (93.9 MHz), Liffey Sound FM (96.4 MHz), Near FM (90.3 MHz), and Raidió na Life (106.4 MHz).\n\nSport\n\nGAA\n\nCroke Park is the largest sport stadium in Ireland. The headquarters of the Gaelic Athletic Association, it has a capacity of 82,300. It is the third-largest stadium in Europe after Nou Camp in Barcelona and Wembley Stadium in London. It hosts the premier Gaelic football and hurling games, international rules football and irregularly other sporting and non-sporting events including concerts. Muhammad Ali fought there in 1972 and it played host to the opening and closing ceremonies of the 2003 Special Olympics. It also has conference and banqueting facilities. There is a GAA Museum there and tours of the stadium are offered, including a rooftop walk of the stadium. During the redevelopment of Lansdowne Road, Croke Park played host to the Irish Rugby Union Team and Republic of Ireland national football team as well as hosting the Heineken Cup rugby 2008–09 semi-final between Munster and Leinster which set a world record attendance for a club rugby match. The Dublin GAA team plays most of their home league hurling games at Parnell Park.\n\nRugby\n\nI.R.F.U. Stadium Lansdowne Road was laid out in 1874. This was the venue for home games of both the Irish Rugby Union Team and the Republic of Ireland national football team. A joint venture between the Irish Rugby Football Union, the FAI and the Government, saw it redeveloped into a new state-of-the-art 50,000 seat Aviva Stadium, which opened in May 2010. Aviva Stadium hosted the 2011 UEFA Europa League Final. Rugby union team Leinster Rugby play their competitive home games in the RDS Arena & the Aviva Stadium while Donnybrook Stadium hosts their friendlies and A games, Ireland A and Women, Leinster Schools and Youths and the home club games of All Ireland League clubs Old Wesley and Bective Rangers. County Dublin is home for 13 of the senior rugby union clubs in Ireland including 5 of the 10 sides in the top division 1A.[http://www.irishrugby.ie/ulsterbankleague/tables.php Irish Rugby : Club & Community : Ulster Bank League : Ulster Bank League Tables] \n\nFootball\n\nCounty Dublin is home to six League of Ireland association clubs; Bohemian F.C., Shamrock Rovers, St Patrick's Athletic, University College Dublin, Shelbourne and Cabinteely. The first Irish side to reach the group stages of a European competition (2011–12 UEFA Europa League group stage) are Shamrock Rovers, who play at Tallaght Stadium in South Dublin. Bohemian F.C play at Dalymount Park, the oldest football stadium in the country, and home ground for the Ireland football team from 1904 to 1990. St Patrick's Athletic play at Richmond Park; University College Dublin at the UCD Bowl in Dún Laoghaire–Rathdown; and Shelbourne at Tolka Park. Tolka Park, Dalymount Park, UCD Bowl and Tallaght Stadium, along with the Carlisle Grounds in Bray, hosted all Group 3 games in the intermediary round of the 2011 UEFA Regions' Cup.\n\nCricket\n\nDublin has two ODI Cricket grounds in Castle Avenue, Clontarf and Malahide Cricket Club. The Castle Avenue hosted its first one day international match on May 21, 1999 as part of the 1999 Cricket World Cup when Bangladesh played against the West Indies. College Park has Test status and played host to Ireland's only Test cricket match to date, a women's match against Pakistan in 2000.\n\nOther\n\nThe Dublin Marathon has been run since 1980 at the end of October, having been staged on the final Monday in October from 1980 to 2015, before moving to the final Sunday in 2016 and 2017. The Women's Mini Marathon has been run since 1983 on the first Monday in June, which is also a bank holiday in Ireland. It is said to be the largest all female event of its kind in the world.\n\nThe Dublin area hosts greyhound racing at Shelbourne Park and horse racing at Leopardstown. The Dublin Horse Show takes place at the RDS, which hosted the Show Jumping World Championships in 1982. The national boxing arena is located in The National Stadium on the South Circular Road. The National Basketball Arena is located in Tallaght, is the home of the Irish basketball team, the venue for the basketball league finals, and has also hosted boxing and wrestling events. The National Aquatic Centre in Blanchardstown is Ireland's largest indoor water leisure facility. There are also Gaelic Handball, hockey and athletics stadia, most notably Morton Stadium in Santry, which held the athletics events of the 2003 Special Olympics.\n\nCuisine\n\nHaute cuisine in Dublin was dominated by French restaurants and chefs. However, Irish-born Kevin Thornton was awarded two Michelin stars in 2001. The Dublin Institute of Technology commenced a bachelor's degree in culinary skills in 1999. By 2016, Dublin had five restaurants sharing six Michelin stars, with Restaurant Patrick Guilbaud holding two stars. Many awarded restaurants have Irish head chefs.\n\nHistorically, Irish coffee house were associated with those working in media. Since the beginning of the 21st century, with the growth of apartment living in the city, Dublin's cafés attracted younger patrons looking for an informal gathering place and an ad hoc office. Cafés became more popular in the city, and Irish-owned coffee chains like Java Republic, Insomnia, and O'Brien's Sandwich Bars now compete internationally. In 2008, Irish barista Stephen Morrissey won the title of World Barista Champion.\n\nIrish language\n\nThere are 12,950 students in the Dublin region attending 34 gaelscoileanna (Irish-language primary schools) and 10 gaelcholáistí (Irish-language secondary schools). Dublin has the highest number of Irish-medium schools in the country. There may be also up to another 10,000 Gaeltacht speakers living in Dublin. Two Irish language radio stations Raidió Na Life and RTÉ Raidió na Gaeltachta have studios in the city, and the online and DAB station Raidió Rí-Rá broadcasts from studios in the city. Many other radio stations in the city broadcast at least an hour of Irish language programming per week. A number of Irish language agencies are also located in the capital. Conradh na Gaeilge offers language classes, has a book shop and is a meeting place for different groups. The closest Gaeltacht to Dublin is the County Meath Gaeltacht of Ráth Cairn and Baile Ghib which is 55 km away.\n\nTwin cities\n\nDublin is twinned with the following places:\n\nThe city is also in talks to twin with Rio de Janeiro, and Mexican city Guadalajara. Dublin. http://en.wikipedia.org/?curid=8504."
  }
}
