{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1217",
  "eid" : "b8fa98c0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778390092,
  "textBody" : "Anguilla ( ) is a British overseas territory in the Caribbean. It is one of the most northerly of the Leeward Islands in the Lesser Antilles, lying east of Puerto Rico and the Virgin Islands and directly north of Saint Martin. The territory consists of the main island of Anguilla, approximately 16 mi long by 3 mi wide at its widest point, together with a number of much smaller islands and cays with no permanent population. The island's capital is The Valley. The total land area of the territory is 35 mi2, with a population of approximately  ( estimate).\n\nAnguilla has become a popular tax haven, having no capital gains, estate, profit or other forms of direct taxation on either individuals or corporations. In April 2011, faced with a mounting deficit, it introduced a 3% \"Interim Stabilisation Levy\", Anguilla's first form of income tax.\n\nOn 7 September 2017, the Category 5 Hurricane Irma hit the island. As of the next day, one death had been reported; the island also sustained extensive damage to many buildings, including government ones, as well as its electricity infrastructure and water supply. The UK government summarised this as \"severe and in places critical\" damage.http://abcnews.go.com/International/wireStory/damage-hurricane-irma-caribbean-49703893 A few days later, Hurricane Jose largely bypassed Anguilla.http://smn-news.com/st-maarten-st-martin-news/27019-anguilla-spared-by-hurricane-jose-accelerates-recovery-from-irma.html\n\nName \n\nThe name Anguilla is an anglicised or latinate form of earlier Spanish ' meaning \"eel\" in reference to the island's shape. It is believed by most sources to have been named by Christopher Columbus. For similar reasons, it was also known as Snake or Snake Island.\n\nHistory \n\nAnguilla was first settled by Indigenous Amerindian peoples who migrated from South America. The earliest Native American artefacts found on Anguilla have been dated to around 1300 ; remains of settlements date from  600.Caribbean Islands, Sarah Cameron (Footprint Travel Guides), p. 466 ([https://books.google.com/?idG74-rZzX64cC Google Books]) The Arawak name for the island seems to have been Malliouhana. The date of European colonisation is uncertain: some sources claim that Columbus sighted the island during his second voyage in 1493, while others state that the island's first European explorer was the French Huguenot nobleman and merchant mariner René Goulaine de Laudonnière in 1564.. The Dutch West India Company established a fort on the island in 1631. The Dutch withdraw after the destruction of the fort by Spanish forces in 1633.Source: [http://www.atlasofmutualheritage.nl/nl/Anguilla.1009p Atlas of Mutual Heritage].\n\nTraditional accounts state that Anguilla was first colonised by English settlers from Saint Kitts beginning in 1650. In this early colonial period, however, Anguilla sometimes served as a place of refuge and recent scholarship focused on Anguilla has placed greater significance on other Europeans and creoles migrating from St. Christopher,Cooper, V.O. 1998. St. Kitts: The Launching Pad for Leeward Islands Creoles. In St. Kitts and the Atlantic Creoles, the Texts of Samuel Augustus Mathews in Perspective, P. Baker and A. Bruyn (eds.). London: University of Westminster Press. Barbados, Nevis and Antigua. The French temporarily took over the island in 1666 but returned it to English control under the terms of the Treaty of Breda the next year. A Major John Scott who visited in September 1667, wrote of leaving the island \"in good condition\" and noted that in July 1668, \"200 or 300 people fled thither in time of war\".British Colonial and State Papers 1661–1668, 16 November 1667 and 9 July 1668.\n\nIt is likely that some of these early Europeans brought enslaved Africans with them. Historians confirm that African slaves lived in the region in the early 17th century. For example, Africans from Senegal lived in St. Christopher in 1626. By 1672 a slave depot existed on the island of Nevis, serving the Leeward Islands. While the time of African arrival in Anguilla is difficult to place precisely, archival evidence indicates a substantial African presence of at least 100 slaves by 1683. These seem to have come from Central Africa as well as West Africa.Walicek, Don E. 2009. \"The Founder Principle and Anguilla's Homestead Society,\" Gradual Creolization: Studies Celebrating Jacques Arends, ed. by M. van den Berg, H. Cardoso, and R. Selbach. (Creole Language Library Series 34), Amsterdam: John Benjamins, pp. 349–372.\n\nAttempts by the French to capture the island during the War of Austrian Succession (1745) and the Napoleonic Wars (1796) ended in failure.\n\nDuring the early colonial period, Anguilla was administered by the British through Antigua; in 1825, it was placed under the administrative control of nearby Saint Kitts. In 1967, Britain granted Saint Kitts and Nevis full internal autonomy. Anguilla was also incorporated into the new unified dependency, named Saint Christopher-Nevis-Anguilla, against the wishes of many Anguillians. This led to two Anguillian Revolutions in 1967 and 1969 headed by Atlin Harriganhttp://www.gov.ai/documents/budget/Budget_2009.pdf and Ronald Webster. The island briefly operated as the independent \"Republic of Anguilla\". The goal of the revolution was not independence per se, but rather independence from Saint Kitts and Nevis and a return to being a British colony. British authority was fully restored in July 1971; in 1980, Anguilla was finally allowed to secede from Saint Kitts and Nevis and become a separate British Crown colony (now a British overseas territory).\n\nGovernance \n\nPolitical system\n\nAnguilla is an internally self-governing overseas territory of the United Kingdom. Its politics take place in a framework of a parliamentary representative democratic dependency, whereby the Chief Minister is the head of government, and of a pluriform multi-party system.\n\nThe United Nations Committee on Decolonization includes Anguilla on the United Nations list of Non-Self-Governing Territories. The territory's constitution is Anguilla Constitutional Order 1 April 1982 (amended 1990). Executive power is exercised by the government. Legislative power is vested in both the government and the House of Assembly. The judiciary is independent of the executive and the legislature. \n\nDefence\n\nAs a dependency of the UK, the UK is responsible for Anguilla's military defence, although there are no active garrisons or armed forces present. Anguilla has a small marine police force, comprising around 32 personnel, which operates one VT Halmatic M160-class 52-foot fast patrol boat.\n\nPopulation \n\nDemographics \n\nThe majority of residents (90.08%) are black, the descendants of slaves transported from Africa. Minorities include whites at 3.74% and people of mixed race at 4.65% (figures from 2001 census).\n\n72% of the population is Anguillian while 28% is non-Anguillian (2001 census). Of the non-Anguillian population, many are citizens of the United States, United Kingdom, St Kitts & Nevis, the Dominican Republic, Jamaica and Nigeria.\n\n2006 and 2007 saw an influx of large numbers of Chinese, Indian and Mexican workers, brought in as labour for major tourist developments due to the local population not being large enough to support the labour requirements.\n\nReligion \n\nChristian churches did not have a consistent or strong presence during the initial period of English colonisation. Spiritual and religious practices of Europeans and Africans tended to reflect their regional origins. As early as 1813, Christian ministers formally ministered to enslaved Africans and promoted literacy among converts.Walicek, Don E. 2011. \"Christianity, Literacy, and Creolization in Nineteenth-Century Anguilla.\" In Anansi's Defiant Webs, Contact, Continuity, Convergence, and Complexity in the Language, Literatures and Cultures of the Greater Caribbean, ed. by N. Faraclas, R. Severing, et al. Willemstad: University of Curaçao and Fundashon pa Planifikashon di Idioma, pp. 181–189. The Wesleyan (Methodist) Missionary Society of England built churches and schools in 1817.Hodge, S. Wilfred (2003). Bethel- the road – and due west. In Wilbert Forker (Ed.), Born in slavery: A story of Methodism in Anguilla and its influence in the Caribbean (pp. 20–29). Edinburgh: Dunedin Academic Press.\n\nAccording to the 2001 census, Christianity is Anguilla's predominant religion, with 29 percent of the population practising Anglicanism. Another 23.9 percent are Methodist. Other churches on the island include Seventh-day Adventist, Baptist, Roman Catholic (served by the Roman Catholic Diocese of Saint John's - Basseterre, with see at Saint John on Antigua and Barbuda) and a community of Jehovah's Witnesses (0.7%). Between 1992 and 2001 the number of followers of the Church of God and Pentecostals increased considerably. There are at least 15 churches on the island. Although a minority on the island, it is an important location to followers of Rastafarian religion—Anguilla is the birthplace of Robert Athlyi Rogers, author of the Holy Piby which has had a strong influence on Rastafarian beliefs. Various other religions are practised as well. More recently, a Muslim cultural centre has opened on the island.\n\nLanguages \n\nToday most people in Anguilla speak a British-influenced variety of standard English. Other languages are also spoken on the island, including varieties of Spanish, Chinese and the languages of other immigrants. However, the most common language other than Standard English is the island's own English-lexifier Creole language (not to be confused with Antillean Creole ('French Creole'), spoken in French islands such as Martinique and Guadeloupe). It is referred to locally by terms such as \"dialect\" (pronounced \"dialek\"), [http://whatwedoinanguilla.com/language/ Anguilla Talk or \"Anguillian\"]. It has its main roots in early varieties of English and West African languages, and is similar to the dialects spoken in English-speaking islands throughout the Eastern Caribbean, in terms of its structural features and to the extent of being considered one single language.\n\nLinguists who are interested in the origins of Anguillian and other Caribbean Creoles point out that some of its grammatical features can be traced to African languages while others can be traced to European languages. Three areas have been identified as significant for the identification of the linguistic origins of those forced migrants who arrived before 1710: the Gold Coast, the Slave Coast and the Windward Coast.Singler, John. 1993. African influence upon Afro-American language varieties: A consideration of sociohistorical factors. In Africanisms in Afro-American language varieties, S. Mufwene and n. Condon (eds.), 235–253. Athens, GA: University of Georgia Press.\n\nSociohistorical information from Anguilla's archives suggest that Africans and Europeans formed two distinct, but perhaps overlapping speech communities in the early phases of the island's colonisation. \"Anguillian\" is believed to have emerged as the language of the masses as time passed, slavery was abolished and locals began to see themselves as \"belonging\" to Anguillian society.\n\nEducation \n\nThere are six government primary schools, one government secondary school (Albena Lake Hodge Comprehensive School), and two private schools.\"[http://www.gov.ai/schools.php Schools].\" Government of Anguilla. Retrieved on December 7, 2017. There is a single library, the Edison L. Hughes Education & Library Complex of the Anguilla Public Library.\"[http://www.gov.ai/library.php The Edison L. Hughes Education & Library Complex].\" Government of Anguilla. Retrieved on December 7, 2017. A branch of the Saint James School of Medicine was established in 2011 in Anguilla. It is a private, for-profit medical school headquartered in Park Ridge, Illinois.\n\nCulture \n\nThe Anguilla National Trust (ANT) was established in 1988 and opened its offices in 1993 charged with the responsibility of preserving the heritage of the island, including its cultural heritage. The Trust has programmes encouraging Anguillian writers and the preservation of the island's history. In 2015, Where I See The Sun – Contemporary Poetry in Anguilla A New Anthology by Lasana M. Sekou was published by House of Nehesi Publishers. Among the forty three poets in the unprecedented collection are Rita Celestine-Carty, Bankie Banx, John T. Harrigan, Patricia J. Adams, Fabian Fahie, Dr. Oluwakemi Linda Banks, and Reuel Ben Lewi.http://soualiganewsday.com/local/soualiga-newsday-features/item/3890-think-and-know-where-i-see-the-sun-–-contemporary-poetry-in-anguilla.html\n\nThe island's cultural history begins with the Taino Native Americans. Artifacts have been found around the island, telling of life before European settlers arrived by the Arawak and Carib peoples.\n\nAs throughout the Caribbean, holidays are a cultural fixture. Anguilla's most important holidays are of historic as much as cultural importance – particularly the anniversary of the emancipation (previously August Monday in the Park), celebrated as the Summer Festival. British festivities, such as the Queen's Birthday, are also celebrated.\n\nCuisine \n\nAnguillian cuisine is influenced by native Caribbean, African, Spanish, French and English cuisines.Robinson, Peg. [http://traveltips.usatoday.com/foods-important-anguilla-20339.html \"Foods That Are Important in Anguilla.\"] [http://traveltips.usatoday.com USA Today Travel]. Retrieved July 2011. Seafood is abundant, including prawns, shrimp, crab, spiny lobster, conch, mahi-mahi, red snapper, marlin and grouper. Salt cod is a staple food eaten on its own and used in stews, casseroles and soups. Livestock is limited due to the small size of the island and people there use poultry, pork, goat and mutton, along with imported beef. Goat is the most commonly eaten meat, used in a variety of dishes.\n\nA significant amount of the island's produce is imported due to limited land suitable for agriculture production; much of the soil is sandy and infertile. Among the agriculture produced in Anguilla includes tomatoes, peppers, limes and other citrus fruits, onion, garlic, squash, pigeon peas and callaloo. Starch staple foods include imported rice and other foods that are imported or locally grown, including yams,Higgins, Michelle. (28 January 2007).  [http://travel.nytimes.com/2007/01/28/travel/28anguilla.html \"For Foodies: Anguilla.\"] [http://travel.nytimes.com The New York Times – Travel]. Retrieved July 2011. sweet potatoes and breadfruit.\n\nDue to its internationally recognised culinary community, the island has enjoyed a reputation as \"the culinary capital of the Caribbean\". This reputation was reinforced with the publication of the (WE) Are Anguilla Cookbook, a guide to the cuisine of Anguilla featuring emerging and established local chefs, who share both their signature dishes and personal anecdotes regarding the island's epicurean culture. A publishing contract was secured by The Britto Agency, which had conceived the idea for the book itself.\n\nMusic \n\nThe island's burgeoning musical community made history with the recording of Sounds of Anguilla (Volume 1), the first album ever composed solely of artists from a single Caribbean island representing multiple musical genres: pop, reggae, hip-hop, soca music and R&B. The album, featuring Anguillian musicians such as Bankie Banx, Amalia Watty, True Intentions and Gerswin Lake and The Parables, was released on iTunes in June 2015.\n\nSports \n\nBoat racing has deep roots in Anguillian culture and is the national sport.\n \nThere are regular sailing regattas on national holidays, such as Carnival, which are contested by locally built and designed boats. These boats have names and have sponsors that print their logo on their sails.\n\nAs in many other former British colonies, cricket is also a popular sport. Anguilla is the home of Omari Banks, who played for the West Indies Cricket Team, while Cardigan Connor played first-class cricket for English county side Hampshire and was 'chef de mission' (team manager) for Anguilla's Commonwealth Games team in 2002.\n\nRugby union is represented in Anguilla by the Anguilla Eels RFC, who were formed in April 2006.[http://www.news.ai/gl//article.php?story=20060425160749670 Rugby in Anguilla!], Anguilla News The Eels have been finalists in the St. Martin tournament in November 2006 and semi-finalists in 2007, 2008, 2009 and Champions in 2010. The Eels were formed in 2006 by Scottish club national second row Martin Welsh, Club Sponsor and President of the AERFC Ms. Jacquie Ruan, and Canadian standout Scrumhalf Mark Harris (Toronto Scottish RFC).\n\nAnguilla is also the birthplace of sprinter Zharnel Hughes who has represented Great Britain since 2015. He specialises in the 100m and 200m sprints. He won the 100m in the 2013 CARIFTA Games with a time of 10.44 seconds, despite his time being some way below his personal best.2013 CARIFTA Games He currently holds the ISSA/GraceKennedy Boys' and Girls' Athletics Championships record for the 100m, with a time of 10.12 seconds having taken the record from Yohan Blake.[5][6] On 13 March 2015, Hughes made his Diamond League debut where he was commended for almost beating world champion Usain Bolt.[7] On 24 July 2015, Hughes won the 200m at the London Diamond League meet to take the lead in the Diamond League standings for the season.[8] On 27 August 2015, Hughes came 5th in the 200m at the World Championships in Beijing with a time of 20.02 seconds.\n\nShara Proctor, British Long Jump Silver Medalist in World Championships in Beijing first represented Anguilla in the event until 2010 when she began to represent the UK. Under the Anguillian Flag she achieved several medals in the NACAC games.\n\nKeith Connor, triple jumper, is also an Anguillian. He represented Great Britain and achieved several international titles including Commonwealth and European Games gold medals and an Olympic bronze medal. Keith later became Head Coach of Australia Athletics.\n\nChesney Hughes, is a West Indian cricketer who plays for Derbyshire. He was born in Anguilla. Having signed for the side in June 2009, and holding a British passport, Hughes made his List A debut for the side during the 2009 Pro40 League against Warwickshire.\n\nNatural history\n\nWildlife\n\nAnguilla has habitat for the Cuban tree frogs (Osteopilus septentrionalis). The red-footed tortoise (Chelonoidis carbonaria) is a species of tortoise found here, it somehow came from South America. Hurricanes led to over-water dispersal for the green iguanas (Iguana iguana) to colonise Anguilla. All three animals are introduced.\n\nFive species of bats are known in the literature from Anguilla – the threatened insular single leaf bat (Monophyllus plethodon), the Antillean fruit-eating bat (Brachyphylla cavernarum), the Jamaican fruit bat (Artibeus jamaicensis), the Mexican funnel-eared bat (Natalus stramineus), and the velvety free-tailed bat (Molossus molossus).\n\nGeography and geology \n\nAnguilla is a flat, low-lying island of coral and limestone in the Caribbean Sea, east of Puerto Rico and the Virgin Islands. It is directly north of Saint Martin, separated from that island by the Anguilla Channel. The soil is generally thin and poor, supporting scrub, tropical and forest vegetation.\n\nAnguilla is noted for its spectacular and ecologically important coral reefs and beaches. Apart from the main island of Anguilla itself, the territory includes a number of other smaller islands and cays, mostly tiny and uninhabited. Some of these are:\n* Anguillita\n* Dog Island\n* Prickly Pear Cays\n* Scrub Island\n* Seal Island\n* Sombrero, also known as Hat Island\n* Sandy Island\n\nGeology\n\nAnguilla has a volcanic origin and has been submerged repeatedly from climate change.\n\nClimate \n\nTemperature\n\nNortheastern trade winds keep this tropical island relatively cool and dry. Average annual temperature is 80 °F. July–October is its hottest period, December–February, its coolest.\n\nRainfall\n\nRainfall averages 35 in annually, although the figures vary from season to season and year to year. The island is subject to both sudden tropical storms and hurricanes, which occur in the period from July to November. The island suffered damage in 1995 from Hurricane Luis and severe flooding 5–20 feet from Hurricane Lenny.\n\nEconomy \n\nAnguilla's thin arid soil being largely unsuitable for agriculture, the island has few land-based natural resources. Its main industries are tourism, offshore incorporation and management, offshore banking, captive insurance and fishing.\n\nBefore the 2008 worldwide crisis the economy of Anguilla was expanding rapidly, especially the tourism sector which was driving major new developments in partnerships with multi-national companies.\n\nAnguilla's currency is the East Caribbean dollar, though the US dollar is also widely accepted. The exchange rate is fixed to the US dollar at US$1 = EC$2.70.\n\nThe economy, and especially the tourism sector, suffered a setback in late 1995 due to the effects of Hurricane Luis in September but recovered in 1996. Hotels were hit particularly hard during this time. Another economic setback occurred during the aftermath of Hurricane Lenny in 2000.\n\nAnguilla's financial system comprises 7 banks, 2 money services businesses, more than 40 company managers, more than 50 insurers, 12 brokers, more than 250 captive intermediaries, more than 50 mutual funds and 8 trust companies.[http://www.fsc.org.ai/market.shtml Market Participants]\n\nAnguilla's tourism industry received a major boost when it was selected to host the World Travel Awards in December 2014. Known as \"the Oscars of the travel industry\", the awards ceremony was held at the CuisinArt Resort and Spa and was hosted by award-winning actress Vivica A. Fox. Anguilla was voted the World's Leading Luxury Island Destination from a short list of top-tier candidates such as St. Barts, Maldives and Mauritius.\n\nAnguilla aims to obtain 15% of its energy from solar power so it is less reliant on expensive imported diesel. The Climate & Development Knowledge Network is helping the government gather the information it needs to change the territory's legislation, so it can integrate renewables into its grid. Barbados, have also made good progress in switching to renewables, but many other SIDS are still at the early stages of planning how to integrate renewable energy into their grids. \"For a small island we're very far ahead,\" said Beth Barry, Coordinator of the Anguilla Renewable Energy Office. \"We've got an Energy Policy and a draft Climate Change policy and have been focussing efforts on the question of sustainable energy supply for several years now. As a result, we have a lot of information we can share with other islands.\"Fry, Carolyn. 28 June 2012. [http://cdkn.org/2012/06/interview-with-beth-barry-on-anguilla-renewable-energy/ Anguilla moves towards cleaner energy]\n\nTransportation \n\nAir\n\nAnguilla is served by Clayton J. Lloyd International Airport (prior to 4 July 2010 known as Wallblake Airport). The primary runway at the airport is 5462 ft in length and can accommodate moderate-sized aircraft. Services connect to various other Caribbean islands via regional carrier LIAT, local charter airlines and others. Although there are no direct scheduled flights to or from continental America or Europe, Tradewind Aviation and Cape Air provide scheduled air service to San Juan, Puerto Rico. The airport can handle large narrow-body jets such as the Boeing 727, Boeing 737 and Boeing 757.\n\nRoad\n\nAside from taxis, there is no public transport on the island. Cars drive on the left.\n\nBoat\n\nThere are regular ferries from Saint Martin to Anguilla. It is a 20-minute crossing from Marigot, St. Martin to Blowing Point, Anguilla. Ferries commence service from 7:00 am. There is also a Charter Service, from Blowing Point, Anguilla to Princess Juliana Airport to make travel easier. This way of travel is the most common method of transport between Anguilla and St. Martin or St. Maarten.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Anguilla" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1217" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Anguilla ( ) is a British overseas territory in the Caribbean. It is one of the most northerly of the Leeward Islands in the Lesser Antilles, lying east of Puerto Rico and the Virgin Islands and directly north of Saint Martin. The territory consists of the main island of Anguilla, approximately 16 mi long by 3 mi wide at its widest point, together with a number of much smaller islands and cays with no permanent population. The island's capital is The Valley. The total land area of the territory is 35 mi2, with a population of approximately  ( estimate).\n\nAnguilla has become a popular tax haven, having no capital gains, estate, profit or other forms of direct taxation on either individuals or corporations. In April 2011, faced with a mounting deficit, it introduced a 3% \"Interim Stabilisation Levy\", Anguilla's first form of income tax.\n\nOn 7 September 2017, the Category 5 Hurricane Irma hit the island. As of the next day, one death had been reported; the island also sustained extensive damage to many buildings, including government ones, as well as its electricity infrastructure and water supply. The UK government summarised this as \"severe and in places critical\" damage.http://abcnews.go.com/International/wireStory/damage-hurricane-irma-caribbean-49703893 A few days later, Hurricane Jose largely bypassed Anguilla.http://smn-news.com/st-maarten-st-martin-news/27019-anguilla-spared-by-hurricane-jose-accelerates-recovery-from-irma.html\n\nName \n\nThe name Anguilla is an anglicised or latinate form of earlier Spanish ' meaning \"eel\" in reference to the island's shape. It is believed by most sources to have been named by Christopher Columbus. For similar reasons, it was also known as Snake or Snake Island.\n\nHistory \n\nAnguilla was first settled by Indigenous Amerindian peoples who migrated from South America. The earliest Native American artefacts found on Anguilla have been dated to around 1300 ; remains of settlements date from  600.Caribbean Islands, Sarah Cameron (Footprint Travel Guides), p. 466 ([https://books.google.com/?idG74-rZzX64cC Google Books]) The Arawak name for the island seems to have been Malliouhana. The date of European colonisation is uncertain: some sources claim that Columbus sighted the island during his second voyage in 1493, while others state that the island's first European explorer was the French Huguenot nobleman and merchant mariner René Goulaine de Laudonnière in 1564.. The Dutch West India Company established a fort on the island in 1631. The Dutch withdraw after the destruction of the fort by Spanish forces in 1633.Source: [http://www.atlasofmutualheritage.nl/nl/Anguilla.1009p Atlas of Mutual Heritage].\n\nTraditional accounts state that Anguilla was first colonised by English settlers from Saint Kitts beginning in 1650. In this early colonial period, however, Anguilla sometimes served as a place of refuge and recent scholarship focused on Anguilla has placed greater significance on other Europeans and creoles migrating from St. Christopher,Cooper, V.O. 1998. St. Kitts: The Launching Pad for Leeward Islands Creoles. In St. Kitts and the Atlantic Creoles, the Texts of Samuel Augustus Mathews in Perspective, P. Baker and A. Bruyn (eds.). London: University of Westminster Press. Barbados, Nevis and Antigua. The French temporarily took over the island in 1666 but returned it to English control under the terms of the Treaty of Breda the next year. A Major John Scott who visited in September 1667, wrote of leaving the island \"in good condition\" and noted that in July 1668, \"200 or 300 people fled thither in time of war\".British Colonial and State Papers 1661–1668, 16 November 1667 and 9 July 1668.\n\nIt is likely that some of these early Europeans brought enslaved Africans with them. Historians confirm that African slaves lived in the region in the early 17th century. For example, Africans from Senegal lived in St. Christopher in 1626. By 1672 a slave depot existed on the island of Nevis, serving the Leeward Islands. While the time of African arrival in Anguilla is difficult to place precisely, archival evidence indicates a substantial African presence of at least 100 slaves by 1683. These seem to have come from Central Africa as well as West Africa.Walicek, Don E. 2009. \"The Founder Principle and Anguilla's Homestead Society,\" Gradual Creolization: Studies Celebrating Jacques Arends, ed. by M. van den Berg, H. Cardoso, and R. Selbach. (Creole Language Library Series 34), Amsterdam: John Benjamins, pp. 349–372.\n\nAttempts by the French to capture the island during the War of Austrian Succession (1745) and the Napoleonic Wars (1796) ended in failure.\n\nDuring the early colonial period, Anguilla was administered by the British through Antigua; in 1825, it was placed under the administrative control of nearby Saint Kitts. In 1967, Britain granted Saint Kitts and Nevis full internal autonomy. Anguilla was also incorporated into the new unified dependency, named Saint Christopher-Nevis-Anguilla, against the wishes of many Anguillians. This led to two Anguillian Revolutions in 1967 and 1969 headed by Atlin Harriganhttp://www.gov.ai/documents/budget/Budget_2009.pdf and Ronald Webster. The island briefly operated as the independent \"Republic of Anguilla\". The goal of the revolution was not independence per se, but rather independence from Saint Kitts and Nevis and a return to being a British colony. British authority was fully restored in July 1971; in 1980, Anguilla was finally allowed to secede from Saint Kitts and Nevis and become a separate British Crown colony (now a British overseas territory).\n\nGovernance \n\nPolitical system\n\nAnguilla is an internally self-governing overseas territory of the United Kingdom. Its politics take place in a framework of a parliamentary representative democratic dependency, whereby the Chief Minister is the head of government, and of a pluriform multi-party system.\n\nThe United Nations Committee on Decolonization includes Anguilla on the United Nations list of Non-Self-Governing Territories. The territory's constitution is Anguilla Constitutional Order 1 April 1982 (amended 1990). Executive power is exercised by the government. Legislative power is vested in both the government and the House of Assembly. The judiciary is independent of the executive and the legislature. \n\nDefence\n\nAs a dependency of the UK, the UK is responsible for Anguilla's military defence, although there are no active garrisons or armed forces present. Anguilla has a small marine police force, comprising around 32 personnel, which operates one VT Halmatic M160-class 52-foot fast patrol boat.\n\nPopulation \n\nDemographics \n\nThe majority of residents (90.08%) are black, the descendants of slaves transported from Africa. Minorities include whites at 3.74% and people of mixed race at 4.65% (figures from 2001 census).\n\n72% of the population is Anguillian while 28% is non-Anguillian (2001 census). Of the non-Anguillian population, many are citizens of the United States, United Kingdom, St Kitts & Nevis, the Dominican Republic, Jamaica and Nigeria.\n\n2006 and 2007 saw an influx of large numbers of Chinese, Indian and Mexican workers, brought in as labour for major tourist developments due to the local population not being large enough to support the labour requirements.\n\nReligion \n\nChristian churches did not have a consistent or strong presence during the initial period of English colonisation. Spiritual and religious practices of Europeans and Africans tended to reflect their regional origins. As early as 1813, Christian ministers formally ministered to enslaved Africans and promoted literacy among converts.Walicek, Don E. 2011. \"Christianity, Literacy, and Creolization in Nineteenth-Century Anguilla.\" In Anansi's Defiant Webs, Contact, Continuity, Convergence, and Complexity in the Language, Literatures and Cultures of the Greater Caribbean, ed. by N. Faraclas, R. Severing, et al. Willemstad: University of Curaçao and Fundashon pa Planifikashon di Idioma, pp. 181–189. The Wesleyan (Methodist) Missionary Society of England built churches and schools in 1817.Hodge, S. Wilfred (2003). Bethel- the road – and due west. In Wilbert Forker (Ed.), Born in slavery: A story of Methodism in Anguilla and its influence in the Caribbean (pp. 20–29). Edinburgh: Dunedin Academic Press.\n\nAccording to the 2001 census, Christianity is Anguilla's predominant religion, with 29 percent of the population practising Anglicanism. Another 23.9 percent are Methodist. Other churches on the island include Seventh-day Adventist, Baptist, Roman Catholic (served by the Roman Catholic Diocese of Saint John's - Basseterre, with see at Saint John on Antigua and Barbuda) and a community of Jehovah's Witnesses (0.7%). Between 1992 and 2001 the number of followers of the Church of God and Pentecostals increased considerably. There are at least 15 churches on the island. Although a minority on the island, it is an important location to followers of Rastafarian religion—Anguilla is the birthplace of Robert Athlyi Rogers, author of the Holy Piby which has had a strong influence on Rastafarian beliefs. Various other religions are practised as well. More recently, a Muslim cultural centre has opened on the island.\n\nLanguages \n\nToday most people in Anguilla speak a British-influenced variety of standard English. Other languages are also spoken on the island, including varieties of Spanish, Chinese and the languages of other immigrants. However, the most common language other than Standard English is the island's own English-lexifier Creole language (not to be confused with Antillean Creole ('French Creole'), spoken in French islands such as Martinique and Guadeloupe). It is referred to locally by terms such as \"dialect\" (pronounced \"dialek\"), [http://whatwedoinanguilla.com/language/ Anguilla Talk or \"Anguillian\"]. It has its main roots in early varieties of English and West African languages, and is similar to the dialects spoken in English-speaking islands throughout the Eastern Caribbean, in terms of its structural features and to the extent of being considered one single language.\n\nLinguists who are interested in the origins of Anguillian and other Caribbean Creoles point out that some of its grammatical features can be traced to African languages while others can be traced to European languages. Three areas have been identified as significant for the identification of the linguistic origins of those forced migrants who arrived before 1710: the Gold Coast, the Slave Coast and the Windward Coast.Singler, John. 1993. African influence upon Afro-American language varieties: A consideration of sociohistorical factors. In Africanisms in Afro-American language varieties, S. Mufwene and n. Condon (eds.), 235–253. Athens, GA: University of Georgia Press.\n\nSociohistorical information from Anguilla's archives suggest that Africans and Europeans formed two distinct, but perhaps overlapping speech communities in the early phases of the island's colonisation. \"Anguillian\" is believed to have emerged as the language of the masses as time passed, slavery was abolished and locals began to see themselves as \"belonging\" to Anguillian society.\n\nEducation \n\nThere are six government primary schools, one government secondary school (Albena Lake Hodge Comprehensive School), and two private schools.\"[http://www.gov.ai/schools.php Schools].\" Government of Anguilla. Retrieved on December 7, 2017. There is a single library, the Edison L. Hughes Education & Library Complex of the Anguilla Public Library.\"[http://www.gov.ai/library.php The Edison L. Hughes Education & Library Complex].\" Government of Anguilla. Retrieved on December 7, 2017. A branch of the Saint James School of Medicine was established in 2011 in Anguilla. It is a private, for-profit medical school headquartered in Park Ridge, Illinois.\n\nCulture \n\nThe Anguilla National Trust (ANT) was established in 1988 and opened its offices in 1993 charged with the responsibility of preserving the heritage of the island, including its cultural heritage. The Trust has programmes encouraging Anguillian writers and the preservation of the island's history. In 2015, Where I See The Sun – Contemporary Poetry in Anguilla A New Anthology by Lasana M. Sekou was published by House of Nehesi Publishers. Among the forty three poets in the unprecedented collection are Rita Celestine-Carty, Bankie Banx, John T. Harrigan, Patricia J. Adams, Fabian Fahie, Dr. Oluwakemi Linda Banks, and Reuel Ben Lewi.http://soualiganewsday.com/local/soualiga-newsday-features/item/3890-think-and-know-where-i-see-the-sun-–-contemporary-poetry-in-anguilla.html\n\nThe island's cultural history begins with the Taino Native Americans. Artifacts have been found around the island, telling of life before European settlers arrived by the Arawak and Carib peoples.\n\nAs throughout the Caribbean, holidays are a cultural fixture. Anguilla's most important holidays are of historic as much as cultural importance – particularly the anniversary of the emancipation (previously August Monday in the Park), celebrated as the Summer Festival. British festivities, such as the Queen's Birthday, are also celebrated.\n\nCuisine \n\nAnguillian cuisine is influenced by native Caribbean, African, Spanish, French and English cuisines.Robinson, Peg. [http://traveltips.usatoday.com/foods-important-anguilla-20339.html \"Foods That Are Important in Anguilla.\"] [http://traveltips.usatoday.com USA Today Travel]. Retrieved July 2011. Seafood is abundant, including prawns, shrimp, crab, spiny lobster, conch, mahi-mahi, red snapper, marlin and grouper. Salt cod is a staple food eaten on its own and used in stews, casseroles and soups. Livestock is limited due to the small size of the island and people there use poultry, pork, goat and mutton, along with imported beef. Goat is the most commonly eaten meat, used in a variety of dishes.\n\nA significant amount of the island's produce is imported due to limited land suitable for agriculture production; much of the soil is sandy and infertile. Among the agriculture produced in Anguilla includes tomatoes, peppers, limes and other citrus fruits, onion, garlic, squash, pigeon peas and callaloo. Starch staple foods include imported rice and other foods that are imported or locally grown, including yams,Higgins, Michelle. (28 January 2007).  [http://travel.nytimes.com/2007/01/28/travel/28anguilla.html \"For Foodies: Anguilla.\"] [http://travel.nytimes.com The New York Times – Travel]. Retrieved July 2011. sweet potatoes and breadfruit.\n\nDue to its internationally recognised culinary community, the island has enjoyed a reputation as \"the culinary capital of the Caribbean\". This reputation was reinforced with the publication of the (WE) Are Anguilla Cookbook, a guide to the cuisine of Anguilla featuring emerging and established local chefs, who share both their signature dishes and personal anecdotes regarding the island's epicurean culture. A publishing contract was secured by The Britto Agency, which had conceived the idea for the book itself.\n\nMusic \n\nThe island's burgeoning musical community made history with the recording of Sounds of Anguilla (Volume 1), the first album ever composed solely of artists from a single Caribbean island representing multiple musical genres: pop, reggae, hip-hop, soca music and R&B. The album, featuring Anguillian musicians such as Bankie Banx, Amalia Watty, True Intentions and Gerswin Lake and The Parables, was released on iTunes in June 2015.\n\nSports \n\nBoat racing has deep roots in Anguillian culture and is the national sport.\n \nThere are regular sailing regattas on national holidays, such as Carnival, which are contested by locally built and designed boats. These boats have names and have sponsors that print their logo on their sails.\n\nAs in many other former British colonies, cricket is also a popular sport. Anguilla is the home of Omari Banks, who played for the West Indies Cricket Team, while Cardigan Connor played first-class cricket for English county side Hampshire and was 'chef de mission' (team manager) for Anguilla's Commonwealth Games team in 2002.\n\nRugby union is represented in Anguilla by the Anguilla Eels RFC, who were formed in April 2006.[http://www.news.ai/gl//article.php?story=20060425160749670 Rugby in Anguilla!], Anguilla News The Eels have been finalists in the St. Martin tournament in November 2006 and semi-finalists in 2007, 2008, 2009 and Champions in 2010. The Eels were formed in 2006 by Scottish club national second row Martin Welsh, Club Sponsor and President of the AERFC Ms. Jacquie Ruan, and Canadian standout Scrumhalf Mark Harris (Toronto Scottish RFC).\n\nAnguilla is also the birthplace of sprinter Zharnel Hughes who has represented Great Britain since 2015. He specialises in the 100m and 200m sprints. He won the 100m in the 2013 CARIFTA Games with a time of 10.44 seconds, despite his time being some way below his personal best.2013 CARIFTA Games He currently holds the ISSA/GraceKennedy Boys' and Girls' Athletics Championships record for the 100m, with a time of 10.12 seconds having taken the record from Yohan Blake.[5][6] On 13 March 2015, Hughes made his Diamond League debut where he was commended for almost beating world champion Usain Bolt.[7] On 24 July 2015, Hughes won the 200m at the London Diamond League meet to take the lead in the Diamond League standings for the season.[8] On 27 August 2015, Hughes came 5th in the 200m at the World Championships in Beijing with a time of 20.02 seconds.\n\nShara Proctor, British Long Jump Silver Medalist in World Championships in Beijing first represented Anguilla in the event until 2010 when she began to represent the UK. Under the Anguillian Flag she achieved several medals in the NACAC games.\n\nKeith Connor, triple jumper, is also an Anguillian. He represented Great Britain and achieved several international titles including Commonwealth and European Games gold medals and an Olympic bronze medal. Keith later became Head Coach of Australia Athletics.\n\nChesney Hughes, is a West Indian cricketer who plays for Derbyshire. He was born in Anguilla. Having signed for the side in June 2009, and holding a British passport, Hughes made his List A debut for the side during the 2009 Pro40 League against Warwickshire.\n\nNatural history\n\nWildlife\n\nAnguilla has habitat for the Cuban tree frogs (Osteopilus septentrionalis). The red-footed tortoise (Chelonoidis carbonaria) is a species of tortoise found here, it somehow came from South America. Hurricanes led to over-water dispersal for the green iguanas (Iguana iguana) to colonise Anguilla. All three animals are introduced.\n\nFive species of bats are known in the literature from Anguilla – the threatened insular single leaf bat (Monophyllus plethodon), the Antillean fruit-eating bat (Brachyphylla cavernarum), the Jamaican fruit bat (Artibeus jamaicensis), the Mexican funnel-eared bat (Natalus stramineus), and the velvety free-tailed bat (Molossus molossus).\n\nGeography and geology \n\nAnguilla is a flat, low-lying island of coral and limestone in the Caribbean Sea, east of Puerto Rico and the Virgin Islands. It is directly north of Saint Martin, separated from that island by the Anguilla Channel. The soil is generally thin and poor, supporting scrub, tropical and forest vegetation.\n\nAnguilla is noted for its spectacular and ecologically important coral reefs and beaches. Apart from the main island of Anguilla itself, the territory includes a number of other smaller islands and cays, mostly tiny and uninhabited. Some of these are:\n* Anguillita\n* Dog Island\n* Prickly Pear Cays\n* Scrub Island\n* Seal Island\n* Sombrero, also known as Hat Island\n* Sandy Island\n\nGeology\n\nAnguilla has a volcanic origin and has been submerged repeatedly from climate change.\n\nClimate \n\nTemperature\n\nNortheastern trade winds keep this tropical island relatively cool and dry. Average annual temperature is 80 °F. July–October is its hottest period, December–February, its coolest.\n\nRainfall\n\nRainfall averages 35 in annually, although the figures vary from season to season and year to year. The island is subject to both sudden tropical storms and hurricanes, which occur in the period from July to November. The island suffered damage in 1995 from Hurricane Luis and severe flooding 5–20 feet from Hurricane Lenny.\n\nEconomy \n\nAnguilla's thin arid soil being largely unsuitable for agriculture, the island has few land-based natural resources. Its main industries are tourism, offshore incorporation and management, offshore banking, captive insurance and fishing.\n\nBefore the 2008 worldwide crisis the economy of Anguilla was expanding rapidly, especially the tourism sector which was driving major new developments in partnerships with multi-national companies.\n\nAnguilla's currency is the East Caribbean dollar, though the US dollar is also widely accepted. The exchange rate is fixed to the US dollar at US$1 = EC$2.70.\n\nThe economy, and especially the tourism sector, suffered a setback in late 1995 due to the effects of Hurricane Luis in September but recovered in 1996. Hotels were hit particularly hard during this time. Another economic setback occurred during the aftermath of Hurricane Lenny in 2000.\n\nAnguilla's financial system comprises 7 banks, 2 money services businesses, more than 40 company managers, more than 50 insurers, 12 brokers, more than 250 captive intermediaries, more than 50 mutual funds and 8 trust companies.[http://www.fsc.org.ai/market.shtml Market Participants]\n\nAnguilla's tourism industry received a major boost when it was selected to host the World Travel Awards in December 2014. Known as \"the Oscars of the travel industry\", the awards ceremony was held at the CuisinArt Resort and Spa and was hosted by award-winning actress Vivica A. Fox. Anguilla was voted the World's Leading Luxury Island Destination from a short list of top-tier candidates such as St. Barts, Maldives and Mauritius.\n\nAnguilla aims to obtain 15% of its energy from solar power so it is less reliant on expensive imported diesel. The Climate & Development Knowledge Network is helping the government gather the information it needs to change the territory's legislation, so it can integrate renewables into its grid. Barbados, have also made good progress in switching to renewables, but many other SIDS are still at the early stages of planning how to integrate renewable energy into their grids. \"For a small island we're very far ahead,\" said Beth Barry, Coordinator of the Anguilla Renewable Energy Office. \"We've got an Energy Policy and a draft Climate Change policy and have been focussing efforts on the question of sustainable energy supply for several years now. As a result, we have a lot of information we can share with other islands.\"Fry, Carolyn. 28 June 2012. [http://cdkn.org/2012/06/interview-with-beth-barry-on-anguilla-renewable-energy/ Anguilla moves towards cleaner energy]\n\nTransportation \n\nAir\n\nAnguilla is served by Clayton J. Lloyd International Airport (prior to 4 July 2010 known as Wallblake Airport). The primary runway at the airport is 5462 ft in length and can accommodate moderate-sized aircraft. Services connect to various other Caribbean islands via regional carrier LIAT, local charter airlines and others. Although there are no direct scheduled flights to or from continental America or Europe, Tradewind Aviation and Cape Air provide scheduled air service to San Juan, Puerto Rico. The airport can handle large narrow-body jets such as the Boeing 727, Boeing 737 and Boeing 757.\n\nRoad\n\nAside from taxis, there is no public transport on the island. Cars drive on the left.\n\nBoat\n\nThere are regular ferries from Saint Martin to Anguilla. It is a 20-minute crossing from Marigot, St. Martin to Blowing Point, Anguilla. Ferries commence service from 7:00 am. There is also a Charter Service, from Blowing Point, Anguilla to Princess Juliana Airport to make travel easier. This way of travel is the most common method of transport between Anguilla and St. Martin or St. Maarten. Anguilla. http://en.wikipedia.org/?curid=1217."
  }
}
