{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11671",
  "eid" : "fd1f5c20-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778504418,
  "textBody" : "Fick's laws of diffusion describe diffusion and were derived by Adolf Fick in 1855. They can be used to solve for the diffusion coefficient, D. Fick's first law can be used to derive his second law which in turn is identical to the diffusion equation.\n\nFick's first law \n\nFick's first law relates the diffusive flux to the concentration under the assumption of steady state. It postulates that the flux goes from regions of high concentration to regions of low concentration, with a magnitude that is proportional to the concentration gradient (spatial derivative), or in simplistic terms the concept that a solute will move from a region of high concentration to a region of low concentration across a concentration gradient. In one (spatial) dimension, the law is:\n\nJ = -D \\frac{d \\varphi}{d x} \nwhere\n* J is the \"diffusion flux,\" of which the dimension is amount of substance per unit area per unit time, so it is expressed in such units as mol m−2 s−1. J measures the amount of substance that will flow through a unit area during a unit time interval.\n* D is the diffusion coefficient or diffusivity. Its dimension is area per unit time, so typical units for expressing it would be m2/s.\n* \\varphi (for ideal mixtures) is the concentration, of which the dimension is amount of substance per unit volume. It might be expressed in units of mol/m3.\n* x is position, the dimension of which is length. It might thus be expressed in the unit m.\n\nD is proportional to the squared velocity of the diffusing particles, which depends on the temperature, viscosity of the fluid and the size of the particles according to the Stokes-Einstein relation. In dilute aqueous solutions the diffusion coefficients of most ions are similar and have values that at room temperature are in the range of 0.6 × 10−9 to 2 × 10−9 m2/s. For biological molecules the diffusion coefficients normally range from 10−11 to 10−10 m2/s.\n\nIn two or more dimensions we must use ∇, the del or gradient operator, which generalises the first derivative, obtaining\n\n \\mathbf{J}=- D\\nabla \\varphi \n\nwhere J denotes the diffusion flux vector.\n\nThe driving force for the one-dimensional diffusion is the quantity −, which for ideal mixtures is the concentration gradient. In chemical systems other than ideal solutions or mixtures, the driving force for diffusion of each species is the gradient of chemical potential of this species. Then Fick's first law (one-dimensional case) can be written as:\n\nJ_i = - \\frac{D c_i}{RT} \\frac{\\partial \\mu_i}{\\partial x}\n\nwhere the index i denotes the ith species, c is the concentration (mol/m3), R is the universal gas constant [J/(K.mol)], T is the absolute temperature (K), and μ is the chemical potential (J/mol).\n\nIf the primary variable is mass fraction (yi, given, for example, in kg/kg), then the equation changes to:\n\nJ_i=- \\rho D\\nabla y_i \n\nwhere ρ is the fluid density (for example, in kg/m3). Note that the density is outside the gradient operator.\n\nFick's second law \n\nFick's second law predicts how diffusion causes the concentration to change with time. It is a partial differential equation which in one dimension reads:\n\n\\frac{\\partial \\varphi}{\\partial t} = D\\,\\frac{\\partial^2 \\varphi}{\\partial x^2}\\,\\!\n\nwhere\n* φ is the concentration in dimensions of [(amount of substance) length−3], example mol/m3; φ = φ(x,t) is a function that depends on location x and time t\n* t is time [s]\n* D is the diffusion coefficient in dimensions of [length2 time−1], example m2/s\n* x is the position [length], example m\n\nIn two or more dimensions we must use the Laplacian Δ = ∇2, which generalises the second derivative, obtaining the equation\n\n\\frac{\\partial \\varphi}{\\partial t} = D\\,\\Delta \\varphi\n\nDerivation of Fick's laws\n\nFick's first law\n\nIn one dimension, the following derivation is based on a similar argument made in Berg 1977 (see references).\n\nConsider a collection of particles performing a random walk in one dimension with length scale Δx and time scale Δt. Let N(x,t) be the number of particles at position x at time t.\n\nAt a given time step, half of the particles would move left and half would move right. Since half of the particles at point x move right and half of the particles at point x + Δx move left, the net movement to the right is:\n\n-\\tfrac{1}{2}\\left[N(x + \\Delta x, t) - N(x, t)\\right]\n\nThe flux, J, is this net movement of particles across some area element of area a, normal to the random walk during a time interval Δt. Hence we may write:\n\nJ = - \\frac{1}{2} \\left[\\frac{ N(x + \\Delta x, t)}{a \\Delta t} - \\frac{ N(x, t)}{a \\Delta t}\\right]\n\nMultiplying the top and bottom of the righthand side by (Δx)2 and rewriting, one obtains:\n\n J = -\\frac{\\left(\\Delta x\\right)^2}{2 \\Delta t}\\left[\\frac{N(x + \\Delta x, t)}{a (\\Delta x)^2} - \\frac{N(x, t)}{a (\\Delta x)^2}\\right]\n\nConcentration is defined as particles per unit volume, and hence\n\\varphi (x, t) = \\frac{N(x, t)}{a \\Delta x}.\n\nIn addition,  is the definition of the diffusion constant in one dimension, D. Thus our expression simplifies to:\n\n J = -D \\left[\\frac{\\varphi (x + \\Delta x, t)}{\\Delta x} - \\frac{\\varphi (x , t)}{\\Delta x}\\right]\n\nIn the limit where Δx is infinitesimal, the righthand side becomes a space derivative:\n\n J = - D \\frac{\\partial \\varphi}{\\partial x}  \n\nFick's second law\n\nFick's second law can be derived from Fick's first law and the mass conservation in absence of any chemical reactions:\n\n\\frac{\\partial \\varphi}{\\partial t} +\\,\\frac{\\partial}{\\partial x}\\,J 0\\Rightarrow\\frac{\\partial \\varphi}{\\partial t} -\\frac{\\partial}{\\partial x}\\left(\\,D\\,\\frac{\\partial}{\\partial x}\\varphi\\,\\right)\\,\n0\\!\n\nAssuming the diffusion coefficient D to be a constant, one can exchange the orders of the differentiation and multiply by the constant:\n\n\\frac{\\partial}{\\partial x}\\left(\\,D\\,\\frac{\\partial}{\\partial x} \\varphi\\,\\right) D\\,\\frac{\\partial}{\\partial x} \\frac{\\partial}{\\partial x} \\,\\varphi \n D\\,\\frac{\\partial^2\\varphi}{\\partial x^2}\nand, thus, receive the form of the Fick's equations as was stated above.\n\nFor the case of diffusion in two or more dimensions Fick's second law becomes\n\n\\frac{\\partial \\varphi}{\\partial t} = D\\,\\nabla^2\\,\\varphi\\,\\!,\n\nwhich is analogous to the heat equation.\n\nIf the diffusion coefficient is not a constant, but depends upon the coordinate or concentration, Fick's second law yields\n\n\\frac{\\partial \\varphi}{\\partial t} =  \\nabla \\cdot (\\,D\\,\\nabla\\,\\varphi\\,)\\,\\!.\n\nAn important example is the case where φ is at a steady state, i.e. the concentration does not change by time, so that the left part of the above equation is identically zero. In one dimension with constant D, the solution for the concentration will be a linear change of concentrations along x. In two or more dimensions we obtain\n\n \\nabla^2\\,\\varphi =0\\!\n\nwhich is Laplace's equation, the solutions to which are referred to by mathematicians as harmonic functions.\n\nDerivation\n\nFick's second law is a special case of the convection–diffusion equation in which there is no advective flux and no net volumetric source. It can be derived from the continuity equation:\n\n \\frac{\\partial \\varphi}{\\partial t} + \\nabla\\cdot\\vec{j} = R, \nwhere \\vec{j} is the total flux and R is a net volumetric source for \\varphi. The only source of flux in this situation is assumed to be diffusive flux:\n\\vec{j}_{\\text{diffusion}} = -D \\, \\nabla \\varphi\n\nPlugging the definition of diffusive flux to the continuity equation and assuming there is no source (R = 0), we arrive at Fick's second law:\n\n\\frac{\\partial \\varphi}{\\partial t} = D\\,\\frac{\\partial^2 \\varphi}{\\partial x^2}\\,\\!\n\nIf flux were the result of both diffusive flux and advective flux, the convection–diffusion equation is the result.\n\nExample solution in one dimension: diffusion length\n\nA simple case of diffusion with time t in one dimension (taken as the x-axis) from a boundary located at position x = 0, where the concentration is maintained at a value n0 is\n\nn \\left(x,t \\right)=n_0 \\mathrm{erfc} \\left( \\frac{x}{2\\sqrt{Dt}}\\right).\n\nwhere erfc is the complementary error function. This is the case when corrosive gases diffuse through the oxidative layer towards the metal surface (if we assume that concentration of gases in the environment is constant and the diffusion space (i. e., corrosion product layer) is semi-infinite – starting at 0 at the surface and spreading infinitely deep in the material). If, in its turn, the diffusion space is infinite (lasting both through the layer with n(x,0)  0, x > 0 and that with n(x,0) \n n0, x ≤ 0), then the solution is amended only with coefficient  in front of n0 (this might seem obvious, as the diffusion now occurs in both directions). This case is valid when some solution with concentration n0 is put in contact with a layer of pure solvent. (Bokstein, 2005) The length 2 is called the diffusion length and provides a measure of how far the concentration has propagated in the x-direction by diffusion in time t (Bird, 1976).\n\nAs a quick approximation of the error function, the first 2 terms of the Taylor series can be used:\nn \\left(x,t \\right)=n_0 \\left[ 1 - 2 \\left(\\frac{x}{2\\sqrt{Dt\\pi}}\\right) \\right] \n\nIf D is time-dependent, the diffusion length becomes\n 2\\sqrt{\\int_0^{t}D(t')dt'} .\nThis idea is useful for estimating a diffusion length over a heating and cooling cycle, where D varies with temperature.\n\nGeneralizations\n\n1. In non-homogeneous media, the diffusion coefficient varies in space, D = D(x). This dependence does not affect Fick's first law but the second law changes:\n\\frac{\\partial \\varphi(x,t)}{\\partial t}\\nabla\\cdot (D(x) \\nabla \\varphi(x,t))\nD(x) \\Delta \\varphi(x,t)+\\sum_{i=1}^3 \\frac{\\partial D(x)}{\\partial x_i} \\frac{\\partial \\varphi(x,t)}{\\partial x_i}\\   \n\n2. In anisotropic media, the diffusion coefficient depends on the direction. It is a symmetric tensor D = Dij. Fick's first law changes to\nJ=-D \\nabla \\varphi \\ ,\nit is the product of a tensor and a vector:\n \\;\\; J_i-\\sum_{j\n1}^3D_{ij} \\frac{\\partial \\varphi}{\\partial x_j} \\ .\nFor the diffusion equation this formula gives\n\\frac{\\partial \\varphi(x,t)}{\\partial t}\\nabla\\cdot (D \\nabla \\varphi(x,t))\n\\sum_{i1}^3\\sum_{j\n1}^3D_{ij} \\frac{\\partial^2 \\varphi(x,t)}{\\partial x_i \\partial x_j}\\ . \nThe symmetric matrix of diffusion coefficients Dij should be positive definite. It is needed to make the right hand side operator elliptic.\n\n3. For inhomogeneous anisotropic media these two forms of the diffusion equation should be combined in\n\\frac{\\partial \\varphi(x,t)}{\\partial t}\\nabla\\cdot (D(x) \\nabla \\varphi(x,t))\n\\sum_{i,j=1}^3\\left(D_{ij}(x) \\frac{\\partial^2 \\varphi(x,t)}{\\partial x_i \\partial x_j}+ \\frac{\\partial D_{ij}(x)}{\\partial x_i }  \\frac{\\partial \\varphi(x,t)}{\\partial x_j}\\right)\\ . \n\n4. The approach based on Einstein's mobility and Teorell formula gives the following generalization of Fick's equation for the multicomponent diffusion of the perfect components:\n\\frac{\\partial \\varphi_i}{\\partial t}  =\\sum_j \\nabla\\cdot\\left(D_{ij} \\frac{\\varphi_i}{\\varphi_j} \\nabla \\, \\varphi_j\\right) \\, .\nwhere φi are concentrations of the components and Dij is the matrix of coefficients. Here, indices i, j are related to the various components and not to the space coordinates.\n\nThe Chapman–Enskog formulae for diffusion in gases include exactly the same terms. These physical models of diffusion are different from the test models  which are valid for very small deviations from the uniform equilibrium. Earlier, such terms were introduced in the Maxwell–Stefan diffusion equation.\n\nFor anisotropic multicomponent diffusion coefficients one needs a rank-four tensor, for example Dij,αβ, where i, j refer to the components and α, β = 1, 2, 3 correspond to the space coordinates.\n\nApplications \n\nEquations based on Fick's law have been commonly used to model transport processes in foods, neurons, biopolymers, pharmaceuticals, porous soils, population dynamics, nuclear materials, plasma physics, and semiconductor doping processes. Theory of all voltammetric methods is based on solutions of Fick's equation. Much experimental research in polymer science and food science has shown that a more general approach is required to describe transport of components in materials undergoing glass transition.  In the vicinity of glass transition the flow behavior becomes \"non-Fickian\". It can be shown that the Fick's law can be obtained from the Maxwell–Stefan equations\nof multi-component mass transfer. The Fick's law is limiting case of the Maxwell–Stefan equations, when the mixture is extremely dilute and every chemical species is interacting only with the bulk mixture and not with other species. To account for the presence of multiple species in a non-dilute mixture, several variations of the Maxwell–Stefan equations are used. See also non-diagonal coupled transport processes (Onsager relationship). \n\nBiological perspective \n\nThe first law gives rise to the following formula:\n\n\\text{Flux} = {-P (c_2 - c_1)}\\,\\!\n\nin which,\n* P is the permeability, an experimentally determined membrane \"conductance\" for a given gas at a given temperature.\n* c2 − c1 is the difference in concentration of the gas across the membrane for the direction of flow (from c1 to c2).\n\nFick's first law is also important in radiation transfer equations.  However, in this context it becomes inaccurate when the diffusion constant is low and the radiation becomes limited by the speed of light rather than by the resistance of the material the radiation is flowing through.  In this situation, one can use a flux limiter.\n\nThe exchange rate of a gas across a fluid membrane can be determined by using this law together with Graham's law.\n\nFick's flow in liquids \n\nWhen two miscible liquids are brought into contact, and diffusion takes place, the macroscopic (or average) concentration evolves following Fick's law. On a mesoscopic scale, that is, between the macroscopic scale described by Fick's law and molecular scale, where molecular random walks take place, fluctuations cannot be neglected. Such situations can be successfully modeled with Landau-Lifshitz fluctuating hydrodynamics. In this theoretical framework, diffusion is due to fluctuations whose dimensions range from the molecular scale to the macroscopic scale.\n\nIn particular, fluctuating hydrodynamic equations include a Fick's flow term, with a given diffusion coefficient, along with hydrodynamics equations and stochastic terms describing fluctuations. When calculating the fluctuations with a perturbative approach, the zero order approximation is Fick's law. The first order gives the fluctuations, and it comes out that fluctuations contribute to diffusion. This represents somehow a tautology, since the phenomena described by a lower order approximation is the result of a higher approximation: this problem is solved only by renormalizing the fluctuating hydrodynamics equations.\n\nSemiconductor fabrication applications \n\nIntegrated circuit fabrication technologies, model processes like CVD, thermal oxidation, wet oxidation, doping, etc. use diffusion equations obtained from Fick's law.\n\nIn certain cases, the solutions are obtained for boundary conditions such as constant source concentration diffusion, limited source concentration, or moving boundary diffusion (where junction depth keeps moving into the substrate).\n\nHistory \n\nIn 1855, physiologist Adolf Fick first reported his now-well-known laws governing the transport of mass through diffusive means.  Fick's work was inspired by the earlier experiments of Thomas Graham, which fell short of proposing the fundamental laws for which Fick would become famous.  The Fick's law is analogous to the  relationships discovered at the same epoch by other eminent scientists: Darcy's law (hydraulic flow), Ohm's law (charge transport), and Fourier's Law (heat transport).\n\nFick's experiments (modeled on Graham's) dealt with measuring the concentrations and fluxes of salt, diffusing between two reservoirs through tubes of water. It is notable that Fick's work primarily concerned diffusion in fluids, because at the time, diffusion in solids was not considered generally possible.  Today, Fick's Laws form the core of our understanding of diffusion in solids, liquids, and gases (in the absence of bulk fluid motion in the latter two cases).  When a diffusion process does not follow Fick's laws (which happens in cases of diffusion through porous media and diffusion of swelling penetrants, among others), it is referred to as non-Fickian.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Fick's laws of diffusion" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11671" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Fick's laws of diffusion describe diffusion and were derived by Adolf Fick in 1855. They can be used to solve for the diffusion coefficient, D. Fick's first law can be used to derive his second law which in turn is identical to the diffusion equation.\n\nFick's first law \n\nFick's first law relates the diffusive flux to the concentration under the assumption of steady state. It postulates that the flux goes from regions of high concentration to regions of low concentration, with a magnitude that is proportional to the concentration gradient (spatial derivative), or in simplistic terms the concept that a solute will move from a region of high concentration to a region of low concentration across a concentration gradient. In one (spatial) dimension, the law is:\n\nJ = -D \\frac{d \\varphi}{d x} \nwhere\n* J is the \"diffusion flux,\" of which the dimension is amount of substance per unit area per unit time, so it is expressed in such units as mol m−2 s−1. J measures the amount of substance that will flow through a unit area during a unit time interval.\n* D is the diffusion coefficient or diffusivity. Its dimension is area per unit time, so typical units for expressing it would be m2/s.\n* \\varphi (for ideal mixtures) is the concentration, of which the dimension is amount of substance per unit volume. It might be expressed in units of mol/m3.\n* x is position, the dimension of which is length. It might thus be expressed in the unit m.\n\nD is proportional to the squared velocity of the diffusing particles, which depends on the temperature, viscosity of the fluid and the size of the particles according to the Stokes-Einstein relation. In dilute aqueous solutions the diffusion coefficients of most ions are similar and have values that at room temperature are in the range of 0.6 × 10−9 to 2 × 10−9 m2/s. For biological molecules the diffusion coefficients normally range from 10−11 to 10−10 m2/s.\n\nIn two or more dimensions we must use ∇, the del or gradient operator, which generalises the first derivative, obtaining\n\n \\mathbf{J}=- D\\nabla \\varphi \n\nwhere J denotes the diffusion flux vector.\n\nThe driving force for the one-dimensional diffusion is the quantity −, which for ideal mixtures is the concentration gradient. In chemical systems other than ideal solutions or mixtures, the driving force for diffusion of each species is the gradient of chemical potential of this species. Then Fick's first law (one-dimensional case) can be written as:\n\nJ_i = - \\frac{D c_i}{RT} \\frac{\\partial \\mu_i}{\\partial x}\n\nwhere the index i denotes the ith species, c is the concentration (mol/m3), R is the universal gas constant [J/(K.mol)], T is the absolute temperature (K), and μ is the chemical potential (J/mol).\n\nIf the primary variable is mass fraction (yi, given, for example, in kg/kg), then the equation changes to:\n\nJ_i=- \\rho D\\nabla y_i \n\nwhere ρ is the fluid density (for example, in kg/m3). Note that the density is outside the gradient operator.\n\nFick's second law \n\nFick's second law predicts how diffusion causes the concentration to change with time. It is a partial differential equation which in one dimension reads:\n\n\\frac{\\partial \\varphi}{\\partial t} = D\\,\\frac{\\partial^2 \\varphi}{\\partial x^2}\\,\\!\n\nwhere\n* φ is the concentration in dimensions of [(amount of substance) length−3], example mol/m3; φ = φ(x,t) is a function that depends on location x and time t\n* t is time [s]\n* D is the diffusion coefficient in dimensions of [length2 time−1], example m2/s\n* x is the position [length], example m\n\nIn two or more dimensions we must use the Laplacian Δ = ∇2, which generalises the second derivative, obtaining the equation\n\n\\frac{\\partial \\varphi}{\\partial t} = D\\,\\Delta \\varphi\n\nDerivation of Fick's laws\n\nFick's first law\n\nIn one dimension, the following derivation is based on a similar argument made in Berg 1977 (see references).\n\nConsider a collection of particles performing a random walk in one dimension with length scale Δx and time scale Δt. Let N(x,t) be the number of particles at position x at time t.\n\nAt a given time step, half of the particles would move left and half would move right. Since half of the particles at point x move right and half of the particles at point x + Δx move left, the net movement to the right is:\n\n-\\tfrac{1}{2}\\left[N(x + \\Delta x, t) - N(x, t)\\right]\n\nThe flux, J, is this net movement of particles across some area element of area a, normal to the random walk during a time interval Δt. Hence we may write:\n\nJ = - \\frac{1}{2} \\left[\\frac{ N(x + \\Delta x, t)}{a \\Delta t} - \\frac{ N(x, t)}{a \\Delta t}\\right]\n\nMultiplying the top and bottom of the righthand side by (Δx)2 and rewriting, one obtains:\n\n J = -\\frac{\\left(\\Delta x\\right)^2}{2 \\Delta t}\\left[\\frac{N(x + \\Delta x, t)}{a (\\Delta x)^2} - \\frac{N(x, t)}{a (\\Delta x)^2}\\right]\n\nConcentration is defined as particles per unit volume, and hence\n\\varphi (x, t) = \\frac{N(x, t)}{a \\Delta x}.\n\nIn addition,  is the definition of the diffusion constant in one dimension, D. Thus our expression simplifies to:\n\n J = -D \\left[\\frac{\\varphi (x + \\Delta x, t)}{\\Delta x} - \\frac{\\varphi (x , t)}{\\Delta x}\\right]\n\nIn the limit where Δx is infinitesimal, the righthand side becomes a space derivative:\n\n J = - D \\frac{\\partial \\varphi}{\\partial x}  \n\nFick's second law\n\nFick's second law can be derived from Fick's first law and the mass conservation in absence of any chemical reactions:\n\n\\frac{\\partial \\varphi}{\\partial t} +\\,\\frac{\\partial}{\\partial x}\\,J 0\\Rightarrow\\frac{\\partial \\varphi}{\\partial t} -\\frac{\\partial}{\\partial x}\\left(\\,D\\,\\frac{\\partial}{\\partial x}\\varphi\\,\\right)\\,\n0\\!\n\nAssuming the diffusion coefficient D to be a constant, one can exchange the orders of the differentiation and multiply by the constant:\n\n\\frac{\\partial}{\\partial x}\\left(\\,D\\,\\frac{\\partial}{\\partial x} \\varphi\\,\\right) D\\,\\frac{\\partial}{\\partial x} \\frac{\\partial}{\\partial x} \\,\\varphi \n D\\,\\frac{\\partial^2\\varphi}{\\partial x^2}\nand, thus, receive the form of the Fick's equations as was stated above.\n\nFor the case of diffusion in two or more dimensions Fick's second law becomes\n\n\\frac{\\partial \\varphi}{\\partial t} = D\\,\\nabla^2\\,\\varphi\\,\\!,\n\nwhich is analogous to the heat equation.\n\nIf the diffusion coefficient is not a constant, but depends upon the coordinate or concentration, Fick's second law yields\n\n\\frac{\\partial \\varphi}{\\partial t} =  \\nabla \\cdot (\\,D\\,\\nabla\\,\\varphi\\,)\\,\\!.\n\nAn important example is the case where φ is at a steady state, i.e. the concentration does not change by time, so that the left part of the above equation is identically zero. In one dimension with constant D, the solution for the concentration will be a linear change of concentrations along x. In two or more dimensions we obtain\n\n \\nabla^2\\,\\varphi =0\\!\n\nwhich is Laplace's equation, the solutions to which are referred to by mathematicians as harmonic functions.\n\nDerivation\n\nFick's second law is a special case of the convection–diffusion equation in which there is no advective flux and no net volumetric source. It can be derived from the continuity equation:\n\n \\frac{\\partial \\varphi}{\\partial t} + \\nabla\\cdot\\vec{j} = R, \nwhere \\vec{j} is the total flux and R is a net volumetric source for \\varphi. The only source of flux in this situation is assumed to be diffusive flux:\n\\vec{j}_{\\text{diffusion}} = -D \\, \\nabla \\varphi\n\nPlugging the definition of diffusive flux to the continuity equation and assuming there is no source (R = 0), we arrive at Fick's second law:\n\n\\frac{\\partial \\varphi}{\\partial t} = D\\,\\frac{\\partial^2 \\varphi}{\\partial x^2}\\,\\!\n\nIf flux were the result of both diffusive flux and advective flux, the convection–diffusion equation is the result.\n\nExample solution in one dimension: diffusion length\n\nA simple case of diffusion with time t in one dimension (taken as the x-axis) from a boundary located at position x = 0, where the concentration is maintained at a value n0 is\n\nn \\left(x,t \\right)=n_0 \\mathrm{erfc} \\left( \\frac{x}{2\\sqrt{Dt}}\\right).\n\nwhere erfc is the complementary error function. This is the case when corrosive gases diffuse through the oxidative layer towards the metal surface (if we assume that concentration of gases in the environment is constant and the diffusion space (i. e., corrosion product layer) is semi-infinite – starting at 0 at the surface and spreading infinitely deep in the material). If, in its turn, the diffusion space is infinite (lasting both through the layer with n(x,0)  0, x > 0 and that with n(x,0) \n n0, x ≤ 0), then the solution is amended only with coefficient  in front of n0 (this might seem obvious, as the diffusion now occurs in both directions). This case is valid when some solution with concentration n0 is put in contact with a layer of pure solvent. (Bokstein, 2005) The length 2 is called the diffusion length and provides a measure of how far the concentration has propagated in the x-direction by diffusion in time t (Bird, 1976).\n\nAs a quick approximation of the error function, the first 2 terms of the Taylor series can be used:\nn \\left(x,t \\right)=n_0 \\left[ 1 - 2 \\left(\\frac{x}{2\\sqrt{Dt\\pi}}\\right) \\right] \n\nIf D is time-dependent, the diffusion length becomes\n 2\\sqrt{\\int_0^{t}D(t')dt'} .\nThis idea is useful for estimating a diffusion length over a heating and cooling cycle, where D varies with temperature.\n\nGeneralizations\n\n1. In non-homogeneous media, the diffusion coefficient varies in space, D = D(x). This dependence does not affect Fick's first law but the second law changes:\n\\frac{\\partial \\varphi(x,t)}{\\partial t}\\nabla\\cdot (D(x) \\nabla \\varphi(x,t))\nD(x) \\Delta \\varphi(x,t)+\\sum_{i=1}^3 \\frac{\\partial D(x)}{\\partial x_i} \\frac{\\partial \\varphi(x,t)}{\\partial x_i}\\   \n\n2. In anisotropic media, the diffusion coefficient depends on the direction. It is a symmetric tensor D = Dij. Fick's first law changes to\nJ=-D \\nabla \\varphi \\ ,\nit is the product of a tensor and a vector:\n \\;\\; J_i-\\sum_{j\n1}^3D_{ij} \\frac{\\partial \\varphi}{\\partial x_j} \\ .\nFor the diffusion equation this formula gives\n\\frac{\\partial \\varphi(x,t)}{\\partial t}\\nabla\\cdot (D \\nabla \\varphi(x,t))\n\\sum_{i1}^3\\sum_{j\n1}^3D_{ij} \\frac{\\partial^2 \\varphi(x,t)}{\\partial x_i \\partial x_j}\\ . \nThe symmetric matrix of diffusion coefficients Dij should be positive definite. It is needed to make the right hand side operator elliptic.\n\n3. For inhomogeneous anisotropic media these two forms of the diffusion equation should be combined in\n\\frac{\\partial \\varphi(x,t)}{\\partial t}\\nabla\\cdot (D(x) \\nabla \\varphi(x,t))\n\\sum_{i,j=1}^3\\left(D_{ij}(x) \\frac{\\partial^2 \\varphi(x,t)}{\\partial x_i \\partial x_j}+ \\frac{\\partial D_{ij}(x)}{\\partial x_i }  \\frac{\\partial \\varphi(x,t)}{\\partial x_j}\\right)\\ . \n\n4. The approach based on Einstein's mobility and Teorell formula gives the following generalization of Fick's equation for the multicomponent diffusion of the perfect components:\n\\frac{\\partial \\varphi_i}{\\partial t}  =\\sum_j \\nabla\\cdot\\left(D_{ij} \\frac{\\varphi_i}{\\varphi_j} \\nabla \\, \\varphi_j\\right) \\, .\nwhere φi are concentrations of the components and Dij is the matrix of coefficients. Here, indices i, j are related to the various components and not to the space coordinates.\n\nThe Chapman–Enskog formulae for diffusion in gases include exactly the same terms. These physical models of diffusion are different from the test models  which are valid for very small deviations from the uniform equilibrium. Earlier, such terms were introduced in the Maxwell–Stefan diffusion equation.\n\nFor anisotropic multicomponent diffusion coefficients one needs a rank-four tensor, for example Dij,αβ, where i, j refer to the components and α, β = 1, 2, 3 correspond to the space coordinates.\n\nApplications \n\nEquations based on Fick's law have been commonly used to model transport processes in foods, neurons, biopolymers, pharmaceuticals, porous soils, population dynamics, nuclear materials, plasma physics, and semiconductor doping processes. Theory of all voltammetric methods is based on solutions of Fick's equation. Much experimental research in polymer science and food science has shown that a more general approach is required to describe transport of components in materials undergoing glass transition.  In the vicinity of glass transition the flow behavior becomes \"non-Fickian\". It can be shown that the Fick's law can be obtained from the Maxwell–Stefan equations\nof multi-component mass transfer. The Fick's law is limiting case of the Maxwell–Stefan equations, when the mixture is extremely dilute and every chemical species is interacting only with the bulk mixture and not with other species. To account for the presence of multiple species in a non-dilute mixture, several variations of the Maxwell–Stefan equations are used. See also non-diagonal coupled transport processes (Onsager relationship). \n\nBiological perspective \n\nThe first law gives rise to the following formula:\n\n\\text{Flux} = {-P (c_2 - c_1)}\\,\\!\n\nin which,\n* P is the permeability, an experimentally determined membrane \"conductance\" for a given gas at a given temperature.\n* c2 − c1 is the difference in concentration of the gas across the membrane for the direction of flow (from c1 to c2).\n\nFick's first law is also important in radiation transfer equations.  However, in this context it becomes inaccurate when the diffusion constant is low and the radiation becomes limited by the speed of light rather than by the resistance of the material the radiation is flowing through.  In this situation, one can use a flux limiter.\n\nThe exchange rate of a gas across a fluid membrane can be determined by using this law together with Graham's law.\n\nFick's flow in liquids \n\nWhen two miscible liquids are brought into contact, and diffusion takes place, the macroscopic (or average) concentration evolves following Fick's law. On a mesoscopic scale, that is, between the macroscopic scale described by Fick's law and molecular scale, where molecular random walks take place, fluctuations cannot be neglected. Such situations can be successfully modeled with Landau-Lifshitz fluctuating hydrodynamics. In this theoretical framework, diffusion is due to fluctuations whose dimensions range from the molecular scale to the macroscopic scale.\n\nIn particular, fluctuating hydrodynamic equations include a Fick's flow term, with a given diffusion coefficient, along with hydrodynamics equations and stochastic terms describing fluctuations. When calculating the fluctuations with a perturbative approach, the zero order approximation is Fick's law. The first order gives the fluctuations, and it comes out that fluctuations contribute to diffusion. This represents somehow a tautology, since the phenomena described by a lower order approximation is the result of a higher approximation: this problem is solved only by renormalizing the fluctuating hydrodynamics equations.\n\nSemiconductor fabrication applications \n\nIntegrated circuit fabrication technologies, model processes like CVD, thermal oxidation, wet oxidation, doping, etc. use diffusion equations obtained from Fick's law.\n\nIn certain cases, the solutions are obtained for boundary conditions such as constant source concentration diffusion, limited source concentration, or moving boundary diffusion (where junction depth keeps moving into the substrate).\n\nHistory \n\nIn 1855, physiologist Adolf Fick first reported his now-well-known laws governing the transport of mass through diffusive means.  Fick's work was inspired by the earlier experiments of Thomas Graham, which fell short of proposing the fundamental laws for which Fick would become famous.  The Fick's law is analogous to the  relationships discovered at the same epoch by other eminent scientists: Darcy's law (hydraulic flow), Ohm's law (charge transport), and Fourier's Law (heat transport).\n\nFick's experiments (modeled on Graham's) dealt with measuring the concentrations and fluxes of salt, diffusing between two reservoirs through tubes of water. It is notable that Fick's work primarily concerned diffusion in fluids, because at the time, diffusion in solids was not considered generally possible.  Today, Fick's Laws form the core of our understanding of diffusion in solids, liquids, and gases (in the absence of bulk fluid motion in the latter two cases).  When a diffusion process does not follow Fick's laws (which happens in cases of diffusion through porous media and diffusion of swelling penetrants, among others), it is referred to as non-Fickian. Fick's laws of diffusion. http://en.wikipedia.org/?curid=11671."
  }
}
