{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17095",
  "eid" : "2a8a1970-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778580615,
  "textBody" : "Kary Banks Mullis (born December 28, 1944) is a Nobel Prize-winning American biochemist. In recognition of his invention of the polymerase chain reaction (PCR) technique, he shared the 1993 Nobel Prize in Chemistry with Michael Smith and earned the Japan Prize in the same year. The process was first described by Kjell Kleppe and 1968 Nobel laureate H. Gobind Khorana, and allows the amplification of specific DNA sequences. The invention made by Mullis allowed PCR to become a central technique in biochemistry and molecular biology, described by The New York Times as \"highly original and significant, virtually dividing biology into the two epochs of before P.C.R. and after P.C.R.\"\n\nHe has defended AIDS denialism, and climate change denial,  and has attacked sociology as a \"worthless science\" for not taking astrology seriously.[http://www.lrb.co.uk/v21/n13/steven-shapin/nobel-savage London Review of Books, \"Nobel Savage\", by Steven Shapin] All of these stances were criticized by George Johnson of The New York Times.\n\nEarly life\n\nMullis was born in Lenoir, North Carolina, near the Blue Ridge Mountains, on December 28, 1944. His family had a background in farming in this rural area.  As a child, Mullis recalls, he was interested in observing organisms in the countryside. He grew up in Columbia, South Carolina, where he attended Dreher High School. He has described his early interest in chemistry, and claims to have learned how to chemically synthesize and build solid state fuel propulsion rockets as a high school student during the 1950s.[https://www.ted.com/talks/kary_mullis_on_what_scientists_do?language=en Kary Mullis: Play! Experiment! Discover! | TED Talk]. TED.com. Retrieved on May 9, 2016.\n\nMullis earned a Bachelor of Science (BS) degree in chemistry from the Georgia Institute of Technology in Atlanta in 1966, during which time he got married and started a business. He then received a PhD in biochemistry from the University of California, Berkeley in 1973; his research done in J. B. Neilands' laboratory focused on synthesis and structure of bacterial iron transporter molecules. Following his graduation, Mullis became a postdoctoral fellow in pediatric cardiology at the University of Kansas Medical School, going on to complete two years of postdoctoral work in pharmaceutical chemistry at the University of California, San Francisco.\n\nCareer\n\nAfter receiving his PhD, Mullis left science to write fiction, but quit and became a biochemist at a medical school in Kansas City. He then managed a bakery for two years. Mullis returned to science at the encouragement of friend Thomas White, who later got Mullis a job with the biotechnology company Cetus Corporation of Emeryville, California. Mullis worked as a DNA chemist at Cetus for seven years; it was there, in 1983, that Mullis invented his prize-winning improvements to the polymerase chain reaction. After leaving Cetus in 1986, Mullis served as director of molecular biology for Xytronyx, Inc. in San Diego for two years. Mullis has consulted on nucleic acid chemistry for multiple corporations.\n\nIn 1992, Mullis founded a business with the intent to sell pieces of jewelry containing the amplified DNA of deceased famous people like Elvis Presley and Marilyn Monroe. Mullis is also a member of the USA Science and Engineering Festival's Advisory Board. As of 2014, he is a researcher at the Children's Hospital Oakland Research Institute in Oakland, California.[http://www.karymullis.com/biography.shtml Dr. Kary Banks Mullis]. Karymullis.com. Retrieved on May 9, 2016.\n\nPCR and other inventions\n\nIn 1983, Mullis was working for Cetus Corp. as a chemist. That spring, according to Mullis, he was driving his vehicle late one night with his girlfriend, who was also a chemist at Cetus, when he had the idea to use a pair of primers to bracket the desired DNA sequence and to copy it using DNA polymerase; a technique which would allow rapid amplification of a small strand of DNA and become a standard procedure in molecular biology labs. Cetus took Mullis off his usual projects to concentrate on PCR full-time. Mullis succeeded in demonstrating PCR December 16, 1983. In his Nobel Prize lecture, he remarked that the success didn't make up for his girlfriend breaking up with him shortly before: \"I was sagging as I walked out to my little silver Honda Civic. Neither [assistant] Fred, empty Beck's bottles, nor the sweet smell of the dawn of the age of PCR could replace Jenny. I was lonesome.\" He received a $10,000 bonus from Cetus for the invention.\n\nOther Cetus scientists, including Randall Saiki and Henry Erlich, were placed on PCR projects to work on evaluating whether PCR could amplify a specific human gene (betaglobin) from genomic DNA. Saiki generated the needed data and Erlich authored the first paper to include utilization of the technique, while Mullis was still working on a paper that would describe PCR itself.\n\nA complication at that point was that the DNA polymerase used was destroyed by the high heat used at the start of each replication cycle and had to be replaced. In 1986, Saiki started to use Thermophilus aquaticus (Taq) DNA polymerase to amplify segments of DNA. The Taq polymerase was heat resistant and would only need to be added once, thus making the technique dramatically more affordable and subject to automation. This has created revolutions in biochemistry, molecular biology, genetics, medicine and forensics.\n\nMullis has also invented a UV-sensitive plastic that changes color in response to light, and most recently has been working on an approach for mobilizing the immune system to neutralize invading pathogens and toxins, leading to the formation of his current venture, Altermune LLC, in 2011.[https://www.reuters.com/article/2011/09/22/idUS134319+22-Sep-2011+BW20110922 Loxbridge and Dr Kary Mullis Announce the Formation of Altermune Technologies with $7m Seed Investment.] [https://www.webcitation.org/6EozxJ87N?url=https://www.reuters.com/article/2011/09/22/idUS134319%2B22-Sep-2011%2BBW20110922 Archived] Mullis described this idea this way:\n\nIt is a method using specific synthetic chemical linkers to divert an immune response from its nominal target to something completely different which you would right now like to be temporarily immune to. Let's say you just got exposed to a new strain of the flu. You're already immune to alpha-1,3-galactosyl-galactose bonds. All humans are. Why not divert a fraction of those antibodies to the influenza strain you just picked up? A chemical linker synthesized with an alpha-1,3-gal-gal bond on one end and a DNA aptamer devised to bind specifically to the strain of influenza you have on the other end will link anti-alpha-Gal antibodies to the influenza virus and presto!--you have fooled your immune system into attacking the new virus.\n\nThe first proof-of-principle of this technology, re-targeting pre-existing antibodies to the surface of a pathogenic strep bacteria using an alpha-gal modified aptamer (\"alphamer\"), was recently published in collaboration with scientists at UC San Diego, and is Mullis' first authorship in the scientific literature in two decades.\n\nAccreditation of the PCR technique\n\nA concept similar to that of PCR had been described before Mullis' work. Nobel Prize laureate H. Gobind Khorana and Kjell Kleppe, a Norwegian scientist, authored a paper seventeen years earlier describing a process they termed \"repair replication\" in the Journal of Molecular Biology. Using repair replication, Kleppe duplicated and then quadrupled a small synthetic molecule with the help of two primers and DNA-polymerase. The method developed by Mullis, used repeated thermal cycling, which allowed the rapid and exponential amplification of large quantities of any desired DNA sequence from an extremely complex template. Later a heat stable DNA polymerase was incorporated into the process.\n\nThe suggestion that Mullis was solely responsible for the idea of using Taq polymerase in the PCR process has been contested by his co-workers at the time, who were embittered by his abrupt departure from Cetus. However, other scientists have written that \"the full potential [of PCR] was not realized\" until Mullis' work in 1983, and that Mullis' colleagues failed to see the potential of the technique when he presented it to them. As a result, some controversy surrounds the balance of credit that should be given to Mullis versus the team at Cetus. In practice, credit has accrued to both the inventor and the company (although not its individual workers) in the form of a Nobel Prize and a $10,000 Cetus bonus for Mullis and $300 million for Cetus when the company sold the patent to Roche Molecular Systems. After DuPont lost out to Roche on that sale, the company unsuccessfully disputed Mullis's patent on the alleged grounds that PCR had been previously described in 1971. Mullis and Erlich took Cetus' side in the case, and Khorana refused to testify for DuPont; the jury upheld Mullis's patent in 1991.\n\nThe anthropologist Paul Rabinow wrote a book on the history of the PCR method in 1996 (entitled Making PCR) in which he discussed whether or not Mullis \"invented\" PCR or \"merely\" came up with the concept of it. Rabinow, a Foucault scholar interested in issues of the production of knowledge, used the topic to argue against the idea that scientific discovery is the product of individual work, writing, \"Committees and science journalists like the idea of associating a unique idea with a unique person, the lone genius. PCR is thought by some to be an example of teamwork, but by others as the genius of one who was smart enough to put things together which were present to all, but overlooked. For Mullis, the light bulb went off, but for others it did not. This is consistent with the idea, that the prepared (educated) mind who is careful to observe and not overlook, is what separates the genius scientist from his many also smart scientists. The proof is in the fact that the person who has the light bulb go off never forgets the Ah experience, while the others never had this photochemical reaction go off in their brains.\"\n\nPersonal views\n\nMullis has said that the never-ending quest for more grants and staying with established dogmas has hurt science. He believes that \"science is being practiced by people who are dependent on being paid for what they are going to find out,\" not for what they actually produce. Mullis has been described as an \"impatient and impulsive researcher\" who finds routine lab work boring and instead thinks about his research while driving and surfing. He came up with the polymerase chain reaction while driving along a highway.\n\nIn his 1998 autobiography, Mullis expressed disagreement with the scientific evidence supporting climate change and ozone depletion, the evidence that HIV causes AIDS, and asserted his belief in astrology. Mullis claims climate change and the HIV/AIDS connection are due to a conspiracy of environmentalists, government agencies and scientists attempting to preserve their careers and earn money, rather than scientific evidence. Mullis has been criticized for his association with AIDS denialist Peter Duesberg, claiming that AIDS is an arbitrary diagnosis only used when HIV antibodies are found in a patient's blood. The medical and scientific consensus is that Duesberg's hypothesis is pseudoscience, HIV having been conclusively proven to be the cause of AIDS and that global warming is occurring because of human activities. Seth Kalichman, AIDS researcher and author of Denying AIDS, \"[admits] that it seems odd to include a Nobel Laureate among the who's who of AIDS pseudoscientists\". Mullis also wrote the foreword to the book What If Everything You Thought You Knew About AIDS Was Wrong? by Christine Maggiore, an HIV-positive AIDS denialist who, along with her daughter, died of an AIDS-related illness. A New York Times article listed Mullis as one of several scientists who, after success in their area of research, go on to make unfounded, sometimes bizarre statements in other areas. An article in the Skeptical Inquirer described Mullis as an \"AIDS denialist with scientific credentials [who] has never done any scientific research on HIV or AIDS.\"\n\nUse of LSD\n\nMullis details his experiences synthesizing and testing various psychedelic amphetamines and a difficult trip on DET in his autobiography. In a Q&A interview published in the September 1994 issue of California Monthly, Mullis said, \"Back in the 1960s and early '70s I took plenty of LSD. A lot of people were doing that in Berkeley back then. And I found it to be a mind-opening experience. It was certainly much more important than any courses I ever took.\" During a symposium held for centenarian Albert Hofmann, \"Hofmann revealed that he was told by Nobel-prize-winning chemist Kary Mullis that LSD had helped him develop the polymerase chain reaction that helps amplify specific DNA sequences.\"\n\nPersonal life\n\nMullis enjoys surfing. He has been married four times. He has three children by two ex-wives. Mullis reported an encounter with a \"glowing green raccoon\" at his cabin in the woods of northern California around midnight one night in 1985; he denies having been on LSD or any other drug at the time.\n\nPublications and books\n\n* K.F. Mullis, F. Faloona, S. Scharf, R. Saiki, G. Horn and H. Erlich, 1986, Specific enzymatic amplification of DNA in vitro: The polymerase chain reaction. Cold Spring Harbor Symposium in Quantitative Biology, 51:263–273.\n* K. Mullis, 1990, The unusual origin of the polymerase chain reaction. Scientific American, April 56–65.\n* The Polymerase Chain Reaction, 1994, co-edited Francious Ferre and Richard A. Gibbs (Basel: Birkhauser)  \n* Dancing Naked in the Mind Field. 1998, Vintage Books.\n\nMullis's 1998 autobiography Dancing Naked in the Mind Field, gives his account of the commercial development of PCR, as well as providing insights into his opinions and experiences. In the book, Mullis chronicles his romantic relationships, use of LSD, synthesis and self-testing of novel psychoactive substances, belief in astrology and an encounter with an extraterrestrial in the form of a fluorescent raccoon.\n\nAwards and honors\n\n* 1990 – William Allan Memorial Award of the American Society of Human Genetics | Preis Biochemische Analytik of the German Society of Clinical Chemistry and Boehringer Mannheim\n* 1991 – National Biotechnology Award | Gairdner Award | R&D Scientist of the Year\n* 1992 – California Scientist of the Year Award\n* 1992 - Robert Koch Prize\n* 1993 – Nobel Prize in Chemistry | Japan Prize | Thomas A. Edison Award\n* 1994 – Honorary degree of Doctor of Science from the University of South Carolina\n* 1998 – Inducted into the National Inventors Hall of Fame | Ronald H. Brown American Innovator Award\n* 2004 – Honorary degree in Pharmaceutical Biotechnology from the University of Bologna, Italy\n\nMullis also received the John Scott Award in 1991, given by the City Trusts of Philadelphia to others including Thomas Edison and the Wright Brothers.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Kary Mullis" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17095" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Kary Banks Mullis (born December 28, 1944) is a Nobel Prize-winning American biochemist. In recognition of his invention of the polymerase chain reaction (PCR) technique, he shared the 1993 Nobel Prize in Chemistry with Michael Smith and earned the Japan Prize in the same year. The process was first described by Kjell Kleppe and 1968 Nobel laureate H. Gobind Khorana, and allows the amplification of specific DNA sequences. The invention made by Mullis allowed PCR to become a central technique in biochemistry and molecular biology, described by The New York Times as \"highly original and significant, virtually dividing biology into the two epochs of before P.C.R. and after P.C.R.\"\n\nHe has defended AIDS denialism, and climate change denial,  and has attacked sociology as a \"worthless science\" for not taking astrology seriously.[http://www.lrb.co.uk/v21/n13/steven-shapin/nobel-savage London Review of Books, \"Nobel Savage\", by Steven Shapin] All of these stances were criticized by George Johnson of The New York Times.\n\nEarly life\n\nMullis was born in Lenoir, North Carolina, near the Blue Ridge Mountains, on December 28, 1944. His family had a background in farming in this rural area.  As a child, Mullis recalls, he was interested in observing organisms in the countryside. He grew up in Columbia, South Carolina, where he attended Dreher High School. He has described his early interest in chemistry, and claims to have learned how to chemically synthesize and build solid state fuel propulsion rockets as a high school student during the 1950s.[https://www.ted.com/talks/kary_mullis_on_what_scientists_do?language=en Kary Mullis: Play! Experiment! Discover! | TED Talk]. TED.com. Retrieved on May 9, 2016.\n\nMullis earned a Bachelor of Science (BS) degree in chemistry from the Georgia Institute of Technology in Atlanta in 1966, during which time he got married and started a business. He then received a PhD in biochemistry from the University of California, Berkeley in 1973; his research done in J. B. Neilands' laboratory focused on synthesis and structure of bacterial iron transporter molecules. Following his graduation, Mullis became a postdoctoral fellow in pediatric cardiology at the University of Kansas Medical School, going on to complete two years of postdoctoral work in pharmaceutical chemistry at the University of California, San Francisco.\n\nCareer\n\nAfter receiving his PhD, Mullis left science to write fiction, but quit and became a biochemist at a medical school in Kansas City. He then managed a bakery for two years. Mullis returned to science at the encouragement of friend Thomas White, who later got Mullis a job with the biotechnology company Cetus Corporation of Emeryville, California. Mullis worked as a DNA chemist at Cetus for seven years; it was there, in 1983, that Mullis invented his prize-winning improvements to the polymerase chain reaction. After leaving Cetus in 1986, Mullis served as director of molecular biology for Xytronyx, Inc. in San Diego for two years. Mullis has consulted on nucleic acid chemistry for multiple corporations.\n\nIn 1992, Mullis founded a business with the intent to sell pieces of jewelry containing the amplified DNA of deceased famous people like Elvis Presley and Marilyn Monroe. Mullis is also a member of the USA Science and Engineering Festival's Advisory Board. As of 2014, he is a researcher at the Children's Hospital Oakland Research Institute in Oakland, California.[http://www.karymullis.com/biography.shtml Dr. Kary Banks Mullis]. Karymullis.com. Retrieved on May 9, 2016.\n\nPCR and other inventions\n\nIn 1983, Mullis was working for Cetus Corp. as a chemist. That spring, according to Mullis, he was driving his vehicle late one night with his girlfriend, who was also a chemist at Cetus, when he had the idea to use a pair of primers to bracket the desired DNA sequence and to copy it using DNA polymerase; a technique which would allow rapid amplification of a small strand of DNA and become a standard procedure in molecular biology labs. Cetus took Mullis off his usual projects to concentrate on PCR full-time. Mullis succeeded in demonstrating PCR December 16, 1983. In his Nobel Prize lecture, he remarked that the success didn't make up for his girlfriend breaking up with him shortly before: \"I was sagging as I walked out to my little silver Honda Civic. Neither [assistant] Fred, empty Beck's bottles, nor the sweet smell of the dawn of the age of PCR could replace Jenny. I was lonesome.\" He received a $10,000 bonus from Cetus for the invention.\n\nOther Cetus scientists, including Randall Saiki and Henry Erlich, were placed on PCR projects to work on evaluating whether PCR could amplify a specific human gene (betaglobin) from genomic DNA. Saiki generated the needed data and Erlich authored the first paper to include utilization of the technique, while Mullis was still working on a paper that would describe PCR itself.\n\nA complication at that point was that the DNA polymerase used was destroyed by the high heat used at the start of each replication cycle and had to be replaced. In 1986, Saiki started to use Thermophilus aquaticus (Taq) DNA polymerase to amplify segments of DNA. The Taq polymerase was heat resistant and would only need to be added once, thus making the technique dramatically more affordable and subject to automation. This has created revolutions in biochemistry, molecular biology, genetics, medicine and forensics.\n\nMullis has also invented a UV-sensitive plastic that changes color in response to light, and most recently has been working on an approach for mobilizing the immune system to neutralize invading pathogens and toxins, leading to the formation of his current venture, Altermune LLC, in 2011.[https://www.reuters.com/article/2011/09/22/idUS134319+22-Sep-2011+BW20110922 Loxbridge and Dr Kary Mullis Announce the Formation of Altermune Technologies with $7m Seed Investment.] [https://www.webcitation.org/6EozxJ87N?url=https://www.reuters.com/article/2011/09/22/idUS134319%2B22-Sep-2011%2BBW20110922 Archived] Mullis described this idea this way:\n\nIt is a method using specific synthetic chemical linkers to divert an immune response from its nominal target to something completely different which you would right now like to be temporarily immune to. Let's say you just got exposed to a new strain of the flu. You're already immune to alpha-1,3-galactosyl-galactose bonds. All humans are. Why not divert a fraction of those antibodies to the influenza strain you just picked up? A chemical linker synthesized with an alpha-1,3-gal-gal bond on one end and a DNA aptamer devised to bind specifically to the strain of influenza you have on the other end will link anti-alpha-Gal antibodies to the influenza virus and presto!--you have fooled your immune system into attacking the new virus.\n\nThe first proof-of-principle of this technology, re-targeting pre-existing antibodies to the surface of a pathogenic strep bacteria using an alpha-gal modified aptamer (\"alphamer\"), was recently published in collaboration with scientists at UC San Diego, and is Mullis' first authorship in the scientific literature in two decades.\n\nAccreditation of the PCR technique\n\nA concept similar to that of PCR had been described before Mullis' work. Nobel Prize laureate H. Gobind Khorana and Kjell Kleppe, a Norwegian scientist, authored a paper seventeen years earlier describing a process they termed \"repair replication\" in the Journal of Molecular Biology. Using repair replication, Kleppe duplicated and then quadrupled a small synthetic molecule with the help of two primers and DNA-polymerase. The method developed by Mullis, used repeated thermal cycling, which allowed the rapid and exponential amplification of large quantities of any desired DNA sequence from an extremely complex template. Later a heat stable DNA polymerase was incorporated into the process.\n\nThe suggestion that Mullis was solely responsible for the idea of using Taq polymerase in the PCR process has been contested by his co-workers at the time, who were embittered by his abrupt departure from Cetus. However, other scientists have written that \"the full potential [of PCR] was not realized\" until Mullis' work in 1983, and that Mullis' colleagues failed to see the potential of the technique when he presented it to them. As a result, some controversy surrounds the balance of credit that should be given to Mullis versus the team at Cetus. In practice, credit has accrued to both the inventor and the company (although not its individual workers) in the form of a Nobel Prize and a $10,000 Cetus bonus for Mullis and $300 million for Cetus when the company sold the patent to Roche Molecular Systems. After DuPont lost out to Roche on that sale, the company unsuccessfully disputed Mullis's patent on the alleged grounds that PCR had been previously described in 1971. Mullis and Erlich took Cetus' side in the case, and Khorana refused to testify for DuPont; the jury upheld Mullis's patent in 1991.\n\nThe anthropologist Paul Rabinow wrote a book on the history of the PCR method in 1996 (entitled Making PCR) in which he discussed whether or not Mullis \"invented\" PCR or \"merely\" came up with the concept of it. Rabinow, a Foucault scholar interested in issues of the production of knowledge, used the topic to argue against the idea that scientific discovery is the product of individual work, writing, \"Committees and science journalists like the idea of associating a unique idea with a unique person, the lone genius. PCR is thought by some to be an example of teamwork, but by others as the genius of one who was smart enough to put things together which were present to all, but overlooked. For Mullis, the light bulb went off, but for others it did not. This is consistent with the idea, that the prepared (educated) mind who is careful to observe and not overlook, is what separates the genius scientist from his many also smart scientists. The proof is in the fact that the person who has the light bulb go off never forgets the Ah experience, while the others never had this photochemical reaction go off in their brains.\"\n\nPersonal views\n\nMullis has said that the never-ending quest for more grants and staying with established dogmas has hurt science. He believes that \"science is being practiced by people who are dependent on being paid for what they are going to find out,\" not for what they actually produce. Mullis has been described as an \"impatient and impulsive researcher\" who finds routine lab work boring and instead thinks about his research while driving and surfing. He came up with the polymerase chain reaction while driving along a highway.\n\nIn his 1998 autobiography, Mullis expressed disagreement with the scientific evidence supporting climate change and ozone depletion, the evidence that HIV causes AIDS, and asserted his belief in astrology. Mullis claims climate change and the HIV/AIDS connection are due to a conspiracy of environmentalists, government agencies and scientists attempting to preserve their careers and earn money, rather than scientific evidence. Mullis has been criticized for his association with AIDS denialist Peter Duesberg, claiming that AIDS is an arbitrary diagnosis only used when HIV antibodies are found in a patient's blood. The medical and scientific consensus is that Duesberg's hypothesis is pseudoscience, HIV having been conclusively proven to be the cause of AIDS and that global warming is occurring because of human activities. Seth Kalichman, AIDS researcher and author of Denying AIDS, \"[admits] that it seems odd to include a Nobel Laureate among the who's who of AIDS pseudoscientists\". Mullis also wrote the foreword to the book What If Everything You Thought You Knew About AIDS Was Wrong? by Christine Maggiore, an HIV-positive AIDS denialist who, along with her daughter, died of an AIDS-related illness. A New York Times article listed Mullis as one of several scientists who, after success in their area of research, go on to make unfounded, sometimes bizarre statements in other areas. An article in the Skeptical Inquirer described Mullis as an \"AIDS denialist with scientific credentials [who] has never done any scientific research on HIV or AIDS.\"\n\nUse of LSD\n\nMullis details his experiences synthesizing and testing various psychedelic amphetamines and a difficult trip on DET in his autobiography. In a Q&A interview published in the September 1994 issue of California Monthly, Mullis said, \"Back in the 1960s and early '70s I took plenty of LSD. A lot of people were doing that in Berkeley back then. And I found it to be a mind-opening experience. It was certainly much more important than any courses I ever took.\" During a symposium held for centenarian Albert Hofmann, \"Hofmann revealed that he was told by Nobel-prize-winning chemist Kary Mullis that LSD had helped him develop the polymerase chain reaction that helps amplify specific DNA sequences.\"\n\nPersonal life\n\nMullis enjoys surfing. He has been married four times. He has three children by two ex-wives. Mullis reported an encounter with a \"glowing green raccoon\" at his cabin in the woods of northern California around midnight one night in 1985; he denies having been on LSD or any other drug at the time.\n\nPublications and books\n\n* K.F. Mullis, F. Faloona, S. Scharf, R. Saiki, G. Horn and H. Erlich, 1986, Specific enzymatic amplification of DNA in vitro: The polymerase chain reaction. Cold Spring Harbor Symposium in Quantitative Biology, 51:263–273.\n* K. Mullis, 1990, The unusual origin of the polymerase chain reaction. Scientific American, April 56–65.\n* The Polymerase Chain Reaction, 1994, co-edited Francious Ferre and Richard A. Gibbs (Basel: Birkhauser)  \n* Dancing Naked in the Mind Field. 1998, Vintage Books.\n\nMullis's 1998 autobiography Dancing Naked in the Mind Field, gives his account of the commercial development of PCR, as well as providing insights into his opinions and experiences. In the book, Mullis chronicles his romantic relationships, use of LSD, synthesis and self-testing of novel psychoactive substances, belief in astrology and an encounter with an extraterrestrial in the form of a fluorescent raccoon.\n\nAwards and honors\n\n* 1990 – William Allan Memorial Award of the American Society of Human Genetics | Preis Biochemische Analytik of the German Society of Clinical Chemistry and Boehringer Mannheim\n* 1991 – National Biotechnology Award | Gairdner Award | R&D Scientist of the Year\n* 1992 – California Scientist of the Year Award\n* 1992 - Robert Koch Prize\n* 1993 – Nobel Prize in Chemistry | Japan Prize | Thomas A. Edison Award\n* 1994 – Honorary degree of Doctor of Science from the University of South Carolina\n* 1998 – Inducted into the National Inventors Hall of Fame | Ronald H. Brown American Innovator Award\n* 2004 – Honorary degree in Pharmaceutical Biotechnology from the University of Bologna, Italy\n\nMullis also received the John Scott Award in 1991, given by the City Trusts of Philadelphia to others including Thomas Edison and the Wright Brothers. Kary Mullis. http://en.wikipedia.org/?curid=17095."
  }
}
