{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11600",
  "eid" : "fc9ac2d0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778503549,
  "textBody" : "Persian ( or), also known by its endonym Farsi ( '), is one of the Western Iranian languages within the Indo-Iranian branch of the Indo-European language family. It is primarily spoken in Iran, Afghanistan (officially known as Dari since 1958),Asta Olesen, \"Islam and Politics in Afghanistan, Volume 3\", Psychology Press, 1995. pg 205: \"There began a general promotion of the Pashto language at the expense of Fārsi – previously dominant at the educational and administrative level – and the term 'Dari' for the Afghan version of Persian came into common use, being officially adopted in 1958\" Uzbekistan (in Samarqand, Bukhara, and the Surxondaryo Region) and Tajikistan (officially known as Tajiki since the Soviet era),, pg 518: \"among them the realignment of Central Asian Persian, renamed Tajiki by the Soviet Union\" and some other regions which historically were Persianate societies and considered part of Greater Iran. It is written in the Persian alphabet, a modified variant of the Arabic script.\n\nThe Persian language is classified as a continuation of Middle Persian, the official religious and literary language of the Sasanian Empire, itself a continuation of Old Persian, the language of the Achaemenid Empire.Ulrich Ammon, Norbert Dittmar, Klaus J. Mattheier, Peter Trudgill, \"Sociolinguistics Hsk 3/3 Series Volume 3 of Sociolinguistics: An International Handbook of the Science of Language and Society\", Walter de Gruyter, 2006. 2nd edition. pg 1912. Excerpt: \"Middle Persian, also called Pahlavi is a direct continuation of old Persian, and was used as the written official language of the country.\" \"However, after the Moslem conquest and the collapse of the Sassanids, the Pahlavi language was gradually replaced by Dari, a variety of Middle Persian, with considerable loan elements from Arabic and Parthian.\"Skjærvø, Prods Oktor (2006). Encyclopedia Iranica, \"Iran, vi. Iranian languages and scripts, \"new Persian, is \"the descendant of Middle Persian\" and has since been \"official language of Iranian states for centuries\", whereas for other non-Persian Iranian languages \"close genetic relationships are difficult to establish\" between their different (Middle and Modern) stages. Modern Yaḡnōbi belongs to the same dialect group as Sogdian, but is not a direct descendant; Bactrian may be closely related to modern Yidḡa and Munji (Munjāni); and Wakhi (Wāḵi) belongs with Khotanese.\" Its grammar is similar to that of many contemporary European languages.Richard Davis, \"Persian\" in Josef W. Meri, Jere L. Bacharach, \"Medieval Islamic Civilization\", Taylor & Francis, 2006. pp. 602–603. \"The grammar of New Persian is similar to many contemporary European languages.\"Similarly, the core vocabulary of Persian continued to be derived from Pahlavi. Fārsi, the name of the language in Persian, is Arabic, being the Arabic modification of Pārsi. A Persian-speaking person may be referred to as Persophone.[https://www.iaaw.hu-berlin.de/en/centralasia/research/current-research-projects/modernity-and-modernism-in-persophone-literary-history \"Modernity and Modernism in Persophone Literary History\"], Humboldt-Universität zu Berlin\n\nThere are approximately 110 million Persian speakers worldwide, with the language holding official status in Iran, Afghanistan, and Tajikistan. For centuries, Persian has also been a prestigious cultural language in other regions of Western Asia, Central Asia, and South Asia by the various empires based in the regions.Encyclopædia Britannica: [http://www.britannica.com/EBchecked/topic/452843/Persian-literature/277134/The-proliferation-of-court-patronage?anchor\nref997402 Persian literature], retrieved September 2011.\n\nPersian has had a considerable (mainly lexical) influence on neighboring languages, particularly the Turkic languages in Central Asia, Caucasus, and Anatolia, neighboring Iranian languages, as well as Armenian, Georgian, and Indo-Aryan languages, especially Urdu (a register of Hindustani). It also exerted some influence on Arabic, particularly Bahrani Arabic,, p. XXX while borrowing much vocabulary from it after the Arab conquest of Iran.Lazard, Gilbert 1975, \"The Rise of the New Persian Language\" in Frye, R. N., The Cambridge History of Iran, Vol. 4, pp. 595–632, Cambridge: Cambridge University Press. \"The language known as New Persian, which usually is called at this period (early Islamic times) by the name of Dari or Farsi-Dari, can be classified linguistically as a continuation of Middle Persian, the official religious and literary language of Sassanian Iran, itself a continuation of Old Persian, the language of the Achaemenids. Unlike the other languages and dialects, ancient and modern, of the Iranian group such as Avestan, Parthian, Soghdian, Kurdish, Balochi, Pashto, etc., Old Persian, Middle and New Persian represent one and the same language at three states of its history. It had its origin in Fars (the true Persian country from the historical point of view) and is differentiated by dialectical features, still easily recognizable from the dialect prevailing in north-western and eastern Iran.\"Lazard, Gilbert, \"Pahlavi, Pârsi, dari: Les langues d'Iran d'apès Ibn al-Muqaffa\" in R.N. Frye, Iran and Islam. In Memory of the late Vladimir Minorsky, Edinburgh University Press, 1971.Ann K. S. Lambton, Persian grammar, Cambridge University Press 1953. \"The Arabic words incorporated into the Persian language have become Persianized\".[http://www.ezglot.com/most-similar-languages.php?l=fas Most similar languages to Persian], ezglot.com\n\nWith a long history of literature in the form of Middle Persian before Islam, Persian was the first language in the Muslim world to break through Arabic's monopoly on writing, and the writing of poetry in Persian was established as a court tradition in many eastern courts. Some of the famous works of Persian literature are the Shahnameh of Ferdowsi, the works of Rumi, the Rubaiyat of Omar Khayyam, the Panj Ganj of Nizami Ganjavi, the Divān of Hafez and the two miscellanea of prose and verse by Saadi Shirazi, the Gulistan and the Bustan. About 40% of everyday Persian literary vocabulary is of Arabic origin.\n\nClassification\n\nPersian is one of the Western Iranian languages within the Indo-European family. Other Western Iranian languages are the Kurdish languages, Gilaki, Mazanderani, Talysh, and Balochi. Persian is classified as a member of the Southwestern subgroup within Western Iranian along with Lari, Kumzari, and Luri.\n\nEtymology\n\nPersian language name in Persian\n\nIn Persian, the language is known by several names:\n\nWestern Persian, Farsi ( ' or  ), the Arabic form of Parsi ( '), has been the name used by all native speakers until the 20th century. In recent decades some authors writing in English have referred to the variety of Persian spoken in Iran as Farsi;E.g. Gholamreza Nazari (2014): Farsi Grammar in Use: For BeginnersSaeid Atoofi (2015): Farsi (Persian) for Beginners: Mastering Conversational Farsi. although the name Persian is also still widely used.E.g. Bahman Solati (2013): Persian Grammar: An Elementary Guide to Some Persian Grammatical ProblemsMehdi Purmohammad (2013): An Applied Persian Grammar: Speaking as the Macro-skillAbdi Rafiee (1988/2001): Colloquial Persian (Routledge).\n* Eastern Persian, Dari Persian ( ' or  ) was originally a synonym for Fārsi but since the latter decades of the 20th century has become the name for the variety of Persian spoken in Afghanistan, where it is one of the two official languages; it is sometimes called Afghan Persian in English.See Dari – Geographical distribution\n* Tajiki (,   or  /  ') is the variety of Persian spoken in Tajikistan and Uzbekistan by the Tajiks.\n\nPersian language name in English\n\nPersian, the historically more widely used name of the language in English, is an anglicized form derived from Latin * . a Hellenized form of Old Persian . According to the Oxford English Dictionary, the term Persian as a language name is first attested in English in the mid-16th century.Oxford English Dictionary online, s.v. \"Persian\", draft revision June 2007. Native Iranian Persian speakers call it Fārsi.OED online, s.v. \"Pārsi\". \n\nFarsi is the Arabicized form of Pārsi, subsequent to Arab conquest of Iran, due to a lack of the phoneme in Standard Arabic (i.e., the was replaced with an). The origin of the name Farsi and the place of origin of the language which is Fars Province is the Arabicized form of Pārs. In English, this language has historically been known as Persian, though Farsi has also gained some currency. Farsi is encountered in some linguistic literature as a name for the language, used both by Iranian and by foreign authors.For example: A. Gharib, M. Bahar, B. Fooroozanfar, J. Homaii, and R. Yasami. Farsi Grammar. Jahane Danesh, 2nd edition, 2001.\n\nIn modern English the word Farsi refers to the language while Parsi (or Parsee) describes Zoroastrians, particularly in South Asia.\n\nThe Academy of Persian Language and Literature has declared that the name Persian is more appropriate, as it has the longer tradition in western languages and better expresses the role of the language as a mark of cultural and national continuity. Some Persian language scholars such as Ehsan Yarshater, editor of Encyclopædia Iranica, and University of Arizona professor Kamran Talattof, have also rejected the usage of \"Farsi\" in their articles.\n\nThe international language-encoding standard ISO 639-1 uses the code fa, as its coding system is mostly based on the local names. The more detailed standard ISO 639-3 uses the name \"Persian\" (code fas) for the dialect continuum spoken across Iran and Afghanistan. This consists of the individual languages Dari (Afghan Persian) and Iranian Persian.\n\nCurrently, Voice of America, BBC World Service, Deutsche Welle, and Radio Free Europe/Radio Liberty use \"Persian Service\" for their broadcasts in the language. Radio Free Europe/Radio Liberty also includes a Tajik service and an Afghan (Dari) service. This is also the case for the American Association of Teachers of Persian, The Centre for Promotion of Persian Language and Literature, and many of the leading scholars of the Persian language.\n\nHistory\n\nPersian is an Iranian language belonging to the Indo-Iranian branch of the Indo-European family of languages. In general, Iranian languages are known from three periods, usually referred to as Old, Middle, and New (Modern) periods. These correspond to three eras in Iranian history; Old era being the period from sometime before Achaemenids, the Achaemenid era and sometime after Achaemenids (that is to 400–300 BC), Middle era being the next period most officially Sassanid era and sometime in post-Sassanid era, and the New era being the period afterwards down to present day. vi(2). Documentation.\n\nAccording to available documents, the Persian language is \"the only Iranian language\" for which close philological relationships between all of its three stages are established and so that Old, Middle, and New Persian represent one and the same language of Persian; that is, New Persian is a direct descendant of Middle and Old Persian.cf.  vi(2). Documentation. Excerpt 1: \"Only the official languages Old, Middle, and New Persian represent three stages of one and the same language, whereas close genetic relationships are difficult to establish between other Middle and Modern Iranian languages. Modern Yaḡnōbi belongs to the same dialect group as Sogdian, but is not a direct descendant; Bactrian may be closely related to modern Yidḡa and Munji (Munjāni); and Wakhi (Wāḵi) belongs with Khotanese. Excerpt 2: New Persian, the descendant of Middle Persian and official language of Iranian states for centuries.\"\n\nThe known history of the Persian language can be divided into the following three distinct periods:\n\nOld Persian\n\nAs a written language, Old Persian is attested in royal Achaemenid inscriptions. The oldest known text written in Old Persian is from the Behistun Inscription. Examples of Old Persian have been found in what is now Iran, Romania (Gherla), Armenia, Bahrain, Iraq, Turkey and Egypt.[http://www.avesta.org/op/op.htm Roland G. Kent, Old Persian, 1953]Kent, R. G.: \"Old Persian: Grammar Texts Lexicon\", page 6. American Oriental Society, 1950. Old Persian is one of the oldest Indo-European languages which is attested in original texts.\n\nXenophon, a Greek general serving in some of the Persian expeditions, describes many aspects of Armenian village life and hospitality in around 401 BC, which is at a time when Old Persian was the only form of Persian used. He relates that the Armenians spoke a language that to his ear sounded like the language of the Persians.\n\nMiddle Persian\n\nThe complex grammatical conjugation and declension of Old Persian yielded to the structure of Middle Persian in which the dual number disappeared, leaving only singular and plural, as did gender. Middle Persian developed the ezāfe construction, expressed through ī (modern ye), to indicate some of the relations between words that have been lost with the simplification of the earlier grammatical system.\n\nAlthough the \"middle period\" of the Iranian languages formally begins with the fall of the Achaemenid Empire, the transition from Old to Middle Persian had probably already begun before the 4th century. However, Middle Persian is not actually attested until 600 years later when it appears in the Sassanid era (224–651) inscriptions, so any form of the language before this date cannot be described with any degree of certainty. Moreover, as a literary language, Middle Persian is not attested until much later, to the 6th or 7th century. And from the 8th century onward, Middle Persian gradually began yielding to New Persian, with the middle-period form only continuing in the texts of Zoroastrianism.\n\nThe native name of Middle Persian was Parsig or Parsik, after the name of the ethnic group of the southwest, that is, \"of Pars\", Old Persian Parsa, New Persian Fars. This is the origin of the name Farsi as it is today used to signify New Persian. Following the collapse of the Sassanid state, Parsik came to be applied exclusively to (either Middle or New) Persian that was written in the Arabic script. From about the 9th century onward, as Middle Persian was on the threshold of becoming New Persian, the older form of the language came to be erroneously called Pahlavi, which was actually but one of the writing systems used to render both Middle Persian as well as various other Middle Iranian languages. That writing system had previously been adopted by the Sassanids (who were Persians, i.e. from the southwest) from the preceding Arsacids (who were Parthians, i.e. from the northeast). While Ibn al-Muqaffa' (eighth century) still distinguished between Pahlavi (i.e. Parthian) and Persian (in Arabic text: al-Farisiyah) (i.e. Middle Persian), this distinction is not evident in Arab commentaries written after that date.\n\nGernot Windfuhr considers new Persian as an evolution of the Old Persian language and the Middle Persian language, p. 82. \"The evolution of Persian as the culturally dominant language of major parts of the Near East, from Anatolia and Iran, to Central Asia, to northwest India until recent centuries, began with the political domination of these areas by dynasties originating in southwestern province of Iran, Pars, later Arabicised to Fars: first the Achaemenids (599–331 BC) whose official language was Old Persian; then the Sassanids (c. AD 225–651) whose official language was Middle Persian. Hence, the entire country used to be called Perse by the ancient Greeks, a practice continued to this day. The more general designation 'Iran(-shahr)\" derives from Old Iranian aryanam (Khshathra)' (the realm) of Aryans'. The dominance of these two dynasties resulted in Old and Middle-Persian colonies throughout the empire, most importantly for the course of the development of Persian, in the north-east i.e., what is now Khorasan, northern Afghanistan and Central Asia, as documented by the Middle Persian texts of the Manichean found in the oasis city of Turfan in Chinese Turkistan (Sinkiang). This led to certain degree of regionalisation\". but also states that none of the known Middle Persian dialects is the direct predecessor of Modern Persian.Comrie, Bernard (1990) The major languages of South Asia, the Middle East and Africa, Taylor & Francis, p. 82Barbara M. Horvath, Paul Vaughan, Community languages, 1991, p. 276 Ludwig Paul states: \"The language of the Shahnameh should be seen as one instance of continuous historical development from Middle to New Persian.\"L. Paul (2005), \"The Language of the Shahnameh in historical and dialectical perspective\", p. 150: \"The language of the Shahnameh should be seen as one instance of continuous historical development from Middle to New Persian.\", in \n\nNew Persian\n\n\"New Persian\"  is conventionally divided into three stages:\n*Early New Persian (8th/9th centuries)\n*Classical Persian (10th–18th centuries)\n*Contemporary Persian (19th century to present)\n\nEarly New Persian remains largely intelligible to speakers of Contemporary Persian, as  the morphology and, to a lesser extent, the lexicon of the language have remained relatively stable.\n\nEarly New Persian\n\n\"New Persian\" is taken to replace Middle Persian in the course of the 8th to 9th centuries, under Abbasid rule.Johanson, Lars, and Christiane Bulut. 2006. [http://www.turkiclanguages.com/www/Johanson2006Cont.pdf Turkic-Iranian contact areas: historical and linguistic aspects]. Wiesbaden: Harrassowitz.\nWith the decline of the Abbasids began the  reestablishment of Persian national life and Persians laid the foundations for a renaissance in the realm of letters. New Persian as an independent literary language first emerges in Bactria through the adaptation of the spoken form of Sassanian Middle Persian court language called Dari. The cradle of the Persian literary renaissance lay in the east of Greater Iran in Greater Khorasan and Transoxiana close to the Amu Darya (Modern day Afghanistan).Jackson, A. V. Williams. 1920. Early Persian poetry, from the beginnings down to the time of Firdausi. New York: The Macmillan Company. pp.17–19. (in [https://archive.org/stream/earlypersianpoet00jackuoft/earlypersianpoet00jackuoft_djvu.txt Public Domain])\n\nThe mastery of the newer speech having now been transformed from Middle into New Persian was already complete by the era of the three princely dynasties of Iranian origin, the Tahirid dynasty (820–872), Saffarid dynasty (860–903) and Samanid Empire (874–999), and could develop only in range and power of expression.\n\nAbbas of Merv is mentioned as being the earliest minstrel to chant verse in the newer Persian tongue and after him the poems of Hanzala Badghisi were among the most famous between the Persian-speakers of the time.Jackson, A. V. Williams.pp.17–19.\n\nThe first poems of the Persian language, a language historically called Dari, emerged in Afghanistan. The first significant Persian poet was Rudaki. He flourished in the 10th century, when the Samanids were at the height of their power. His reputation as a court poet and as an accomplished musician and singer has survived, although little of his poetry has been preserved. Among his lost works is versified fables collected in the Kalila wa Dimna.\n\nThe language spread geographically from the 11th century on and was the medium through which among others, Central Asian Turks became familiar with Islam and urban culture. New Persian was widely used as a trans-regional lingua franca, a task for which it was particularly suitable due to its relatively simple morphological structure and this situation persisted until at least 19th century. In the late Middle Ages, new Islamic literary languages were created on the Persian model: Ottoman Turkish, Chagatai and Urdu, which are regarded as \"structural daughter languages\" of Persian.\n\nClassical Persian\n\n\"Classical Persian\" loosely refers to the standardized language of medieval Persia used in literature and poetry.\nThis is the language of the 10th to 12th centuries, which continued to be used as literary language and lingua franca under the \"Persianized\" Turko-Mongol dynasties during the 12th to 15th centuries, and under restored Persian rule during the 16th to 19th centuries.\n\naccording to [http://www.iranchamber.com/literature/articles/persian_language.php iranchamber.com] \"the language (ninth to thirteenth centuries), preserved in the literature of the Empire, is known as Classical Persian, due to the eminence and distinction of poets such as Roudaki, Ferdowsi, and Khayyam. During this period, Persian was adopted as the lingua franca of the eastern Islamic nations.  Extensive contact with Arabic led to a large influx of Arab vocabulary. In fact, a writer of Classical Persian had at one's disposal the entire Arabic lexicon and could use Arab terms freely either for literary effect or to display erudition.  Classical Persian remained essentially unchanged until the nineteenth century, when the dialect of Teheran rose in prominence, having been chosen as the capital of Persia by the Qajar Dynasty in 1787. This Modern Persian dialect became the basis of what is now called Contemporary Standard Persian. Although it still contains a large number of Arab terms, most borrowings have been nativized, with a much lower percentage of Arabic words in colloquial forms of the language.\"\n\nPersian during this time served as lingua franca of Greater Persia and of much of the Indian subcontinent.\nIt was also the official and cultural language of many Islamic dynasties, including the Samanids, Buyids, Tahirids, Ziyarids, the Mughal Empire, Timurids, Ghaznavids, Seljuqs, Khwarazmians, the Sultanate of Rum, the Shirvanshahs, Safavids, Afsharids, Zands, Qajars, Ottomans and also many Mughal successors such as the Nizam of Hyderabad.\nPersian was the only non-European language known and used by Marco Polo at the Court of Kublai Khan and in his journeys through China.John Andrew Boyle, Some thoughts on the sources for the Il-Khanid period of Persian history, in Iran: Journal of the British Institute of Persian Studies, British Institute of Persian Studies, vol. 12 (1974), p. 175.\n\nUse in Asia Minor\n\nDespite Anatolia having been ruled at various times prior to the Middle Ages by various Persian-speaking dynasties originating in Iran, the language lost its traditional foothold there with the demise of the Sasanian Empire. Centuries later however, the practise and usage of Persian in the region would be strongly revived. A branch of the Seljuks, the Sultanate of Rum, took Persian language, art and letters to Anatolia., p 734 They adopted Persian language as the official language of the empire., p 322 The Ottomans, which can roughly be seen as their eventual successors, took this tradition over. Persian was the official court language of the empire, and for some time, the official language of the empire.Doris Wastl-Walter. [https://books.google.nl/books?id\n6gsm72h9u_IC&pgPA409&dq\nottoman+empire+official+language+persian+language&hlnl&sa\nX&ved0CDcQ6AEwA2oVChMIroKRg_2RxgIVxhgsCh3c4gNw#v\nonepage&qottoman%20empire%20official%20language%20persian%20language&f\nfalse The Ashgate Research Companion to Border Studies] Ashgate Publishing, Ltd., 2011  p 409 The educated and noble class of the Ottoman Empire all spoke Persian, such as sultan Selim I, despite being Safavid Iran's archrival and a staunch opposer of Shia Islam.Bertold Spuler. [https://books.google.nl/books?id\nrD1vvympVtsC&pgPA68&dq\npersian+language+in+anatolia&hlnl&sa\nX&ved0CC0Q6AEwAmoVChMIpZ2B8PeRxgIVQZ8sCh10HAVJ#v\nonepage&qpersian%20language%20in%20anatolia&f\nfalse Persian Historiography & Geography] Pustaka Nasional Pte Ltd  p 68 It was a major literary language in the empire.Franklin D. Lewis. [https://books.google.nl/books?idPFsQBwAAQBAJ&pg\nPT340&dqottoman+court+persian+language&hl\nnl&saX&ved\n0CCgQ6AEwAWoVChMIsPuc5_2RxgIVA2QsCh1kQQAa#vonepage&q\nottoman%20court%20persian%20language&ffalse Rumi - Past and Present, East and West: The Life, Teachings, and Poetry of Jal l al-Din Rumi] Oneworld Publications, 18 okt. 2014  Some of the noted earlier Persian works during the Ottoman rule are Idris Bidlisi's Hasht Bihisht, which begun in 1502 and covered the reign of the first eight Ottoman rulers, and the Salim-Namah, a glorification of Selim I. After a period of several centuries, Ottoman Turkish (which was highly Persianised itself) had developed towards a fully accepted language of literature, which was even able to satisfy the demands of a scientific presentation.Bertold Spuler. [https://books.google.nl/books?id\nrD1vvympVtsC&pgPA68&dq\npersian+language+in+anatolia&hlnl&sa\nX&ved0CC0Q6AEwAmoVChMIpZ2B8PeRxgIVQZ8sCh10HAVJ#v\nonepage&qpersian%20language%20in%20anatolia&f\nfalse Persian Historiography & Geography] Pustaka Nasional Pte Ltd  p 69 However, the number of Persian and Arabic loanwords contained in those works increased at times up to 88%.\n\nUse in South Asia\n\nThe Persian language influenced the formation of many modern languages in West Asia, Europe, Central Asia, and South Asia. Following the Turko-Persian Ghaznavid conquest of South Asia, Persian was firstly introduced in the region by Turkic Central Asians. The basis in general for the introduction of Persian language into the subcontinent was set, from its earliest days, by various Persianized Central Asian Turkic and Afghan dynasties. For five centuries prior to the British colonization, Persian was widely used as a second language in the Indian subcontinent, due to the admiration the Mughals (who were of Turco-Mongol origin) had for the foreign language. It took prominence as the language of culture and education in several Muslim courts on the subcontinent and became the sole \"official language\" under the Mughal emperors.\nBeginning in 1843, though, English and Hindustani gradually replaced Persian in importance on the subcontinent. Evidence of Persian's historical influence there can be seen in the extent of its influence on certain languages of the Indian subcontinent. Words borrowed from Persian are still quite commonly used in certain Indo-Aryan languages, especially Urdu, also historically known as Hindustani. There is also a small population of Zoroastrian Iranis in India, who migrated around 16th-18th century to escape religious execution in Qajar Iran and speak a Dari dialect.\n\nContemporary Persian\n\nIn the 19th century, under the Qajar dynasty, the dialect spoken in Tehran rose to prominence. This became the basis of what is now known as \"Contemporary Standard Persian\".\n\nThere is still substantial Arabic vocabulary, but many of these words have been integrated into Persian phonology and grammar. In addition, since the 19thcentury numerous Russian, French, and English terms have been borrowed, especially vocabulary related to technology. The Iranian National Academy of Persian Language and Literature is responsible for evaluating neologisms in order to devise their Persian equivalents.\n\nVarieties\n\nThere are three modern varieties of standard Persian:\n*Western Persian (Persian, Iranian Persian, or Farsi) is spoken in Iran, and by minorities in Iraq and the Persian Gulf states.\n*Dari (Dari Persian, Afghan Persian, or Dari) is spoken in Afghanistan.\n*Tajiki (Tajik Persian) is spoken in Tajikistan and Uzbekistan. It is written in the Cyrillic script.\n\nAll these three varieties are based on the classic Persian literature and its literary tradition. There are also several local dialects from Iran, Afghanistan and Tajikistan which slightly differ from the standard Persian. The Hazaragi dialect (in Central Afghanistan and Pakistan), Herati (in Western Afghanistan), Darwazi (in Afghanistan and Tajikistan), and the Tehrani accent (in Iran, the basis of standard Iranian Persian) are examples of these dialects. Persian-speaking peoples of Iran, Afghanistan, and Tajikistan can understand one another with a relatively high degree of mutual intelligibility.\n\nThe following are some languages closely related to Persian, or in some cases are considered dialects:\n*Luri (or Lori), spoken mainly in the southwestern Iranian provinces of Lorestan, Kohgiluyeh and Boyer-Ahmad Province, some western parts of Fars Province and some parts of Khuzestan Province.\n*Lari (in southern Iran)\n*Tat, spoken in parts of Azerbaijan, Russia, and Transcaucasia. It is classified as a variety of Persian.Gernot Windfuhr, \"Persian Grammar: history and state of its study\", Walter de Gruyter, 1979. pg 4:\"\"Tat- Persian spoken in the East Caucasus\"\"V. Minorsky, \"Tat\" in M. Th. Houtsma et al., eds., The Encyclopædia of Islam: A Dictionary of the Geography, Ethnography and Biography of the Muhammadan Peoples, 4 vols. and Suppl., Leiden: Late E.J. Brill and London: Luzac, 1913–38.V. Minorsky, \"Tat\" in M. Th. Houtsma et al., eds., The Encyclopædia of Islam: A Dictionary of the Geography, Ethnography and Biography of the Muhammadan Peoples, 4 vols. and Suppl., Leiden: Late E.J. Brill and London: Luzac, 1913–38. Excerpt: \"Like most Persian dialects, Tati is not very regular in its characteristic features\"C Kerslake, Journal of Islamic Studies (2010) 21 (1): 147–151. excerpt: \"It is a comparison of the verbal systems of three varieties of Persian—standard Persian, Tat, and Tajik—in terms of the 'innovations' that the latter two have developed for expressing finer differentiations of tense, aspect and modality...\"  [https://scholar.google.com/scholar?hl\nen&q+It+is+a+comparison+of+the+verbal+systems+of+three+varieties+of+Persian%E2%80%94standard+Persian%2C+tat%2C+tajik&as_sdt\n80000000000000&as_ylo&as_vis\n0], \"It embraces Gilani, Ta- lysh, Tabari, Kurdish, Gabri, and the Tati Persian of the Caucasus, all but the last belonging to the north-western group of Iranian language.\"\n*Judeo-Tat. Part of the Tat Persian continuum, and spoken in Azerbaijan, Russia, as well as notably by immigrant communities in Israel and New York.\n\nPhonology\n\nIranian Persian has six vowels and twenty-three consonants.\n\nVowels\n\nHistorically, Persian has distinguished length. Early New Persian had a series of five long vowels (,,, and) along with three short vowels, and. At some point prior to the 16th century in the general area now modern Iran, and merged into, and and merged into. Thus, older contrasts such as  shēr \"lion\" vs.   shīr \"milk\", and  zūd \"quick\" vs  zōr \"strong\" were lost. However, there are exceptions to this rule, and in some words, ē and ō are preserved or merged into the diphthongs and (which are descendants of the diphthongs and in Early New Persian), instead of merging into and. Examples of the exception can be found in words such as  (bright).\n\nHowever, in Dari, the archaic distinction of and (respectively known as  Yā-ye majhūl and  Yā-ye ma'rūf) is still preserved as well as the distinction of and (known as  Wāw-e majhūl and  Wāw-e ma'rūf). On the other hand, in standard Tajik, the length distinction has disappeared, and merged with and with.Perry, J. R. (2005) A Tajik Persian Reference Grammar (Boston : Brill)  Therefore, contemporary Afghan Dari dialects are the closest to the vowel inventory of Early New Persian.\n\nAccording to most studies on the subject (e.g. Samareh 1977, Pisowicz 1985, Najafi 2001), the three vowels traditionally considered long (,,) are currently distinguished from their short counterparts (,,) by position of articulation rather than by length. However, there are studies (e.g. Hayes 1979, Windfuhr 1979) that consider vowel length to be the active feature of the system, with,, and phonologically long or bimoraic and,, and phonologically short or monomoraic.\n\nThere are also some studies that consider quality and quantity to be both active in the Iranian system (such as Toosarvandani 2004). That offers a synthetic analysis including both quality and quantity, which often suggests that Modern Persian vowels are in a transition state between the quantitative system of Classical Persian and a hypothetical future Persian, which will eliminate all traces of quantity and retain quality as the only active feature.\n\nThe length distinction is still strictly observed by careful reciters of classic-style poetry for all varieties (including Tajik).\n\nConsonants\n\nGrammar\n\nMorphology\n\nSuffixes predominate Persian morphology, though there are a small number of prefixes. Verbs can express tense and aspect, and they agree with the subject in person and number. There is no grammatical gender in Persian, and pronouns are not marked for natural gender.\n\nSyntax\n\nNormal declarative sentences are structured as (S) (PP) (O) V: sentences have optional subjects, prepositional phrases, and objects followed by a compulsory verb. If the object is specific, the object is followed by the word rā and precedes prepositional phrases: (S) (O + rā) (PP) V.\n\nVocabulary\n\nNative word formation\n\nPersian makes extensive use of word building and combining affixes, stems, nouns and adjectives. Persian frequently uses derivational agglutination to form new words from nouns, adjectives, and verbal stems. New words are extensively formed by compounding – two existing words combining into a new one, as is common in German.\n\nInfluences\n\nWhile having a lesser influence on Arabic and other languages of Mesopotamia and its core vocabulary being of Middle Persian origin, New Persian contains a considerable amount of Arabic lexical items, which were Persianized and often took a different meaning and usage than the Arabic original. Persian loanwords of Arabic origin especially include Islamic terms. The Arabic vocabulary in other Iranian, Turkic and Indic languages is generally understood to have been copied from New Persian, not from Arabic itself.John R. Perry, \"Lexical Areas and Semantic Fields of Arabic\" in Éva Ágnes Csató, Eva Agnes Csato, Bo Isaksson, Carina Jahani, Linguistic convergence and areal diffusion: case studies from Iranian, Semitic and Turkic, Routledge, 2005. pg 97: \"It is generally understood that the bulk of the Arabic vocabulary in the central, contiguous Iranian, Turkic and Indic languages was originally borrowed into literary Persian between the ninth and thirteenth centuries\"\n\nJohn R. Perry, in his article Lexical Areas and Semantic Fields of Arabic, estimates that about 24 percent of an everyday vocabulary of 20,000 words in current Persian, and more than 25 percent of the vocabulary of classical and modern Persian literature, are of Arabic origin. The text frequency of these loan words is generally lower and varies by style and topic area. It may approach 25 percent of a text in literature.John R. Perry, \"Lexical Areas and Semantic Fields of Arabic\" in Éva Ágnes Csató, Eva Agnes Csato, Bo Isaksson, Carina Jahani, Linguistic convergence and areal diffusion: case studies from Iranian, Semitic and Turkic, Routledge, 2005. p.97 Among the Arabic loan words, relatively few (14 percent) are from the semantic domain of material culture, while a larger number are from domains of intellectual and spiritual life.Perry 2005, p.99. Most of the Arabic words used in Persian are either synonyms of native terms or could be glossed in Persian.Perry 2005, p. 99.\n\nThe inclusion of Mongolian and Turkic elements in the Persian language should also be mentioned,e.g. The role of Azeri-Turkish in Iranian Persian, on which see John Perry, \"The Historical Role of Turkish in Relation to Persian of Iran\", Iran & the Caucasus, Vol. 5 (2001), pp. 193–200. not only because of the political role a succession of Turkic dynasties played in Iranian history, but also because of the immense prestige Persian language and literature enjoyed in the wider (non-Arab) Islamic world, which was often ruled by sultans and emirs with a Turkic background. The Turkish and Mongolian vocabulary in Persian is minor in comparison to that of Arabic and these words were mainly confined to military, pastoral terms and political sector (titles, administration, etc.).Xavier Planhol, \"Land of Iran\", Encyclopedia Iranica. \"The Turks, on the other hand, posed a formidable threat: their penetration into Iranian lands was considerable, to such an extent that vast regions adapted their language. This process was all the more remarkable since, in spite of their almost uninterrupted political domination for nearly 1,500 years, the cultural influence of these rough nomads on Iran's refined civilization remained extremely tenuous. This is demonstrated by the mediocre linguistic contribution, for which exhaustive statistical studies have been made (Doerfer). The number of Turkish or Mongol words that entered Persian, though not negligible, remained limited to 2,135, i.e., 3 percent of the vocabulary at the most. These new words are confined on the one hand to the military and political sector (titles, administration, etc.) and, on the other hand, to technical pastoral terms. The contrast with Arab influence is striking. While cultural pressure of the Arabs on Iran had been intense, they in no way infringed upon the entire Iranian territory, whereas with the Turks, whose contributions to Iranian civilization were modest, vast regions of Iranian lands were assimilated, notwithstanding the fact that resistance by the latter was ultimately victorious. Several reasons may be offered.\" New military and political titles were coined based partially on Middle Persian (e.g.  arteš for \"army\", instead of the Uzbek  qoʻshin;  sarlaškar;  daryābān; etc.) in the 20th century.\nPersian has likewise influenced the vocabularies of other languages, especially other Indo-European languages such as Armenian, Urdu, and (to a lesser extent) Hindi; the latter two through conquests of Persianized Central Asian Turkic and Afghan invaders; Turkic languages such as Ottoman Turkish, Chagatai, Tatar, Turkish,[http://www.azargoshnasp.net/languages/Persian/persianloanwordsistanbulturkish.pdf Andreas Tietze, Persian loanwords in Anatolian Turkish, Oriens, 20 (1967) pp- 125–168.] (accessed August 2016) Turkmen, Azeri,L. Johanson, \"Azerbaijan: Iranian Elements in Azeri Turkish\" in Encyclopedia Iranica [http://www.iranica.com/newsite/index.isc?Articlehttp://www.iranica.com/newsite/articles/unicode/v3f2/v3f2a088.html Iranica.com] Uzbek, and Karachay-Balkar; Caucasian languages such as Georgian, and to a lesser extent, Avar and Lezgin; Afro-Asiatic languages like Assyrian (List of loanwords in Assyrian Neo-Aramaic) and Arabic; and even Dravidian languages indirectly especially Telugu and Brahui; as well as Austronesian languages such as Indonesian and Malay. Persian has also had a significant lexical influence, via Turkish, on Albanian, Serbian, Croatian, Bosnian, and Serbo-Croatian, particularly as spoken in Bosnia and Herzegovina.\n\nUse of occasional foreign synonyms instead of Persian words can be a common practice in everyday communications as an alternative expression. In some instances in addition to the Persian vocabulary, the equivalent synonyms from multiple foreign languages can be used. For example, in Iranian colloquial Persian (not in Afghanistan or Tajikistan), the phrase \"thank you\" may be expressed using the French word  merci (stressed, however, on the first syllable), the hybrid Persian-Arabic phrase  motešakker am ( motešakker being \"thankful\" in Arabic, commonly pronounced motčakker in Persian, and the verb  am meaning \"I am\" in Persian), or by the pure Persian phrase  sepās-gozār am.\n\nOrthography\n\nThe vast majority of modern Iranian Persian and Dari text is written with the Arabic script. Tajiki, which is considered by some linguists to be a Persian dialect influenced by Russian and the Turkic languages of Central Asia, is written with the Cyrillic script in Tajikistan (see Tajik alphabet). There also exist several romanization systems for Persian. \n\nPersian alphabet\n\nModern Iranian Persian and Afghan Persian are written using a modified variant of the Arabic alphabet, which uses different pronunciation and additional letters not found in Arabic. After the Muslim conquest of Persia, it took approximately 150 years before Persians adopted the Arabic script in place of the older alphabet. Previously, two different scripts were used, Pahlavi, used for Middle Persian, and the Avestan alphabet (in Persian, Dīndapirak or Din Dabire—literally: religion script), used for religious purposes, primarily for the Avestan but sometimes for Middle Persian.\n\nIn the modern Persian script, historically short vowels are usually not written, only the historically long ones are represented in the text, so words distinguished from each other only by short vowels are ambiguous in writing: Western Persian ' \"worm\", ' \"generosity\", ' \"cream\", and ' \"chrome\" are all spelled ' () in Persian. The reader must determine the word from context. The Arabic system of vocalization marks known as harakat is also used in Persian, although some of the symbols have different pronunciations. For example, a ḍammah is pronounced, while in Iranian Persian it is pronounced. This system is not used in mainstream Persian literature; it is primarily used for teaching and in some (but not all) dictionaries.\n\nThere are several letters generally only used in Arabic loanwords. These letters are pronounced the same as similar Persian letters. For example, there are four functionally identical letters for (), three letters for (), two letters for (), two letters for ().\nOn the other hand, there are four letters that don't exist in Arabic .\n\nAdditions\n\nThe Persian alphabet adds four letters to the Arabic alphabet:\n\nHistorically, there was used also a special letter for the sound. This letter is used no more as the /β/-sound changed to /b/, i.e. archaic زڤان /zaβān/ > زبان /zæbɒn/ 'language'\n\nVariations\n\nThe Persian alphabet also modifies some letters of the Arabic alphabet. For example, alef with hamza below (  ) changes to alef (  ); words using various hamzas get spelled with yet another kind of hamza (so that  becomes ) even though the latter is also correct in Arabic; and teh marbuta (  ) changes to heh (  ) or teh (  ).\n\nThe letters different in shape are:\n\nLatin alphabet\n\nThe International Organization for Standardization has published a standard for simplified transliteration of Persian into Latin, ISO 233-3, titled \"Information and documentation – Transliteration of Arabic characters into Latin characters – Part 3: Persian language – Simplified transliteration\" but the transliteration scheme is not in widespread use.\n\nAnother Latin alphabet, based on the Common Turkic Alphabet, was used in Tajikistan in the 1920s and 1930s. The alphabet was phased out in favor of Cyrillic in the late 1930s.\n\nFingilish is Persian using ISO basic Latin alphabet. It is most commonly used in chat, emails and SMS applications. The orthography is not standardized, and varies among writers and even media (for example, typing 'aa' for the phoneme is easier on computer keyboards than on cellphone keyboards, resulting in smaller usage of the combination on cellphones).\n\nTajik alphabet\n\nThe Cyrillic script was introduced for writing the Tajik language under the Tajik Soviet Socialist Republic in the late 1930s, replacing the Latin alphabet that had been used since the October Revolution and the Persian script that had been used earlier. After 1939, materials published in Persian in the Persian script were banned from the country.[http://www.smallwars.quantico.usmc.mil/search/LessonsLearned/afghanistan/groundcombat.asp Smallwars.quantico.usmc.mil]\n\nExamples\n\nThe following text is from Article 1 of the Universal Declaration of Human Rights.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Persian language" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11600" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Persian ( or), also known by its endonym Farsi ( '), is one of the Western Iranian languages within the Indo-Iranian branch of the Indo-European language family. It is primarily spoken in Iran, Afghanistan (officially known as Dari since 1958),Asta Olesen, \"Islam and Politics in Afghanistan, Volume 3\", Psychology Press, 1995. pg 205: \"There began a general promotion of the Pashto language at the expense of Fārsi – previously dominant at the educational and administrative level – and the term 'Dari' for the Afghan version of Persian came into common use, being officially adopted in 1958\" Uzbekistan (in Samarqand, Bukhara, and the Surxondaryo Region) and Tajikistan (officially known as Tajiki since the Soviet era),, pg 518: \"among them the realignment of Central Asian Persian, renamed Tajiki by the Soviet Union\" and some other regions which historically were Persianate societies and considered part of Greater Iran. It is written in the Persian alphabet, a modified variant of the Arabic script.\n\nThe Persian language is classified as a continuation of Middle Persian, the official religious and literary language of the Sasanian Empire, itself a continuation of Old Persian, the language of the Achaemenid Empire.Ulrich Ammon, Norbert Dittmar, Klaus J. Mattheier, Peter Trudgill, \"Sociolinguistics Hsk 3/3 Series Volume 3 of Sociolinguistics: An International Handbook of the Science of Language and Society\", Walter de Gruyter, 2006. 2nd edition. pg 1912. Excerpt: \"Middle Persian, also called Pahlavi is a direct continuation of old Persian, and was used as the written official language of the country.\" \"However, after the Moslem conquest and the collapse of the Sassanids, the Pahlavi language was gradually replaced by Dari, a variety of Middle Persian, with considerable loan elements from Arabic and Parthian.\"Skjærvø, Prods Oktor (2006). Encyclopedia Iranica, \"Iran, vi. Iranian languages and scripts, \"new Persian, is \"the descendant of Middle Persian\" and has since been \"official language of Iranian states for centuries\", whereas for other non-Persian Iranian languages \"close genetic relationships are difficult to establish\" between their different (Middle and Modern) stages. Modern Yaḡnōbi belongs to the same dialect group as Sogdian, but is not a direct descendant; Bactrian may be closely related to modern Yidḡa and Munji (Munjāni); and Wakhi (Wāḵi) belongs with Khotanese.\" Its grammar is similar to that of many contemporary European languages.Richard Davis, \"Persian\" in Josef W. Meri, Jere L. Bacharach, \"Medieval Islamic Civilization\", Taylor & Francis, 2006. pp. 602–603. \"The grammar of New Persian is similar to many contemporary European languages.\"Similarly, the core vocabulary of Persian continued to be derived from Pahlavi. Fārsi, the name of the language in Persian, is Arabic, being the Arabic modification of Pārsi. A Persian-speaking person may be referred to as Persophone.[https://www.iaaw.hu-berlin.de/en/centralasia/research/current-research-projects/modernity-and-modernism-in-persophone-literary-history \"Modernity and Modernism in Persophone Literary History\"], Humboldt-Universität zu Berlin\n\nThere are approximately 110 million Persian speakers worldwide, with the language holding official status in Iran, Afghanistan, and Tajikistan. For centuries, Persian has also been a prestigious cultural language in other regions of Western Asia, Central Asia, and South Asia by the various empires based in the regions.Encyclopædia Britannica: [http://www.britannica.com/EBchecked/topic/452843/Persian-literature/277134/The-proliferation-of-court-patronage?anchor\nref997402 Persian literature], retrieved September 2011.\n\nPersian has had a considerable (mainly lexical) influence on neighboring languages, particularly the Turkic languages in Central Asia, Caucasus, and Anatolia, neighboring Iranian languages, as well as Armenian, Georgian, and Indo-Aryan languages, especially Urdu (a register of Hindustani). It also exerted some influence on Arabic, particularly Bahrani Arabic,, p. XXX while borrowing much vocabulary from it after the Arab conquest of Iran.Lazard, Gilbert 1975, \"The Rise of the New Persian Language\" in Frye, R. N., The Cambridge History of Iran, Vol. 4, pp. 595–632, Cambridge: Cambridge University Press. \"The language known as New Persian, which usually is called at this period (early Islamic times) by the name of Dari or Farsi-Dari, can be classified linguistically as a continuation of Middle Persian, the official religious and literary language of Sassanian Iran, itself a continuation of Old Persian, the language of the Achaemenids. Unlike the other languages and dialects, ancient and modern, of the Iranian group such as Avestan, Parthian, Soghdian, Kurdish, Balochi, Pashto, etc., Old Persian, Middle and New Persian represent one and the same language at three states of its history. It had its origin in Fars (the true Persian country from the historical point of view) and is differentiated by dialectical features, still easily recognizable from the dialect prevailing in north-western and eastern Iran.\"Lazard, Gilbert, \"Pahlavi, Pârsi, dari: Les langues d'Iran d'apès Ibn al-Muqaffa\" in R.N. Frye, Iran and Islam. In Memory of the late Vladimir Minorsky, Edinburgh University Press, 1971.Ann K. S. Lambton, Persian grammar, Cambridge University Press 1953. \"The Arabic words incorporated into the Persian language have become Persianized\".[http://www.ezglot.com/most-similar-languages.php?l=fas Most similar languages to Persian], ezglot.com\n\nWith a long history of literature in the form of Middle Persian before Islam, Persian was the first language in the Muslim world to break through Arabic's monopoly on writing, and the writing of poetry in Persian was established as a court tradition in many eastern courts. Some of the famous works of Persian literature are the Shahnameh of Ferdowsi, the works of Rumi, the Rubaiyat of Omar Khayyam, the Panj Ganj of Nizami Ganjavi, the Divān of Hafez and the two miscellanea of prose and verse by Saadi Shirazi, the Gulistan and the Bustan. About 40% of everyday Persian literary vocabulary is of Arabic origin.\n\nClassification\n\nPersian is one of the Western Iranian languages within the Indo-European family. Other Western Iranian languages are the Kurdish languages, Gilaki, Mazanderani, Talysh, and Balochi. Persian is classified as a member of the Southwestern subgroup within Western Iranian along with Lari, Kumzari, and Luri.\n\nEtymology\n\nPersian language name in Persian\n\nIn Persian, the language is known by several names:\n\nWestern Persian, Farsi ( ' or  ), the Arabic form of Parsi ( '), has been the name used by all native speakers until the 20th century. In recent decades some authors writing in English have referred to the variety of Persian spoken in Iran as Farsi;E.g. Gholamreza Nazari (2014): Farsi Grammar in Use: For BeginnersSaeid Atoofi (2015): Farsi (Persian) for Beginners: Mastering Conversational Farsi. although the name Persian is also still widely used.E.g. Bahman Solati (2013): Persian Grammar: An Elementary Guide to Some Persian Grammatical ProblemsMehdi Purmohammad (2013): An Applied Persian Grammar: Speaking as the Macro-skillAbdi Rafiee (1988/2001): Colloquial Persian (Routledge).\n* Eastern Persian, Dari Persian ( ' or  ) was originally a synonym for Fārsi but since the latter decades of the 20th century has become the name for the variety of Persian spoken in Afghanistan, where it is one of the two official languages; it is sometimes called Afghan Persian in English.See Dari – Geographical distribution\n* Tajiki (,   or  /  ') is the variety of Persian spoken in Tajikistan and Uzbekistan by the Tajiks.\n\nPersian language name in English\n\nPersian, the historically more widely used name of the language in English, is an anglicized form derived from Latin * . a Hellenized form of Old Persian . According to the Oxford English Dictionary, the term Persian as a language name is first attested in English in the mid-16th century.Oxford English Dictionary online, s.v. \"Persian\", draft revision June 2007. Native Iranian Persian speakers call it Fārsi.OED online, s.v. \"Pārsi\". \n\nFarsi is the Arabicized form of Pārsi, subsequent to Arab conquest of Iran, due to a lack of the phoneme in Standard Arabic (i.e., the was replaced with an). The origin of the name Farsi and the place of origin of the language which is Fars Province is the Arabicized form of Pārs. In English, this language has historically been known as Persian, though Farsi has also gained some currency. Farsi is encountered in some linguistic literature as a name for the language, used both by Iranian and by foreign authors.For example: A. Gharib, M. Bahar, B. Fooroozanfar, J. Homaii, and R. Yasami. Farsi Grammar. Jahane Danesh, 2nd edition, 2001.\n\nIn modern English the word Farsi refers to the language while Parsi (or Parsee) describes Zoroastrians, particularly in South Asia.\n\nThe Academy of Persian Language and Literature has declared that the name Persian is more appropriate, as it has the longer tradition in western languages and better expresses the role of the language as a mark of cultural and national continuity. Some Persian language scholars such as Ehsan Yarshater, editor of Encyclopædia Iranica, and University of Arizona professor Kamran Talattof, have also rejected the usage of \"Farsi\" in their articles.\n\nThe international language-encoding standard ISO 639-1 uses the code fa, as its coding system is mostly based on the local names. The more detailed standard ISO 639-3 uses the name \"Persian\" (code fas) for the dialect continuum spoken across Iran and Afghanistan. This consists of the individual languages Dari (Afghan Persian) and Iranian Persian.\n\nCurrently, Voice of America, BBC World Service, Deutsche Welle, and Radio Free Europe/Radio Liberty use \"Persian Service\" for their broadcasts in the language. Radio Free Europe/Radio Liberty also includes a Tajik service and an Afghan (Dari) service. This is also the case for the American Association of Teachers of Persian, The Centre for Promotion of Persian Language and Literature, and many of the leading scholars of the Persian language.\n\nHistory\n\nPersian is an Iranian language belonging to the Indo-Iranian branch of the Indo-European family of languages. In general, Iranian languages are known from three periods, usually referred to as Old, Middle, and New (Modern) periods. These correspond to three eras in Iranian history; Old era being the period from sometime before Achaemenids, the Achaemenid era and sometime after Achaemenids (that is to 400–300 BC), Middle era being the next period most officially Sassanid era and sometime in post-Sassanid era, and the New era being the period afterwards down to present day. vi(2). Documentation.\n\nAccording to available documents, the Persian language is \"the only Iranian language\" for which close philological relationships between all of its three stages are established and so that Old, Middle, and New Persian represent one and the same language of Persian; that is, New Persian is a direct descendant of Middle and Old Persian.cf.  vi(2). Documentation. Excerpt 1: \"Only the official languages Old, Middle, and New Persian represent three stages of one and the same language, whereas close genetic relationships are difficult to establish between other Middle and Modern Iranian languages. Modern Yaḡnōbi belongs to the same dialect group as Sogdian, but is not a direct descendant; Bactrian may be closely related to modern Yidḡa and Munji (Munjāni); and Wakhi (Wāḵi) belongs with Khotanese. Excerpt 2: New Persian, the descendant of Middle Persian and official language of Iranian states for centuries.\"\n\nThe known history of the Persian language can be divided into the following three distinct periods:\n\nOld Persian\n\nAs a written language, Old Persian is attested in royal Achaemenid inscriptions. The oldest known text written in Old Persian is from the Behistun Inscription. Examples of Old Persian have been found in what is now Iran, Romania (Gherla), Armenia, Bahrain, Iraq, Turkey and Egypt.[http://www.avesta.org/op/op.htm Roland G. Kent, Old Persian, 1953]Kent, R. G.: \"Old Persian: Grammar Texts Lexicon\", page 6. American Oriental Society, 1950. Old Persian is one of the oldest Indo-European languages which is attested in original texts.\n\nXenophon, a Greek general serving in some of the Persian expeditions, describes many aspects of Armenian village life and hospitality in around 401 BC, which is at a time when Old Persian was the only form of Persian used. He relates that the Armenians spoke a language that to his ear sounded like the language of the Persians.\n\nMiddle Persian\n\nThe complex grammatical conjugation and declension of Old Persian yielded to the structure of Middle Persian in which the dual number disappeared, leaving only singular and plural, as did gender. Middle Persian developed the ezāfe construction, expressed through ī (modern ye), to indicate some of the relations between words that have been lost with the simplification of the earlier grammatical system.\n\nAlthough the \"middle period\" of the Iranian languages formally begins with the fall of the Achaemenid Empire, the transition from Old to Middle Persian had probably already begun before the 4th century. However, Middle Persian is not actually attested until 600 years later when it appears in the Sassanid era (224–651) inscriptions, so any form of the language before this date cannot be described with any degree of certainty. Moreover, as a literary language, Middle Persian is not attested until much later, to the 6th or 7th century. And from the 8th century onward, Middle Persian gradually began yielding to New Persian, with the middle-period form only continuing in the texts of Zoroastrianism.\n\nThe native name of Middle Persian was Parsig or Parsik, after the name of the ethnic group of the southwest, that is, \"of Pars\", Old Persian Parsa, New Persian Fars. This is the origin of the name Farsi as it is today used to signify New Persian. Following the collapse of the Sassanid state, Parsik came to be applied exclusively to (either Middle or New) Persian that was written in the Arabic script. From about the 9th century onward, as Middle Persian was on the threshold of becoming New Persian, the older form of the language came to be erroneously called Pahlavi, which was actually but one of the writing systems used to render both Middle Persian as well as various other Middle Iranian languages. That writing system had previously been adopted by the Sassanids (who were Persians, i.e. from the southwest) from the preceding Arsacids (who were Parthians, i.e. from the northeast). While Ibn al-Muqaffa' (eighth century) still distinguished between Pahlavi (i.e. Parthian) and Persian (in Arabic text: al-Farisiyah) (i.e. Middle Persian), this distinction is not evident in Arab commentaries written after that date.\n\nGernot Windfuhr considers new Persian as an evolution of the Old Persian language and the Middle Persian language, p. 82. \"The evolution of Persian as the culturally dominant language of major parts of the Near East, from Anatolia and Iran, to Central Asia, to northwest India until recent centuries, began with the political domination of these areas by dynasties originating in southwestern province of Iran, Pars, later Arabicised to Fars: first the Achaemenids (599–331 BC) whose official language was Old Persian; then the Sassanids (c. AD 225–651) whose official language was Middle Persian. Hence, the entire country used to be called Perse by the ancient Greeks, a practice continued to this day. The more general designation 'Iran(-shahr)\" derives from Old Iranian aryanam (Khshathra)' (the realm) of Aryans'. The dominance of these two dynasties resulted in Old and Middle-Persian colonies throughout the empire, most importantly for the course of the development of Persian, in the north-east i.e., what is now Khorasan, northern Afghanistan and Central Asia, as documented by the Middle Persian texts of the Manichean found in the oasis city of Turfan in Chinese Turkistan (Sinkiang). This led to certain degree of regionalisation\". but also states that none of the known Middle Persian dialects is the direct predecessor of Modern Persian.Comrie, Bernard (1990) The major languages of South Asia, the Middle East and Africa, Taylor & Francis, p. 82Barbara M. Horvath, Paul Vaughan, Community languages, 1991, p. 276 Ludwig Paul states: \"The language of the Shahnameh should be seen as one instance of continuous historical development from Middle to New Persian.\"L. Paul (2005), \"The Language of the Shahnameh in historical and dialectical perspective\", p. 150: \"The language of the Shahnameh should be seen as one instance of continuous historical development from Middle to New Persian.\", in \n\nNew Persian\n\n\"New Persian\"  is conventionally divided into three stages:\n*Early New Persian (8th/9th centuries)\n*Classical Persian (10th–18th centuries)\n*Contemporary Persian (19th century to present)\n\nEarly New Persian remains largely intelligible to speakers of Contemporary Persian, as  the morphology and, to a lesser extent, the lexicon of the language have remained relatively stable.\n\nEarly New Persian\n\n\"New Persian\" is taken to replace Middle Persian in the course of the 8th to 9th centuries, under Abbasid rule.Johanson, Lars, and Christiane Bulut. 2006. [http://www.turkiclanguages.com/www/Johanson2006Cont.pdf Turkic-Iranian contact areas: historical and linguistic aspects]. Wiesbaden: Harrassowitz.\nWith the decline of the Abbasids began the  reestablishment of Persian national life and Persians laid the foundations for a renaissance in the realm of letters. New Persian as an independent literary language first emerges in Bactria through the adaptation of the spoken form of Sassanian Middle Persian court language called Dari. The cradle of the Persian literary renaissance lay in the east of Greater Iran in Greater Khorasan and Transoxiana close to the Amu Darya (Modern day Afghanistan).Jackson, A. V. Williams. 1920. Early Persian poetry, from the beginnings down to the time of Firdausi. New York: The Macmillan Company. pp.17–19. (in [https://archive.org/stream/earlypersianpoet00jackuoft/earlypersianpoet00jackuoft_djvu.txt Public Domain])\n\nThe mastery of the newer speech having now been transformed from Middle into New Persian was already complete by the era of the three princely dynasties of Iranian origin, the Tahirid dynasty (820–872), Saffarid dynasty (860–903) and Samanid Empire (874–999), and could develop only in range and power of expression.\n\nAbbas of Merv is mentioned as being the earliest minstrel to chant verse in the newer Persian tongue and after him the poems of Hanzala Badghisi were among the most famous between the Persian-speakers of the time.Jackson, A. V. Williams.pp.17–19.\n\nThe first poems of the Persian language, a language historically called Dari, emerged in Afghanistan. The first significant Persian poet was Rudaki. He flourished in the 10th century, when the Samanids were at the height of their power. His reputation as a court poet and as an accomplished musician and singer has survived, although little of his poetry has been preserved. Among his lost works is versified fables collected in the Kalila wa Dimna.\n\nThe language spread geographically from the 11th century on and was the medium through which among others, Central Asian Turks became familiar with Islam and urban culture. New Persian was widely used as a trans-regional lingua franca, a task for which it was particularly suitable due to its relatively simple morphological structure and this situation persisted until at least 19th century. In the late Middle Ages, new Islamic literary languages were created on the Persian model: Ottoman Turkish, Chagatai and Urdu, which are regarded as \"structural daughter languages\" of Persian.\n\nClassical Persian\n\n\"Classical Persian\" loosely refers to the standardized language of medieval Persia used in literature and poetry.\nThis is the language of the 10th to 12th centuries, which continued to be used as literary language and lingua franca under the \"Persianized\" Turko-Mongol dynasties during the 12th to 15th centuries, and under restored Persian rule during the 16th to 19th centuries.\n\naccording to [http://www.iranchamber.com/literature/articles/persian_language.php iranchamber.com] \"the language (ninth to thirteenth centuries), preserved in the literature of the Empire, is known as Classical Persian, due to the eminence and distinction of poets such as Roudaki, Ferdowsi, and Khayyam. During this period, Persian was adopted as the lingua franca of the eastern Islamic nations.  Extensive contact with Arabic led to a large influx of Arab vocabulary. In fact, a writer of Classical Persian had at one's disposal the entire Arabic lexicon and could use Arab terms freely either for literary effect or to display erudition.  Classical Persian remained essentially unchanged until the nineteenth century, when the dialect of Teheran rose in prominence, having been chosen as the capital of Persia by the Qajar Dynasty in 1787. This Modern Persian dialect became the basis of what is now called Contemporary Standard Persian. Although it still contains a large number of Arab terms, most borrowings have been nativized, with a much lower percentage of Arabic words in colloquial forms of the language.\"\n\nPersian during this time served as lingua franca of Greater Persia and of much of the Indian subcontinent.\nIt was also the official and cultural language of many Islamic dynasties, including the Samanids, Buyids, Tahirids, Ziyarids, the Mughal Empire, Timurids, Ghaznavids, Seljuqs, Khwarazmians, the Sultanate of Rum, the Shirvanshahs, Safavids, Afsharids, Zands, Qajars, Ottomans and also many Mughal successors such as the Nizam of Hyderabad.\nPersian was the only non-European language known and used by Marco Polo at the Court of Kublai Khan and in his journeys through China.John Andrew Boyle, Some thoughts on the sources for the Il-Khanid period of Persian history, in Iran: Journal of the British Institute of Persian Studies, British Institute of Persian Studies, vol. 12 (1974), p. 175.\n\nUse in Asia Minor\n\nDespite Anatolia having been ruled at various times prior to the Middle Ages by various Persian-speaking dynasties originating in Iran, the language lost its traditional foothold there with the demise of the Sasanian Empire. Centuries later however, the practise and usage of Persian in the region would be strongly revived. A branch of the Seljuks, the Sultanate of Rum, took Persian language, art and letters to Anatolia., p 734 They adopted Persian language as the official language of the empire., p 322 The Ottomans, which can roughly be seen as their eventual successors, took this tradition over. Persian was the official court language of the empire, and for some time, the official language of the empire.Doris Wastl-Walter. [https://books.google.nl/books?id\n6gsm72h9u_IC&pgPA409&dq\nottoman+empire+official+language+persian+language&hlnl&sa\nX&ved0CDcQ6AEwA2oVChMIroKRg_2RxgIVxhgsCh3c4gNw#v\nonepage&qottoman%20empire%20official%20language%20persian%20language&f\nfalse The Ashgate Research Companion to Border Studies] Ashgate Publishing, Ltd., 2011  p 409 The educated and noble class of the Ottoman Empire all spoke Persian, such as sultan Selim I, despite being Safavid Iran's archrival and a staunch opposer of Shia Islam.Bertold Spuler. [https://books.google.nl/books?id\nrD1vvympVtsC&pgPA68&dq\npersian+language+in+anatolia&hlnl&sa\nX&ved0CC0Q6AEwAmoVChMIpZ2B8PeRxgIVQZ8sCh10HAVJ#v\nonepage&qpersian%20language%20in%20anatolia&f\nfalse Persian Historiography & Geography] Pustaka Nasional Pte Ltd  p 68 It was a major literary language in the empire.Franklin D. Lewis. [https://books.google.nl/books?idPFsQBwAAQBAJ&pg\nPT340&dqottoman+court+persian+language&hl\nnl&saX&ved\n0CCgQ6AEwAWoVChMIsPuc5_2RxgIVA2QsCh1kQQAa#vonepage&q\nottoman%20court%20persian%20language&ffalse Rumi - Past and Present, East and West: The Life, Teachings, and Poetry of Jal l al-Din Rumi] Oneworld Publications, 18 okt. 2014  Some of the noted earlier Persian works during the Ottoman rule are Idris Bidlisi's Hasht Bihisht, which begun in 1502 and covered the reign of the first eight Ottoman rulers, and the Salim-Namah, a glorification of Selim I. After a period of several centuries, Ottoman Turkish (which was highly Persianised itself) had developed towards a fully accepted language of literature, which was even able to satisfy the demands of a scientific presentation.Bertold Spuler. [https://books.google.nl/books?id\nrD1vvympVtsC&pgPA68&dq\npersian+language+in+anatolia&hlnl&sa\nX&ved0CC0Q6AEwAmoVChMIpZ2B8PeRxgIVQZ8sCh10HAVJ#v\nonepage&qpersian%20language%20in%20anatolia&f\nfalse Persian Historiography & Geography] Pustaka Nasional Pte Ltd  p 69 However, the number of Persian and Arabic loanwords contained in those works increased at times up to 88%.\n\nUse in South Asia\n\nThe Persian language influenced the formation of many modern languages in West Asia, Europe, Central Asia, and South Asia. Following the Turko-Persian Ghaznavid conquest of South Asia, Persian was firstly introduced in the region by Turkic Central Asians. The basis in general for the introduction of Persian language into the subcontinent was set, from its earliest days, by various Persianized Central Asian Turkic and Afghan dynasties. For five centuries prior to the British colonization, Persian was widely used as a second language in the Indian subcontinent, due to the admiration the Mughals (who were of Turco-Mongol origin) had for the foreign language. It took prominence as the language of culture and education in several Muslim courts on the subcontinent and became the sole \"official language\" under the Mughal emperors.\nBeginning in 1843, though, English and Hindustani gradually replaced Persian in importance on the subcontinent. Evidence of Persian's historical influence there can be seen in the extent of its influence on certain languages of the Indian subcontinent. Words borrowed from Persian are still quite commonly used in certain Indo-Aryan languages, especially Urdu, also historically known as Hindustani. There is also a small population of Zoroastrian Iranis in India, who migrated around 16th-18th century to escape religious execution in Qajar Iran and speak a Dari dialect.\n\nContemporary Persian\n\nIn the 19th century, under the Qajar dynasty, the dialect spoken in Tehran rose to prominence. This became the basis of what is now known as \"Contemporary Standard Persian\".\n\nThere is still substantial Arabic vocabulary, but many of these words have been integrated into Persian phonology and grammar. In addition, since the 19thcentury numerous Russian, French, and English terms have been borrowed, especially vocabulary related to technology. The Iranian National Academy of Persian Language and Literature is responsible for evaluating neologisms in order to devise their Persian equivalents.\n\nVarieties\n\nThere are three modern varieties of standard Persian:\n*Western Persian (Persian, Iranian Persian, or Farsi) is spoken in Iran, and by minorities in Iraq and the Persian Gulf states.\n*Dari (Dari Persian, Afghan Persian, or Dari) is spoken in Afghanistan.\n*Tajiki (Tajik Persian) is spoken in Tajikistan and Uzbekistan. It is written in the Cyrillic script.\n\nAll these three varieties are based on the classic Persian literature and its literary tradition. There are also several local dialects from Iran, Afghanistan and Tajikistan which slightly differ from the standard Persian. The Hazaragi dialect (in Central Afghanistan and Pakistan), Herati (in Western Afghanistan), Darwazi (in Afghanistan and Tajikistan), and the Tehrani accent (in Iran, the basis of standard Iranian Persian) are examples of these dialects. Persian-speaking peoples of Iran, Afghanistan, and Tajikistan can understand one another with a relatively high degree of mutual intelligibility.\n\nThe following are some languages closely related to Persian, or in some cases are considered dialects:\n*Luri (or Lori), spoken mainly in the southwestern Iranian provinces of Lorestan, Kohgiluyeh and Boyer-Ahmad Province, some western parts of Fars Province and some parts of Khuzestan Province.\n*Lari (in southern Iran)\n*Tat, spoken in parts of Azerbaijan, Russia, and Transcaucasia. It is classified as a variety of Persian.Gernot Windfuhr, \"Persian Grammar: history and state of its study\", Walter de Gruyter, 1979. pg 4:\"\"Tat- Persian spoken in the East Caucasus\"\"V. Minorsky, \"Tat\" in M. Th. Houtsma et al., eds., The Encyclopædia of Islam: A Dictionary of the Geography, Ethnography and Biography of the Muhammadan Peoples, 4 vols. and Suppl., Leiden: Late E.J. Brill and London: Luzac, 1913–38.V. Minorsky, \"Tat\" in M. Th. Houtsma et al., eds., The Encyclopædia of Islam: A Dictionary of the Geography, Ethnography and Biography of the Muhammadan Peoples, 4 vols. and Suppl., Leiden: Late E.J. Brill and London: Luzac, 1913–38. Excerpt: \"Like most Persian dialects, Tati is not very regular in its characteristic features\"C Kerslake, Journal of Islamic Studies (2010) 21 (1): 147–151. excerpt: \"It is a comparison of the verbal systems of three varieties of Persian—standard Persian, Tat, and Tajik—in terms of the 'innovations' that the latter two have developed for expressing finer differentiations of tense, aspect and modality...\"  [https://scholar.google.com/scholar?hl\nen&q+It+is+a+comparison+of+the+verbal+systems+of+three+varieties+of+Persian%E2%80%94standard+Persian%2C+tat%2C+tajik&as_sdt\n80000000000000&as_ylo&as_vis\n0], \"It embraces Gilani, Ta- lysh, Tabari, Kurdish, Gabri, and the Tati Persian of the Caucasus, all but the last belonging to the north-western group of Iranian language.\"\n*Judeo-Tat. Part of the Tat Persian continuum, and spoken in Azerbaijan, Russia, as well as notably by immigrant communities in Israel and New York.\n\nPhonology\n\nIranian Persian has six vowels and twenty-three consonants.\n\nVowels\n\nHistorically, Persian has distinguished length. Early New Persian had a series of five long vowels (,,, and) along with three short vowels, and. At some point prior to the 16th century in the general area now modern Iran, and merged into, and and merged into. Thus, older contrasts such as  shēr \"lion\" vs.   shīr \"milk\", and  zūd \"quick\" vs  zōr \"strong\" were lost. However, there are exceptions to this rule, and in some words, ē and ō are preserved or merged into the diphthongs and (which are descendants of the diphthongs and in Early New Persian), instead of merging into and. Examples of the exception can be found in words such as  (bright).\n\nHowever, in Dari, the archaic distinction of and (respectively known as  Yā-ye majhūl and  Yā-ye ma'rūf) is still preserved as well as the distinction of and (known as  Wāw-e majhūl and  Wāw-e ma'rūf). On the other hand, in standard Tajik, the length distinction has disappeared, and merged with and with.Perry, J. R. (2005) A Tajik Persian Reference Grammar (Boston : Brill)  Therefore, contemporary Afghan Dari dialects are the closest to the vowel inventory of Early New Persian.\n\nAccording to most studies on the subject (e.g. Samareh 1977, Pisowicz 1985, Najafi 2001), the three vowels traditionally considered long (,,) are currently distinguished from their short counterparts (,,) by position of articulation rather than by length. However, there are studies (e.g. Hayes 1979, Windfuhr 1979) that consider vowel length to be the active feature of the system, with,, and phonologically long or bimoraic and,, and phonologically short or monomoraic.\n\nThere are also some studies that consider quality and quantity to be both active in the Iranian system (such as Toosarvandani 2004). That offers a synthetic analysis including both quality and quantity, which often suggests that Modern Persian vowels are in a transition state between the quantitative system of Classical Persian and a hypothetical future Persian, which will eliminate all traces of quantity and retain quality as the only active feature.\n\nThe length distinction is still strictly observed by careful reciters of classic-style poetry for all varieties (including Tajik).\n\nConsonants\n\nGrammar\n\nMorphology\n\nSuffixes predominate Persian morphology, though there are a small number of prefixes. Verbs can express tense and aspect, and they agree with the subject in person and number. There is no grammatical gender in Persian, and pronouns are not marked for natural gender.\n\nSyntax\n\nNormal declarative sentences are structured as (S) (PP) (O) V: sentences have optional subjects, prepositional phrases, and objects followed by a compulsory verb. If the object is specific, the object is followed by the word rā and precedes prepositional phrases: (S) (O + rā) (PP) V.\n\nVocabulary\n\nNative word formation\n\nPersian makes extensive use of word building and combining affixes, stems, nouns and adjectives. Persian frequently uses derivational agglutination to form new words from nouns, adjectives, and verbal stems. New words are extensively formed by compounding – two existing words combining into a new one, as is common in German.\n\nInfluences\n\nWhile having a lesser influence on Arabic and other languages of Mesopotamia and its core vocabulary being of Middle Persian origin, New Persian contains a considerable amount of Arabic lexical items, which were Persianized and often took a different meaning and usage than the Arabic original. Persian loanwords of Arabic origin especially include Islamic terms. The Arabic vocabulary in other Iranian, Turkic and Indic languages is generally understood to have been copied from New Persian, not from Arabic itself.John R. Perry, \"Lexical Areas and Semantic Fields of Arabic\" in Éva Ágnes Csató, Eva Agnes Csato, Bo Isaksson, Carina Jahani, Linguistic convergence and areal diffusion: case studies from Iranian, Semitic and Turkic, Routledge, 2005. pg 97: \"It is generally understood that the bulk of the Arabic vocabulary in the central, contiguous Iranian, Turkic and Indic languages was originally borrowed into literary Persian between the ninth and thirteenth centuries\"\n\nJohn R. Perry, in his article Lexical Areas and Semantic Fields of Arabic, estimates that about 24 percent of an everyday vocabulary of 20,000 words in current Persian, and more than 25 percent of the vocabulary of classical and modern Persian literature, are of Arabic origin. The text frequency of these loan words is generally lower and varies by style and topic area. It may approach 25 percent of a text in literature.John R. Perry, \"Lexical Areas and Semantic Fields of Arabic\" in Éva Ágnes Csató, Eva Agnes Csato, Bo Isaksson, Carina Jahani, Linguistic convergence and areal diffusion: case studies from Iranian, Semitic and Turkic, Routledge, 2005. p.97 Among the Arabic loan words, relatively few (14 percent) are from the semantic domain of material culture, while a larger number are from domains of intellectual and spiritual life.Perry 2005, p.99. Most of the Arabic words used in Persian are either synonyms of native terms or could be glossed in Persian.Perry 2005, p. 99.\n\nThe inclusion of Mongolian and Turkic elements in the Persian language should also be mentioned,e.g. The role of Azeri-Turkish in Iranian Persian, on which see John Perry, \"The Historical Role of Turkish in Relation to Persian of Iran\", Iran & the Caucasus, Vol. 5 (2001), pp. 193–200. not only because of the political role a succession of Turkic dynasties played in Iranian history, but also because of the immense prestige Persian language and literature enjoyed in the wider (non-Arab) Islamic world, which was often ruled by sultans and emirs with a Turkic background. The Turkish and Mongolian vocabulary in Persian is minor in comparison to that of Arabic and these words were mainly confined to military, pastoral terms and political sector (titles, administration, etc.).Xavier Planhol, \"Land of Iran\", Encyclopedia Iranica. \"The Turks, on the other hand, posed a formidable threat: their penetration into Iranian lands was considerable, to such an extent that vast regions adapted their language. This process was all the more remarkable since, in spite of their almost uninterrupted political domination for nearly 1,500 years, the cultural influence of these rough nomads on Iran's refined civilization remained extremely tenuous. This is demonstrated by the mediocre linguistic contribution, for which exhaustive statistical studies have been made (Doerfer). The number of Turkish or Mongol words that entered Persian, though not negligible, remained limited to 2,135, i.e., 3 percent of the vocabulary at the most. These new words are confined on the one hand to the military and political sector (titles, administration, etc.) and, on the other hand, to technical pastoral terms. The contrast with Arab influence is striking. While cultural pressure of the Arabs on Iran had been intense, they in no way infringed upon the entire Iranian territory, whereas with the Turks, whose contributions to Iranian civilization were modest, vast regions of Iranian lands were assimilated, notwithstanding the fact that resistance by the latter was ultimately victorious. Several reasons may be offered.\" New military and political titles were coined based partially on Middle Persian (e.g.  arteš for \"army\", instead of the Uzbek  qoʻshin;  sarlaškar;  daryābān; etc.) in the 20th century.\nPersian has likewise influenced the vocabularies of other languages, especially other Indo-European languages such as Armenian, Urdu, and (to a lesser extent) Hindi; the latter two through conquests of Persianized Central Asian Turkic and Afghan invaders; Turkic languages such as Ottoman Turkish, Chagatai, Tatar, Turkish,[http://www.azargoshnasp.net/languages/Persian/persianloanwordsistanbulturkish.pdf Andreas Tietze, Persian loanwords in Anatolian Turkish, Oriens, 20 (1967) pp- 125–168.] (accessed August 2016) Turkmen, Azeri,L. Johanson, \"Azerbaijan: Iranian Elements in Azeri Turkish\" in Encyclopedia Iranica [http://www.iranica.com/newsite/index.isc?Articlehttp://www.iranica.com/newsite/articles/unicode/v3f2/v3f2a088.html Iranica.com] Uzbek, and Karachay-Balkar; Caucasian languages such as Georgian, and to a lesser extent, Avar and Lezgin; Afro-Asiatic languages like Assyrian (List of loanwords in Assyrian Neo-Aramaic) and Arabic; and even Dravidian languages indirectly especially Telugu and Brahui; as well as Austronesian languages such as Indonesian and Malay. Persian has also had a significant lexical influence, via Turkish, on Albanian, Serbian, Croatian, Bosnian, and Serbo-Croatian, particularly as spoken in Bosnia and Herzegovina.\n\nUse of occasional foreign synonyms instead of Persian words can be a common practice in everyday communications as an alternative expression. In some instances in addition to the Persian vocabulary, the equivalent synonyms from multiple foreign languages can be used. For example, in Iranian colloquial Persian (not in Afghanistan or Tajikistan), the phrase \"thank you\" may be expressed using the French word  merci (stressed, however, on the first syllable), the hybrid Persian-Arabic phrase  motešakker am ( motešakker being \"thankful\" in Arabic, commonly pronounced motčakker in Persian, and the verb  am meaning \"I am\" in Persian), or by the pure Persian phrase  sepās-gozār am.\n\nOrthography\n\nThe vast majority of modern Iranian Persian and Dari text is written with the Arabic script. Tajiki, which is considered by some linguists to be a Persian dialect influenced by Russian and the Turkic languages of Central Asia, is written with the Cyrillic script in Tajikistan (see Tajik alphabet). There also exist several romanization systems for Persian. \n\nPersian alphabet\n\nModern Iranian Persian and Afghan Persian are written using a modified variant of the Arabic alphabet, which uses different pronunciation and additional letters not found in Arabic. After the Muslim conquest of Persia, it took approximately 150 years before Persians adopted the Arabic script in place of the older alphabet. Previously, two different scripts were used, Pahlavi, used for Middle Persian, and the Avestan alphabet (in Persian, Dīndapirak or Din Dabire—literally: religion script), used for religious purposes, primarily for the Avestan but sometimes for Middle Persian.\n\nIn the modern Persian script, historically short vowels are usually not written, only the historically long ones are represented in the text, so words distinguished from each other only by short vowels are ambiguous in writing: Western Persian ' \"worm\", ' \"generosity\", ' \"cream\", and ' \"chrome\" are all spelled ' () in Persian. The reader must determine the word from context. The Arabic system of vocalization marks known as harakat is also used in Persian, although some of the symbols have different pronunciations. For example, a ḍammah is pronounced, while in Iranian Persian it is pronounced. This system is not used in mainstream Persian literature; it is primarily used for teaching and in some (but not all) dictionaries.\n\nThere are several letters generally only used in Arabic loanwords. These letters are pronounced the same as similar Persian letters. For example, there are four functionally identical letters for (), three letters for (), two letters for (), two letters for ().\nOn the other hand, there are four letters that don't exist in Arabic .\n\nAdditions\n\nThe Persian alphabet adds four letters to the Arabic alphabet:\n\nHistorically, there was used also a special letter for the sound. This letter is used no more as the /β/-sound changed to /b/, i.e. archaic زڤان /zaβān/ > زبان /zæbɒn/ 'language'\n\nVariations\n\nThe Persian alphabet also modifies some letters of the Arabic alphabet. For example, alef with hamza below (  ) changes to alef (  ); words using various hamzas get spelled with yet another kind of hamza (so that  becomes ) even though the latter is also correct in Arabic; and teh marbuta (  ) changes to heh (  ) or teh (  ).\n\nThe letters different in shape are:\n\nLatin alphabet\n\nThe International Organization for Standardization has published a standard for simplified transliteration of Persian into Latin, ISO 233-3, titled \"Information and documentation – Transliteration of Arabic characters into Latin characters – Part 3: Persian language – Simplified transliteration\" but the transliteration scheme is not in widespread use.\n\nAnother Latin alphabet, based on the Common Turkic Alphabet, was used in Tajikistan in the 1920s and 1930s. The alphabet was phased out in favor of Cyrillic in the late 1930s.\n\nFingilish is Persian using ISO basic Latin alphabet. It is most commonly used in chat, emails and SMS applications. The orthography is not standardized, and varies among writers and even media (for example, typing 'aa' for the phoneme is easier on computer keyboards than on cellphone keyboards, resulting in smaller usage of the combination on cellphones).\n\nTajik alphabet\n\nThe Cyrillic script was introduced for writing the Tajik language under the Tajik Soviet Socialist Republic in the late 1930s, replacing the Latin alphabet that had been used since the October Revolution and the Persian script that had been used earlier. After 1939, materials published in Persian in the Persian script were banned from the country.[http://www.smallwars.quantico.usmc.mil/search/LessonsLearned/afghanistan/groundcombat.asp Smallwars.quantico.usmc.mil]\n\nExamples\n\nThe following text is from Article 1 of the Universal Declaration of Human Rights. Persian language. http://en.wikipedia.org/?curid=11600."
  }
}
