{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8799",
  "eid" : "ea903b10-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778473281,
  "textBody" : "D. B. Cooper is a media epithet popularly used to refer to an unidentified man who hijacked a Boeing 727 aircraft in the airspace between Portland, Oregon, and Seattle, Washington, on November 24, 1971. He extorted $200,000 in ransom () and parachuted to an uncertain fate. Despite an extensive manhunt and protracted FBI investigation, the perpetrator has never been located or identified. The case remains the only unsolved air piracy in commercial aviation history.\n\nAvailable evidence and a preponderance of expert opinion suggested from the beginning that Cooper probably did not survive his high-risk jump, but his remains were never recovered. The FBI nevertheless maintained an active investigation for 45 years after the hijacking. Despite a case file that grew to over 60 volumes over that time period, no definitive conclusions have been reached regarding Cooper's true identity or whereabouts. The suspect purchased his airline ticket using the alias Dan Cooper, but because of a news media miscommunication he became known in popular lore as \"D. B. Cooper\".\n\nNumerous theories of widely varying plausibility have been proposed over the years by investigators, reporters, and amateur enthusiasts. A young boy discovered a small cache of ransom bills along the banks of the Columbia River in February 1980. The find triggered renewed interest but ultimately only deepened the mystery, and the great majority of the ransom remains unrecovered.\n\nThe FBI officially suspended active investigation of the case in July 2016, but the agency continues to request that any physical evidence that might emerge related to the parachutes or the ransom money be submitted for analysis.\n\nHijacking\n\nOn Thanksgiving eve, November 24, 1971, a middle-aged man carrying a black attaché case approached the flight counter of Northwest Orient Airlines at Portland International Airport. He identified himself as \"Dan Cooper\" and used cash to purchase a one-way ticket on Flight 305, a 30-minute trip to Seattle.\n\nCooper boarded the aircraft, a Boeing 727-100 (FAA registration N467US), and took seat 18C (18E by one account,History's Greatest Unsolved Crimes. [http://www.francesfarmersrevenge.com/stuff/archive/oldnews6/crimes.htm Frances Farmer Archive]  Retrieved February 7, 2011. 15D by another) in the rear of the passenger cabin. He lit a cigaretteSmoking was permitted on commercial aircraft until 1988. and ordered a bourbon and soda. Fellow passengers described him as a man in his mid-forties, between 5 ft and 6 ft tall. He wore a black lightweight raincoat, loafers, a dark suit, a neatly pressed white collared shirt, a black necktie, and a mother of pearl tie pin.\n\nFlight 305 was approximately one-third full when it took-off on schedule at 2:50 p.m., PST.  Shortly after takeoff, Cooper handed a note to Florence Schaffner, the flight attendant situated nearest to him in a jump seat attached to the aft stair door. Schaffner assumed that the note contained a lonely businessman's phone number and dropped it unopened into her purse. Cooper leaned toward her and whispered, \"Miss, you'd better look at that note. I have a bomb.\"\n\nThe note was printed in neat, all-capital letters with a felt-tip pen.Unmasking D.B. Cooper. [http://nymag.com/nymag/features/39593/index1.html New York Magazine] retrieved June 28, 2016. Its exact wording is unknown, because Cooper later reclaimed it,D.B. Cooper. [http://www.crimemuseum.org/crime-library/d-b-cooper/ crimemuseum.org], retrieved June 28, 2016. but Schaffner recalled that the note indicated he had a bomb in his briefcase. After Schaffner read the note, Cooper directed her to sit beside him.The D.B. Cooper Mystery. [https://www.fbi.gov/news/stories/2006/november/dbcooper_112406 FBI.gov], retrieved June 28, 2016. Schaffner did as requested, then quietly asked to see the bomb. Cooper cracked open his briefcase long enough for her to glimpse eight red cylinders (\"four on top of four\") attached to wires coated with red insulation, and a large cylindrical battery.[http://n467us.com/Data%20Files/Logs%2006-20-2008R.pdf Transcript of Crew Communications] Retrieved February 25, 2011. After closing the briefcase, he dictated his demands: $200,000 in \"negotiable American currency\"; four parachutes (two primary and two reserve); and a fuel truck standing by in Seattle to refuel the aircraft upon arrival. Schaffner conveyed Cooper's instructions to the pilots in the cockpit: when she returned, he was wearing dark sunglasses.\n\nThe pilot, William Scott, contacted Seattle–Tacoma Airport air traffic control, which in turn informed local and federal authorities. The 36 other passengers were given false information that their arrival in Seattle would be delayed because of a \"minor mechanical difficulty\". Northwest Orient's president, Donald Nyrop, authorized payment of the ransom and ordered all employees to cooperate fully with the hijacker's demands. The aircraft circled Puget Sound for approximately two hours to allow Seattle police and the FBI sufficient time to assemble Cooper's parachutes and ransom money, and to mobilize emergency personnel.\n\nSchaffner recalled that Cooper appeared familiar with the local terrain; at one point he remarked, \"Looks like Tacoma down there,\" as the aircraft flew above it. He also correctly mentioned that McChord Air Force Base was only a 20-minute drive (at that time) from Seattle-Tacoma Airport. Schaffner described him as calm, polite, and well-spoken, not at all consistent with the stereotypes (enraged, hardened criminals or \"take-me-to-Cuba\" political dissidents) popularly associated with air piracy at the time. Tina Mucklow, another flight attendant, agreed. \"He wasn't nervous,\" she told investigators. \"He seemed rather nice. He was never cruel or nasty. He was thoughtful and calm all the time.\" He ordered a second bourbon and water, paid his drink tab (and attempted to give Schaffner the change), and offered to request meals for the flight crew during the stop in Seattle.\n\nFBI agents assembled the ransom money from several Seattle-area banks – 10,000 unmarked 20-dollar bills, most with serial numbers beginning with the letter \"L\" indicating issuance by the Federal Reserve Bank of San Francisco, and most from the 1963A or 1969 series – and made a microfilm photograph of each of them. Cooper rejected the military-issue parachutes offered by McChord AFB personnel, demanding instead civilian parachutes with manually operated ripcords. Seattle police obtained them from a local skydiving school.\n\nPassengers released\n\nAt 5:24 p.m. Cooper was informed that his demands had been met, and at 5:39 p.m. the aircraft landed at Seattle-Tacoma Airport. Cooper instructed Scott to taxi the jet to an isolated, brightly lit section of the tarmac and close each window shade in the cabin to deter police snipers. Northwest Orient's Seattle operations manager, Al Lee, approached the aircraft in street clothes to avoid the possibility that Cooper might mistake his airline uniform for that of a police officer. He delivered the cash-filled knapsack and parachutes to Mucklow via the aft stairs. Once the delivery was completed, Cooper ordered all passengers, Schaffner, and senior flight attendant Alice Hancock to leave the plane.\n\nDuring refueling, Cooper outlined his flight plan to the cockpit crew: a southeast course toward Mexico City at the minimum airspeed possible without stalling the aircraft – approximately 100 kn – at a maximum 10000 foot altitude. He further specified that the landing gear remain deployed in the takeoff/landing position, the wing flaps be lowered 15 degrees, and the cabin remain unpressurized.Rothenberg and Ulvaeus, p. 5. Copilot William Rataczak informed Cooper that the aircraft's range was limited to approximately 1000 mi under the specified flight configuration, which meant that a second refueling would be necessary before entering Mexico. Cooper and the crew discussed options and agreed on Reno, Nevada, as the refueling stop. With the plane's rear exit door open and its staircase extended, Cooper directed the pilot to take off. Northwest's home office objected, on grounds that it was unsafe to take off with the aft staircase deployed. Cooper countered that it was indeed safe, but he would not argue the point; he would lower it once they were airborne.\n\nAn FAA official requested a face-to-face meeting with Cooper aboard the aircraft, which was denied. The refueling process was delayed because of a vapor lock in the fuel tanker truck's pumping mechanism, and Cooper became suspicious; but he allowed a replacement tanker truck to continue the refueling – and a third after the second ran dry.\n\nBack in the air\n\nAt approximately 7:40 p.m., the Boeing 727 took off with only 5 people onboard: Cooper, pilot Scott, flight attendant Mucklow, copilot Rataczak, and flight engineer H. E. Anderson. Two F-106 fighter aircraft were scrambled from nearby McChord Air Force Base and followed behind the airliner, one above it and one below, out of Cooper's view. A Lockheed T-33 trainer, diverted from an unrelated Air National Guard mission, also shadowed the 727 before running low on fuel and turning back near the Oregon–California state line.\n\nAfter takeoff, Cooper told Mucklow to join the rest of the crew in the cockpit and remain there with the door closed. As she complied, Mucklow observed Cooper tying something around his waist. At approximately 8:00 p.m., a warning light flashed in the cockpit, indicating that the aft airstair apparatus had been activated. The crew's offer of assistance via the aircraft's intercom system was curtly refused. The crew soon noticed a subjective change of air pressure, indicating that the aft door was open.\n\nAt approximately 8:13 p.m., the aircraft's tail section sustained a sudden upward movement, significant enough to require trimming to bring the plane back to level flight.Bragg, p. 4. At approximately 10:15 p.m., Scott and Rataczak landed the 727, with the aft airstair still deployed, at Reno Airport. FBI agents, state troopers, sheriff's deputies, and Reno police surrounded the jet, as it had not yet been determined with certainty that Cooper was no longer aboard, but an armed search quickly confirmed that he was gone.\n\nInvestigation\n\nFBI agents recovered 66 unidentified latent fingerprints aboard the airliner. The agents also found Cooper's black clip-on tie and mother-of-pearl tie clip and two of the four parachutes, one of which had been opened and two shroud lines cut from its canopy. Authorities interviewed eyewitnesses in Portland, Seattle, and Reno, and all those who personally interacted with Cooper. A series of composite sketches was developed.[https://vault.fbi.gov/D-B-Cooper%20/D-B-Cooper-Part-7-of-7/view FBI FOIA file part 1], from [https://vault.fbi.gov/D-B-Cooper%20/ FBI FOIA catalogue on the Dan Cooper case], also see the actual FBI poster.\n\nLocal police and FBI agents immediately began questioning possible suspects. An Oregon man named D. B. Cooper who had a minor police record was one of the first persons of interest in the case. He was contacted by Portland police on the off-chance that the hijacker had used his real name or the same alias in a previous crime. He was quickly ruled out as a suspect, but a local reporter named James Long, rushing to meet an imminent deadline, confused the eliminated suspect's name with the pseudonym used by the hijacker.Browning, W. (July 22, 2016). One mystery solved in 'D.B. Cooper' skyjacking fiasco. [http://www.cjr.org/the_feature/db_cooper_mystery_solved.php Columbia Journalism Review], retrieved July 29, 2016.D B Cooper was not really D B Cooper? [http://indiatoday.intoday.in/story/d-b-cooper-was-not-really-d-b-cooper-a-journalist-added-swagger-to-mysterious-hijackers-legacy/1/726575.html India Today], retrieved July 29, 2016. A wire service reporter (Clyde Jabin of UPI by most accounts,Guzman, Monica (November 27, 2007). Update: Everyone wants a piece of the D. B. Cooper legend. [http://blog.seattlepi.com/thebigblog/2007/11/27/update-everyone-wants-a-piece-of-the-d-b-cooper-legend/ Seattle Post-Intelligencer archive] Retrieved February 25, 2011. Joe Frazier of AP by others) republished the error, followed by numerous other media sources; the moniker \"D. B. Cooper\" became lodged in the public's collective memory.\n\nA precise search area was difficult to define, as even small differences in estimates of the aircraft's speed, or the environmental conditions along the flight path (which varied significantly by location and altitude), changed Cooper's projected landing point considerably. An important variable was the length of time he remained in free fall before pulling his ripcord—if indeed he succeeded in opening a parachute at all. Neither of the Air Force fighter pilots saw anything exit the airliner, either visually or on radar, nor did they see a parachute open; but at night, with extremely limited visibility and cloud cover obscuring any ground lighting below, an airborne human figure clad entirely in black clothing could easily have gone undetected. The T-33 pilots never made visual contact with the 727 at all.\n\nIn order to conduct an experimental re-creation, Scott piloted the aircraft used in the hijacking in the same flight configuration. FBI agents, pushing a 200 lb sled out of the open airstair, were able to reproduce the upward motion of the tail section described by the flight crew at 8:13 p.m. Based on this experiment, it was concluded that 8:13 p.m. was the most likely jump time. At that moment the aircraft was flying through a heavy rainstorm over the Lewis River in southwestern Washington.\n\nInitial extrapolations placed Cooper's landing zone within an area on the southernmost outreach of Mount St. Helens, a few miles southeast of Ariel, Washington, near Lake Merwin, an artificial lake formed by a dam on the Lewis River.  Search efforts focused on Clark and Cowlitz Counties, encompassing the terrain immediately south and north, respectively, of the Lewis River in southwest Washington.[http://n467us.com/Data%20Files/Seamless%20Hot%20Zone%20North.jpg Topographic map, northern half of primary search area] Retrieved February 25, 2011.[http://n467us.com/Data%20Files/Seamless%20Hot%20Zone%20South.jpg Topographic map, southern half of primary search area] Retrieved February 25, 2011. FBI agents and Sheriff's deputies from those counties searched large areas of the mountainous wilderness on foot and by helicopter. Door-to-door searches of local farmhouses were also carried out. Other search parties ran patrol boats along Lake Merwin and Yale Lake, the reservoir immediately to its east. No trace of Cooper, nor any of the equipment presumed to have left the aircraft with him, was found.\n\nThe FBI also coordinated an aerial search, using fixed-wing aircraft and helicopters from the Oregon Army National Guard, along the entire flight path (known as Victor 23 in standard aviation terminology but \"Vector 23\" in most Cooper  from Seattle to Reno. While numerous broken treetops and several pieces of plastic and other objects resembling parachute canopies were sighted and investigated, nothing relevant to the hijacking was found.\n\nShortly after the spring thaw in early 1972, teams of FBI agents aided by some 200 Army soldiers from Fort Lewis, along with Air Force personnel, National Guardsmen, and civilian volunteers, conducted another thorough ground search of Clark and Cowlitz Counties for 18 days in March, and then an additional 18 days in April. Electronic Explorations Company, a marine salvage firm, used a submarine to search the 200 ft depths of Lake Merwin. Two local women stumbled upon a skeleton in an abandoned structure in Clark County; it was later identified as the remains of a female teenager who had been abducted and murdered several weeks before. Ultimately, the search operation—arguably the most extensive, and intensive, in U.S. history—uncovered no significant material evidence related to the hijacking.\n\nLater developments\n\nSubsequent analyses indicated that the original landing zone estimate was inaccurate: Scott, who was flying the aircraft manually because of Cooper's speed and altitude demands, later determined that his flight path was significantly farther east than initially assumed. Additional data from a variety of sources—in particular Continental Airlines pilot Tom Bohan, who was flying four minutes behind Flight 305—indicated that the wind direction factored into drop zone calculations had been wrong, possibly by as much as 80 degrees. This and other supplemental data suggested that the actual drop zone was probably south-southeast of the original estimate, in the drainage area of the Washougal River.\n\nRetired FBI chief investigator Ralph Himmelsbach wrote in his 1986 book, \"I have to confess, if I [were] going to look for Cooper, I would head for the Washougal.\" The Washougal Valley and its surroundings have been searched repeatedly by private individuals and groups in subsequent years; to date, no discoveries directly traceable to the hijacking have been reported. Some investigators have speculated that the 1980 eruption of Mount St. Helens may have obliterated any remaining physical clues.Connolly, P. (November 24, 1981). D.B. Cooper: A stupid rascal. [https://news.google.com/newspapers?nid\n1298&dat19811124&id\nIfpNAAAAIBAJ&sjiddosDAAAAIBAJ&pg\n6868,4075230&hl=en The Free Lance-Star], retrieved June 29, 2016.\n\nSearch for ransom money\n\nA month after the hijacking, the FBI distributed lists of the ransom serial numbers to financial institutions, casinos, race tracks, and other businesses that routinely conducted significant cash transactions, and to law enforcement agencies around the world. Northwest Orient offered a reward of 15% of the recovered money, to a maximum of $25,000. In early 1972 U.S. Attorney General John Mitchell released the serial numbers to the general public. In 1972 two men used counterfeit 20-dollar bills printed with Cooper serial numbers to swindle $30,000 from a Newsweek reporter named Karl Fleming in exchange for an interview with a man they falsely claimed was the hijacker.[https://vault.fbi.gov/D-B-Cooper%20/D-B-Cooper-Part-1-of-7/view FBI files on Fleming case, released via Freedom of Information Act] Retrieved February 15, 2011.\n\nIn early 1973, with the ransom money still missing, The Oregon Journal republished the serial numbers and offered $1,000 to the first person to turn in a ransom bill to the newspaper or any FBI field office. In Seattle, the Post-Intelligencer made a similar offer with a $5,000 reward. The offers remained in effect until Thanksgiving 1974, and though there were several near-matches, no genuine bills were found. In 1975 Northwest Orient's insurer, Global Indemnity Co., complied with an order from the Minnesota Supreme Court and paid the airline's $180,000 claim on the ransom money.\n\nStatute of limitations\n\nIn 1976, discussion arose over impending expiration of the statute of limitations on the hijacking. Most published legal analyses agreed that it would make little difference,Frazier, Joe (November 13, 1976): \"Sky Thief: Bandit Who Stole $200,000 in 1971 Still Being Sought\"  Pittsburgh Post-Gazette, p. B-1. Retrieved March 3, 2013 as interpretation of the statute varies considerably from case to case and court to court, and a prosecutor could argue that Cooper had forfeited immunity on any of several valid technical grounds.CRS Report for Congress: Statutes of Limitation in Federal Criminal Cases: An Overview. [https://fas.org/sgp/crs/misc/RL31253.pdf FAS.org] Retrieved March 6, 2011. The question was rendered irrelevant in November when a Portland grand jury returned an indictment in absentia against \"John Doe, aka Dan Cooper\" for air piracy and violation of the Hobbs Act.Denson, Bryan (November 24, 1996). D.B. Cooper legend lives. [http://www.oregonlive.com/special/current/dbcooper.ssf?/special/current/dbcooper_story1.frame Oregon Live archive] Retrieved March 6, 2011. The indictment formally initiated prosecution that can be continued, should the hijacker be apprehended, at any time in the future.\n\nPhysical evidence\n\nIn 1978, a placard printed with instructions for lowering the aft stairs of a 727 was found by a deer hunter near a logging road about 13 mi east of Castle Rock, Washington, well north of Lake Merwin, but within Flight 305's basic flight path.\n\nIn February 1980, eight-year-old Brian Ingram was vacationing with his family on the Columbia River at a beachfront known as Tina (or Tena) Bar, about 9 mi downstream from Vancouver, Washington and 20 mi southwest of Ariel. The child uncovered three packets of the ransom cash as he raked the sandy riverbank to build a campfire. The bills were significantly disintegrated, but still bundled in rubber bands.Orzano, M (July 21, 2014). D.B. Cooper skyjacking: 8-year-old Washington boy first to unearth ransom notes from 1971 incident. [http://www.coinworld.com/insights/1971-skyjacking-cash-ransom-found-by-eight-year-old-in-1980.all.html coinworld.com], retrieved August 29, 2015. FBI technicians confirmed that the money was indeed a portion of the ransom—two packets of 100 twenty-dollar bills each, and a third packet of 90, all arranged in the same order as when given to Cooper.Associated Press (May 22, 1986). Boy to Split $5,520 of D. B. Cooper's Loot. [http://articles.latimes.com/1986-05-22/news/mn-6995_1 LA Times archive] Retrieved March 6, 2011.\n\nThe discovery launched several new rounds of conjecture and ultimately raised more questions than it answered. Initial statements by investigators and scientific consultants were founded on the assumption that the bundled bills washed freely into the Columbia River from one of its many connecting tributaries. An Army Corps of Engineers hydrologist noted that the bills had disintegrated in a \"rounded\" fashion and were matted together, indicating that they had been deposited by river action, as opposed to having been deliberately buried. That conclusion, if correct, supported the opinion that Cooper had not landed near Lake Merwin nor any tributary of the Lewis River, which feeds into the Columbia well downstream from Tina Bar. It also lent credence to supplemental speculation (see Later developments above) that placed the drop zone near the Washougal River, which merges with the Columbia upstream from the discovery site.\n\nBut the \"free floating\" hypothesis presented its own difficulties; it did not explain the ten bills missing from one packet, nor was there a logical reason that the three packets would have remained together after separating from the rest of the money. Physical evidence was incompatible with geologic evidence: Himmelsbach observed that free-floating bundles would have had to wash up on the bank \"within a couple of years\" of the hijacking; otherwise the rubber bands would have long since deteriorated, an observation confirmed experimentally by the Cooper Research Team (see #Subsequent FBI disclosures below).[http://www.citizensleuths.com/conclusions.html Research Conclusions: Cooper Research Team web site] .  Retrieved August 28, 2014. Geological evidence suggested that the bills arrived at Tina Bar well after 1974, the year of a Corps of Engineers dredging operation on that stretch of the river. Geologist Leonard Palmer of Portland State University found two distinct layers of sand and sediment between the clay deposited on the riverbank by the dredge and the sand layer in which the bills were buried, indicating that the bills arrived long after dredging had been completed. The Cooper Research Team later challenged Palmer's conclusion, citing evidence that the clay layer was a natural deposit. That finding, if true, favors an arrival time of less than one year after the event (based on the rubber band experiment), but does not help to explain how the bundles got to Tina Bar, nor from where they came.[http://www.citizensleuths.com/palmer-report.html Palmer Report: Cooper Research Team web site]. Retrieved May 9, 2015.\n\nAlternative theories were advanced. Some surmised that the money had been found at a distant location by someone (or possibly even a wild animal), carried to the riverbank, and reburied there. The sheriff of Cowlitz County proposed that Cooper accidentally dropped a few bundles on the airstair, which then blew off the aircraft and fell into the Columbia River. One local newspaper editor theorized that Cooper, knowing he could never spend the money, dumped it in the river, or buried portions of it at Tina Bar (and possibly elsewhere) himself. No hypothesis offered to date satisfactorily explains all of the existing evidence.\n\nIn 1981, a human skull was unearthed along the same stretch of riverbank during excavations in search of additional evidence. Forensic pathologists eventually determined that it belonged to a woman, possibly of Native American ancestry.\n\nIn 1986, after protracted negotiations, the recovered bills were divided equally between Ingram and Northwest Orient's insurer; the FBI retained 14 examples as evidence.D.B. Cooper: A Timeline (October 2007) [http://nymag.com/news/features/39617/ New York Magazine Archives] Retrieved February 10, 2011.Six Years Later Brian Ingram Gets a Piece of D.B. Cooper's Hijack Haul (June 23, 1986). [http://www.people.com/people/archive/article/0,,20093930,00.html People Magazine archive] Retrieved February 28, 2011. Ingram sold fifteen of his bills at auction in 2008 for about $37,000. To date, none of the 9,710 remaining bills have turned up anywhere in the world. Their serial numbers remain available online for public search.\n\nIn 1988, a piece of  material from a parachute was raised from the river bottom near Tina Bar, but FBI experts determined that it had come from a military drogue parachute. In 2008, children unearthed another parachute near Amboy, Washington, about 6 mi due south of Lake Merwin, which proved to be of World War II-era military origin.McNerthney, Casey (April 2, 2008): Suspected D.B. Cooper parachute may actually be from '45 military crash. [http://www.seattlepi.com/local/357259_parachute02.html seattlepi.com]. Retrieved January 7, 2011. The Columbia River ransom money and the airstair instruction placard remain the only bona fide physical evidence from the hijacking ever found outside the aircraft.\n\nIn 2017, a group of volunteer investigators uncovered what they believe to be “potential evidence, what appears to be a decades-old parachute strap\" in the Pacific Northwest.  This was followed later in August 2017 with a piece of foam, suspected of being part of Cooper's backpack.http://www.nydailynews.com/news/crime/new-potential-evidence-emerges-b-cooper-hijacking-case-article-1.3426633\n\nSubsequent FBI disclosures\n\nIn late 2007, the FBI announced that a partial DNA profile had been obtained from three organic samples found on the hijacker's clip-on tie in 2001, though they later acknowledged that there is no evidence that the hijacker was the source of the sample material. \"The tie had two small DNA samples, and one large sample,\" said Special Agent Fred Gutt. \"It's difficult to draw firm conclusions from these samples.\"Cloherty, Jack (August 9, 2011): D.B. Cooper DNA Results: \"Not A Match\". [http://abcnews.go.com/US/db-cooper-dna-results-match/story?id14258726 ABCNews.com] Retrieved August 9, 2011 The bureau also made public a file of previously unreleased evidence, including Cooper's 1971 plane ticket from Portland to Seattle (price: $20.00, paid in cash), and posted previously unreleased composite sketches and fact sheets, along with a request to the general public for information which might lead to Cooper's positive identification.\n\nThey also disclosed that Cooper chose the older of the two primary parachutes supplied to him, rather than the technically superior professional sport parachute; and that from the two reserve parachutes, he selected a \"dummy\"—an unusable unit with an inoperative ripcord intended for classroom demonstrations, although it had clear markings identifying it to any experienced skydiver as non-functional. (He cannibalized the other, functional reserve parachute, possibly using its shrouds to tie the money bag shut, and to secure the bag to his body as witnessed by Mucklow) The FBI stressed that inclusion of the dummy reserve parachute, one of four obtained in haste from a Seattle skydiving school, was accidental.\n\nIn March 2009, the FBI disclosed that Tom Kaye, a paleontologist from the Burke Museum of Natural History and Culture in Seattle, had assembled a team of \"citizen sleuths\", including scientific illustrator Carol Abraczinskas and metallurgist Alan Stone. The group, eventually known as the Cooper Research Team, reinvestigated important components of the case using GPS, satellite imagery, and other technologies unavailable in 1971. While little new information was gained regarding the buried ransom money or Cooper's landing zone, they were able to find and analyze hundreds of minute particles on Cooper's tie using electron microscopy. Lycopodium spores (likely from a pharmaceutical product) were identified, as well as fragments of bismuth and aluminum.\n\nIn November 2011, Kaye announced that particles of pure (unalloyed) titanium had also been found on the tie. He explained that titanium, which was much rarer in the 1970s than it is today, was at that time found only in metal fabrication or production facilities, or at chemical companies using it (combined with aluminum) to store extremely corrosive substances.Ingalls C (November 23, 2011): \"40 years later, new evidence unveiled in DB Cooper case\".  [http://www.king5.com/news/investigators/40-years-after-the-crime-new-evidence-unveiled-in-DB-Cooper-case-134417003.html King5.com archive] . Retrieved May 29, 2013 The findings suggested that Cooper may have been a chemist or a metallurgist, or possibly an engineer or manager (the only employees who wore ties in such facilities at that time) in a metal or chemical manufacturing plant,Johnson, Gene (AP) (November 23, 2011). 40 years later, DB Cooper's identity a mystery. [http://www.kgw.com/news/local/40-years-later-DB-Coopers-identity-a-mystery--134407308.html KGW.com, Portland, OR] Retrieved November 23, 2011  or at a company that recovered scrap metal from those types of factories. In January 2017, Kaye reported that rare earth minerals such as cerium and strontium sulfide had also been identified among particles from the tie. One of the rare applications for such elements in the 1970s was Boeing's supersonic transport development project, suggesting the possibility that Cooper was a Boeing employee.[https://www.usatoday.com/story/news/nation-now/2017/01/13/scientists-say-they-may-have-new-evidence-db-cooper-case/96575858/ Scientists say they may have new evidence in D.B. Cooper case]. USA Today (January 13, 2017), retrieved January 16, 2017.[http://www.king5.com/news/crime/new-evidence-was-db-cooper-boeing-employee/385924766 New evidence: Was DB Cooper a Boeing employee?] King5.com, retrieved January 16, 2017. Other possible sources of the material included plants that manufactured cathode ray tubes, such as the Portland firms Teledyne and Tektronix.\n\nTheories and conjectures\n\nOver the 45-year span of its active investigation, the FBI periodically made public some of its working hypotheses and tentative conclusions, drawn from witness testimony and the scarce physical evidence.\n\nThe official physical description remained unchanged, and is considered reliable. Flight attendants Schaffner and Mucklow, who spent the most time with Cooper, were interviewed on the same night in separate cities, and gave nearly identical descriptions: 5 ft to 6 ft tall, 170 to, mid-40s, with close-set piercing brown eyes and swarthy skin.\n\nCooper appeared to be familiar with the Seattle area and may have been an Air Force veteran, based on testimony that he recognized the city of Tacoma from the air as the jet circled Puget Sound, and his accurate comment to Mucklow that McChord Air Force Base was approximately 20 minutes' driving time from the Seattle-Tacoma Airport—a detail most civilians would not know, or comment upon. His financial situation was very likely desperate, as extortionists and other criminals who steal large amounts of money nearly always do so, according to experts, because they need it urgently; otherwise, the crime is not worth the considerable risk. (A minority opinion is that Cooper was \"a thrill seeker\" who made the jump \"just to prove it could be done.\")\n\nAgents theorized that he took his alias from a popular Belgian comic book series of the 1970s featuring the fictional hero Dan Cooper, a Royal Canadian Air Force test pilot who took part in numerous heroic adventures, including parachuting. (One cover from the series, reproduced on the FBI web site, depicts test pilot Cooper skydiving in full paratrooper regalia.) Because the Dan Cooper comics were never translated into English, nor imported to the US, they speculated that he may have encountered them during a tour of duty in Europe. Tom Kaye's Cooper Research Team (see Ongoing investigation) suggested the alternative possibility that Cooper was Canadian, and found the comics in Canada, where they were also sold.Boswell, Randy (November 24, 2011). FBI-backed team finds Canadian link to famous '70s plane hijacking [http://news.nationalpost.com/2011/11/24/fbi-backed-team-finds-canadian-link-to-famous-60s-era-plane-hijacking/ Canadian National Post archive] Retrieved December 5, 2011 They noted his specific demand for \"negotiable American currency\", a phrase seldom if ever used by American citizens; since witnesses stated that Cooper had no distinguishable accent, Canada would be his most likely country of origin if he were not a US citizen.Research Summary. [http://www.citizensleuths.com/conclusions.html Cooper Research Team web site]  Retrieved December 7, 2011\n\nEvidence suggested that Cooper was knowledgeable about technique, aircraft, and the terrain. He demanded four parachutes to force the assumption that he might compel one or more hostages to jump with him, thus ensuring he would not be deliberately supplied with sabotaged equipment. He chose a 727-100 aircraft because it was ideal for a bail-out escape, due not only to its aft airstair but also the high, aftward placement of all three engines, which allowed a reasonably safe jump without risk of immediate incineration by jet exhaust. It had \"single-point fueling\" capability, a recent innovation that allowed all tanks to be refueled rapidly through a single fuel port. It also had the ability (unusual for a commercial jet airliner) to remain in slow, low-altitude flight without stalling; and Cooper knew how to control its air speed and altitude without entering the cockpit, where he could have been overpowered by the three pilots. In addition, Cooper was familiar with important details, such as the appropriate flap setting of 15 degrees (which was unique to that aircraft), and the typical refueling time. He knew that the aft airstair could be lowered during flight—a fact never disclosed to civilian flight crews, since there was no situation on a passenger flight that would make it necessary—and that its operation, by a single switch in the rear of the cabin, could not be overridden from the cockpit. Some of this knowledge was virtually unique to Central Intelligence Agency paramilitary units.\n\nAccording to Kaye's research team, Cooper's meticulous planning may also have extended to the timing of his operation, and even his choice of attire. \"The FBI searched but couldn't find anyone who disappeared that weekend,\" Kaye wrote, suggesting that the perpetrator may have returned to his normal occupation. \"If you were planning on going 'back to work on Monday', then you would need as much time as possible to get out of the woods, find transportation and get home. The very best time for this is in front of a four-day weekend, which is the timing Dan Cooper chose for his crime.\" Furthermore, \"if he was planning ahead, he knew he had to hitchhike out of the woods, and it is much easier to get picked up in a suit and tie than in old blue jeans.\"\n\nCooper adopted careful planning and attention to detail, but the bureau felt strongly that he lacked crucial skydiving skills and experience. \"We originally thought Cooper was an experienced jumper, perhaps even a paratrooper,\" said Special Agent Larry Carr, leader of the investigative team from 2006 until its dissolution in 2016. \"We concluded after a few years this was simply not true. No experienced parachutist would have jumped in the pitch-black night, in the rain, with a 200-mile-an-hour wind in his face, wearing loafers and a trench coat. It was simply too risky. He also missed that his reserve 'chute was only for training, and had been sewn shut—something a skilled skydiver would have checked.\" He also failed to bring or request a helmet, chose to jump with the older and technically inferior of the two primary parachutes supplied to him, and jumped into a  wind chill without proper protection against the extreme cold.In Search of D.B. Cooper: New Developments in the Unsolved Case (March 17, 2009). [https://archives.fbi.gov/archives/news/stories/2009/march/in-search-of-d.b.-cooper/dbcooper_031709 FBI.gov] Retrieved November 9, 2016.\n\nThe FBI speculated from the beginning that Cooper did not survive his jump. \"Diving into the wilderness without a plan, without the right equipment, in such terrible conditions, he probably never even got his 'chute open,\" said Carr. Even if he did land safely, agents contended that survival in the mountainous terrain at the onset of winter would have been all but impossible without an accomplice at a predetermined landing point. This would have required a precisely timed jump—necessitating, in turn, cooperation from the flight crew. There is no evidence that Cooper requested or received any such help from the crew, nor that he had any clear idea where he was when he jumped into the stormy, overcast darkness.\"It's an Enigma.\" [http://www.jcs-group.com/enigma/crimes/cooper.html JCS-Group.com] Recovered January 31, 2011.\n\nSpeculation over motive\n\nIn addition to planning his escape, Cooper retrieved the note and wore dark glasses, which indicated that he had a certain level of sophistication in avoiding the things that had aided the identification of the perpetrator of the best-known case of a ransom: the Lindbergh kidnapping. It is not clear how he could have reasonably expected to ever spend the money, fence it at a discount or otherwise profit. While Cooper made the familiar-from-fiction demand of  non-sequentially numbered small bills,  mass publicity over the Lindbergh kidnapping had long made it public knowledge that even with thirties technology, getting non-sequential bills in a ransom was no defense against the numbers being logged and used to track down a perpetrator. In the Lindbergh case, fencing what he could as hot money and being very careful with what he did personally pass, the perpetrator had been caught through the  ransom money nonetheless, with identification and handwriting evidence only brought in at the trial. Acamstoday, The Lindbergh Case: How Bankers Helped Solve It http://www.acamstoday.org/the-lindberg-case-how-banker-helped-solve-it/  \n\nAlthough unconscionably perilous by the high safety, training and equipment standards of skydivers, whether Cooper's jump was virtually suicidal is a matter of dispute. The author of an overview and  comparison of World War II aircrew bail-outs with Cooper's drop asserts a probability for his survival, and suggests that like copycat Martin McNally, Cooper lost the ransom during descent. The mystery of how the ransom could have been washed into Tena Bar from any Cooper jump area remains.Survival Probability Analysis of the D.B. Cooper Hijacking, using Historical Parachuting Data, December 1, 2014, Martin Andrade Jr, MBA, https://martinandrade.files.wordpress.com/2014/12/dbcooperfinalupdated.pdf The Tena Bar find anomalies led one local journalist to suggest Cooper, knowing that he could never spend it, dumped the ransom.\n\nInvestigation suspended\n\nOn July 8, 2016, the FBI announced that it was suspending active investigation of the Cooper case, citing a need to focus its investigative resources and manpower on issues of higher and more urgent priority. Local field offices will continue to accept any legitimate physical evidence—related specifically to the parachutes or the ransom money—that may emerge in the future. The 60-volume case file compiled over the 45-year course of the investigation will be preserved for historical purposes at FBI headquarters in Washington, D.C.\n\nCopycat hijackings\n\nCooper was not the first to attempt air piracy for personal gain. In early November 1971, for example, a Canadian man named Paul Joseph Cini hijacked an Air Canada DC-8 over Montana, but was overpowered by the crew when he put down his shotgun to strap on the parachute he had brought with him.Koerner, B (June 14, 2013). Paul Joseph Cini. [http://www.slate.com/articles/life/history/features/2013/skyjacker_of_the_day/paul_joseph_cini_hijacked_a_plane_because_he_had_an_idea_parachuting.html Slate.com archive], retrieved September 4, 2015. Cooper's apparent success inspired a flurry of imitators, mostly during 1972. Some notable examples:\n\n* Garrett Brock Trapnell hijacked a TWA airliner en route from Los Angeles to New York City in January. He demanded $306,800 in cash, the release of Angela Davis, and an audience with President Richard Nixon. After the aircraft landed at John F. Kennedy International Airport, he was shot and wounded by FBI agents, then arrested.Killen, Andreas (January 15, 2005). The First Hijackers. [https://www.nytimes.com/2005/01/16/magazine/16HIJACKERS.html?pagewanted=print&position New York Times Archive.] Retrieved June 29, 2011.\n* Richard Charles LaPoint, an Army veteran and \"New England beach bum\", boarded Hughes Airwest Flight 800 at McCarran airport in Las Vegas on January 20. Brandishing what he claimed was a bomb while the DC-9 was on the taxiway, he demanded $50,000, two parachutes, and a helmet. After releasing the passengers and two flight attendants, he ordered the plane on an eastward trajectory toward Denver, then bailed out over the treeless plains of northeastern Colorado. Authorities, tracking the locator-equipped parachute and his footprints in the snow and mud, apprehended him a few hours later. \n* Richard McCoy, Jr., a former Army Green Beret,Skyjacker – The Richard McCoy Jr. Story (March 2, 2011). [http://parachutistonline.com/feature/skyjacker—-richard-mccoy-jr-story ParachutistOnLine.com] Retrieved February 25, 2013. hijacked a United Airlines 727-100 in April after it left Denver, Colorado, diverted it to San Francisco, then bailed out over Utah with $500,000 in ransom money. He landed safely, but was arrested two days later.Richard Floyd McCoy, Jr. – aircraft hijacking. [https://www.fbi.gov/about-us/history/famous-cases/richard-floyd-mccoy – FBI.gov]  Retrieved March 8, 2011.\n* Frederick Hahneman used a handgun to hijack an Eastern Air Lines 727 in Allentown, Pennsylvania, in May, demanded $303,000, and eventually parachuted into Honduras, his country of birth. A month later, with the FBI in pursuit and a $25,000 bounty on his head, he surrendered at the American Embassy in Tegucigalpa.Whelan, Frank (June 30, 1985): \"A-B-E Hijacker Who Parachuted into Jungle Is Free From Prison Air Piracy\" [http://articles.mcall.com/1985-06-30/news/2464617_1_hijacking-eastern-airlines-night-clerk Morning Call Archive] Retrieved August 3, 2011.Lehigh Valley International Airport began as airmail stop (September 3, 2010). [http://lehighvalleyhistory.blogspot.com/2010_09_01_archive.html Lehigh Valley History] Retrieved March 8, 2011.\n* Robb Dolin Heady, a paratrooper and Vietnam veteran, stormed a United Airlines 727 in Reno in early June, extorted $200,000 and two parachutes, and jumped into darkness near Washoe Lake, about 25 mi south of Reno. Police found Heady's car (sporting a United States Parachute Association bumper sticker) parked near the lake and arrested him as he returned to it the next morning.Heady, 22, Night jump, Reno, $200k, Vietnam vet, gun, sticker, caught immediately (August 1, 2008). [http://www.dropzone.com/cgi-bin/forum/gforum.cgi?post3286950 Dropzone.com] Retrieved March 8, 2011.Photo of Heady's arrest (June 3, 1972). [http://www.dropzone.com/cgi-bin/forum/gforum.cgi?do\npost_attachment;postatt_id101982;guest\n77543628 Dropzone.com] Retrieved March 8, 2011.\n* Martin McNally, an unemployed service-station attendant, used a submachine gun in late June to commandeer an American Airlines 727 en route from St. Louis to Tulsa, then diverted it eastward to Indiana and bailed out with $500,000 in ransom. McNally lost the ransom money as he exited the aircraft, but landed safely near Peru, Indiana, and was apprehended a few days later in a Detroit suburb.Curtis, Gene (July 8, 2007). Only in Oklahoma: Skyjacker nabs Tulsa plane in error-filled romp. [http://www.tulsaworld.com/webextra/itemsofinterest/centennial/centennial_storypage.asp?ID=070729_1_A4_spanc01672 TulsaWorld.com archive] Retrieved March 8, 2011.\n\nIn all, 15 hijackings similar to Cooper's—all unsuccessful—were attempted in 1972. With the advent of universal luggage searches in 1973 (see Airport security), the general incidence of hijackings dropped precipitously. There were no further notable Cooper imitators until July 11, 1980, when Glenn K. Tripp seized Northwest flight 608 at Seattle-Tacoma Airport, demanding $600,000 ($100,000 by an independent account),Codename: Norjak The Skyjacking of Northwest Flight 305. [http://www.check-six.com/Crash_Sites/NWA305-DBCooper.htm Check-Six.com] Retrieved March 4, 2013. two parachutes, and the assassination of his boss. After a 10-hour standoff, he was apprehended, but on January 21, 1983—while still on probation—he hijacked the same Northwest flight, this time en route, and demanded to be flown to Afghanistan. When the plane landed in Portland, he was shot and killed by FBI agents.Mickolus, E.F. and Simmons, S.L. (January 12, 2011): The Terrorist List. Westport, CT: Praeger Publishers, p. 273. . Retrieved March 4, 2013.\n\nSuspects\n\nBetween 1971 and 2016, the FBI processed over a thousand \"serious suspects\", which included assorted publicity seekers and deathbed confessors. While none of the suspects satisfied the bureau's standard of \"beyond a reasonable doubt\", a handful of men—and one woman—continued to be treated as suspects by various private individuals and groups. The decision to retain the suspects was based on varying amounts of evidence, both real and imagined. Some notable examples:\n\nTed Mayfield\n\nTheodore E. Mayfield was an Army Special Forces veteran, pilot, competitive skydiver, and skydiving instructor who served time in 1994 for negligent homicide after two of his students died when their parachutes failed to open.Skydiving Operator Faces Charges Over Deaths of 2 Jumpers (February 13, 1995). [http://community.seattletimes.nwsource.com/archive/?date19950213&slug\n2104806 Seattle Times archive]. Retrieved October 10, 2012  Later, he was found indirectly responsible for 13 additional skydiving deaths due to faulty equipment and training.  His criminal record also included armed robbery and transportation of stolen aircraft.  In 2010, he was sentenced to three years' probation for piloting a plane 26 years after losing his pilot's license and rigging certificates.McCowan, Karen (January 20, 2010). Illegal flight lands pilot in trouble once again. [http://special.registerguard.com/csp/cms/sites/web/news/cityregion/24367930-41/mayfield-faa-1994-eugene-license.csp Register-Guard archive] Retrieved February 24, 2011. He was suggested repeatedly as a suspect early in the investigation, according to FBI Agent Ralph Himmelsbach, who knew Mayfield from a prior dispute at a local airport. He was ruled out, based partly on the fact that he called Himmelsbach less than two hours after Flight 305 landed in Reno to volunteer advice on standard skydiving practices and possible landing zones.\n\nIn 2006, two amateur researchers named Daniel Dvorak and Matthew Myers proposed Mayfield as a suspect once again, asserting that they had assembled a convincing circumstantial case that would be detailed in a forthcoming book. Retrieved February 24, 2011.  They theorized that Mayfield called Himmelsbach not to offer advice, but to establish an alibi; and they challenged Himmelsbach's conclusion that Mayfield could not possibly have found a phone in time to call the FBI less than four hours after jumping into the wilderness at night. Mayfield denied any involvement, and repeated a previous assertion that the FBI called him five times while the hijacking was still in progress to ask about parachutes, local skydivers, and skydiving techniques. (Himmelsbach said the FBI never called Mayfield.)  Mayfield further charged that Dvorak and Myers asked him to play along with their theory, and \"we'll all make a lot of money\". (Dvorak and Myers called any inference of collusion a \"blatant lie\".)\n\nDvorak died in 2007, and the promised book was never published. The FBI offered no comment beyond Himmelsbach's original statement that Mayfield, who died in 2015,Smith, BA (August 15, 2015). DB Cooper suspect, Ted Mayfield, killed in aviation accident. [http://themountainnewswa.net/2015/08/30/db-cooper-suspect-ted-mayfield-killed-in-aviation-accident/ The Mountain News], retrieved October 4, 2015. was ruled out as a suspect early on.\n\nJack Coffelt\n\nCoffelt was a conman, ex-convict, and purported government informant who claimed to have been the chauffeur and confidante of Abraham Lincoln's last undisputed descendant, great-grandson Robert Todd Lincoln Beckwith. In 1972 he began claiming he was D.B. Cooper, and attempted through an intermediary, a former cellmate named James Brown, to sell his story to a Hollywood production company. He said he landed near Mount Hood, about 50 mi southeast of Ariel, injuring himself and losing the ransom money in the process. Photos of Coffelt bear a resemblance to the composite drawings, although he was in his mid-fifties in 1971. He was reportedly in Portland on the day of the hijacking, and sustained leg injuries around that time which were consistent with a skydiving mishap.\n\nCoffelt's account was reviewed by the FBI, which concluded that it differed in significant details from information that had not been made public, and was therefore a fabrication. Brown, undeterred, continued peddling the story long after Coffelt died in 1975. Multiple media venues, including the television news program 60 Minutes, considered and rejected it. In a 2008 book about Lincoln's descendants,Lachman, Charles (2008). The Last Lincolns: The Rise & Fall of a Great American Family. Union Square Press. . author Charles Lachman revisited Coffelt's tale although it had been discredited 36 years before.\n\nRichard Floyd McCoy Jr.\n\nMcCoy was an Army veteran who served two tours of duty in Vietnam, first as a demolition expert, and later, with the Green Berets, as a helicopter pilot. After his military service he became a warrant officer in the Utah National Guard and an avid recreational skydiver, with aspirations, he said, of becoming a Utah State Trooper.\n\nOn April 7, 1972 McCoy staged the best-known of the so-called \"copycat\" hijackings (see above). He boarded United Airlines' Flight 855 (a Boeing 727 with aft stairs) in Denver, and brandishing what later proved to be a paperweight resembling a hand grenade and an unloaded handgun, he demanded four parachutes and $500,000. After delivery of the money and parachutes at San Francisco International Airport, McCoy ordered the aircraft back into the sky and bailed out over Provo, Utah, leaving behind his handwritten hijacking instructions and his fingerprints on a magazine he had been reading.Famous Cases & Criminals. [https://www.fbi.gov/about-us/history/famous-cases/richard-floyd-mccoy FBI.gov]  Retrieved May 29, 2013 He was arrested on April 9 with the ransom cash in his possession, and after trial and conviction, received a 45-year sentence. Two years later he escaped from Lewisburg Federal Penitentiary with several accomplices by crashing a garbage truck through the main gate. Tracked down three months later in Virginia Beach, McCoy was killed in a shootout with FBI agents.Funk, Marianne (February 21, 1992). McCoy's Widow Admits Helping in '72 Hijacking. [http://www.deseretnews.com/article/211317/MCCOYS-WIDOW-ADMITS-HELPING-IN-72-HIJACKING.html Deseret News Archive] Retrieved February 21, 2011.\n\nIn their 1991 book, D.B. Cooper: The Real McCoy,Rhodes B, Calame R. D.B. Cooper: The Real McCoy. Univ. of Utah Press (1991).  parole officer Bernie Rhodes and former FBI agent Russell Calame asserted that they had identified McCoy as D.B. Cooper. They cited obvious similarities in the two hijackings, claims by McCoy's family that the tie and mother-of-pearl tie clip left on the plane belonged to McCoy, and McCoy's own refusal to admit or deny that he was Cooper. A proponent of their theory was the FBI agent who killed McCoy. \"When I shot Richard McCoy,\" he said, \"I shot D. B. Cooper at the same time.\"\n\nWhile there is no reasonable doubt that McCoy committed the Denver hijacking, the FBI does not consider him a suspect in the Cooper case because of significant mismatches in age and description;Some notable examples, cited by Rhodes and Calame: Cooper's age was estimated by all witnesses as mid-40s, McCoy was 29; most witnesses, including all three flight attendants, said Cooper had \"dark brown, piercing\" eyes, McCoy's eyes were light blue; Cooper's ears had no distinguishing characteristics, McCoy's ears stuck out so prominently that his nickname was \"Dumbo\", and he wore a scarf to conceal them during the Denver hijacking; Cooper drank bourbon and chain-smoked cigarettes, McCoy was an observant Mormon who did not smoke or drink alcohol; Cooper was described as having a raspy voice with no particular accent, McCoy had a noticeable southern accent, and a marked lisp due to surgical correction of a cleft palate in childhood. Rhodes & Calame (1991), pp. 86, 94, 96, 134, 145. a level of skydiving skill well above that thought to be possessed by the hijacker; and credible evidence that McCoy was in Las Vegas on the day of the Portland hijacking, and at home in Utah the day after, having Thanksgiving dinner with his family.\n\nRobert Rackstraw\n\nRobert Wesley Rackstraw is a retired pilot and ex-convict who served on an army helicopter crew and other units during the Vietnam War. He came to the attention of the Cooper task force in February 1978, after he was arrested in Iran and deported to the U.S. to face explosive possession and check kiting charges. Several months later, while released on bail, Rackstraw attempted to fake his own death by radioing a false mayday call and telling controllers that he was bailing out of a rented plane over Monterey Bay.[http://www.mercurynews.com/2016/07/12/d-b-cooper-investigation-focuses-on-california-off-the-books-genius-robert-rackstraw/ D.B. Cooper investigation focuses on California 'off-the-books genius' Robert Rackstraw.] San Jose Mercury News (July 12, 2016), retrieved September 8, 2016. Police later arrested him in Fullerton on an additional charge of forging federal pilot certificates; the plane he claimed to have ditched was found, repainted, in a nearby hangar.Wilkinson, J. (September 9, 2016). [http://www.dailymail.co.uk/news/article-3781043/Is-Robert-Henry-Rackstraw-really-plane-hijacker-DB-Cooper-Filmmaker-sues-FBI-prove-theory.html Is this maverick ex-Army pilot who faked his own death in a plane crash DB Cooper?] dailymail.com, retrieved December 13, 2016. Cooper investigators noted his physical resemblance to Cooper composite sketches (although he was only 28 in 1971), military parachute training, and criminal record, but eliminated him as a suspect in 1979 after no direct evidence of his involvement could be found.\n\t \nIn 2016, Rackstraw re-emerged as a suspect in a History Channel program and a book.Colbert T, Szollosi T. The Last Master Outlaw. Jacaranda Roots Publishing (2016).  On September 8, 2016, Thomas J. Colbert, an author of the book The Last Master Outlaw, filed a lawsuit to compel the FBI to release its Cooper case file under the Freedom of Information Act. The suit alleges that the FBI suspended active investigation of the Cooper case \"... in order to undermine the theory that Rackstraw is D.B. Cooper so as to prevent embarrassment for the bureau's failure to develop evidence sufficient to prosecute him for the crime.\"[http://www.oregonlive.com/pacific-northwest-news/index.ssf/2016/09/lawsuit_filed_against_fbi_to_m.html Lawsuit filed against FBI to make D.B. Cooper investigation file public]. The Oregonian (September 8, 2016), retrieved September 22, 2016. In January 2018, a small cold case documentary team reported that they had obtained a letter originally written in December 1971 and sent to the New York Times, Los Angeles Times, Seattle Times and Washington Post, with numerous numbers and letters written on it. The team, led by Tom and Dawna Colbert, says that the codes were deciphered and matched to three units Rackstraw was a part of while in the Army, and the FBI refused to acknowledge the findings because \"it would have to admit that amateur sleuths had cracked a case the bureau couldn't\".\n\nOne of the Flight 305 flight attendants reportedly \"did not find any similarities\" between photos of Rackstraw from the 1970s and her recollection of Cooper's appearance.Dodd, J. (July 12, 2016). [http://people.com/crime/db-cooper-robert-rackstraw-accused-in-history-channel-show-denies-accusation/ Man Identified in History Channel Show as Notorious Skyjacker D.B. Cooper Denies Accusation]. People.com, retrieved December 13, 2016.Walsh, S. (July 11, 2016). [http://heavy.com/news/2016/07/robert-rackstraw-db-cooper-case-closed-documentary-culprit-who-is/ Robert Rackstraw: 5 Fast Facts You Need to Know]. Heavy.com, retrieved December 13, 2016. Rackstraw's attorney called the renewed allegations \"the stupidest thing I've ever heard\",[http://miami.cbslocal.com/2016/07/13/fbi-closes-case-on-d-b-cooper-skyjacking-mystery/ FBI Closes Case On D.B. Cooper Skyjacking Mystery]. CBS Miami (July 13, 2016), retrieved September 8, 2016. and Rackstraw himself told People.com, \"It's a lot of [expletive], and they know it is.\" The FBI declined further comment. Rackstraw stated in a 2017 phone interview that he lost his job over the 2016 investigations.\n\nDuane Weber\n\nDuane L. Weber was a World War II Army veteran who served time in at least six prisons from 1945 to 1968 for burglary and forgery. He was proposed as a suspect by his widow, based primarily on a deathbed confession: Three days before he died in 1995, Weber told his wife, \"I am Dan Cooper.\" The name meant nothing to her, she said; but months later, a friend told her of its significance in the hijacking. She went to her local library to research D.B. Cooper, found Max Gunther's book, and discovered notations in the margins in her husband's handwriting.\n\nShe then recalled, in retrospect, that Weber once had a nightmare during which he talked in his sleep about jumping from a plane, leaving his fingerprints on the \"aft stairs\". He also reportedly told her that an old knee injury had been incurred by \"jumping out of a plane\". Like the hijacker, Weber drank bourbon and chain smoked. Other circumstantial evidence included a 1979 trip to Seattle and the Columbia River, during which Weber took a walk alone along the river bank in the Tina Bar area; four months later Brian Ingram made his ransom cash discovery in the same area.\n\nThe FBI eliminated Weber as an active suspect in July 1998 when his fingerprints did not match any of those processed in the hijacked plane, and no other direct evidence could be found to implicate him. Later, his DNA also failed to match the samples recovered from Cooper's tie, though the bureau has since conceded that they cannot be certain that the organic material on the tie came from Cooper.\n\nJohn List\n\nList was an accountant and World War II and Korean War veteran who murdered his wife, three teenage children, and 85-year-old mother in Westfield, New Jersey, 15 days before the Cooper hijacking, withdrew $200,000 from his mother's bank account, and disappeared. He came to the attention of the Cooper task force due to the timing of his disappearance, multiple matches to the hijacker's description, and the reasoning that \"a fugitive accused of mass murder has nothing to lose.\" After his capture in 1989, List admitted to murdering his family, but denied any involvement in the Cooper hijacking. While his name continues to crop up in Cooper articles and documentaries, no substantive evidence implicates him, and the FBI no longer considers him a suspect. He died in prison in 2008.\n\nWilliam Gossett\n\nGossett was a Marine Corps, Army, and Army Air Force veteran who saw action in Korea and Vietnam. His military experience included advanced jump training and wilderness survival. After retiring from military service in 1973, he worked as an ROTC instructor, taught military law at Weber State University in Ogden, Utah, and hosted a radio talk show in Salt Lake City which featured discussions about the paranormal.Craig, John S. \"D.B. Cooper Suspect Named: William Pratt Gossett,\" associatedcontent.com. He died in 2003.\n\nGossett was widely known to be obsessed with the Cooper hijacking. He amassed a voluminous collection of Cooper-related news articles, and told one of his wives that he knew enough about the case to \"write the epitaph for D.B. Cooper\". Late in his life he reportedly told three of his sons, a retired Utah judge, and a friend in the Salt Lake City public defender's office that he had committed the hijacking.Yet Another D. B. Cooper Suspect: William Pratt \"Wolfgang\" Gossett. [http://crimeslam.com/2008/05/yet-another-d-b-cooper-suspect-william.html Crime Slam]  Retrieved February 1, 2011. Photos of Gossett taken circa 1971 bear a close resemblance to the most widely circulated Cooper composite drawing.[http://www.coasttocoastam.com/photo/view/d_b_cooper_suspect/37861 Photos of Gossett, 1967–73] Retrieved February 2, 2011.\n\nAccording to Galen Cook, a lawyer who has collected information related to Gossett for years, Gossett once showed his sons a key to a Vancouver, British Columbia safe deposit box which, he claimed, contained the long-missing ransom money. Gossett's eldest son, Greg, said that his father, a compulsive gambler who was always \"strapped for cash\", showed him \"wads of cash\" just before Christmas 1971, weeks after the Cooper hijacking. He speculated that Gossett gambled the money away in Las Vegas.\n\nIn 1988 Gossett changed his name to \"Wolfgang\" and became a Catholic priest, which Cook and others interpreted as an effort to disguise his identity. Other circumstantial evidence includes testimony that Cook claims to have obtained from William Mitchell, a passenger on the hijacked aircraft, regarding a mysterious \"physical detail\" (which he will not divulge) common to the hijacker and Gossett.Craig, John S. \"1971 D.B. Cooper Letters Linked to Suspect William Gossett,\" associatedcontent.com. Cook also claims to have found \"possible links\" to Gossett in each of four letters signed by \"D.B. Cooper\" and mailed to three newspapers within days after the hijacking, although there is no evidence that the actual hijacker created or mailed any of the letters.\n\nThe FBI has no direct evidence implicating Gossett, and cannot even reliably place him in the Pacific Northwest at the time of the hijacking.Spencer, Kent (November 21, 2011): Skyjacker D.B. Cooper 'enjoyed the Grey Cup game,' according to 1971 letter attributed to him. [http://news.nationalpost.com/2011/11/24/skyjacker-d-b-cooper-enjoyed-the-grey-cup-game-according-to-1971-letter-attributed-to-him/ National Post archive] Retrieved December 1, 2011 \"There is not one link to the D.B. Cooper case,\" said Special Agent Carr, \"other than the statements [Gossett] made to someone.\"\"[http://www.deseretnews.com/article/700246479/Was-DB-Cooper-an-Ogden-resident.html?pg\nall  Was D.B. Cooper an Ogden Resident?]\" (July 28, 2008) Deseret News (Salt Lake City) via Associated Press. Retrieved February 1, 2011.\n\nKenneth Christiansen\n\nIn 2003, a Minnesota resident named Lyle Christiansen watched a television documentary about the Cooper hijacking and became convinced that his late brother Kenneth was D. B. Cooper. After repeated futile attempts to convince first the FBI, and then the author and film director Nora Ephron (who he hoped would make a movie about the case), he contacted a private investigator in New York City. In 2010 the detective, Skipp Porteous, published a book postulating that Christiansen was the hijacker. In early 2011 an episode of the History series Brad Meltzer's Decoded also summarized the circumstantial evidence linking Christiansen to the Cooper case.\n\nChristiansen enlisted in the army in 1944 and was trained as a paratrooper. The war had ended by the time he was deployed in 1945, but he made occasional training jumps while stationed in Japan with occupation forces in the late 1940s. After leaving the army he joined Northwest Orient in 1954 as a mechanic in the South Pacific, and subsequently became a flight attendant, and then a purser, based in Seattle. Christiansen was 45 years old at the time of the hijacking, but he was shorter (5 ft. 8 in.), thinner (150 pounds), and lighter complected than eyewitness descriptions. Christiansen smoked (as did the hijacker), and displayed a particular fondness for bourbon (Cooper's preferred beverage). He was also left-handed. (Evidence photos of Cooper's black tie show the tie clip applied from the left side, suggesting a left-handed wearer.) Flight attendant Florence Schaffner told a reporter that photos of Christiansen fit her memory of the hijacker's appearance more closely than those of other suspects she had been shown. (Tina Mucklow, who had the most contact with Cooper, has never granted a press interview.)\n\nChristiansen reportedly purchased a house with cash a few months after the hijacking. While dying of cancer in 1994 he told Lyle, \"There is something you should know, but I cannot tell you.\" Lyle said he never pressed his brother to explain. After Christiansen's death family members discovered gold coins and a valuable stamp collection, along with over $200,000 in bank accounts. They also found a folder of Northwest Orient news clippings which began about the time he was hired in the 1950s, and stopped just prior to the date of the hijacking, despite the fact that the hijacking was by far the most momentous news event in the airline's history. Christiansen continued to work part-time for the airline for many years after 1971, but apparently never clipped another Northwest news story.\n\nDespite the publicity generated by Porteous's book and the 2011 television documentary, the FBI is standing by its position that Christiansen cannot be considered a prime suspect. It cites a poor match to eyewitness physical descriptions, a level of skydiving expertise above that predicted by their suspect profile, and an absence of direct incriminating evidence.\n\nLynn Doyle Cooper\n\nL.D. Cooper, a leather worker and Korean War veteran, was proposed as a suspect in July 2011 by his niece, Marla Cooper.Provano, Joel (August 3, 2011): Woman claims D.B. Cooper was her uncle. [http://www.ajc.com/news/nation-world/woman-claims-d-b-1070683.html?cxtyperss_news_81960 AJC.com] Retrieved August 3, 2011. As an eight-year-old, she recalled Cooper and another uncle planning something \"very mischievous\", involving the use of \"expensive walkie-talkies\", at her grandmother's house in Sisters, Oregon, 150 mi south of Portland. The next day flight 305 was hijacked; and though the uncles ostensibly were turkey hunting, L.D. Cooper came home wearing a bloody shirt—the result, he said, of an auto accident. Later, she said, her parents came to believe that L.D. Cooper was the hijacker. She also recalled that her uncle, who died in 1999, was obsessed with the Canadian comic book hero Dan Cooper (see Theories and conjectures), and \"had one of his comic books thumbtacked to his wall\"—although he was not a skydiver or paratrooper.Thomas, P and Cloherty, J (August 3, 2011):  \"D.B. Cooper Exclusive: Did Niece Provide Key Evidence?\" [http://abcnews.go.com/US/db-cooper-exclusive-niece-provide-key-evidence/story?id=14219052 ABCNews.com] Retrieved August 3, 2011.\n\nIn August, New York magazine published an alternative witness sketch, reportedly based on a description by Flight 305 eyewitness Robert Gregory, depicting horn-rimmed sunglasses, a \"russet\"-colored suit jacket with wide lapels, and marcelled hair. The article notes that L.D. Cooper had wavy hair that looked marcelled (as did Duane Weber).\n\nOn August 3 the FBI announced that no fingerprints had been found on a guitar strap made by L.D. Cooper. One week later they added that his DNA did not match the partial DNA profile obtained from the hijacker's tie, but acknowledged, once again, that there is no certainty that the hijacker was the source of the organic material obtained from the tie. The bureau has made no further public comment.\n\nBarbara Dayton\n\nBarbara Dayton, a recreational pilot and University of Washington librarian who was born Robert Dayton in 1926, served in the Merchant Marine and then the army during World War II.  After discharge Dayton worked with explosives in the construction industry and aspired to a professional airline career, but could not obtain a commercial pilot's license.\n\nDayton underwent gender reassignment surgery in 1969 and changed her name to Barbara. She claimed to have staged the Cooper hijacking two years later, disguised as a man, in order to \"get back\" at the airline industry and the FAA, whose insurmountable rules and conditions had prevented her from becoming an airline pilot. She said she hid the ransom money in a cistern near her landing point in Woodburn, a suburban area south of Portland, Oregon. Eventually she recanted her entire story, ostensibly after learning that she could still be charged with the hijacking. The FBI has never commented publicly on Dayton, who died in 2002.\n\nRichard Lepsy \n\nRobert Lepsy was a 33-year-old grocery store manager and married father of four from Grayling, Michigan who disappeared in October 1969. His vehicle was found three days later at a local airport, and a man matching Lepsy's description was reportedly seen boarding a flight to Mexico. Authorities concluded that Lepsy had left voluntarily and closed their investigation. \n\nTwo years after the Cooper hijacking, family members noted that Lepsy's physical features resembled those in the Cooper composite drawings. They asserted that Cooper's clothing was described as very similar to Lepsy's grocery store uniform.   Lepsy was declared legally dead in 1976.  One of Lepsy's daughters submitted a DNA sample to the FBI in 2011, with unknown results.  Though Lepsy was proposed as a Cooper suspect in a 2014 book,Richardson, R. Still Missing: Rethinking the D.B. Cooper Case and Other Mysterious Unsolved Disappearances. Terra Mysteria Media (2014), pp. 142-7.  there is no record of public comment on him from the FBI.\n\nAftermath\n\nAirport security\n\nThe Cooper hijacking marked the beginning of the end for unfettered and unscrutinized airline travel. Despite the initiation of the federal Sky Marshal Program the previous year,Wu, Annie. The History of Airport Security. [http://savvytraveler.publicradio.org/show/features/2000/20000915/security.shtml SavvyTraveler.publicradio.org] Retrieved February 14, 2011. 31 hijackings were committed in U.S. airspace in 1972; 19 of them were for the specific purpose of extorting money and most of the rest were attempts to reach Cuba.Holden, Robert T. The Contagiousness of Aircraft Hijacking [http://pegasus.cc.ucf.edu/~surette/hijacking.html UCF.edu Archive] Retrieved February 14, 2011.  In 15 of the extortion cases the hijackers also demanded parachutes.Gladwell, Malcolm. The New Yorker (October 1, 2001): Safety in the Skies. [http://gladwell.com/safety-in-the-skies/ New Yorker Archive]  Retrieved February 14, 2011. In early 1973 the FAA began requiring airlines to search all passengers and their bags. Amid multiple lawsuits charging that such searches violated Fourth Amendment protections against search and seizure, federal courts ruled that they were acceptable when applied universally, and when limited to searches for weapons and explosives. In contrast to the 31 hijackings in 1972, only two were attempted in 1973, both by psychiatric patients, one of whom intended to crash the airliner into the White House to kill President Nixon.\n\nAircraft modifications\n\nIn the wake of multiple \"copycat\" hijackings in 1972, the FAA required that all Boeing 727 aircraft be fitted with a device, later dubbed the \"Cooper vane\", that prevents lowering of the aft airstair during flight. As direct result of the hijacking, the installation of peepholes was mandated in all cockpit doors. This made it possible for the cockpit crew to observe people in the passenger cabin without having to open the cockpit door.\n\nSubsequent history of N467US\n\nIn 1978 the hijacked 727-100 aircraft was sold by Northwest to Piedmont Airlines where it was re-registered N838N and continued in domestic carrier service.[http://www.jetpiedmont.com/ Piedmont Historical Archives] Retrieved May 29, 2013. In 1984 it was purchased by the now-defunct charter company Key Airlines, re-registered N29KA, and incorporated into the Air Force's civilian charter fleet that shuttled workers between Nellis Air Force Base and the Tonopah Test Range during the top-secret F-117 Nighthawk development program.Hengi, B.I. Airlines Remembered. Midland (June 10, 2000). , pp. 56–7. In 1996 the aircraft was scrapped for parts in a Memphis boneyard.\n\nEarl Cossey\n\nIn late April 2013, Earl Cossey – the owner of the skydiving school that furnished the four parachutes that were given to Cooper – was found dead in his home in Woodinville, a suburb of Seattle. His death was ruled a homicide due to blunt-force trauma to the head. The perpetrator remains unknown.Baumann, L (May 7, 2013): \"Man Who Packed DB Cooper's Parachutes ID'd as Woodinville Homicide Victim\". [http://woodinville.patch.com/groups/police-and-fire/p/homicide-victim-identified-as-earl-cossey-of-woodinville Woodinville Patch]. Retrieved May 29, 2013 Conspiracy theorists immediately began pointing out possible links to the Cooper case,Smith, BA (May 4, 2013): \"Update on the murder of Earl Cossey, an analysis of his role in the DB Cooper case\". [http://themountainnewswa.net/2013/05/04/update-on-the-murder-of-earl-cossey-an-analysis-of-his-role-in-the-db-cooper-case/ The Mountain News]. Retrieved May 29, 2013 but authorities responded that they have no reason to believe that any such link exists.Johnson G (April 30, 2013): \"Earl Cossey, DB Cooper Parachute Packer, ID'd As Homicide Victim\". [http://www.huffingtonpost.com/2013/04/30/earl-cossey-db-cooper-par_n_3188745.html HuffingtonPost.com] Retrieved May 29, 2013 Woodinville officials later announced that burglary was most likely the motive for the crime.Bauman, L (May 12, 2013). Cossey Murder: Woodinville Police Chief Classifies it as Burglary. [http://woodinville.patch.com/groups/police-and-fire/p/earl-cossey-murder-woodinville-police-chief-classifie5175f3af01 WoodinvillePatch.com archive]. Retrieved October 28, 2013.\n\nCultural phenomena\n\nD.B. Cooper was undeniably an air pirate and extortionist (Himmelsbach famously called him a \"rotten sleazy crook\") who endangered the lives of 42 people and caused immeasurable inconvenience for many others. His bold and adventurous crime inspired a cult following that was expressed in song, film, and literature.  Restaurants and bowling alleys in the Pacific Northwest hold regular Cooper-themed promotions and sell tourist souvenirs.  A \"Cooper Day\" celebration has been held at the Ariel General Store and Tavern each November since 1974 with the exception of 2015, the year its owner, Dona Elliot, died.  \n\nCooper has appeared in the storylines of the television series Prison Break, NewsRadio, and Numb3rs, the 2004 film Without a Paddle, and a book titled The Vesuvius Prophecy, based on The 4400 TV series. Over the years there have been a few small bars in various United States cities named D.B. Cooper's.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "D. B. Cooper" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8799" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "D. B. Cooper is a media epithet popularly used to refer to an unidentified man who hijacked a Boeing 727 aircraft in the airspace between Portland, Oregon, and Seattle, Washington, on November 24, 1971. He extorted $200,000 in ransom () and parachuted to an uncertain fate. Despite an extensive manhunt and protracted FBI investigation, the perpetrator has never been located or identified. The case remains the only unsolved air piracy in commercial aviation history.\n\nAvailable evidence and a preponderance of expert opinion suggested from the beginning that Cooper probably did not survive his high-risk jump, but his remains were never recovered. The FBI nevertheless maintained an active investigation for 45 years after the hijacking. Despite a case file that grew to over 60 volumes over that time period, no definitive conclusions have been reached regarding Cooper's true identity or whereabouts. The suspect purchased his airline ticket using the alias Dan Cooper, but because of a news media miscommunication he became known in popular lore as \"D. B. Cooper\".\n\nNumerous theories of widely varying plausibility have been proposed over the years by investigators, reporters, and amateur enthusiasts. A young boy discovered a small cache of ransom bills along the banks of the Columbia River in February 1980. The find triggered renewed interest but ultimately only deepened the mystery, and the great majority of the ransom remains unrecovered.\n\nThe FBI officially suspended active investigation of the case in July 2016, but the agency continues to request that any physical evidence that might emerge related to the parachutes or the ransom money be submitted for analysis.\n\nHijacking\n\nOn Thanksgiving eve, November 24, 1971, a middle-aged man carrying a black attaché case approached the flight counter of Northwest Orient Airlines at Portland International Airport. He identified himself as \"Dan Cooper\" and used cash to purchase a one-way ticket on Flight 305, a 30-minute trip to Seattle.\n\nCooper boarded the aircraft, a Boeing 727-100 (FAA registration N467US), and took seat 18C (18E by one account,History's Greatest Unsolved Crimes. [http://www.francesfarmersrevenge.com/stuff/archive/oldnews6/crimes.htm Frances Farmer Archive]  Retrieved February 7, 2011. 15D by another) in the rear of the passenger cabin. He lit a cigaretteSmoking was permitted on commercial aircraft until 1988. and ordered a bourbon and soda. Fellow passengers described him as a man in his mid-forties, between 5 ft and 6 ft tall. He wore a black lightweight raincoat, loafers, a dark suit, a neatly pressed white collared shirt, a black necktie, and a mother of pearl tie pin.\n\nFlight 305 was approximately one-third full when it took-off on schedule at 2:50 p.m., PST.  Shortly after takeoff, Cooper handed a note to Florence Schaffner, the flight attendant situated nearest to him in a jump seat attached to the aft stair door. Schaffner assumed that the note contained a lonely businessman's phone number and dropped it unopened into her purse. Cooper leaned toward her and whispered, \"Miss, you'd better look at that note. I have a bomb.\"\n\nThe note was printed in neat, all-capital letters with a felt-tip pen.Unmasking D.B. Cooper. [http://nymag.com/nymag/features/39593/index1.html New York Magazine] retrieved June 28, 2016. Its exact wording is unknown, because Cooper later reclaimed it,D.B. Cooper. [http://www.crimemuseum.org/crime-library/d-b-cooper/ crimemuseum.org], retrieved June 28, 2016. but Schaffner recalled that the note indicated he had a bomb in his briefcase. After Schaffner read the note, Cooper directed her to sit beside him.The D.B. Cooper Mystery. [https://www.fbi.gov/news/stories/2006/november/dbcooper_112406 FBI.gov], retrieved June 28, 2016. Schaffner did as requested, then quietly asked to see the bomb. Cooper cracked open his briefcase long enough for her to glimpse eight red cylinders (\"four on top of four\") attached to wires coated with red insulation, and a large cylindrical battery.[http://n467us.com/Data%20Files/Logs%2006-20-2008R.pdf Transcript of Crew Communications] Retrieved February 25, 2011. After closing the briefcase, he dictated his demands: $200,000 in \"negotiable American currency\"; four parachutes (two primary and two reserve); and a fuel truck standing by in Seattle to refuel the aircraft upon arrival. Schaffner conveyed Cooper's instructions to the pilots in the cockpit: when she returned, he was wearing dark sunglasses.\n\nThe pilot, William Scott, contacted Seattle–Tacoma Airport air traffic control, which in turn informed local and federal authorities. The 36 other passengers were given false information that their arrival in Seattle would be delayed because of a \"minor mechanical difficulty\". Northwest Orient's president, Donald Nyrop, authorized payment of the ransom and ordered all employees to cooperate fully with the hijacker's demands. The aircraft circled Puget Sound for approximately two hours to allow Seattle police and the FBI sufficient time to assemble Cooper's parachutes and ransom money, and to mobilize emergency personnel.\n\nSchaffner recalled that Cooper appeared familiar with the local terrain; at one point he remarked, \"Looks like Tacoma down there,\" as the aircraft flew above it. He also correctly mentioned that McChord Air Force Base was only a 20-minute drive (at that time) from Seattle-Tacoma Airport. Schaffner described him as calm, polite, and well-spoken, not at all consistent with the stereotypes (enraged, hardened criminals or \"take-me-to-Cuba\" political dissidents) popularly associated with air piracy at the time. Tina Mucklow, another flight attendant, agreed. \"He wasn't nervous,\" she told investigators. \"He seemed rather nice. He was never cruel or nasty. He was thoughtful and calm all the time.\" He ordered a second bourbon and water, paid his drink tab (and attempted to give Schaffner the change), and offered to request meals for the flight crew during the stop in Seattle.\n\nFBI agents assembled the ransom money from several Seattle-area banks – 10,000 unmarked 20-dollar bills, most with serial numbers beginning with the letter \"L\" indicating issuance by the Federal Reserve Bank of San Francisco, and most from the 1963A or 1969 series – and made a microfilm photograph of each of them. Cooper rejected the military-issue parachutes offered by McChord AFB personnel, demanding instead civilian parachutes with manually operated ripcords. Seattle police obtained them from a local skydiving school.\n\nPassengers released\n\nAt 5:24 p.m. Cooper was informed that his demands had been met, and at 5:39 p.m. the aircraft landed at Seattle-Tacoma Airport. Cooper instructed Scott to taxi the jet to an isolated, brightly lit section of the tarmac and close each window shade in the cabin to deter police snipers. Northwest Orient's Seattle operations manager, Al Lee, approached the aircraft in street clothes to avoid the possibility that Cooper might mistake his airline uniform for that of a police officer. He delivered the cash-filled knapsack and parachutes to Mucklow via the aft stairs. Once the delivery was completed, Cooper ordered all passengers, Schaffner, and senior flight attendant Alice Hancock to leave the plane.\n\nDuring refueling, Cooper outlined his flight plan to the cockpit crew: a southeast course toward Mexico City at the minimum airspeed possible without stalling the aircraft – approximately 100 kn – at a maximum 10000 foot altitude. He further specified that the landing gear remain deployed in the takeoff/landing position, the wing flaps be lowered 15 degrees, and the cabin remain unpressurized.Rothenberg and Ulvaeus, p. 5. Copilot William Rataczak informed Cooper that the aircraft's range was limited to approximately 1000 mi under the specified flight configuration, which meant that a second refueling would be necessary before entering Mexico. Cooper and the crew discussed options and agreed on Reno, Nevada, as the refueling stop. With the plane's rear exit door open and its staircase extended, Cooper directed the pilot to take off. Northwest's home office objected, on grounds that it was unsafe to take off with the aft staircase deployed. Cooper countered that it was indeed safe, but he would not argue the point; he would lower it once they were airborne.\n\nAn FAA official requested a face-to-face meeting with Cooper aboard the aircraft, which was denied. The refueling process was delayed because of a vapor lock in the fuel tanker truck's pumping mechanism, and Cooper became suspicious; but he allowed a replacement tanker truck to continue the refueling – and a third after the second ran dry.\n\nBack in the air\n\nAt approximately 7:40 p.m., the Boeing 727 took off with only 5 people onboard: Cooper, pilot Scott, flight attendant Mucklow, copilot Rataczak, and flight engineer H. E. Anderson. Two F-106 fighter aircraft were scrambled from nearby McChord Air Force Base and followed behind the airliner, one above it and one below, out of Cooper's view. A Lockheed T-33 trainer, diverted from an unrelated Air National Guard mission, also shadowed the 727 before running low on fuel and turning back near the Oregon–California state line.\n\nAfter takeoff, Cooper told Mucklow to join the rest of the crew in the cockpit and remain there with the door closed. As she complied, Mucklow observed Cooper tying something around his waist. At approximately 8:00 p.m., a warning light flashed in the cockpit, indicating that the aft airstair apparatus had been activated. The crew's offer of assistance via the aircraft's intercom system was curtly refused. The crew soon noticed a subjective change of air pressure, indicating that the aft door was open.\n\nAt approximately 8:13 p.m., the aircraft's tail section sustained a sudden upward movement, significant enough to require trimming to bring the plane back to level flight.Bragg, p. 4. At approximately 10:15 p.m., Scott and Rataczak landed the 727, with the aft airstair still deployed, at Reno Airport. FBI agents, state troopers, sheriff's deputies, and Reno police surrounded the jet, as it had not yet been determined with certainty that Cooper was no longer aboard, but an armed search quickly confirmed that he was gone.\n\nInvestigation\n\nFBI agents recovered 66 unidentified latent fingerprints aboard the airliner. The agents also found Cooper's black clip-on tie and mother-of-pearl tie clip and two of the four parachutes, one of which had been opened and two shroud lines cut from its canopy. Authorities interviewed eyewitnesses in Portland, Seattle, and Reno, and all those who personally interacted with Cooper. A series of composite sketches was developed.[https://vault.fbi.gov/D-B-Cooper%20/D-B-Cooper-Part-7-of-7/view FBI FOIA file part 1], from [https://vault.fbi.gov/D-B-Cooper%20/ FBI FOIA catalogue on the Dan Cooper case], also see the actual FBI poster.\n\nLocal police and FBI agents immediately began questioning possible suspects. An Oregon man named D. B. Cooper who had a minor police record was one of the first persons of interest in the case. He was contacted by Portland police on the off-chance that the hijacker had used his real name or the same alias in a previous crime. He was quickly ruled out as a suspect, but a local reporter named James Long, rushing to meet an imminent deadline, confused the eliminated suspect's name with the pseudonym used by the hijacker.Browning, W. (July 22, 2016). One mystery solved in 'D.B. Cooper' skyjacking fiasco. [http://www.cjr.org/the_feature/db_cooper_mystery_solved.php Columbia Journalism Review], retrieved July 29, 2016.D B Cooper was not really D B Cooper? [http://indiatoday.intoday.in/story/d-b-cooper-was-not-really-d-b-cooper-a-journalist-added-swagger-to-mysterious-hijackers-legacy/1/726575.html India Today], retrieved July 29, 2016. A wire service reporter (Clyde Jabin of UPI by most accounts,Guzman, Monica (November 27, 2007). Update: Everyone wants a piece of the D. B. Cooper legend. [http://blog.seattlepi.com/thebigblog/2007/11/27/update-everyone-wants-a-piece-of-the-d-b-cooper-legend/ Seattle Post-Intelligencer archive] Retrieved February 25, 2011. Joe Frazier of AP by others) republished the error, followed by numerous other media sources; the moniker \"D. B. Cooper\" became lodged in the public's collective memory.\n\nA precise search area was difficult to define, as even small differences in estimates of the aircraft's speed, or the environmental conditions along the flight path (which varied significantly by location and altitude), changed Cooper's projected landing point considerably. An important variable was the length of time he remained in free fall before pulling his ripcord—if indeed he succeeded in opening a parachute at all. Neither of the Air Force fighter pilots saw anything exit the airliner, either visually or on radar, nor did they see a parachute open; but at night, with extremely limited visibility and cloud cover obscuring any ground lighting below, an airborne human figure clad entirely in black clothing could easily have gone undetected. The T-33 pilots never made visual contact with the 727 at all.\n\nIn order to conduct an experimental re-creation, Scott piloted the aircraft used in the hijacking in the same flight configuration. FBI agents, pushing a 200 lb sled out of the open airstair, were able to reproduce the upward motion of the tail section described by the flight crew at 8:13 p.m. Based on this experiment, it was concluded that 8:13 p.m. was the most likely jump time. At that moment the aircraft was flying through a heavy rainstorm over the Lewis River in southwestern Washington.\n\nInitial extrapolations placed Cooper's landing zone within an area on the southernmost outreach of Mount St. Helens, a few miles southeast of Ariel, Washington, near Lake Merwin, an artificial lake formed by a dam on the Lewis River.  Search efforts focused on Clark and Cowlitz Counties, encompassing the terrain immediately south and north, respectively, of the Lewis River in southwest Washington.[http://n467us.com/Data%20Files/Seamless%20Hot%20Zone%20North.jpg Topographic map, northern half of primary search area] Retrieved February 25, 2011.[http://n467us.com/Data%20Files/Seamless%20Hot%20Zone%20South.jpg Topographic map, southern half of primary search area] Retrieved February 25, 2011. FBI agents and Sheriff's deputies from those counties searched large areas of the mountainous wilderness on foot and by helicopter. Door-to-door searches of local farmhouses were also carried out. Other search parties ran patrol boats along Lake Merwin and Yale Lake, the reservoir immediately to its east. No trace of Cooper, nor any of the equipment presumed to have left the aircraft with him, was found.\n\nThe FBI also coordinated an aerial search, using fixed-wing aircraft and helicopters from the Oregon Army National Guard, along the entire flight path (known as Victor 23 in standard aviation terminology but \"Vector 23\" in most Cooper  from Seattle to Reno. While numerous broken treetops and several pieces of plastic and other objects resembling parachute canopies were sighted and investigated, nothing relevant to the hijacking was found.\n\nShortly after the spring thaw in early 1972, teams of FBI agents aided by some 200 Army soldiers from Fort Lewis, along with Air Force personnel, National Guardsmen, and civilian volunteers, conducted another thorough ground search of Clark and Cowlitz Counties for 18 days in March, and then an additional 18 days in April. Electronic Explorations Company, a marine salvage firm, used a submarine to search the 200 ft depths of Lake Merwin. Two local women stumbled upon a skeleton in an abandoned structure in Clark County; it was later identified as the remains of a female teenager who had been abducted and murdered several weeks before. Ultimately, the search operation—arguably the most extensive, and intensive, in U.S. history—uncovered no significant material evidence related to the hijacking.\n\nLater developments\n\nSubsequent analyses indicated that the original landing zone estimate was inaccurate: Scott, who was flying the aircraft manually because of Cooper's speed and altitude demands, later determined that his flight path was significantly farther east than initially assumed. Additional data from a variety of sources—in particular Continental Airlines pilot Tom Bohan, who was flying four minutes behind Flight 305—indicated that the wind direction factored into drop zone calculations had been wrong, possibly by as much as 80 degrees. This and other supplemental data suggested that the actual drop zone was probably south-southeast of the original estimate, in the drainage area of the Washougal River.\n\nRetired FBI chief investigator Ralph Himmelsbach wrote in his 1986 book, \"I have to confess, if I [were] going to look for Cooper, I would head for the Washougal.\" The Washougal Valley and its surroundings have been searched repeatedly by private individuals and groups in subsequent years; to date, no discoveries directly traceable to the hijacking have been reported. Some investigators have speculated that the 1980 eruption of Mount St. Helens may have obliterated any remaining physical clues.Connolly, P. (November 24, 1981). D.B. Cooper: A stupid rascal. [https://news.google.com/newspapers?nid\n1298&dat19811124&id\nIfpNAAAAIBAJ&sjiddosDAAAAIBAJ&pg\n6868,4075230&hl=en The Free Lance-Star], retrieved June 29, 2016.\n\nSearch for ransom money\n\nA month after the hijacking, the FBI distributed lists of the ransom serial numbers to financial institutions, casinos, race tracks, and other businesses that routinely conducted significant cash transactions, and to law enforcement agencies around the world. Northwest Orient offered a reward of 15% of the recovered money, to a maximum of $25,000. In early 1972 U.S. Attorney General John Mitchell released the serial numbers to the general public. In 1972 two men used counterfeit 20-dollar bills printed with Cooper serial numbers to swindle $30,000 from a Newsweek reporter named Karl Fleming in exchange for an interview with a man they falsely claimed was the hijacker.[https://vault.fbi.gov/D-B-Cooper%20/D-B-Cooper-Part-1-of-7/view FBI files on Fleming case, released via Freedom of Information Act] Retrieved February 15, 2011.\n\nIn early 1973, with the ransom money still missing, The Oregon Journal republished the serial numbers and offered $1,000 to the first person to turn in a ransom bill to the newspaper or any FBI field office. In Seattle, the Post-Intelligencer made a similar offer with a $5,000 reward. The offers remained in effect until Thanksgiving 1974, and though there were several near-matches, no genuine bills were found. In 1975 Northwest Orient's insurer, Global Indemnity Co., complied with an order from the Minnesota Supreme Court and paid the airline's $180,000 claim on the ransom money.\n\nStatute of limitations\n\nIn 1976, discussion arose over impending expiration of the statute of limitations on the hijacking. Most published legal analyses agreed that it would make little difference,Frazier, Joe (November 13, 1976): \"Sky Thief: Bandit Who Stole $200,000 in 1971 Still Being Sought\"  Pittsburgh Post-Gazette, p. B-1. Retrieved March 3, 2013 as interpretation of the statute varies considerably from case to case and court to court, and a prosecutor could argue that Cooper had forfeited immunity on any of several valid technical grounds.CRS Report for Congress: Statutes of Limitation in Federal Criminal Cases: An Overview. [https://fas.org/sgp/crs/misc/RL31253.pdf FAS.org] Retrieved March 6, 2011. The question was rendered irrelevant in November when a Portland grand jury returned an indictment in absentia against \"John Doe, aka Dan Cooper\" for air piracy and violation of the Hobbs Act.Denson, Bryan (November 24, 1996). D.B. Cooper legend lives. [http://www.oregonlive.com/special/current/dbcooper.ssf?/special/current/dbcooper_story1.frame Oregon Live archive] Retrieved March 6, 2011. The indictment formally initiated prosecution that can be continued, should the hijacker be apprehended, at any time in the future.\n\nPhysical evidence\n\nIn 1978, a placard printed with instructions for lowering the aft stairs of a 727 was found by a deer hunter near a logging road about 13 mi east of Castle Rock, Washington, well north of Lake Merwin, but within Flight 305's basic flight path.\n\nIn February 1980, eight-year-old Brian Ingram was vacationing with his family on the Columbia River at a beachfront known as Tina (or Tena) Bar, about 9 mi downstream from Vancouver, Washington and 20 mi southwest of Ariel. The child uncovered three packets of the ransom cash as he raked the sandy riverbank to build a campfire. The bills were significantly disintegrated, but still bundled in rubber bands.Orzano, M (July 21, 2014). D.B. Cooper skyjacking: 8-year-old Washington boy first to unearth ransom notes from 1971 incident. [http://www.coinworld.com/insights/1971-skyjacking-cash-ransom-found-by-eight-year-old-in-1980.all.html coinworld.com], retrieved August 29, 2015. FBI technicians confirmed that the money was indeed a portion of the ransom—two packets of 100 twenty-dollar bills each, and a third packet of 90, all arranged in the same order as when given to Cooper.Associated Press (May 22, 1986). Boy to Split $5,520 of D. B. Cooper's Loot. [http://articles.latimes.com/1986-05-22/news/mn-6995_1 LA Times archive] Retrieved March 6, 2011.\n\nThe discovery launched several new rounds of conjecture and ultimately raised more questions than it answered. Initial statements by investigators and scientific consultants were founded on the assumption that the bundled bills washed freely into the Columbia River from one of its many connecting tributaries. An Army Corps of Engineers hydrologist noted that the bills had disintegrated in a \"rounded\" fashion and were matted together, indicating that they had been deposited by river action, as opposed to having been deliberately buried. That conclusion, if correct, supported the opinion that Cooper had not landed near Lake Merwin nor any tributary of the Lewis River, which feeds into the Columbia well downstream from Tina Bar. It also lent credence to supplemental speculation (see Later developments above) that placed the drop zone near the Washougal River, which merges with the Columbia upstream from the discovery site.\n\nBut the \"free floating\" hypothesis presented its own difficulties; it did not explain the ten bills missing from one packet, nor was there a logical reason that the three packets would have remained together after separating from the rest of the money. Physical evidence was incompatible with geologic evidence: Himmelsbach observed that free-floating bundles would have had to wash up on the bank \"within a couple of years\" of the hijacking; otherwise the rubber bands would have long since deteriorated, an observation confirmed experimentally by the Cooper Research Team (see #Subsequent FBI disclosures below).[http://www.citizensleuths.com/conclusions.html Research Conclusions: Cooper Research Team web site] .  Retrieved August 28, 2014. Geological evidence suggested that the bills arrived at Tina Bar well after 1974, the year of a Corps of Engineers dredging operation on that stretch of the river. Geologist Leonard Palmer of Portland State University found two distinct layers of sand and sediment between the clay deposited on the riverbank by the dredge and the sand layer in which the bills were buried, indicating that the bills arrived long after dredging had been completed. The Cooper Research Team later challenged Palmer's conclusion, citing evidence that the clay layer was a natural deposit. That finding, if true, favors an arrival time of less than one year after the event (based on the rubber band experiment), but does not help to explain how the bundles got to Tina Bar, nor from where they came.[http://www.citizensleuths.com/palmer-report.html Palmer Report: Cooper Research Team web site]. Retrieved May 9, 2015.\n\nAlternative theories were advanced. Some surmised that the money had been found at a distant location by someone (or possibly even a wild animal), carried to the riverbank, and reburied there. The sheriff of Cowlitz County proposed that Cooper accidentally dropped a few bundles on the airstair, which then blew off the aircraft and fell into the Columbia River. One local newspaper editor theorized that Cooper, knowing he could never spend the money, dumped it in the river, or buried portions of it at Tina Bar (and possibly elsewhere) himself. No hypothesis offered to date satisfactorily explains all of the existing evidence.\n\nIn 1981, a human skull was unearthed along the same stretch of riverbank during excavations in search of additional evidence. Forensic pathologists eventually determined that it belonged to a woman, possibly of Native American ancestry.\n\nIn 1986, after protracted negotiations, the recovered bills were divided equally between Ingram and Northwest Orient's insurer; the FBI retained 14 examples as evidence.D.B. Cooper: A Timeline (October 2007) [http://nymag.com/news/features/39617/ New York Magazine Archives] Retrieved February 10, 2011.Six Years Later Brian Ingram Gets a Piece of D.B. Cooper's Hijack Haul (June 23, 1986). [http://www.people.com/people/archive/article/0,,20093930,00.html People Magazine archive] Retrieved February 28, 2011. Ingram sold fifteen of his bills at auction in 2008 for about $37,000. To date, none of the 9,710 remaining bills have turned up anywhere in the world. Their serial numbers remain available online for public search.\n\nIn 1988, a piece of  material from a parachute was raised from the river bottom near Tina Bar, but FBI experts determined that it had come from a military drogue parachute. In 2008, children unearthed another parachute near Amboy, Washington, about 6 mi due south of Lake Merwin, which proved to be of World War II-era military origin.McNerthney, Casey (April 2, 2008): Suspected D.B. Cooper parachute may actually be from '45 military crash. [http://www.seattlepi.com/local/357259_parachute02.html seattlepi.com]. Retrieved January 7, 2011. The Columbia River ransom money and the airstair instruction placard remain the only bona fide physical evidence from the hijacking ever found outside the aircraft.\n\nIn 2017, a group of volunteer investigators uncovered what they believe to be “potential evidence, what appears to be a decades-old parachute strap\" in the Pacific Northwest.  This was followed later in August 2017 with a piece of foam, suspected of being part of Cooper's backpack.http://www.nydailynews.com/news/crime/new-potential-evidence-emerges-b-cooper-hijacking-case-article-1.3426633\n\nSubsequent FBI disclosures\n\nIn late 2007, the FBI announced that a partial DNA profile had been obtained from three organic samples found on the hijacker's clip-on tie in 2001, though they later acknowledged that there is no evidence that the hijacker was the source of the sample material. \"The tie had two small DNA samples, and one large sample,\" said Special Agent Fred Gutt. \"It's difficult to draw firm conclusions from these samples.\"Cloherty, Jack (August 9, 2011): D.B. Cooper DNA Results: \"Not A Match\". [http://abcnews.go.com/US/db-cooper-dna-results-match/story?id14258726 ABCNews.com] Retrieved August 9, 2011 The bureau also made public a file of previously unreleased evidence, including Cooper's 1971 plane ticket from Portland to Seattle (price: $20.00, paid in cash), and posted previously unreleased composite sketches and fact sheets, along with a request to the general public for information which might lead to Cooper's positive identification.\n\nThey also disclosed that Cooper chose the older of the two primary parachutes supplied to him, rather than the technically superior professional sport parachute; and that from the two reserve parachutes, he selected a \"dummy\"—an unusable unit with an inoperative ripcord intended for classroom demonstrations, although it had clear markings identifying it to any experienced skydiver as non-functional. (He cannibalized the other, functional reserve parachute, possibly using its shrouds to tie the money bag shut, and to secure the bag to his body as witnessed by Mucklow) The FBI stressed that inclusion of the dummy reserve parachute, one of four obtained in haste from a Seattle skydiving school, was accidental.\n\nIn March 2009, the FBI disclosed that Tom Kaye, a paleontologist from the Burke Museum of Natural History and Culture in Seattle, had assembled a team of \"citizen sleuths\", including scientific illustrator Carol Abraczinskas and metallurgist Alan Stone. The group, eventually known as the Cooper Research Team, reinvestigated important components of the case using GPS, satellite imagery, and other technologies unavailable in 1971. While little new information was gained regarding the buried ransom money or Cooper's landing zone, they were able to find and analyze hundreds of minute particles on Cooper's tie using electron microscopy. Lycopodium spores (likely from a pharmaceutical product) were identified, as well as fragments of bismuth and aluminum.\n\nIn November 2011, Kaye announced that particles of pure (unalloyed) titanium had also been found on the tie. He explained that titanium, which was much rarer in the 1970s than it is today, was at that time found only in metal fabrication or production facilities, or at chemical companies using it (combined with aluminum) to store extremely corrosive substances.Ingalls C (November 23, 2011): \"40 years later, new evidence unveiled in DB Cooper case\".  [http://www.king5.com/news/investigators/40-years-after-the-crime-new-evidence-unveiled-in-DB-Cooper-case-134417003.html King5.com archive] . Retrieved May 29, 2013 The findings suggested that Cooper may have been a chemist or a metallurgist, or possibly an engineer or manager (the only employees who wore ties in such facilities at that time) in a metal or chemical manufacturing plant,Johnson, Gene (AP) (November 23, 2011). 40 years later, DB Cooper's identity a mystery. [http://www.kgw.com/news/local/40-years-later-DB-Coopers-identity-a-mystery--134407308.html KGW.com, Portland, OR] Retrieved November 23, 2011  or at a company that recovered scrap metal from those types of factories. In January 2017, Kaye reported that rare earth minerals such as cerium and strontium sulfide had also been identified among particles from the tie. One of the rare applications for such elements in the 1970s was Boeing's supersonic transport development project, suggesting the possibility that Cooper was a Boeing employee.[https://www.usatoday.com/story/news/nation-now/2017/01/13/scientists-say-they-may-have-new-evidence-db-cooper-case/96575858/ Scientists say they may have new evidence in D.B. Cooper case]. USA Today (January 13, 2017), retrieved January 16, 2017.[http://www.king5.com/news/crime/new-evidence-was-db-cooper-boeing-employee/385924766 New evidence: Was DB Cooper a Boeing employee?] King5.com, retrieved January 16, 2017. Other possible sources of the material included plants that manufactured cathode ray tubes, such as the Portland firms Teledyne and Tektronix.\n\nTheories and conjectures\n\nOver the 45-year span of its active investigation, the FBI periodically made public some of its working hypotheses and tentative conclusions, drawn from witness testimony and the scarce physical evidence.\n\nThe official physical description remained unchanged, and is considered reliable. Flight attendants Schaffner and Mucklow, who spent the most time with Cooper, were interviewed on the same night in separate cities, and gave nearly identical descriptions: 5 ft to 6 ft tall, 170 to, mid-40s, with close-set piercing brown eyes and swarthy skin.\n\nCooper appeared to be familiar with the Seattle area and may have been an Air Force veteran, based on testimony that he recognized the city of Tacoma from the air as the jet circled Puget Sound, and his accurate comment to Mucklow that McChord Air Force Base was approximately 20 minutes' driving time from the Seattle-Tacoma Airport—a detail most civilians would not know, or comment upon. His financial situation was very likely desperate, as extortionists and other criminals who steal large amounts of money nearly always do so, according to experts, because they need it urgently; otherwise, the crime is not worth the considerable risk. (A minority opinion is that Cooper was \"a thrill seeker\" who made the jump \"just to prove it could be done.\")\n\nAgents theorized that he took his alias from a popular Belgian comic book series of the 1970s featuring the fictional hero Dan Cooper, a Royal Canadian Air Force test pilot who took part in numerous heroic adventures, including parachuting. (One cover from the series, reproduced on the FBI web site, depicts test pilot Cooper skydiving in full paratrooper regalia.) Because the Dan Cooper comics were never translated into English, nor imported to the US, they speculated that he may have encountered them during a tour of duty in Europe. Tom Kaye's Cooper Research Team (see Ongoing investigation) suggested the alternative possibility that Cooper was Canadian, and found the comics in Canada, where they were also sold.Boswell, Randy (November 24, 2011). FBI-backed team finds Canadian link to famous '70s plane hijacking [http://news.nationalpost.com/2011/11/24/fbi-backed-team-finds-canadian-link-to-famous-60s-era-plane-hijacking/ Canadian National Post archive] Retrieved December 5, 2011 They noted his specific demand for \"negotiable American currency\", a phrase seldom if ever used by American citizens; since witnesses stated that Cooper had no distinguishable accent, Canada would be his most likely country of origin if he were not a US citizen.Research Summary. [http://www.citizensleuths.com/conclusions.html Cooper Research Team web site]  Retrieved December 7, 2011\n\nEvidence suggested that Cooper was knowledgeable about technique, aircraft, and the terrain. He demanded four parachutes to force the assumption that he might compel one or more hostages to jump with him, thus ensuring he would not be deliberately supplied with sabotaged equipment. He chose a 727-100 aircraft because it was ideal for a bail-out escape, due not only to its aft airstair but also the high, aftward placement of all three engines, which allowed a reasonably safe jump without risk of immediate incineration by jet exhaust. It had \"single-point fueling\" capability, a recent innovation that allowed all tanks to be refueled rapidly through a single fuel port. It also had the ability (unusual for a commercial jet airliner) to remain in slow, low-altitude flight without stalling; and Cooper knew how to control its air speed and altitude without entering the cockpit, where he could have been overpowered by the three pilots. In addition, Cooper was familiar with important details, such as the appropriate flap setting of 15 degrees (which was unique to that aircraft), and the typical refueling time. He knew that the aft airstair could be lowered during flight—a fact never disclosed to civilian flight crews, since there was no situation on a passenger flight that would make it necessary—and that its operation, by a single switch in the rear of the cabin, could not be overridden from the cockpit. Some of this knowledge was virtually unique to Central Intelligence Agency paramilitary units.\n\nAccording to Kaye's research team, Cooper's meticulous planning may also have extended to the timing of his operation, and even his choice of attire. \"The FBI searched but couldn't find anyone who disappeared that weekend,\" Kaye wrote, suggesting that the perpetrator may have returned to his normal occupation. \"If you were planning on going 'back to work on Monday', then you would need as much time as possible to get out of the woods, find transportation and get home. The very best time for this is in front of a four-day weekend, which is the timing Dan Cooper chose for his crime.\" Furthermore, \"if he was planning ahead, he knew he had to hitchhike out of the woods, and it is much easier to get picked up in a suit and tie than in old blue jeans.\"\n\nCooper adopted careful planning and attention to detail, but the bureau felt strongly that he lacked crucial skydiving skills and experience. \"We originally thought Cooper was an experienced jumper, perhaps even a paratrooper,\" said Special Agent Larry Carr, leader of the investigative team from 2006 until its dissolution in 2016. \"We concluded after a few years this was simply not true. No experienced parachutist would have jumped in the pitch-black night, in the rain, with a 200-mile-an-hour wind in his face, wearing loafers and a trench coat. It was simply too risky. He also missed that his reserve 'chute was only for training, and had been sewn shut—something a skilled skydiver would have checked.\" He also failed to bring or request a helmet, chose to jump with the older and technically inferior of the two primary parachutes supplied to him, and jumped into a  wind chill without proper protection against the extreme cold.In Search of D.B. Cooper: New Developments in the Unsolved Case (March 17, 2009). [https://archives.fbi.gov/archives/news/stories/2009/march/in-search-of-d.b.-cooper/dbcooper_031709 FBI.gov] Retrieved November 9, 2016.\n\nThe FBI speculated from the beginning that Cooper did not survive his jump. \"Diving into the wilderness without a plan, without the right equipment, in such terrible conditions, he probably never even got his 'chute open,\" said Carr. Even if he did land safely, agents contended that survival in the mountainous terrain at the onset of winter would have been all but impossible without an accomplice at a predetermined landing point. This would have required a precisely timed jump—necessitating, in turn, cooperation from the flight crew. There is no evidence that Cooper requested or received any such help from the crew, nor that he had any clear idea where he was when he jumped into the stormy, overcast darkness.\"It's an Enigma.\" [http://www.jcs-group.com/enigma/crimes/cooper.html JCS-Group.com] Recovered January 31, 2011.\n\nSpeculation over motive\n\nIn addition to planning his escape, Cooper retrieved the note and wore dark glasses, which indicated that he had a certain level of sophistication in avoiding the things that had aided the identification of the perpetrator of the best-known case of a ransom: the Lindbergh kidnapping. It is not clear how he could have reasonably expected to ever spend the money, fence it at a discount or otherwise profit. While Cooper made the familiar-from-fiction demand of  non-sequentially numbered small bills,  mass publicity over the Lindbergh kidnapping had long made it public knowledge that even with thirties technology, getting non-sequential bills in a ransom was no defense against the numbers being logged and used to track down a perpetrator. In the Lindbergh case, fencing what he could as hot money and being very careful with what he did personally pass, the perpetrator had been caught through the  ransom money nonetheless, with identification and handwriting evidence only brought in at the trial. Acamstoday, The Lindbergh Case: How Bankers Helped Solve It http://www.acamstoday.org/the-lindberg-case-how-banker-helped-solve-it/  \n\nAlthough unconscionably perilous by the high safety, training and equipment standards of skydivers, whether Cooper's jump was virtually suicidal is a matter of dispute. The author of an overview and  comparison of World War II aircrew bail-outs with Cooper's drop asserts a probability for his survival, and suggests that like copycat Martin McNally, Cooper lost the ransom during descent. The mystery of how the ransom could have been washed into Tena Bar from any Cooper jump area remains.Survival Probability Analysis of the D.B. Cooper Hijacking, using Historical Parachuting Data, December 1, 2014, Martin Andrade Jr, MBA, https://martinandrade.files.wordpress.com/2014/12/dbcooperfinalupdated.pdf The Tena Bar find anomalies led one local journalist to suggest Cooper, knowing that he could never spend it, dumped the ransom.\n\nInvestigation suspended\n\nOn July 8, 2016, the FBI announced that it was suspending active investigation of the Cooper case, citing a need to focus its investigative resources and manpower on issues of higher and more urgent priority. Local field offices will continue to accept any legitimate physical evidence—related specifically to the parachutes or the ransom money—that may emerge in the future. The 60-volume case file compiled over the 45-year course of the investigation will be preserved for historical purposes at FBI headquarters in Washington, D.C.\n\nCopycat hijackings\n\nCooper was not the first to attempt air piracy for personal gain. In early November 1971, for example, a Canadian man named Paul Joseph Cini hijacked an Air Canada DC-8 over Montana, but was overpowered by the crew when he put down his shotgun to strap on the parachute he had brought with him.Koerner, B (June 14, 2013). Paul Joseph Cini. [http://www.slate.com/articles/life/history/features/2013/skyjacker_of_the_day/paul_joseph_cini_hijacked_a_plane_because_he_had_an_idea_parachuting.html Slate.com archive], retrieved September 4, 2015. Cooper's apparent success inspired a flurry of imitators, mostly during 1972. Some notable examples:\n\n* Garrett Brock Trapnell hijacked a TWA airliner en route from Los Angeles to New York City in January. He demanded $306,800 in cash, the release of Angela Davis, and an audience with President Richard Nixon. After the aircraft landed at John F. Kennedy International Airport, he was shot and wounded by FBI agents, then arrested.Killen, Andreas (January 15, 2005). The First Hijackers. [https://www.nytimes.com/2005/01/16/magazine/16HIJACKERS.html?pagewanted=print&position New York Times Archive.] Retrieved June 29, 2011.\n* Richard Charles LaPoint, an Army veteran and \"New England beach bum\", boarded Hughes Airwest Flight 800 at McCarran airport in Las Vegas on January 20. Brandishing what he claimed was a bomb while the DC-9 was on the taxiway, he demanded $50,000, two parachutes, and a helmet. After releasing the passengers and two flight attendants, he ordered the plane on an eastward trajectory toward Denver, then bailed out over the treeless plains of northeastern Colorado. Authorities, tracking the locator-equipped parachute and his footprints in the snow and mud, apprehended him a few hours later. \n* Richard McCoy, Jr., a former Army Green Beret,Skyjacker – The Richard McCoy Jr. Story (March 2, 2011). [http://parachutistonline.com/feature/skyjacker—-richard-mccoy-jr-story ParachutistOnLine.com] Retrieved February 25, 2013. hijacked a United Airlines 727-100 in April after it left Denver, Colorado, diverted it to San Francisco, then bailed out over Utah with $500,000 in ransom money. He landed safely, but was arrested two days later.Richard Floyd McCoy, Jr. – aircraft hijacking. [https://www.fbi.gov/about-us/history/famous-cases/richard-floyd-mccoy – FBI.gov]  Retrieved March 8, 2011.\n* Frederick Hahneman used a handgun to hijack an Eastern Air Lines 727 in Allentown, Pennsylvania, in May, demanded $303,000, and eventually parachuted into Honduras, his country of birth. A month later, with the FBI in pursuit and a $25,000 bounty on his head, he surrendered at the American Embassy in Tegucigalpa.Whelan, Frank (June 30, 1985): \"A-B-E Hijacker Who Parachuted into Jungle Is Free From Prison Air Piracy\" [http://articles.mcall.com/1985-06-30/news/2464617_1_hijacking-eastern-airlines-night-clerk Morning Call Archive] Retrieved August 3, 2011.Lehigh Valley International Airport began as airmail stop (September 3, 2010). [http://lehighvalleyhistory.blogspot.com/2010_09_01_archive.html Lehigh Valley History] Retrieved March 8, 2011.\n* Robb Dolin Heady, a paratrooper and Vietnam veteran, stormed a United Airlines 727 in Reno in early June, extorted $200,000 and two parachutes, and jumped into darkness near Washoe Lake, about 25 mi south of Reno. Police found Heady's car (sporting a United States Parachute Association bumper sticker) parked near the lake and arrested him as he returned to it the next morning.Heady, 22, Night jump, Reno, $200k, Vietnam vet, gun, sticker, caught immediately (August 1, 2008). [http://www.dropzone.com/cgi-bin/forum/gforum.cgi?post3286950 Dropzone.com] Retrieved March 8, 2011.Photo of Heady's arrest (June 3, 1972). [http://www.dropzone.com/cgi-bin/forum/gforum.cgi?do\npost_attachment;postatt_id101982;guest\n77543628 Dropzone.com] Retrieved March 8, 2011.\n* Martin McNally, an unemployed service-station attendant, used a submachine gun in late June to commandeer an American Airlines 727 en route from St. Louis to Tulsa, then diverted it eastward to Indiana and bailed out with $500,000 in ransom. McNally lost the ransom money as he exited the aircraft, but landed safely near Peru, Indiana, and was apprehended a few days later in a Detroit suburb.Curtis, Gene (July 8, 2007). Only in Oklahoma: Skyjacker nabs Tulsa plane in error-filled romp. [http://www.tulsaworld.com/webextra/itemsofinterest/centennial/centennial_storypage.asp?ID=070729_1_A4_spanc01672 TulsaWorld.com archive] Retrieved March 8, 2011.\n\nIn all, 15 hijackings similar to Cooper's—all unsuccessful—were attempted in 1972. With the advent of universal luggage searches in 1973 (see Airport security), the general incidence of hijackings dropped precipitously. There were no further notable Cooper imitators until July 11, 1980, when Glenn K. Tripp seized Northwest flight 608 at Seattle-Tacoma Airport, demanding $600,000 ($100,000 by an independent account),Codename: Norjak The Skyjacking of Northwest Flight 305. [http://www.check-six.com/Crash_Sites/NWA305-DBCooper.htm Check-Six.com] Retrieved March 4, 2013. two parachutes, and the assassination of his boss. After a 10-hour standoff, he was apprehended, but on January 21, 1983—while still on probation—he hijacked the same Northwest flight, this time en route, and demanded to be flown to Afghanistan. When the plane landed in Portland, he was shot and killed by FBI agents.Mickolus, E.F. and Simmons, S.L. (January 12, 2011): The Terrorist List. Westport, CT: Praeger Publishers, p. 273. . Retrieved March 4, 2013.\n\nSuspects\n\nBetween 1971 and 2016, the FBI processed over a thousand \"serious suspects\", which included assorted publicity seekers and deathbed confessors. While none of the suspects satisfied the bureau's standard of \"beyond a reasonable doubt\", a handful of men—and one woman—continued to be treated as suspects by various private individuals and groups. The decision to retain the suspects was based on varying amounts of evidence, both real and imagined. Some notable examples:\n\nTed Mayfield\n\nTheodore E. Mayfield was an Army Special Forces veteran, pilot, competitive skydiver, and skydiving instructor who served time in 1994 for negligent homicide after two of his students died when their parachutes failed to open.Skydiving Operator Faces Charges Over Deaths of 2 Jumpers (February 13, 1995). [http://community.seattletimes.nwsource.com/archive/?date19950213&slug\n2104806 Seattle Times archive]. Retrieved October 10, 2012  Later, he was found indirectly responsible for 13 additional skydiving deaths due to faulty equipment and training.  His criminal record also included armed robbery and transportation of stolen aircraft.  In 2010, he was sentenced to three years' probation for piloting a plane 26 years after losing his pilot's license and rigging certificates.McCowan, Karen (January 20, 2010). Illegal flight lands pilot in trouble once again. [http://special.registerguard.com/csp/cms/sites/web/news/cityregion/24367930-41/mayfield-faa-1994-eugene-license.csp Register-Guard archive] Retrieved February 24, 2011. He was suggested repeatedly as a suspect early in the investigation, according to FBI Agent Ralph Himmelsbach, who knew Mayfield from a prior dispute at a local airport. He was ruled out, based partly on the fact that he called Himmelsbach less than two hours after Flight 305 landed in Reno to volunteer advice on standard skydiving practices and possible landing zones.\n\nIn 2006, two amateur researchers named Daniel Dvorak and Matthew Myers proposed Mayfield as a suspect once again, asserting that they had assembled a convincing circumstantial case that would be detailed in a forthcoming book. Retrieved February 24, 2011.  They theorized that Mayfield called Himmelsbach not to offer advice, but to establish an alibi; and they challenged Himmelsbach's conclusion that Mayfield could not possibly have found a phone in time to call the FBI less than four hours after jumping into the wilderness at night. Mayfield denied any involvement, and repeated a previous assertion that the FBI called him five times while the hijacking was still in progress to ask about parachutes, local skydivers, and skydiving techniques. (Himmelsbach said the FBI never called Mayfield.)  Mayfield further charged that Dvorak and Myers asked him to play along with their theory, and \"we'll all make a lot of money\". (Dvorak and Myers called any inference of collusion a \"blatant lie\".)\n\nDvorak died in 2007, and the promised book was never published. The FBI offered no comment beyond Himmelsbach's original statement that Mayfield, who died in 2015,Smith, BA (August 15, 2015). DB Cooper suspect, Ted Mayfield, killed in aviation accident. [http://themountainnewswa.net/2015/08/30/db-cooper-suspect-ted-mayfield-killed-in-aviation-accident/ The Mountain News], retrieved October 4, 2015. was ruled out as a suspect early on.\n\nJack Coffelt\n\nCoffelt was a conman, ex-convict, and purported government informant who claimed to have been the chauffeur and confidante of Abraham Lincoln's last undisputed descendant, great-grandson Robert Todd Lincoln Beckwith. In 1972 he began claiming he was D.B. Cooper, and attempted through an intermediary, a former cellmate named James Brown, to sell his story to a Hollywood production company. He said he landed near Mount Hood, about 50 mi southeast of Ariel, injuring himself and losing the ransom money in the process. Photos of Coffelt bear a resemblance to the composite drawings, although he was in his mid-fifties in 1971. He was reportedly in Portland on the day of the hijacking, and sustained leg injuries around that time which were consistent with a skydiving mishap.\n\nCoffelt's account was reviewed by the FBI, which concluded that it differed in significant details from information that had not been made public, and was therefore a fabrication. Brown, undeterred, continued peddling the story long after Coffelt died in 1975. Multiple media venues, including the television news program 60 Minutes, considered and rejected it. In a 2008 book about Lincoln's descendants,Lachman, Charles (2008). The Last Lincolns: The Rise & Fall of a Great American Family. Union Square Press. . author Charles Lachman revisited Coffelt's tale although it had been discredited 36 years before.\n\nRichard Floyd McCoy Jr.\n\nMcCoy was an Army veteran who served two tours of duty in Vietnam, first as a demolition expert, and later, with the Green Berets, as a helicopter pilot. After his military service he became a warrant officer in the Utah National Guard and an avid recreational skydiver, with aspirations, he said, of becoming a Utah State Trooper.\n\nOn April 7, 1972 McCoy staged the best-known of the so-called \"copycat\" hijackings (see above). He boarded United Airlines' Flight 855 (a Boeing 727 with aft stairs) in Denver, and brandishing what later proved to be a paperweight resembling a hand grenade and an unloaded handgun, he demanded four parachutes and $500,000. After delivery of the money and parachutes at San Francisco International Airport, McCoy ordered the aircraft back into the sky and bailed out over Provo, Utah, leaving behind his handwritten hijacking instructions and his fingerprints on a magazine he had been reading.Famous Cases & Criminals. [https://www.fbi.gov/about-us/history/famous-cases/richard-floyd-mccoy FBI.gov]  Retrieved May 29, 2013 He was arrested on April 9 with the ransom cash in his possession, and after trial and conviction, received a 45-year sentence. Two years later he escaped from Lewisburg Federal Penitentiary with several accomplices by crashing a garbage truck through the main gate. Tracked down three months later in Virginia Beach, McCoy was killed in a shootout with FBI agents.Funk, Marianne (February 21, 1992). McCoy's Widow Admits Helping in '72 Hijacking. [http://www.deseretnews.com/article/211317/MCCOYS-WIDOW-ADMITS-HELPING-IN-72-HIJACKING.html Deseret News Archive] Retrieved February 21, 2011.\n\nIn their 1991 book, D.B. Cooper: The Real McCoy,Rhodes B, Calame R. D.B. Cooper: The Real McCoy. Univ. of Utah Press (1991).  parole officer Bernie Rhodes and former FBI agent Russell Calame asserted that they had identified McCoy as D.B. Cooper. They cited obvious similarities in the two hijackings, claims by McCoy's family that the tie and mother-of-pearl tie clip left on the plane belonged to McCoy, and McCoy's own refusal to admit or deny that he was Cooper. A proponent of their theory was the FBI agent who killed McCoy. \"When I shot Richard McCoy,\" he said, \"I shot D. B. Cooper at the same time.\"\n\nWhile there is no reasonable doubt that McCoy committed the Denver hijacking, the FBI does not consider him a suspect in the Cooper case because of significant mismatches in age and description;Some notable examples, cited by Rhodes and Calame: Cooper's age was estimated by all witnesses as mid-40s, McCoy was 29; most witnesses, including all three flight attendants, said Cooper had \"dark brown, piercing\" eyes, McCoy's eyes were light blue; Cooper's ears had no distinguishing characteristics, McCoy's ears stuck out so prominently that his nickname was \"Dumbo\", and he wore a scarf to conceal them during the Denver hijacking; Cooper drank bourbon and chain-smoked cigarettes, McCoy was an observant Mormon who did not smoke or drink alcohol; Cooper was described as having a raspy voice with no particular accent, McCoy had a noticeable southern accent, and a marked lisp due to surgical correction of a cleft palate in childhood. Rhodes & Calame (1991), pp. 86, 94, 96, 134, 145. a level of skydiving skill well above that thought to be possessed by the hijacker; and credible evidence that McCoy was in Las Vegas on the day of the Portland hijacking, and at home in Utah the day after, having Thanksgiving dinner with his family.\n\nRobert Rackstraw\n\nRobert Wesley Rackstraw is a retired pilot and ex-convict who served on an army helicopter crew and other units during the Vietnam War. He came to the attention of the Cooper task force in February 1978, after he was arrested in Iran and deported to the U.S. to face explosive possession and check kiting charges. Several months later, while released on bail, Rackstraw attempted to fake his own death by radioing a false mayday call and telling controllers that he was bailing out of a rented plane over Monterey Bay.[http://www.mercurynews.com/2016/07/12/d-b-cooper-investigation-focuses-on-california-off-the-books-genius-robert-rackstraw/ D.B. Cooper investigation focuses on California 'off-the-books genius' Robert Rackstraw.] San Jose Mercury News (July 12, 2016), retrieved September 8, 2016. Police later arrested him in Fullerton on an additional charge of forging federal pilot certificates; the plane he claimed to have ditched was found, repainted, in a nearby hangar.Wilkinson, J. (September 9, 2016). [http://www.dailymail.co.uk/news/article-3781043/Is-Robert-Henry-Rackstraw-really-plane-hijacker-DB-Cooper-Filmmaker-sues-FBI-prove-theory.html Is this maverick ex-Army pilot who faked his own death in a plane crash DB Cooper?] dailymail.com, retrieved December 13, 2016. Cooper investigators noted his physical resemblance to Cooper composite sketches (although he was only 28 in 1971), military parachute training, and criminal record, but eliminated him as a suspect in 1979 after no direct evidence of his involvement could be found.\n\t \nIn 2016, Rackstraw re-emerged as a suspect in a History Channel program and a book.Colbert T, Szollosi T. The Last Master Outlaw. Jacaranda Roots Publishing (2016).  On September 8, 2016, Thomas J. Colbert, an author of the book The Last Master Outlaw, filed a lawsuit to compel the FBI to release its Cooper case file under the Freedom of Information Act. The suit alleges that the FBI suspended active investigation of the Cooper case \"... in order to undermine the theory that Rackstraw is D.B. Cooper so as to prevent embarrassment for the bureau's failure to develop evidence sufficient to prosecute him for the crime.\"[http://www.oregonlive.com/pacific-northwest-news/index.ssf/2016/09/lawsuit_filed_against_fbi_to_m.html Lawsuit filed against FBI to make D.B. Cooper investigation file public]. The Oregonian (September 8, 2016), retrieved September 22, 2016. In January 2018, a small cold case documentary team reported that they had obtained a letter originally written in December 1971 and sent to the New York Times, Los Angeles Times, Seattle Times and Washington Post, with numerous numbers and letters written on it. The team, led by Tom and Dawna Colbert, says that the codes were deciphered and matched to three units Rackstraw was a part of while in the Army, and the FBI refused to acknowledge the findings because \"it would have to admit that amateur sleuths had cracked a case the bureau couldn't\".\n\nOne of the Flight 305 flight attendants reportedly \"did not find any similarities\" between photos of Rackstraw from the 1970s and her recollection of Cooper's appearance.Dodd, J. (July 12, 2016). [http://people.com/crime/db-cooper-robert-rackstraw-accused-in-history-channel-show-denies-accusation/ Man Identified in History Channel Show as Notorious Skyjacker D.B. Cooper Denies Accusation]. People.com, retrieved December 13, 2016.Walsh, S. (July 11, 2016). [http://heavy.com/news/2016/07/robert-rackstraw-db-cooper-case-closed-documentary-culprit-who-is/ Robert Rackstraw: 5 Fast Facts You Need to Know]. Heavy.com, retrieved December 13, 2016. Rackstraw's attorney called the renewed allegations \"the stupidest thing I've ever heard\",[http://miami.cbslocal.com/2016/07/13/fbi-closes-case-on-d-b-cooper-skyjacking-mystery/ FBI Closes Case On D.B. Cooper Skyjacking Mystery]. CBS Miami (July 13, 2016), retrieved September 8, 2016. and Rackstraw himself told People.com, \"It's a lot of [expletive], and they know it is.\" The FBI declined further comment. Rackstraw stated in a 2017 phone interview that he lost his job over the 2016 investigations.\n\nDuane Weber\n\nDuane L. Weber was a World War II Army veteran who served time in at least six prisons from 1945 to 1968 for burglary and forgery. He was proposed as a suspect by his widow, based primarily on a deathbed confession: Three days before he died in 1995, Weber told his wife, \"I am Dan Cooper.\" The name meant nothing to her, she said; but months later, a friend told her of its significance in the hijacking. She went to her local library to research D.B. Cooper, found Max Gunther's book, and discovered notations in the margins in her husband's handwriting.\n\nShe then recalled, in retrospect, that Weber once had a nightmare during which he talked in his sleep about jumping from a plane, leaving his fingerprints on the \"aft stairs\". He also reportedly told her that an old knee injury had been incurred by \"jumping out of a plane\". Like the hijacker, Weber drank bourbon and chain smoked. Other circumstantial evidence included a 1979 trip to Seattle and the Columbia River, during which Weber took a walk alone along the river bank in the Tina Bar area; four months later Brian Ingram made his ransom cash discovery in the same area.\n\nThe FBI eliminated Weber as an active suspect in July 1998 when his fingerprints did not match any of those processed in the hijacked plane, and no other direct evidence could be found to implicate him. Later, his DNA also failed to match the samples recovered from Cooper's tie, though the bureau has since conceded that they cannot be certain that the organic material on the tie came from Cooper.\n\nJohn List\n\nList was an accountant and World War II and Korean War veteran who murdered his wife, three teenage children, and 85-year-old mother in Westfield, New Jersey, 15 days before the Cooper hijacking, withdrew $200,000 from his mother's bank account, and disappeared. He came to the attention of the Cooper task force due to the timing of his disappearance, multiple matches to the hijacker's description, and the reasoning that \"a fugitive accused of mass murder has nothing to lose.\" After his capture in 1989, List admitted to murdering his family, but denied any involvement in the Cooper hijacking. While his name continues to crop up in Cooper articles and documentaries, no substantive evidence implicates him, and the FBI no longer considers him a suspect. He died in prison in 2008.\n\nWilliam Gossett\n\nGossett was a Marine Corps, Army, and Army Air Force veteran who saw action in Korea and Vietnam. His military experience included advanced jump training and wilderness survival. After retiring from military service in 1973, he worked as an ROTC instructor, taught military law at Weber State University in Ogden, Utah, and hosted a radio talk show in Salt Lake City which featured discussions about the paranormal.Craig, John S. \"D.B. Cooper Suspect Named: William Pratt Gossett,\" associatedcontent.com. He died in 2003.\n\nGossett was widely known to be obsessed with the Cooper hijacking. He amassed a voluminous collection of Cooper-related news articles, and told one of his wives that he knew enough about the case to \"write the epitaph for D.B. Cooper\". Late in his life he reportedly told three of his sons, a retired Utah judge, and a friend in the Salt Lake City public defender's office that he had committed the hijacking.Yet Another D. B. Cooper Suspect: William Pratt \"Wolfgang\" Gossett. [http://crimeslam.com/2008/05/yet-another-d-b-cooper-suspect-william.html Crime Slam]  Retrieved February 1, 2011. Photos of Gossett taken circa 1971 bear a close resemblance to the most widely circulated Cooper composite drawing.[http://www.coasttocoastam.com/photo/view/d_b_cooper_suspect/37861 Photos of Gossett, 1967–73] Retrieved February 2, 2011.\n\nAccording to Galen Cook, a lawyer who has collected information related to Gossett for years, Gossett once showed his sons a key to a Vancouver, British Columbia safe deposit box which, he claimed, contained the long-missing ransom money. Gossett's eldest son, Greg, said that his father, a compulsive gambler who was always \"strapped for cash\", showed him \"wads of cash\" just before Christmas 1971, weeks after the Cooper hijacking. He speculated that Gossett gambled the money away in Las Vegas.\n\nIn 1988 Gossett changed his name to \"Wolfgang\" and became a Catholic priest, which Cook and others interpreted as an effort to disguise his identity. Other circumstantial evidence includes testimony that Cook claims to have obtained from William Mitchell, a passenger on the hijacked aircraft, regarding a mysterious \"physical detail\" (which he will not divulge) common to the hijacker and Gossett.Craig, John S. \"1971 D.B. Cooper Letters Linked to Suspect William Gossett,\" associatedcontent.com. Cook also claims to have found \"possible links\" to Gossett in each of four letters signed by \"D.B. Cooper\" and mailed to three newspapers within days after the hijacking, although there is no evidence that the actual hijacker created or mailed any of the letters.\n\nThe FBI has no direct evidence implicating Gossett, and cannot even reliably place him in the Pacific Northwest at the time of the hijacking.Spencer, Kent (November 21, 2011): Skyjacker D.B. Cooper 'enjoyed the Grey Cup game,' according to 1971 letter attributed to him. [http://news.nationalpost.com/2011/11/24/skyjacker-d-b-cooper-enjoyed-the-grey-cup-game-according-to-1971-letter-attributed-to-him/ National Post archive] Retrieved December 1, 2011 \"There is not one link to the D.B. Cooper case,\" said Special Agent Carr, \"other than the statements [Gossett] made to someone.\"\"[http://www.deseretnews.com/article/700246479/Was-DB-Cooper-an-Ogden-resident.html?pg\nall  Was D.B. Cooper an Ogden Resident?]\" (July 28, 2008) Deseret News (Salt Lake City) via Associated Press. Retrieved February 1, 2011.\n\nKenneth Christiansen\n\nIn 2003, a Minnesota resident named Lyle Christiansen watched a television documentary about the Cooper hijacking and became convinced that his late brother Kenneth was D. B. Cooper. After repeated futile attempts to convince first the FBI, and then the author and film director Nora Ephron (who he hoped would make a movie about the case), he contacted a private investigator in New York City. In 2010 the detective, Skipp Porteous, published a book postulating that Christiansen was the hijacker. In early 2011 an episode of the History series Brad Meltzer's Decoded also summarized the circumstantial evidence linking Christiansen to the Cooper case.\n\nChristiansen enlisted in the army in 1944 and was trained as a paratrooper. The war had ended by the time he was deployed in 1945, but he made occasional training jumps while stationed in Japan with occupation forces in the late 1940s. After leaving the army he joined Northwest Orient in 1954 as a mechanic in the South Pacific, and subsequently became a flight attendant, and then a purser, based in Seattle. Christiansen was 45 years old at the time of the hijacking, but he was shorter (5 ft. 8 in.), thinner (150 pounds), and lighter complected than eyewitness descriptions. Christiansen smoked (as did the hijacker), and displayed a particular fondness for bourbon (Cooper's preferred beverage). He was also left-handed. (Evidence photos of Cooper's black tie show the tie clip applied from the left side, suggesting a left-handed wearer.) Flight attendant Florence Schaffner told a reporter that photos of Christiansen fit her memory of the hijacker's appearance more closely than those of other suspects she had been shown. (Tina Mucklow, who had the most contact with Cooper, has never granted a press interview.)\n\nChristiansen reportedly purchased a house with cash a few months after the hijacking. While dying of cancer in 1994 he told Lyle, \"There is something you should know, but I cannot tell you.\" Lyle said he never pressed his brother to explain. After Christiansen's death family members discovered gold coins and a valuable stamp collection, along with over $200,000 in bank accounts. They also found a folder of Northwest Orient news clippings which began about the time he was hired in the 1950s, and stopped just prior to the date of the hijacking, despite the fact that the hijacking was by far the most momentous news event in the airline's history. Christiansen continued to work part-time for the airline for many years after 1971, but apparently never clipped another Northwest news story.\n\nDespite the publicity generated by Porteous's book and the 2011 television documentary, the FBI is standing by its position that Christiansen cannot be considered a prime suspect. It cites a poor match to eyewitness physical descriptions, a level of skydiving expertise above that predicted by their suspect profile, and an absence of direct incriminating evidence.\n\nLynn Doyle Cooper\n\nL.D. Cooper, a leather worker and Korean War veteran, was proposed as a suspect in July 2011 by his niece, Marla Cooper.Provano, Joel (August 3, 2011): Woman claims D.B. Cooper was her uncle. [http://www.ajc.com/news/nation-world/woman-claims-d-b-1070683.html?cxtyperss_news_81960 AJC.com] Retrieved August 3, 2011. As an eight-year-old, she recalled Cooper and another uncle planning something \"very mischievous\", involving the use of \"expensive walkie-talkies\", at her grandmother's house in Sisters, Oregon, 150 mi south of Portland. The next day flight 305 was hijacked; and though the uncles ostensibly were turkey hunting, L.D. Cooper came home wearing a bloody shirt—the result, he said, of an auto accident. Later, she said, her parents came to believe that L.D. Cooper was the hijacker. She also recalled that her uncle, who died in 1999, was obsessed with the Canadian comic book hero Dan Cooper (see Theories and conjectures), and \"had one of his comic books thumbtacked to his wall\"—although he was not a skydiver or paratrooper.Thomas, P and Cloherty, J (August 3, 2011):  \"D.B. Cooper Exclusive: Did Niece Provide Key Evidence?\" [http://abcnews.go.com/US/db-cooper-exclusive-niece-provide-key-evidence/story?id=14219052 ABCNews.com] Retrieved August 3, 2011.\n\nIn August, New York magazine published an alternative witness sketch, reportedly based on a description by Flight 305 eyewitness Robert Gregory, depicting horn-rimmed sunglasses, a \"russet\"-colored suit jacket with wide lapels, and marcelled hair. The article notes that L.D. Cooper had wavy hair that looked marcelled (as did Duane Weber).\n\nOn August 3 the FBI announced that no fingerprints had been found on a guitar strap made by L.D. Cooper. One week later they added that his DNA did not match the partial DNA profile obtained from the hijacker's tie, but acknowledged, once again, that there is no certainty that the hijacker was the source of the organic material obtained from the tie. The bureau has made no further public comment.\n\nBarbara Dayton\n\nBarbara Dayton, a recreational pilot and University of Washington librarian who was born Robert Dayton in 1926, served in the Merchant Marine and then the army during World War II.  After discharge Dayton worked with explosives in the construction industry and aspired to a professional airline career, but could not obtain a commercial pilot's license.\n\nDayton underwent gender reassignment surgery in 1969 and changed her name to Barbara. She claimed to have staged the Cooper hijacking two years later, disguised as a man, in order to \"get back\" at the airline industry and the FAA, whose insurmountable rules and conditions had prevented her from becoming an airline pilot. She said she hid the ransom money in a cistern near her landing point in Woodburn, a suburban area south of Portland, Oregon. Eventually she recanted her entire story, ostensibly after learning that she could still be charged with the hijacking. The FBI has never commented publicly on Dayton, who died in 2002.\n\nRichard Lepsy \n\nRobert Lepsy was a 33-year-old grocery store manager and married father of four from Grayling, Michigan who disappeared in October 1969. His vehicle was found three days later at a local airport, and a man matching Lepsy's description was reportedly seen boarding a flight to Mexico. Authorities concluded that Lepsy had left voluntarily and closed their investigation. \n\nTwo years after the Cooper hijacking, family members noted that Lepsy's physical features resembled those in the Cooper composite drawings. They asserted that Cooper's clothing was described as very similar to Lepsy's grocery store uniform.   Lepsy was declared legally dead in 1976.  One of Lepsy's daughters submitted a DNA sample to the FBI in 2011, with unknown results.  Though Lepsy was proposed as a Cooper suspect in a 2014 book,Richardson, R. Still Missing: Rethinking the D.B. Cooper Case and Other Mysterious Unsolved Disappearances. Terra Mysteria Media (2014), pp. 142-7.  there is no record of public comment on him from the FBI.\n\nAftermath\n\nAirport security\n\nThe Cooper hijacking marked the beginning of the end for unfettered and unscrutinized airline travel. Despite the initiation of the federal Sky Marshal Program the previous year,Wu, Annie. The History of Airport Security. [http://savvytraveler.publicradio.org/show/features/2000/20000915/security.shtml SavvyTraveler.publicradio.org] Retrieved February 14, 2011. 31 hijackings were committed in U.S. airspace in 1972; 19 of them were for the specific purpose of extorting money and most of the rest were attempts to reach Cuba.Holden, Robert T. The Contagiousness of Aircraft Hijacking [http://pegasus.cc.ucf.edu/~surette/hijacking.html UCF.edu Archive] Retrieved February 14, 2011.  In 15 of the extortion cases the hijackers also demanded parachutes.Gladwell, Malcolm. The New Yorker (October 1, 2001): Safety in the Skies. [http://gladwell.com/safety-in-the-skies/ New Yorker Archive]  Retrieved February 14, 2011. In early 1973 the FAA began requiring airlines to search all passengers and their bags. Amid multiple lawsuits charging that such searches violated Fourth Amendment protections against search and seizure, federal courts ruled that they were acceptable when applied universally, and when limited to searches for weapons and explosives. In contrast to the 31 hijackings in 1972, only two were attempted in 1973, both by psychiatric patients, one of whom intended to crash the airliner into the White House to kill President Nixon.\n\nAircraft modifications\n\nIn the wake of multiple \"copycat\" hijackings in 1972, the FAA required that all Boeing 727 aircraft be fitted with a device, later dubbed the \"Cooper vane\", that prevents lowering of the aft airstair during flight. As direct result of the hijacking, the installation of peepholes was mandated in all cockpit doors. This made it possible for the cockpit crew to observe people in the passenger cabin without having to open the cockpit door.\n\nSubsequent history of N467US\n\nIn 1978 the hijacked 727-100 aircraft was sold by Northwest to Piedmont Airlines where it was re-registered N838N and continued in domestic carrier service.[http://www.jetpiedmont.com/ Piedmont Historical Archives] Retrieved May 29, 2013. In 1984 it was purchased by the now-defunct charter company Key Airlines, re-registered N29KA, and incorporated into the Air Force's civilian charter fleet that shuttled workers between Nellis Air Force Base and the Tonopah Test Range during the top-secret F-117 Nighthawk development program.Hengi, B.I. Airlines Remembered. Midland (June 10, 2000). , pp. 56–7. In 1996 the aircraft was scrapped for parts in a Memphis boneyard.\n\nEarl Cossey\n\nIn late April 2013, Earl Cossey – the owner of the skydiving school that furnished the four parachutes that were given to Cooper – was found dead in his home in Woodinville, a suburb of Seattle. His death was ruled a homicide due to blunt-force trauma to the head. The perpetrator remains unknown.Baumann, L (May 7, 2013): \"Man Who Packed DB Cooper's Parachutes ID'd as Woodinville Homicide Victim\". [http://woodinville.patch.com/groups/police-and-fire/p/homicide-victim-identified-as-earl-cossey-of-woodinville Woodinville Patch]. Retrieved May 29, 2013 Conspiracy theorists immediately began pointing out possible links to the Cooper case,Smith, BA (May 4, 2013): \"Update on the murder of Earl Cossey, an analysis of his role in the DB Cooper case\". [http://themountainnewswa.net/2013/05/04/update-on-the-murder-of-earl-cossey-an-analysis-of-his-role-in-the-db-cooper-case/ The Mountain News]. Retrieved May 29, 2013 but authorities responded that they have no reason to believe that any such link exists.Johnson G (April 30, 2013): \"Earl Cossey, DB Cooper Parachute Packer, ID'd As Homicide Victim\". [http://www.huffingtonpost.com/2013/04/30/earl-cossey-db-cooper-par_n_3188745.html HuffingtonPost.com] Retrieved May 29, 2013 Woodinville officials later announced that burglary was most likely the motive for the crime.Bauman, L (May 12, 2013). Cossey Murder: Woodinville Police Chief Classifies it as Burglary. [http://woodinville.patch.com/groups/police-and-fire/p/earl-cossey-murder-woodinville-police-chief-classifie5175f3af01 WoodinvillePatch.com archive]. Retrieved October 28, 2013.\n\nCultural phenomena\n\nD.B. Cooper was undeniably an air pirate and extortionist (Himmelsbach famously called him a \"rotten sleazy crook\") who endangered the lives of 42 people and caused immeasurable inconvenience for many others. His bold and adventurous crime inspired a cult following that was expressed in song, film, and literature.  Restaurants and bowling alleys in the Pacific Northwest hold regular Cooper-themed promotions and sell tourist souvenirs.  A \"Cooper Day\" celebration has been held at the Ariel General Store and Tavern each November since 1974 with the exception of 2015, the year its owner, Dona Elliot, died.  \n\nCooper has appeared in the storylines of the television series Prison Break, NewsRadio, and Numb3rs, the 2004 film Without a Paddle, and a book titled The Vesuvius Prophecy, based on The 4400 TV series. Over the years there have been a few small bars in various United States cities named D.B. Cooper's. D. B. Cooper. http://en.wikipedia.org/?curid=8799."
  }
}
