{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7734",
  "eid" : "e31a70d0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778460765,
  "textBody" : "The Central Pacific Railroad (CPRR) was a rail route between California and Utah built eastwards from the West Coast in the 1860s, to complete the western part of the \"First Transcontinental Railroad\" in North America. It later became part of the Union Pacific Railroad.\n\nMany 19th century national proposals to build a transcontinental railroad failed because of the energy consumed by political disputes over slavery. With the secession of the South, the modernizers in the Republican Party controlled the US Congress. They passed legislation authorizing the railroad, with financing in the form of government railroad bonds. These were all eventually repaid with interest. The government and the railroads both shared in the increased value of the land grants, which the railroads developed. The construction of the railroad also secured for the government the economical \"safe and speedy transportation of the mails, troops, munitions of war, and public stores.\"\n\nAuthorization and construction\n\nPlanned by Theodore Judah, the Central Pacific Railroad was authorized by Congress in 1862. It was financed and built through \"The Big Four\" (who called themselves \"The Associates\"): Sacramento, California businessmen Leland Stanford, Collis Huntington, Charles Crocker, and Mark Hopkins. Crocker was in charge of construction. Construction crews comprised 12,000 Chinese emigrant workers by 1868, when they constituted eighty percent of the entire work force.[https://www.pbs.org/wgbh/americanexperience/features/general-article/tcrr-cprr/ Workers of the Central Pacific Railroad], PBS: The American Experience.George Kraus, \"Chinese Laborers and the Construction of the Central Pacific,\" Utah Historical Quarterly, vol. 37, no. 1 (Winter 1969), pp. 41-57. They laid the first rails in 1863. The \"Golden spike\", connecting the western railroad to the Union Pacific Railroad at Promontory, Utah, was hammered on May 10, 1869. Coast-to-coast train travel in eight days became possible, replacing months-long sea voyages and lengthy, hazardous travel by wagon trains.\n\nIn 1885 the Central Pacific Railroad was leased by the Southern Pacific Company. Technically the CPRR remained a corporate entity until 1959, when it was formally merged into Southern Pacific. (It was reorganized in 1899 as the Central Pacific \"Railway\".) The original right-of-way is now controlled by the Union Pacific, which bought Southern Pacific in 1996.\n\nThe Union Pacific-Central Pacific (Southern Pacific) mainline followed the historic Overland Route from Omaha, Nebraska to San Francisco Bay.\n\nChinese labor was the most vital source for constructing the railroad. Fifty Chinese laborers were hired by the Central Pacific Railroad in February 1865, and soon more and more Chinese men were hired. Working conditions were harsh, and Chinese men were compensated less than their white counterparts. Chinese men were paid thirty-one dollars each month, and while white workers were paid the same, they were also given room and board.\n\nFinancing\n\nConstruction of the road was financed primarily by 30-year, 6% U.S. government bonds authorized by Sec. 5 of the Pacific Railroad Act of 1862. They were issued at the rate of $16,000 per mile of tracked grade completed west of the designated base of the Sierra Nevada range near Roseville, CA where California state geologist Josiah Whitney had determined were the geologic start of the Sierras' foothills. Sec. 11 of the Act also provided that the issuance of bonds \"shall be treble the number per mile\" (to $48,000) for tracked grade completed over and within the two mountain ranges (but limited to a total of 300 mi at this rate), and \"doubled\" (to $32,000) per mile of completed grade laid between the two mountain ranges. The U.S. Government Bonds, which constituted a lien upon the railroads and all their fixtures, were repaid in full (and with interest) by the company as and when they became due.\n\nSec. 10 of the 1864 amending Pacific Railroad Act (13 Statutes at Large, 356) additionally authorized the company to issue its own \"First Mortgage Bonds\" in total amounts up to (but not exceeding) that of the bonds issued by the United States. Such company-issued securities had priority over the original Government Bonds. (Local and state governments also aided the financing, although the City and County of San Francisco did not do so willingly. This materially slowed early construction efforts.) Sec. 3 of the 1862 Act granted the railroads 10 sqmi of public land for every mile laid, except where railroads ran through cities and crossed rivers. This grant was apportioned in 5 sections on alternating sides of the railroad, with each section measuring  by 10 mi. These grants were later doubled to 20 sqmi per mile of grade by the 1864 Act.\n\nAlthough the Pacific Railroad eventually benefited the Bay Area, the City and County of San Francisco obstructed financing it during the early years of 1863-1865. When Stanford was Governor of California, the Legislature passed on April 22, 1863, \"An Act to Authorize the Board of Supervisors of the City and County of San Francisco to take and subscribe One Million Dollars to the Capital Stock of the Western Pacific Rail Road Company and the Central Pacific Rail Road Company of California and to provide for the payment of the same and other matters relating thereto\" (which was later amended by Section Five of the \"Compromise Act\" of April 4, 1864). On May 19, 1863, the electors of the City and County of San Francisco passed this bond by a vote of 6,329 to 3,116, in a highly controversial Special Election.\n\nThe City and County's financing of the investment through the issuance and delivery of Bonds was delayed for two years, when Mayor Henry P. Coon, and the County Clerk, Wilhelm Loewy, each refused to countersign the Bonds. It took legal actions to force them to do so: in 1864 the Supreme Court of the State of California ordered them under Writs of Mandamus (The People of the State of California ex rel the Central Pacific Railroad Company vs. Henry P. Coon, Mayor; Henry M. Hale, Auditor; and Joseph S. Paxson, Treasurer, of the City and County of San Francisco. 25 Cal. 635) and in 1865, a legal judgment against Loewy (The People ex rel The Central Pacific Railroad Company of California vs. The Board of Supervisors of the City and County of San Francisco, and Wilhelm Lowey, Clerk 27 Cal. 655) directing that the Bonds be countersigned and delivered. In 1863 the legislature's forcing of City and County action became known as the \"Dutch Flat Swindle\". Critics claimed the CPRR intended to build a railroad only as far as Dutch Flat, to connect to the Dutch Flat Wagon Road which they already controlled.\n\nMuseums and archives\n\nA replica of the Sacramento, California Central Pacific Railroad passenger station is part of the California State Railroad Museum, located in the Old Sacramento State Historic Park.\n\nNearly all the company's early correspondence is preserved at Syracuse University, as part of the Collis Huntington Papers collection. It has been released on microfilm (133 reels). The following libraries have the microfilm: University of Arizona at Tucson; and Virginia Commonwealth University at Richmond. Additional collections of manuscript letters are held at Stanford University and the Mariners' Museum at Newport News, Virginia. Alfred A. Hart was the official photographer of the CPRR construction.\n\nLocomotives\n\nThe Central Pacific's first three locomotives were of the then common 4-4-0 type, although with the American Civil War raging in the east, they had difficulty acquiring engines from eastern builders, who at times only had smaller 4-2-4 or 4-2-2 types available. Until the completion of the Transcontinental rail link and the railroad's opening of its own shops, all locomotives had to be purchased by builders in the northeastern U.S. The engines had to be dismantled, loaded on a ship, which would embark on a four-month journey that went around South America's Cape Horn until arriving in Sacramento where the locomotives would be unloaded, re-assembled, and placed in service.\n\nLocomotives at the time came from many manufacturers, such as Cooke, Schenectady, Mason, Rogers, Danforth, Norris, Booth, and McKay & Aldus, among others. Interestingly, the railroad had been on rather unfriendly terms with the Baldwin Locomotive Works, one of the more well-known firms. It is not clear as to the cause of this dispute, though some attribute it to the builder insisting on cash payment (though this has yet to be verified). Consequently, the railroad refused to buy engines from Baldwin, and three former Western Pacific Railroad (which the CP had absorbed in 1870) engines were the only Baldwin engines owned by the Central Pacific. The Central Pacific's dispute with Baldwin remained unresolved until well after the road had been acquired by the Southern Pacific.\n\nIn the 1870s, the road opened up its own locomotive construction facilities in Sacramento. Central Pacific's 173 was rebuilt by these shops and served as the basis for CP's engine construction. The locomotives built before the 1870s were given names as well as numbers. By the 1870s, it was decided to eliminate the names and as each engine was sent to the shops for service, their names would be removed. However, one engine that was built in the 1880s did receive a name: the El Gobernador.\n\nConstruction of the rails was often dangerous work. Towards the end of construction, almost all workers were Chinese immigrants. The ethnicity of workers depended largely on the \"gang\" of workers/specific area on the rails they were working.\n\nPreserved locomotives\n\nThe following CP engines have been preserved:\n* Central Pacific 1, Gov. Stanford\n* CP 233, a 2-6-2T the railroad had built, is stored at the California State Railroad Museum.\n* Central Pacific 3, C. P. Huntington\n* Former Western Pacific Mariposa, Central Pacific's second number 31. Was sold to Stockton Terminal and Eastern in 1914 and renumbered 1. Currently at the Travel Town Museum in Los Angeles.\n* Virginia and Truckee Railroad, though The Dayton was not built for, nor served on the Central Pacific, the engine was one of two locomotives built by the CP's Sacramento shops in preservation (the other being CP 233). Moreover, its specifications were derived from CP 173, and thus is the only surviving example of that engine's design.\n* Central Pacific's numbers 60, Jupiter, and 63 Leviathan. Although both engines have been scrapped, and therefore technically do not count as having been preserved, there were exact, full size operating replicas built in recent years. The Jupiter was built for the National Park Service along with a replica of Union Pacific's 119 for use at their Golden Spike National Historic Site. Leviathan was finished in 2009, is privately owned, and travels to various railroads to operate.\n\nTimeline\n\n1861\n* June 28, 1861: \"Central Pacific Rail Road of California\" incorporated; name changed to \"Central Pacific Railroad of California\" on October 8, 1864, after the Pacific Railway Act amendment passes that summer.[http://www.cprr.org/Museum/CPRR_By-Laws.html By-Laws of the Central Pacific Railroad Company of California, Incorporated: June 28, 1861] \"THE INDUSTRIAL AND FINANCIAL RESOURCES OF THE UNITED STATES OF AMERICA, as developed by the official returns of the Northern and Southern States and Territories, with an APPENDIX containing a detailed description of Federal, State, and City securities, railroad and canal bonds and shares, bank shares, etc. from statements nearest Jan. 1, 1863, and the CHARTERS OF THE UNION PACIFIC RAILROADS, the GENERAL RAILROAD LAW OF CALIFORNIA, and the BY-LAWS OF THE CENTRAL PACIFIC RAILROAD CO. OF CALIFORNIA.\" New York: SAMUEL HALLETT, Banker and Railroad Negotiator.  1864\n\n1862\n* July 1, 1862: President Lincoln signs the Pacific Railway Act, which authorized the Central Pacific and the Union Pacific to build a railroad to the Pacific Ocean.[http://www.cprr.org/Museum/Pacific_Railroad_Acts.html \"An Act to aid in the construction of a railroad and telegraph line from the Missouri river to the Pacific ocean, and to secure to the government the use of the same for postal, military, and other purposes] 12 Stat. 489, July 1, 1862\n1863\n* January 8, 1863: Ground-breaking ceremonies take place at Sacramento, California, at the foot of \"K\" Street at the waterfront of the Sacramento River.\n* October 26, 1863: First rail laid at Sacramento.\n1864\n* April 26, 1864: Central Pacific opened to Roseville, 18 mi, where it makes a junction with the California Central Railroad, operating from Folsom north to Lincoln.\n* June 3, 1864: The first revenue train on the Central Pacific operates between Sacramento and Newcastle, California\n* October 8, 1864: Following passage of the amendment to the Pacific Railroad Act, the company's name is changed to \"Central Pacific Railroad of California,\" a new corporation.\n\n1865\n* May 13, 1865: Central Pacific opened 36 mi to Auburn, California.\n* September 1, 1865: Central Pacific opened 54 mi to Colfax, California (formerly known as \"Illinoistown.\")\n1866\n* December 3, 1866: Central Pacific opened 92 mi to Cisco, California.\n\n1867\n\n* August 28, 1867: The Sierra Nevadas were finally \"conquered\" by the Central Pacific Railroad, after almost five years of sustained construction effort, with the successful completion at Donner Pass of its 1,659-foot (506 m) Tunnel #6 (a.k.a. the \"Summit Tunnel\").Cooper, Bruce C. [http://cprr.org/Museum/Sierra_Grade_8-2003/Donner_Pass-Summit_Tunnel/index.html CPRR Summit Tunnel (#6), Tunnels #7 & #8, Snowsheds, \"Chinese\" Walls, Donner Trail, and Dutch Flat Donner - Lake Wagon Road at Donner Pass] CPRR.org.\n* December 1, 1867: Central Pacific opened to Summit of the Sierra Nevada, 105 mi.\n1868\n* June 18, 1868: The first passenger train crosses the Sierra Nevada to Lake's Crossing (modern day Reno, Nevada) at the eastern foot of the Sierra in Nevada Territory.\n1869\n* April 28, 1869: Track crews on the Central Pacific lay 10 mi of track in one day. This is the longest stretch of track that has been built in one day to date.\n* May 10, 1869: The Central Pacific and Union Pacific tracks meet in Promontory, Utah.\n* May 15, 1869: The first transcontinental trains are run over the new line to Sacramento.\n* November 8, 1869: Central Pacific subsidiaries Western Pacific Railroad (1862-1870) and San Francisco Bay Railroad complete the final leg of the route, connecting Sacramento to Oakland.\n1870\n* June 23, 1870: Central Pacific is consolidated with the Western Pacific Railroad (1862-1870) and San Francisco Bay Railroad Co. to form the \"Central Pacific Railroad Co.\" (of June 1870).\n* August 22, 1870: Central Pacific Railroad Co. is consolidated with the California & Oregon; San Francisco, Oakland & Alameda; and San Joaquin Valley Railroad; to form the \"Central Pacific Railroad Co.\", a new corporation.\n1876\n* April 30, 1876: Operates the California Pacific Railroad between South Vallejo and Sacramento, Calistoga and Marysville until April 1, 1885 (see below).\n1877\n* July 16, 1877: Start of the Great Railroad Strike of 1877 when railroad workers on strike in Martinsburg, West Virginia, derail and loot a train; United States President Rutherford B. Hayes calls in Federal troops to break the strike.\n1883\n* November 18, 1883: A system of one-hour standard time zones for American railroads was first implemented. The zones were named Intercolonial, Eastern, Central, Mountain, and Pacific. Within one year, 85% of all cities having populations over 10,000, about 200 cities, were using standard time.\n1885\n* April 1, 1885: Central Pacific is leased to Southern Pacific.\n1888\n* June 30, 1888: Listed by ICC as a \"non-operating\" subsidiary of Southern Pacific.\n1899\n* July 29, 1899: Central Pacific is reorganized as the \"Central Pacific Railway\".\n1959\n* June 30, 1959: Central Pacific is formally merged into the Southern Pacific.\n\nAcquisitions\n\n* Stockton and Copperopolis Railroad\n* Stockton and Visalia Railroad\n* Western Pacific Railroad (1862-1870)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Central Pacific Railroad" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7734" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Central Pacific Railroad (CPRR) was a rail route between California and Utah built eastwards from the West Coast in the 1860s, to complete the western part of the \"First Transcontinental Railroad\" in North America. It later became part of the Union Pacific Railroad.\n\nMany 19th century national proposals to build a transcontinental railroad failed because of the energy consumed by political disputes over slavery. With the secession of the South, the modernizers in the Republican Party controlled the US Congress. They passed legislation authorizing the railroad, with financing in the form of government railroad bonds. These were all eventually repaid with interest. The government and the railroads both shared in the increased value of the land grants, which the railroads developed. The construction of the railroad also secured for the government the economical \"safe and speedy transportation of the mails, troops, munitions of war, and public stores.\"\n\nAuthorization and construction\n\nPlanned by Theodore Judah, the Central Pacific Railroad was authorized by Congress in 1862. It was financed and built through \"The Big Four\" (who called themselves \"The Associates\"): Sacramento, California businessmen Leland Stanford, Collis Huntington, Charles Crocker, and Mark Hopkins. Crocker was in charge of construction. Construction crews comprised 12,000 Chinese emigrant workers by 1868, when they constituted eighty percent of the entire work force.[https://www.pbs.org/wgbh/americanexperience/features/general-article/tcrr-cprr/ Workers of the Central Pacific Railroad], PBS: The American Experience.George Kraus, \"Chinese Laborers and the Construction of the Central Pacific,\" Utah Historical Quarterly, vol. 37, no. 1 (Winter 1969), pp. 41-57. They laid the first rails in 1863. The \"Golden spike\", connecting the western railroad to the Union Pacific Railroad at Promontory, Utah, was hammered on May 10, 1869. Coast-to-coast train travel in eight days became possible, replacing months-long sea voyages and lengthy, hazardous travel by wagon trains.\n\nIn 1885 the Central Pacific Railroad was leased by the Southern Pacific Company. Technically the CPRR remained a corporate entity until 1959, when it was formally merged into Southern Pacific. (It was reorganized in 1899 as the Central Pacific \"Railway\".) The original right-of-way is now controlled by the Union Pacific, which bought Southern Pacific in 1996.\n\nThe Union Pacific-Central Pacific (Southern Pacific) mainline followed the historic Overland Route from Omaha, Nebraska to San Francisco Bay.\n\nChinese labor was the most vital source for constructing the railroad. Fifty Chinese laborers were hired by the Central Pacific Railroad in February 1865, and soon more and more Chinese men were hired. Working conditions were harsh, and Chinese men were compensated less than their white counterparts. Chinese men were paid thirty-one dollars each month, and while white workers were paid the same, they were also given room and board.\n\nFinancing\n\nConstruction of the road was financed primarily by 30-year, 6% U.S. government bonds authorized by Sec. 5 of the Pacific Railroad Act of 1862. They were issued at the rate of $16,000 per mile of tracked grade completed west of the designated base of the Sierra Nevada range near Roseville, CA where California state geologist Josiah Whitney had determined were the geologic start of the Sierras' foothills. Sec. 11 of the Act also provided that the issuance of bonds \"shall be treble the number per mile\" (to $48,000) for tracked grade completed over and within the two mountain ranges (but limited to a total of 300 mi at this rate), and \"doubled\" (to $32,000) per mile of completed grade laid between the two mountain ranges. The U.S. Government Bonds, which constituted a lien upon the railroads and all their fixtures, were repaid in full (and with interest) by the company as and when they became due.\n\nSec. 10 of the 1864 amending Pacific Railroad Act (13 Statutes at Large, 356) additionally authorized the company to issue its own \"First Mortgage Bonds\" in total amounts up to (but not exceeding) that of the bonds issued by the United States. Such company-issued securities had priority over the original Government Bonds. (Local and state governments also aided the financing, although the City and County of San Francisco did not do so willingly. This materially slowed early construction efforts.) Sec. 3 of the 1862 Act granted the railroads 10 sqmi of public land for every mile laid, except where railroads ran through cities and crossed rivers. This grant was apportioned in 5 sections on alternating sides of the railroad, with each section measuring  by 10 mi. These grants were later doubled to 20 sqmi per mile of grade by the 1864 Act.\n\nAlthough the Pacific Railroad eventually benefited the Bay Area, the City and County of San Francisco obstructed financing it during the early years of 1863-1865. When Stanford was Governor of California, the Legislature passed on April 22, 1863, \"An Act to Authorize the Board of Supervisors of the City and County of San Francisco to take and subscribe One Million Dollars to the Capital Stock of the Western Pacific Rail Road Company and the Central Pacific Rail Road Company of California and to provide for the payment of the same and other matters relating thereto\" (which was later amended by Section Five of the \"Compromise Act\" of April 4, 1864). On May 19, 1863, the electors of the City and County of San Francisco passed this bond by a vote of 6,329 to 3,116, in a highly controversial Special Election.\n\nThe City and County's financing of the investment through the issuance and delivery of Bonds was delayed for two years, when Mayor Henry P. Coon, and the County Clerk, Wilhelm Loewy, each refused to countersign the Bonds. It took legal actions to force them to do so: in 1864 the Supreme Court of the State of California ordered them under Writs of Mandamus (The People of the State of California ex rel the Central Pacific Railroad Company vs. Henry P. Coon, Mayor; Henry M. Hale, Auditor; and Joseph S. Paxson, Treasurer, of the City and County of San Francisco. 25 Cal. 635) and in 1865, a legal judgment against Loewy (The People ex rel The Central Pacific Railroad Company of California vs. The Board of Supervisors of the City and County of San Francisco, and Wilhelm Lowey, Clerk 27 Cal. 655) directing that the Bonds be countersigned and delivered. In 1863 the legislature's forcing of City and County action became known as the \"Dutch Flat Swindle\". Critics claimed the CPRR intended to build a railroad only as far as Dutch Flat, to connect to the Dutch Flat Wagon Road which they already controlled.\n\nMuseums and archives\n\nA replica of the Sacramento, California Central Pacific Railroad passenger station is part of the California State Railroad Museum, located in the Old Sacramento State Historic Park.\n\nNearly all the company's early correspondence is preserved at Syracuse University, as part of the Collis Huntington Papers collection. It has been released on microfilm (133 reels). The following libraries have the microfilm: University of Arizona at Tucson; and Virginia Commonwealth University at Richmond. Additional collections of manuscript letters are held at Stanford University and the Mariners' Museum at Newport News, Virginia. Alfred A. Hart was the official photographer of the CPRR construction.\n\nLocomotives\n\nThe Central Pacific's first three locomotives were of the then common 4-4-0 type, although with the American Civil War raging in the east, they had difficulty acquiring engines from eastern builders, who at times only had smaller 4-2-4 or 4-2-2 types available. Until the completion of the Transcontinental rail link and the railroad's opening of its own shops, all locomotives had to be purchased by builders in the northeastern U.S. The engines had to be dismantled, loaded on a ship, which would embark on a four-month journey that went around South America's Cape Horn until arriving in Sacramento where the locomotives would be unloaded, re-assembled, and placed in service.\n\nLocomotives at the time came from many manufacturers, such as Cooke, Schenectady, Mason, Rogers, Danforth, Norris, Booth, and McKay & Aldus, among others. Interestingly, the railroad had been on rather unfriendly terms with the Baldwin Locomotive Works, one of the more well-known firms. It is not clear as to the cause of this dispute, though some attribute it to the builder insisting on cash payment (though this has yet to be verified). Consequently, the railroad refused to buy engines from Baldwin, and three former Western Pacific Railroad (which the CP had absorbed in 1870) engines were the only Baldwin engines owned by the Central Pacific. The Central Pacific's dispute with Baldwin remained unresolved until well after the road had been acquired by the Southern Pacific.\n\nIn the 1870s, the road opened up its own locomotive construction facilities in Sacramento. Central Pacific's 173 was rebuilt by these shops and served as the basis for CP's engine construction. The locomotives built before the 1870s were given names as well as numbers. By the 1870s, it was decided to eliminate the names and as each engine was sent to the shops for service, their names would be removed. However, one engine that was built in the 1880s did receive a name: the El Gobernador.\n\nConstruction of the rails was often dangerous work. Towards the end of construction, almost all workers were Chinese immigrants. The ethnicity of workers depended largely on the \"gang\" of workers/specific area on the rails they were working.\n\nPreserved locomotives\n\nThe following CP engines have been preserved:\n* Central Pacific 1, Gov. Stanford\n* CP 233, a 2-6-2T the railroad had built, is stored at the California State Railroad Museum.\n* Central Pacific 3, C. P. Huntington\n* Former Western Pacific Mariposa, Central Pacific's second number 31. Was sold to Stockton Terminal and Eastern in 1914 and renumbered 1. Currently at the Travel Town Museum in Los Angeles.\n* Virginia and Truckee Railroad, though The Dayton was not built for, nor served on the Central Pacific, the engine was one of two locomotives built by the CP's Sacramento shops in preservation (the other being CP 233). Moreover, its specifications were derived from CP 173, and thus is the only surviving example of that engine's design.\n* Central Pacific's numbers 60, Jupiter, and 63 Leviathan. Although both engines have been scrapped, and therefore technically do not count as having been preserved, there were exact, full size operating replicas built in recent years. The Jupiter was built for the National Park Service along with a replica of Union Pacific's 119 for use at their Golden Spike National Historic Site. Leviathan was finished in 2009, is privately owned, and travels to various railroads to operate.\n\nTimeline\n\n1861\n* June 28, 1861: \"Central Pacific Rail Road of California\" incorporated; name changed to \"Central Pacific Railroad of California\" on October 8, 1864, after the Pacific Railway Act amendment passes that summer.[http://www.cprr.org/Museum/CPRR_By-Laws.html By-Laws of the Central Pacific Railroad Company of California, Incorporated: June 28, 1861] \"THE INDUSTRIAL AND FINANCIAL RESOURCES OF THE UNITED STATES OF AMERICA, as developed by the official returns of the Northern and Southern States and Territories, with an APPENDIX containing a detailed description of Federal, State, and City securities, railroad and canal bonds and shares, bank shares, etc. from statements nearest Jan. 1, 1863, and the CHARTERS OF THE UNION PACIFIC RAILROADS, the GENERAL RAILROAD LAW OF CALIFORNIA, and the BY-LAWS OF THE CENTRAL PACIFIC RAILROAD CO. OF CALIFORNIA.\" New York: SAMUEL HALLETT, Banker and Railroad Negotiator.  1864\n\n1862\n* July 1, 1862: President Lincoln signs the Pacific Railway Act, which authorized the Central Pacific and the Union Pacific to build a railroad to the Pacific Ocean.[http://www.cprr.org/Museum/Pacific_Railroad_Acts.html \"An Act to aid in the construction of a railroad and telegraph line from the Missouri river to the Pacific ocean, and to secure to the government the use of the same for postal, military, and other purposes] 12 Stat. 489, July 1, 1862\n1863\n* January 8, 1863: Ground-breaking ceremonies take place at Sacramento, California, at the foot of \"K\" Street at the waterfront of the Sacramento River.\n* October 26, 1863: First rail laid at Sacramento.\n1864\n* April 26, 1864: Central Pacific opened to Roseville, 18 mi, where it makes a junction with the California Central Railroad, operating from Folsom north to Lincoln.\n* June 3, 1864: The first revenue train on the Central Pacific operates between Sacramento and Newcastle, California\n* October 8, 1864: Following passage of the amendment to the Pacific Railroad Act, the company's name is changed to \"Central Pacific Railroad of California,\" a new corporation.\n\n1865\n* May 13, 1865: Central Pacific opened 36 mi to Auburn, California.\n* September 1, 1865: Central Pacific opened 54 mi to Colfax, California (formerly known as \"Illinoistown.\")\n1866\n* December 3, 1866: Central Pacific opened 92 mi to Cisco, California.\n\n1867\n\n* August 28, 1867: The Sierra Nevadas were finally \"conquered\" by the Central Pacific Railroad, after almost five years of sustained construction effort, with the successful completion at Donner Pass of its 1,659-foot (506 m) Tunnel #6 (a.k.a. the \"Summit Tunnel\").Cooper, Bruce C. [http://cprr.org/Museum/Sierra_Grade_8-2003/Donner_Pass-Summit_Tunnel/index.html CPRR Summit Tunnel (#6), Tunnels #7 & #8, Snowsheds, \"Chinese\" Walls, Donner Trail, and Dutch Flat Donner - Lake Wagon Road at Donner Pass] CPRR.org.\n* December 1, 1867: Central Pacific opened to Summit of the Sierra Nevada, 105 mi.\n1868\n* June 18, 1868: The first passenger train crosses the Sierra Nevada to Lake's Crossing (modern day Reno, Nevada) at the eastern foot of the Sierra in Nevada Territory.\n1869\n* April 28, 1869: Track crews on the Central Pacific lay 10 mi of track in one day. This is the longest stretch of track that has been built in one day to date.\n* May 10, 1869: The Central Pacific and Union Pacific tracks meet in Promontory, Utah.\n* May 15, 1869: The first transcontinental trains are run over the new line to Sacramento.\n* November 8, 1869: Central Pacific subsidiaries Western Pacific Railroad (1862-1870) and San Francisco Bay Railroad complete the final leg of the route, connecting Sacramento to Oakland.\n1870\n* June 23, 1870: Central Pacific is consolidated with the Western Pacific Railroad (1862-1870) and San Francisco Bay Railroad Co. to form the \"Central Pacific Railroad Co.\" (of June 1870).\n* August 22, 1870: Central Pacific Railroad Co. is consolidated with the California & Oregon; San Francisco, Oakland & Alameda; and San Joaquin Valley Railroad; to form the \"Central Pacific Railroad Co.\", a new corporation.\n1876\n* April 30, 1876: Operates the California Pacific Railroad between South Vallejo and Sacramento, Calistoga and Marysville until April 1, 1885 (see below).\n1877\n* July 16, 1877: Start of the Great Railroad Strike of 1877 when railroad workers on strike in Martinsburg, West Virginia, derail and loot a train; United States President Rutherford B. Hayes calls in Federal troops to break the strike.\n1883\n* November 18, 1883: A system of one-hour standard time zones for American railroads was first implemented. The zones were named Intercolonial, Eastern, Central, Mountain, and Pacific. Within one year, 85% of all cities having populations over 10,000, about 200 cities, were using standard time.\n1885\n* April 1, 1885: Central Pacific is leased to Southern Pacific.\n1888\n* June 30, 1888: Listed by ICC as a \"non-operating\" subsidiary of Southern Pacific.\n1899\n* July 29, 1899: Central Pacific is reorganized as the \"Central Pacific Railway\".\n1959\n* June 30, 1959: Central Pacific is formally merged into the Southern Pacific.\n\nAcquisitions\n\n* Stockton and Copperopolis Railroad\n* Stockton and Visalia Railroad\n* Western Pacific Railroad (1862-1870). Central Pacific Railroad. http://en.wikipedia.org/?curid=7734."
  }
}
