{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=922",
  "eid" : "a882bef0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778362463,
  "textBody" : "Anxiety is an emotion characterized by an unpleasant state of inner turmoil, often accompanied by nervous behavior, such as pacing back and forth, somatic complaints, and rumination. It is the subjectively unpleasant feelings of dread over anticipated events, such as the feeling of imminent death. Anxiety is not the same as fear, which is a response to a  real or perceived immediate threat, whereas anxiety is the expectation of future threat. Anxiety is a feeling of uneasiness and worry, usually generalized and unfocused as an overreaction to a situation that is only subjectively seen as menacing. It is often accompanied by muscular tension, restlessness, fatigue and problems in concentration. Anxiety can be appropriate, but when experienced regularly the individual may suffer from an anxiety disorder.\n\nPeople facing anxiety may withdraw from situations which have provoked anxiety in the past. There are various types of anxiety. Existential anxiety can occur when a person faces angst, an existential crisis, or nihilistic feelings. People can also face mathematical anxiety, somatic anxiety, stage fright, or test anxiety. Social anxiety and stranger anxiety are caused when people are apprehensive around strangers or other people in general. Furthermore, anxiety has been linked with physical symptoms such as IBS and can heighten other mental health illnesses such as OCD and panic disorder. The first step in the management of a person with anxiety symptoms is to evaluate the possible presence of an underlying medical cause, whose recognition is essential in order to decide its correct treatment. Anxiety symptoms may be masking an organic disease, or appear associated or as a result of a medical disorder.\n\nAnxiety can be either a short term \"state\" or a long term \"trait\". Whereas trait anxiety represents worrying about future events, anxiety disorders are a group of mental disorders characterized by feelings of anxiety and fear. Anxiety disorders are partly genetic but may also be due to drug use, including alcohol, caffeine, and benzodiazepines (which are often prescribed to treat anxiety), as well as withdrawal from drugs of abuse. They often occur with other mental disorders, particularly bipolar disorder, eating disorders, major depressive disorder, or certain personality disorders. Common treatment options include lifestyle changes, medication, and therapy.\n\nDescriptions\n\nAnxiety is distinguished from fear, which is an appropriate cognitive and emotional response to a perceived threat. Anxiety is related to the specific behaviors of fight-or-flight responses, defensive behavior or escape. It occurs in situations only perceived as uncontrollable or unavoidable, but not realistically so. David Barlow defines anxiety as \"a future-oriented mood state in which one is not ready or prepared to attempt to cope with upcoming negative events,\" and that it is a distinction between future and present dangers which divides anxiety and fear. Another description of anxiety is  agony, dread, terror, or even apprehension. In positive psychology, anxiety is described as the mental state that results from a difficult challenge for which the subject has insufficient coping skills.\n\nFear and anxiety can be differentiated in four domains: (1) duration of emotional experience, (2) temporal focus, (3) specificity of the threat, and (4) motivated direction. Fear is defined as short lived, present focused, geared towards a specific threat, and facilitating escape from threat; anxiety, on the other hand, is defined as long-acting, future focused, broadly focused towards a diffuse threat, and promoting excessive caution while approaching a potential threat and interferes with constructive coping.\n\nAnxiety can be experienced with long, drawn out daily symptoms that reduce quality of life, known as chronic (or generalized) anxiety, or it can be experienced in short spurts with sporadic, stressful panic attacks, known as acute anxiety.  Symptoms of anxiety can range in number, intensity, and frequency, depending on the person. While almost everyone has experienced anxiety at some point in their lives, most do not develop long-term problems with anxiety.\n\nAnxiety may cause psychiatric and physiological symptoms.\n\nThe behavioral effects of anxiety may include withdrawal from situations which have provoked anxiety or negative feelings in the past. Other effects may include changes in sleeping patterns, changes in habits, increase or decrease in food intake, and increased motor tension (such as foot tapping).\n\nThe emotional effects of anxiety may include \"feelings of apprehension or dread, trouble concentrating, feeling tense or jumpy, anticipating the worst, irritability, restlessness, watching (and waiting) for signs (and occurrences) of danger, and, feeling like your mind's gone blank\"Smith, Melinda (2008, June). Anxiety attacks and disorders: Guide to the signs, symptoms, and treatment options. Retrieved March 3, 2009, from Helpguide Web site:  as well as \"nightmares/bad dreams, obsessions about sensations, déjà vu, a trapped-in-your-mind feeling, and feeling like everything is scary.\"(1987–2008). Anxiety Symptoms, Anxiety Attack Symptoms (Panic Attack Symptoms), Symptoms of Anxiety. Retrieved March 3, 2009, from Anxiety Centre Website: \n\nThe cognitive effects of anxiety may include thoughts about suspected dangers, such as fear of dying. \"You may ... fear that the chest pains are a deadly heart attack or that the shooting pains in your head are the result of a tumor or an aneurysm. You feel an intense fear when you think of dying, or you may think of it more often than normal, or can't get it out of your mind.\"(1987–2008). Anxiety symptoms - Fear of dying. Retrieved March 3, 2009, from Anxiety Centre Website: \n\nThe physiological symptoms of anxiety may include:\n*Neurological, as headache, paresthesias, vertigo, or presyncope.\n*Digestive, as abdominal pain, nausea, diarrhea, indigestion, dry mouth, or bolus.\n*Respiratory, as shortness of breath or sighing breathing.\n*Cardiac, as palpitations, tachycardia, or chest pain.\n*Muscular, as fatigue, tremors, or tetany.\n*Cutaneous, as perspiration, or itchy skin.\n*Uro-genital, as frequent urination, urinary urgency, dyspareunia, or impotence.\n\nTypes\n\nExistential\n\nThe philosopher Søren Kierkegaard, in The Concept of Anxiety (1844), described anxiety or dread associated with the \"dizziness of freedom\" and suggested the possibility for positive resolution of anxiety through the self-conscious exercise of responsibility and choosing. In Art and Artist (1932), the psychologist Otto Rank wrote that the psychological trauma of birth was the pre-eminent human symbol of existential anxiety and encompasses the creative person's simultaneous fear of – and desire for – separation, individuation, and differentiation.\n\nThe theologian Paul Tillich characterized existential anxiety as \"the state in which a being is aware of its possible nonbeing\" and he listed three categories for the nonbeing and resulting anxiety: ontic (fate and death), moral (guilt and condemnation), and spiritual (emptiness and meaninglessness). According to Tillich, the last of these three types of existential anxiety, i.e. spiritual anxiety, is predominant in modern times while the others were predominant in earlier periods. Tillich argues that this anxiety can be accepted as part of the human condition or it can be resisted but with negative consequences. In its pathological form, spiritual anxiety may tend to \"drive the person toward the creation of certitude in systems of meaning which are supported by tradition and authority\" even though such \"undoubted certitude is not built on the rock of reality\".\n\nAccording to Viktor Frankl, the author of Man's Search for Meaning, when a person is faced with extreme mortal dangers, the most basic of all human wishes is to find a meaning of life to combat the \"trauma of nonbeing\" as death is near.\n\nTest and performance\n\nAccording to Yerkes-Dodson law, an optimal level of arousal is necessary to best complete a task such as an exam, performance, or competitive event. However, when the anxiety or level of arousal exceeds that optimum, the result is a decline in performance.\n\nTest anxiety is the uneasiness, apprehension, or nervousness felt by students who have a fear of failing an exam. Students who have test anxiety may experience any of the following: the association of grades with personal worth; fear of embarrassment by a teacher; fear of alienation from parents or friends; time pressures; or feeling a loss of control. Sweating, dizziness, headaches, racing heartbeats, nausea, fidgeting, uncontrollable crying or laughing and drumming on a desk are all common. Because test anxiety hinges on fear of negative evaluation, debate exists as to whether test anxiety is itself a unique anxiety disorder or whether it is a specific type of social phobia. The DSM-IV classifies test anxiety as a type of social phobia.\n\nWhile the term \"test anxiety\" refers specifically to students, many workers share the same experience with regard to their career or profession. The fear of failing at a task and being negatively evaluated for failure can have a similarly negative effect on the adult. Management of test anxiety focuses on achieving relaxation and developing mechanisms to manage anxiety.\n\nStranger, social, and intergroup\n\nHumans generally require social acceptance and thus sometimes dread the disapproval of others. Apprehension of being judged by others may cause anxiety in social environments.\n \nAnxiety during social interactions, particularly between strangers, is common among young people. It may persist into adulthood and become social anxiety or social phobia. \"Stranger anxiety\" in small children is not considered a phobia. In adults, an excessive fear of other people is not a developmentally common stage; it is called social anxiety. According to Cutting, social phobics do not fear the crowd but the fact that they may be judged negatively.\n\nSocial anxiety varies in degree and severity. For some people, it is characterized by experiencing discomfort or awkwardness during physical social contact (e.g. embracing, shaking hands, etc.), while in other cases it can lead to a fear of interacting with unfamiliar people altogether. Those suffering from this condition may restrict their lifestyles to accommodate the anxiety, minimizing social interaction whenever possible. Social anxiety also forms a core aspect of certain personality disorders, including avoidant personality disorder.\n\nTo the extent that a person is fearful of social encounters with unfamiliar others, some people may experience anxiety particularly during interactions with outgroup members, or people who share different group memberships (i.e., by race, ethnicity, class, gender, etc.). Depending on the nature of the antecedent relations, cognitions, and situational factors, intergroup contact may be stressful and lead to feelings of anxiety. This apprehension or fear of contact with outgroup members is often called interracial or intergroup anxiety.\n\nAs is the case the more generalized forms of social anxiety, intergroup anxiety has behavioral, cognitive, and affective effects. For instance, increases in schematic processing and simplified information processing can occur when anxiety is high. Indeed, such is consistent with related work on attentional bias in implicit memory. Additionally recent research has found that implicit racial evaluations (i.e. automatic prejudiced attitudes) can be amplified during intergroup interaction. Negative experiences have been illustrated in producing not only negative expectations, but also avoidant, or  antagonistic, behavior such as hostility. Furthermore, when compared to anxiety levels and cognitive effort (e.g., impression management and self-presentation) in intragroup contexts, levels and depletion of resources may be exacerbated in the intergroup situation.\n\nTrait\n\nAnxiety can be either a short term 'state' or a long term \"trait\". Trait anxiety reflects a stable tendency to respond with state anxiety in the anticipation of threatening situations. A meta-analysis showed that a high level of neuroticism is a risk factor for development of anxiety symptoms and disorders. Such anxiety may be conscious or unconscious.\n\nChoice or decision\n\nAnxiety induced by the need to choose between similar options is increasingly being recognized as a problem for individuals and for organizations. In 2004, Capgemini wrote: \"Today we're all faced with greater choice, more competition and less time to consider our options or seek out the right advice.\"[https://www.uk.capgemini.com/news/pr1487 Is choice anxiety costing british 'blue chip' business?] , Capgemini, Aug 16, 2004\n\nIn a decision context, unpredictability or uncertainty may trigger emotional responses in anxious individuals that systematically alter decision-making. There are primarily two forms of this anxiety type. The first form refers to a choice in which there are multiple potential outcomes with known or calculable probabilities. The second form refers to the uncertainty and ambiguity related to a decision context in which there are multiple possible outcomes with unknown probabilities.\n\nAnxiety disorders\n\nAnxiety disorders are a group of mental disorders characterized by feelings of anxiety and fear. Anxiety is a worry about future events and fear is a reaction to current events. These feelings may cause physical symptoms, such as a fast heart rate and shakiness. There are a number of anxiety disorders: including generalized anxiety disorder, specific phobia, social anxiety disorder, separation anxiety disorder, agoraphobia, panic disorder, and selective mutism. The disorder differs by what results in the symptoms. People often have more than one anxiety disorder.\n\nThe cause of anxiety disorders is a combination of genetic and environmental factors. Risk factors include a history of child abuse, family history of mental disorders, and poverty. Anxiety disorders often occur with other mental disorders, particularly major depressive disorder, personality disorder, and substance use disorder. To be diagnosed symptoms typically need to be present at least six months, be more than would be expected for the situation, and decrease functioning. Other problems that may result in similar symptoms including hyperthyroidism, heart disease, caffeine, alcohol, or cannabis use, and withdrawal from certain drugs, among others.\n\nWithout treatment, anxiety disorders tend to remain. Treatment may include lifestyle changes, counselling, and medications. Counselling is typically with a type of cognitive behavioural therapy. Medications, such as antidepressants or beta blockers, may improve symptoms.\n\nAbout 12% of people are affected by an anxiety disorder in a given year and between 5-30% are affected at some point in their life. They occur about twice as often in females as males, and generally begin before the age of 25. The most common are specific phobia which affects nearly 12% and social anxiety disorder which affects 10% at some point in their life. They affect those between the ages of 15 and 35 the most and become less common after the age of 55. Rates appear to be higher in the United States and Europe.\n\nRisk factors\n\nNeuroanatomy \n\nNeural circuitry involving the amygdala (which regulates emotions like anxiety and fear, stimulating the HPA Axis and sympathetic nervous system) and hippocampus (which is implicated in emotional memory along with the amygdala) is thought to underlie anxiety. People who have anxiety tend to show high activity in response to emotional stimuli in the amygdala.Nolen-Hoeksema, S. (2013). (Ab)normal Psychology (6th edition). McGraw Hill. Some writers believe that excessive anxiety can lead to an overpotentiation of the limbic system (which includes the amygdala and nucleus accumbens), giving increased future anxiety, but this does not appear to have been proven.\n\nResearch upon adolescents who as infants had been highly apprehensive, vigilant, and fearful finds that their nucleus accumbens is more sensitive than that in other people when deciding to make an action that determined whether they received a reward. This suggests a link between circuits responsible for fear and also reward in anxious people. As researchers note, \"a sense of 'responsibility', or self-agency, in a context of uncertainty (probabilistic outcomes) drives the neural system underlying appetitive motivation (i.e., nucleus accumbens) more strongly in temperamentally inhibited than noninhibited adolescents\".\n\nGenetics \n\nGenetics and family history (e.g., parental anxiety) may predispose an individual for an increased risk of an anxiety disorder, but generally external stimuli will trigger its onset or exacerbation. Genetic differences account for about 43% of variance in panic disorder and 28% in generalized anxiety disorder. Although single genes are neither necessary nor sufficient for anxiety by themselves, several gene polymorphisms have been found to correlate with anxiety: PLXNA2, SERT, CRH, COMT and BDNF. Several of these genes influence neurotransmitters (such as serotonin and norepinephrine) and hormones (such as cortisol) which are implicated in anxiety. The epigenetic signature of at least one of these genes BDNF has also been associated with anxiety and specific patterns of neural activity.\n\nMedical conditions\n\nMany medical conditions can cause anxiety. This includes conditions that affect the ability to breathe, like COPD and asthma, and the difficulty in breathing that often occurs near death. Conditions that cause abdominal pain or chest pain can cause anxiety and may in some cases be a somatization of anxiety; the same is true for some sexual dysfunctions. Conditions that affect the face or the skin can cause social anxiety especially among adolescents, and developmental disabilities often lead to social anxiety for children as well.  Life-threatening conditions like cancer also cause anxiety.\n\nFurthermore, certain organic diseases may present with anxiety or symptoms that mimic anxiety. These disorders include certain endocrine diseases (hypo- and hyperthyroidism, hyperprolactinemia), metabolic disorders (diabetes), deficiency states (low levels of vitamin D, B2, B12, folic acid), gastrointestinal diseases (celiac disease, non-celiac gluten sensitivity, inflammatory bowel disease), heart diseases, blood diseases (anemia), cerebral vascular accidents (transient ischemic attack, stroke), and brain degenerative diseases (Parkinson's disease, dementia, multiple sclerosis, Huntington's disease), among others.\n\nSubstance-induced \n\nSeveral drugs can cause or worsen anxiety, whether in intoxication, withdrawal or from chronic use. These include alcohol, tobacco, cannabis, sedatives (including prescription benzodiazepines), opioids (including prescription pain killers and illicit drugs like heroin), stimulants (such as caffeine, cocaine and amphetamines), hallucinogens, and inhalants. While many often report self-medicating anxiety with these substances, improvements in anxiety from drugs are usually short-lived (with worsening of anxiety in the long-term, sometimes with acute anxiety as soon as the drug effects wear off) and tend to be exaggerated. Acute exposure to toxic levels of benzene may cause euphoria, anxiety, and irritability lasting up to 2 weeks after the exposure.\n\nPsychological \n\nPoor coping skills (e.g., rigidity/inflexible problem solving, denial, avoidance, impulsivity, extreme self-expectation, affective instability, and inability to focus on problems) are associated with anxiety. Anxiety is also linked and perpetuated by the person's own pessimistic outcome expectancy and how they cope with feedback negativity. Temperament (e.g., neuroticism) and attitudes (e.g. pessimism) have been found to be risk factors for anxiety.\n\nCognitive distortions such as overgeneralizing, catastrophizing, mind reading, emotional reasoning, binocular trick, and mental filter can result in anxiety. For example, an overgeneralized belief that something bad \"always\" happens may lead someone to have excessive fears of even minimally risky situations and to avoid benign social situations due to anticipatory anxiety of embarrassment. In addition, those who have high anxiety can also create future stressful life events.   Together, these findings suggest that anxious thoughts can lead to anticipatory anxiety as well stressful events, which in turn cause more anxiety. Such unhealthy thoughts can be targets for successful treatment with cognitive therapy.\n\nPsychodynamic theory posits that anxiety is often the result of opposing unconscious wishes or fears that manifest via maladaptive defense mechanisms (such as suppression, repression, anticipation, regression, somatization, passive aggression, dissociation) that develop to adapt to problems with early objects (e.g., caregivers) and empathic failures in childhood. For example, persistent parental discouragement of anger may result in repression/suppression of angry feelings which manifests as gastrointestinal distress (somatization) when provoked by another while the anger remains unconscious and outside the individual's awareness. Such conflicts can be targets for successful treatment with psychodynamic therapy. While psychodynamic therapy tends to explore the underlying roots of anxiety, cognitive behavioral therapy has also been shown to be a successful treatment for anxiety by altering irrational thoughts and unwanted behaviors.\n\nEvolutionary psychology \n\nAn evolutionary psychology explanation is that increased anxiety serves the purpose of increased vigilance regarding potential  threats in the environment as well as increased tendency to take proactive actions regarding such possible threats. This may cause false positive reactions but an individual suffering from anxiety may also avoid real threats. This may explain why anxious people are less likely to die due to accidents.\n\nWhen people are confronted with unpleasant and potentially harmful stimuli such as foul odors or tastes, PET-scans show increased bloodflow in the amygdala. In these studies, the participants also reported moderate anxiety. This might indicate that anxiety is a protective mechanism designed to prevent the organism from engaging in potentially harmful behaviors.\n\nSocial \n\nSocial risk factors for anxiety include a history of trauma (e.g., physical, sexual or emotional abuse or assault), early life experiences and parenting factors (e.g., rejection, lack of warmth, high hostility, harsh discipline, high parental negative affect, anxious childrearing, modelling of dysfunctional and drug-abusing behaviour, discouragement of emotions, poor socialization, poor attachment, and child abuse and neglect), cultural factors (e.g., stoic families/cultures, persecuted minorities including the disabled), and socioeconomics (e.g., uneducated, unemployed, impoverished (although developed countries have higher rates of anxiety disorders than developing countries)).\n\nGender socialization\n\nContextual factors that are thought to contribute to anxiety include gender socialization and learning experiences. In particular, learning mastery (the degree to which people perceive their lives to be under their own control) and instrumentality, which includes such traits as self-confidence, independence, and competitiveness fully mediate the relation between gender and anxiety. That is, though gender differences in anxiety exist, with higher levels of anxiety in women compared to men, gender socialization and learning mastery explain these gender differences.[http://www.communicationcache.com/uploads/1/0/8/8/10887248/anticipatory_anxiety_patterns_for_male_and_female_public_speakers.pdf Anticipatory Anxiety Patterns for Male and Female Public Speakers] , Ralph Behnke and Chris Sawyer, 1999 Research has demonstrated the ways in which facial prominence in photographic images differs between men and women. More specifically, in official online photographs of politicians around the world, women's faces are less prominent than men's. Interestingly enough, the difference in these images actually tended to be greater in cultures with greater institutional gender equality.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Anxiety" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=922" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Anxiety is an emotion characterized by an unpleasant state of inner turmoil, often accompanied by nervous behavior, such as pacing back and forth, somatic complaints, and rumination. It is the subjectively unpleasant feelings of dread over anticipated events, such as the feeling of imminent death. Anxiety is not the same as fear, which is a response to a  real or perceived immediate threat, whereas anxiety is the expectation of future threat. Anxiety is a feeling of uneasiness and worry, usually generalized and unfocused as an overreaction to a situation that is only subjectively seen as menacing. It is often accompanied by muscular tension, restlessness, fatigue and problems in concentration. Anxiety can be appropriate, but when experienced regularly the individual may suffer from an anxiety disorder.\n\nPeople facing anxiety may withdraw from situations which have provoked anxiety in the past. There are various types of anxiety. Existential anxiety can occur when a person faces angst, an existential crisis, or nihilistic feelings. People can also face mathematical anxiety, somatic anxiety, stage fright, or test anxiety. Social anxiety and stranger anxiety are caused when people are apprehensive around strangers or other people in general. Furthermore, anxiety has been linked with physical symptoms such as IBS and can heighten other mental health illnesses such as OCD and panic disorder. The first step in the management of a person with anxiety symptoms is to evaluate the possible presence of an underlying medical cause, whose recognition is essential in order to decide its correct treatment. Anxiety symptoms may be masking an organic disease, or appear associated or as a result of a medical disorder.\n\nAnxiety can be either a short term \"state\" or a long term \"trait\". Whereas trait anxiety represents worrying about future events, anxiety disorders are a group of mental disorders characterized by feelings of anxiety and fear. Anxiety disorders are partly genetic but may also be due to drug use, including alcohol, caffeine, and benzodiazepines (which are often prescribed to treat anxiety), as well as withdrawal from drugs of abuse. They often occur with other mental disorders, particularly bipolar disorder, eating disorders, major depressive disorder, or certain personality disorders. Common treatment options include lifestyle changes, medication, and therapy.\n\nDescriptions\n\nAnxiety is distinguished from fear, which is an appropriate cognitive and emotional response to a perceived threat. Anxiety is related to the specific behaviors of fight-or-flight responses, defensive behavior or escape. It occurs in situations only perceived as uncontrollable or unavoidable, but not realistically so. David Barlow defines anxiety as \"a future-oriented mood state in which one is not ready or prepared to attempt to cope with upcoming negative events,\" and that it is a distinction between future and present dangers which divides anxiety and fear. Another description of anxiety is  agony, dread, terror, or even apprehension. In positive psychology, anxiety is described as the mental state that results from a difficult challenge for which the subject has insufficient coping skills.\n\nFear and anxiety can be differentiated in four domains: (1) duration of emotional experience, (2) temporal focus, (3) specificity of the threat, and (4) motivated direction. Fear is defined as short lived, present focused, geared towards a specific threat, and facilitating escape from threat; anxiety, on the other hand, is defined as long-acting, future focused, broadly focused towards a diffuse threat, and promoting excessive caution while approaching a potential threat and interferes with constructive coping.\n\nAnxiety can be experienced with long, drawn out daily symptoms that reduce quality of life, known as chronic (or generalized) anxiety, or it can be experienced in short spurts with sporadic, stressful panic attacks, known as acute anxiety.  Symptoms of anxiety can range in number, intensity, and frequency, depending on the person. While almost everyone has experienced anxiety at some point in their lives, most do not develop long-term problems with anxiety.\n\nAnxiety may cause psychiatric and physiological symptoms.\n\nThe behavioral effects of anxiety may include withdrawal from situations which have provoked anxiety or negative feelings in the past. Other effects may include changes in sleeping patterns, changes in habits, increase or decrease in food intake, and increased motor tension (such as foot tapping).\n\nThe emotional effects of anxiety may include \"feelings of apprehension or dread, trouble concentrating, feeling tense or jumpy, anticipating the worst, irritability, restlessness, watching (and waiting) for signs (and occurrences) of danger, and, feeling like your mind's gone blank\"Smith, Melinda (2008, June). Anxiety attacks and disorders: Guide to the signs, symptoms, and treatment options. Retrieved March 3, 2009, from Helpguide Web site:  as well as \"nightmares/bad dreams, obsessions about sensations, déjà vu, a trapped-in-your-mind feeling, and feeling like everything is scary.\"(1987–2008). Anxiety Symptoms, Anxiety Attack Symptoms (Panic Attack Symptoms), Symptoms of Anxiety. Retrieved March 3, 2009, from Anxiety Centre Website: \n\nThe cognitive effects of anxiety may include thoughts about suspected dangers, such as fear of dying. \"You may ... fear that the chest pains are a deadly heart attack or that the shooting pains in your head are the result of a tumor or an aneurysm. You feel an intense fear when you think of dying, or you may think of it more often than normal, or can't get it out of your mind.\"(1987–2008). Anxiety symptoms - Fear of dying. Retrieved March 3, 2009, from Anxiety Centre Website: \n\nThe physiological symptoms of anxiety may include:\n*Neurological, as headache, paresthesias, vertigo, or presyncope.\n*Digestive, as abdominal pain, nausea, diarrhea, indigestion, dry mouth, or bolus.\n*Respiratory, as shortness of breath or sighing breathing.\n*Cardiac, as palpitations, tachycardia, or chest pain.\n*Muscular, as fatigue, tremors, or tetany.\n*Cutaneous, as perspiration, or itchy skin.\n*Uro-genital, as frequent urination, urinary urgency, dyspareunia, or impotence.\n\nTypes\n\nExistential\n\nThe philosopher Søren Kierkegaard, in The Concept of Anxiety (1844), described anxiety or dread associated with the \"dizziness of freedom\" and suggested the possibility for positive resolution of anxiety through the self-conscious exercise of responsibility and choosing. In Art and Artist (1932), the psychologist Otto Rank wrote that the psychological trauma of birth was the pre-eminent human symbol of existential anxiety and encompasses the creative person's simultaneous fear of – and desire for – separation, individuation, and differentiation.\n\nThe theologian Paul Tillich characterized existential anxiety as \"the state in which a being is aware of its possible nonbeing\" and he listed three categories for the nonbeing and resulting anxiety: ontic (fate and death), moral (guilt and condemnation), and spiritual (emptiness and meaninglessness). According to Tillich, the last of these three types of existential anxiety, i.e. spiritual anxiety, is predominant in modern times while the others were predominant in earlier periods. Tillich argues that this anxiety can be accepted as part of the human condition or it can be resisted but with negative consequences. In its pathological form, spiritual anxiety may tend to \"drive the person toward the creation of certitude in systems of meaning which are supported by tradition and authority\" even though such \"undoubted certitude is not built on the rock of reality\".\n\nAccording to Viktor Frankl, the author of Man's Search for Meaning, when a person is faced with extreme mortal dangers, the most basic of all human wishes is to find a meaning of life to combat the \"trauma of nonbeing\" as death is near.\n\nTest and performance\n\nAccording to Yerkes-Dodson law, an optimal level of arousal is necessary to best complete a task such as an exam, performance, or competitive event. However, when the anxiety or level of arousal exceeds that optimum, the result is a decline in performance.\n\nTest anxiety is the uneasiness, apprehension, or nervousness felt by students who have a fear of failing an exam. Students who have test anxiety may experience any of the following: the association of grades with personal worth; fear of embarrassment by a teacher; fear of alienation from parents or friends; time pressures; or feeling a loss of control. Sweating, dizziness, headaches, racing heartbeats, nausea, fidgeting, uncontrollable crying or laughing and drumming on a desk are all common. Because test anxiety hinges on fear of negative evaluation, debate exists as to whether test anxiety is itself a unique anxiety disorder or whether it is a specific type of social phobia. The DSM-IV classifies test anxiety as a type of social phobia.\n\nWhile the term \"test anxiety\" refers specifically to students, many workers share the same experience with regard to their career or profession. The fear of failing at a task and being negatively evaluated for failure can have a similarly negative effect on the adult. Management of test anxiety focuses on achieving relaxation and developing mechanisms to manage anxiety.\n\nStranger, social, and intergroup\n\nHumans generally require social acceptance and thus sometimes dread the disapproval of others. Apprehension of being judged by others may cause anxiety in social environments.\n \nAnxiety during social interactions, particularly between strangers, is common among young people. It may persist into adulthood and become social anxiety or social phobia. \"Stranger anxiety\" in small children is not considered a phobia. In adults, an excessive fear of other people is not a developmentally common stage; it is called social anxiety. According to Cutting, social phobics do not fear the crowd but the fact that they may be judged negatively.\n\nSocial anxiety varies in degree and severity. For some people, it is characterized by experiencing discomfort or awkwardness during physical social contact (e.g. embracing, shaking hands, etc.), while in other cases it can lead to a fear of interacting with unfamiliar people altogether. Those suffering from this condition may restrict their lifestyles to accommodate the anxiety, minimizing social interaction whenever possible. Social anxiety also forms a core aspect of certain personality disorders, including avoidant personality disorder.\n\nTo the extent that a person is fearful of social encounters with unfamiliar others, some people may experience anxiety particularly during interactions with outgroup members, or people who share different group memberships (i.e., by race, ethnicity, class, gender, etc.). Depending on the nature of the antecedent relations, cognitions, and situational factors, intergroup contact may be stressful and lead to feelings of anxiety. This apprehension or fear of contact with outgroup members is often called interracial or intergroup anxiety.\n\nAs is the case the more generalized forms of social anxiety, intergroup anxiety has behavioral, cognitive, and affective effects. For instance, increases in schematic processing and simplified information processing can occur when anxiety is high. Indeed, such is consistent with related work on attentional bias in implicit memory. Additionally recent research has found that implicit racial evaluations (i.e. automatic prejudiced attitudes) can be amplified during intergroup interaction. Negative experiences have been illustrated in producing not only negative expectations, but also avoidant, or  antagonistic, behavior such as hostility. Furthermore, when compared to anxiety levels and cognitive effort (e.g., impression management and self-presentation) in intragroup contexts, levels and depletion of resources may be exacerbated in the intergroup situation.\n\nTrait\n\nAnxiety can be either a short term 'state' or a long term \"trait\". Trait anxiety reflects a stable tendency to respond with state anxiety in the anticipation of threatening situations. A meta-analysis showed that a high level of neuroticism is a risk factor for development of anxiety symptoms and disorders. Such anxiety may be conscious or unconscious.\n\nChoice or decision\n\nAnxiety induced by the need to choose between similar options is increasingly being recognized as a problem for individuals and for organizations. In 2004, Capgemini wrote: \"Today we're all faced with greater choice, more competition and less time to consider our options or seek out the right advice.\"[https://www.uk.capgemini.com/news/pr1487 Is choice anxiety costing british 'blue chip' business?] , Capgemini, Aug 16, 2004\n\nIn a decision context, unpredictability or uncertainty may trigger emotional responses in anxious individuals that systematically alter decision-making. There are primarily two forms of this anxiety type. The first form refers to a choice in which there are multiple potential outcomes with known or calculable probabilities. The second form refers to the uncertainty and ambiguity related to a decision context in which there are multiple possible outcomes with unknown probabilities.\n\nAnxiety disorders\n\nAnxiety disorders are a group of mental disorders characterized by feelings of anxiety and fear. Anxiety is a worry about future events and fear is a reaction to current events. These feelings may cause physical symptoms, such as a fast heart rate and shakiness. There are a number of anxiety disorders: including generalized anxiety disorder, specific phobia, social anxiety disorder, separation anxiety disorder, agoraphobia, panic disorder, and selective mutism. The disorder differs by what results in the symptoms. People often have more than one anxiety disorder.\n\nThe cause of anxiety disorders is a combination of genetic and environmental factors. Risk factors include a history of child abuse, family history of mental disorders, and poverty. Anxiety disorders often occur with other mental disorders, particularly major depressive disorder, personality disorder, and substance use disorder. To be diagnosed symptoms typically need to be present at least six months, be more than would be expected for the situation, and decrease functioning. Other problems that may result in similar symptoms including hyperthyroidism, heart disease, caffeine, alcohol, or cannabis use, and withdrawal from certain drugs, among others.\n\nWithout treatment, anxiety disorders tend to remain. Treatment may include lifestyle changes, counselling, and medications. Counselling is typically with a type of cognitive behavioural therapy. Medications, such as antidepressants or beta blockers, may improve symptoms.\n\nAbout 12% of people are affected by an anxiety disorder in a given year and between 5-30% are affected at some point in their life. They occur about twice as often in females as males, and generally begin before the age of 25. The most common are specific phobia which affects nearly 12% and social anxiety disorder which affects 10% at some point in their life. They affect those between the ages of 15 and 35 the most and become less common after the age of 55. Rates appear to be higher in the United States and Europe.\n\nRisk factors\n\nNeuroanatomy \n\nNeural circuitry involving the amygdala (which regulates emotions like anxiety and fear, stimulating the HPA Axis and sympathetic nervous system) and hippocampus (which is implicated in emotional memory along with the amygdala) is thought to underlie anxiety. People who have anxiety tend to show high activity in response to emotional stimuli in the amygdala.Nolen-Hoeksema, S. (2013). (Ab)normal Psychology (6th edition). McGraw Hill. Some writers believe that excessive anxiety can lead to an overpotentiation of the limbic system (which includes the amygdala and nucleus accumbens), giving increased future anxiety, but this does not appear to have been proven.\n\nResearch upon adolescents who as infants had been highly apprehensive, vigilant, and fearful finds that their nucleus accumbens is more sensitive than that in other people when deciding to make an action that determined whether they received a reward. This suggests a link between circuits responsible for fear and also reward in anxious people. As researchers note, \"a sense of 'responsibility', or self-agency, in a context of uncertainty (probabilistic outcomes) drives the neural system underlying appetitive motivation (i.e., nucleus accumbens) more strongly in temperamentally inhibited than noninhibited adolescents\".\n\nGenetics \n\nGenetics and family history (e.g., parental anxiety) may predispose an individual for an increased risk of an anxiety disorder, but generally external stimuli will trigger its onset or exacerbation. Genetic differences account for about 43% of variance in panic disorder and 28% in generalized anxiety disorder. Although single genes are neither necessary nor sufficient for anxiety by themselves, several gene polymorphisms have been found to correlate with anxiety: PLXNA2, SERT, CRH, COMT and BDNF. Several of these genes influence neurotransmitters (such as serotonin and norepinephrine) and hormones (such as cortisol) which are implicated in anxiety. The epigenetic signature of at least one of these genes BDNF has also been associated with anxiety and specific patterns of neural activity.\n\nMedical conditions\n\nMany medical conditions can cause anxiety. This includes conditions that affect the ability to breathe, like COPD and asthma, and the difficulty in breathing that often occurs near death. Conditions that cause abdominal pain or chest pain can cause anxiety and may in some cases be a somatization of anxiety; the same is true for some sexual dysfunctions. Conditions that affect the face or the skin can cause social anxiety especially among adolescents, and developmental disabilities often lead to social anxiety for children as well.  Life-threatening conditions like cancer also cause anxiety.\n\nFurthermore, certain organic diseases may present with anxiety or symptoms that mimic anxiety. These disorders include certain endocrine diseases (hypo- and hyperthyroidism, hyperprolactinemia), metabolic disorders (diabetes), deficiency states (low levels of vitamin D, B2, B12, folic acid), gastrointestinal diseases (celiac disease, non-celiac gluten sensitivity, inflammatory bowel disease), heart diseases, blood diseases (anemia), cerebral vascular accidents (transient ischemic attack, stroke), and brain degenerative diseases (Parkinson's disease, dementia, multiple sclerosis, Huntington's disease), among others.\n\nSubstance-induced \n\nSeveral drugs can cause or worsen anxiety, whether in intoxication, withdrawal or from chronic use. These include alcohol, tobacco, cannabis, sedatives (including prescription benzodiazepines), opioids (including prescription pain killers and illicit drugs like heroin), stimulants (such as caffeine, cocaine and amphetamines), hallucinogens, and inhalants. While many often report self-medicating anxiety with these substances, improvements in anxiety from drugs are usually short-lived (with worsening of anxiety in the long-term, sometimes with acute anxiety as soon as the drug effects wear off) and tend to be exaggerated. Acute exposure to toxic levels of benzene may cause euphoria, anxiety, and irritability lasting up to 2 weeks after the exposure.\n\nPsychological \n\nPoor coping skills (e.g., rigidity/inflexible problem solving, denial, avoidance, impulsivity, extreme self-expectation, affective instability, and inability to focus on problems) are associated with anxiety. Anxiety is also linked and perpetuated by the person's own pessimistic outcome expectancy and how they cope with feedback negativity. Temperament (e.g., neuroticism) and attitudes (e.g. pessimism) have been found to be risk factors for anxiety.\n\nCognitive distortions such as overgeneralizing, catastrophizing, mind reading, emotional reasoning, binocular trick, and mental filter can result in anxiety. For example, an overgeneralized belief that something bad \"always\" happens may lead someone to have excessive fears of even minimally risky situations and to avoid benign social situations due to anticipatory anxiety of embarrassment. In addition, those who have high anxiety can also create future stressful life events.   Together, these findings suggest that anxious thoughts can lead to anticipatory anxiety as well stressful events, which in turn cause more anxiety. Such unhealthy thoughts can be targets for successful treatment with cognitive therapy.\n\nPsychodynamic theory posits that anxiety is often the result of opposing unconscious wishes or fears that manifest via maladaptive defense mechanisms (such as suppression, repression, anticipation, regression, somatization, passive aggression, dissociation) that develop to adapt to problems with early objects (e.g., caregivers) and empathic failures in childhood. For example, persistent parental discouragement of anger may result in repression/suppression of angry feelings which manifests as gastrointestinal distress (somatization) when provoked by another while the anger remains unconscious and outside the individual's awareness. Such conflicts can be targets for successful treatment with psychodynamic therapy. While psychodynamic therapy tends to explore the underlying roots of anxiety, cognitive behavioral therapy has also been shown to be a successful treatment for anxiety by altering irrational thoughts and unwanted behaviors.\n\nEvolutionary psychology \n\nAn evolutionary psychology explanation is that increased anxiety serves the purpose of increased vigilance regarding potential  threats in the environment as well as increased tendency to take proactive actions regarding such possible threats. This may cause false positive reactions but an individual suffering from anxiety may also avoid real threats. This may explain why anxious people are less likely to die due to accidents.\n\nWhen people are confronted with unpleasant and potentially harmful stimuli such as foul odors or tastes, PET-scans show increased bloodflow in the amygdala. In these studies, the participants also reported moderate anxiety. This might indicate that anxiety is a protective mechanism designed to prevent the organism from engaging in potentially harmful behaviors.\n\nSocial \n\nSocial risk factors for anxiety include a history of trauma (e.g., physical, sexual or emotional abuse or assault), early life experiences and parenting factors (e.g., rejection, lack of warmth, high hostility, harsh discipline, high parental negative affect, anxious childrearing, modelling of dysfunctional and drug-abusing behaviour, discouragement of emotions, poor socialization, poor attachment, and child abuse and neglect), cultural factors (e.g., stoic families/cultures, persecuted minorities including the disabled), and socioeconomics (e.g., uneducated, unemployed, impoverished (although developed countries have higher rates of anxiety disorders than developing countries)).\n\nGender socialization\n\nContextual factors that are thought to contribute to anxiety include gender socialization and learning experiences. In particular, learning mastery (the degree to which people perceive their lives to be under their own control) and instrumentality, which includes such traits as self-confidence, independence, and competitiveness fully mediate the relation between gender and anxiety. That is, though gender differences in anxiety exist, with higher levels of anxiety in women compared to men, gender socialization and learning mastery explain these gender differences.[http://www.communicationcache.com/uploads/1/0/8/8/10887248/anticipatory_anxiety_patterns_for_male_and_female_public_speakers.pdf Anticipatory Anxiety Patterns for Male and Female Public Speakers] , Ralph Behnke and Chris Sawyer, 1999 Research has demonstrated the ways in which facial prominence in photographic images differs between men and women. More specifically, in official online photographs of politicians around the world, women's faces are less prominent than men's. Interestingly enough, the difference in these images actually tended to be greater in cultures with greater institutional gender equality. Anxiety. http://en.wikipedia.org/?curid=922."
  }
}
