{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18673",
  "eid" : "345f0960-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778597110,
  "textBody" : "Long-Term Capital Management L.P. (LTCM) was a hedge fund management firmA financial History of the United States Volume II: 1970–2001, Jerry W. Markham, Chapter 5: \"Bank Consolidation\", M. E. Sharpe, Inc., 2002 based in Greenwich, Connecticut that used absolute-return trading strategies combined with high financial leverage. The firm's master hedge fund, Long-Term Capital Portfolio L.P., collapsed in the late 1990s, leading to an agreement on September 23, 1998, among 16 financial institutions—which included Bankers Trust, Barclays, Bear Stearns, Chase Manhattan Bank, Credit Agricole, Credit Suisse First Boston, Deutsche Bank, Goldman Sachs, JP Morgan, Lehman Brothers, Merrill Lynch, Morgan Stanley, Paribas, Salomon Smith Barney, Societe Generale, and UBS—for a $3.6 billion recapitalization (bailout) under the supervision of the Federal Reserve.\n\nLTCM was founded in 1994 by John W. Meriwether, the former vice-chairman and head of bond trading at Salomon Brothers. Members of LTCM's board of directors included Myron S. Scholes and Robert C. Merton, who shared the 1997 Nobel Memorial Prize in Economic Sciences for a \"new method to determine the value of derivatives\".[http://nobelprize.org/economics/laureates/1997/index.html The Bank of Sweden Prize in Economic Sciences 1997]. Robert C. Merton and Myron S. Scholes pictures. Myron S. Scholes with location named as \"Long Term Capital Management, Greenwich, CT, USA\" where the prize was received. Initially successful with annualized return of over 21% (after fees) in its first year, 43% in the second year and 41% in the third year, in 1998 it lost $4.6 billion in less than four months following the 1997 Asian financial crisis and 1998 Russian financial crisis, requiring financial intervention by the Federal Reserve, with the fund liquidating and dissolving in early 2000.\n\nFounding \n\nJohn W. Meriwether headed Salomon Brothers' bond arbitrage desk until he resigned in 1991 amid a trading scandal.  According to Chi-Fu Huang, later a Principal at LTCM, the bond arbitrage group was responsible for 80–100% of Salomon's global total earnings from the late 80s until the early 90s.\nIn 1993 Meriwether created Long-Term Capital as a hedge fund and recruited several Salomon bond traders—Larry Hilibrand and Victor Haghani in particular would wield substantial clout—and two future winners of the Nobel Memorial Prize, Myron S. Scholes and Robert C. Merton. Other principals included Eric Rosenfeld, Greg Hawkins, William Krasker, Dick Leahy, James McEntee, Robert Shustak, and David W. Mullins Jr.\n\nThe company consisted of Long-Term Capital Management (LTCM), a company incorporated in Delaware but based in Greenwich, Connecticut. LTCM managed trades in Long-Term Capital Portfolio LP, a partnership registered in the Cayman Islands. The fund's operation was designed to have extremely low overhead; trades were conducted through a partnership with Bear Stearns and client relations were handled by Merrill Lynch.\n\nMeriwether chose to start a hedge fund to avoid the financial regulation imposed on more traditional investment vehicles, such as mutual funds, as established by the Investment Company Act of 1940—funds which accepted stakes from 100 or fewer individuals with more than $1 million in net worth each were exempt from most of the regulations that bound other investment companies. In late 1993, Meriwether approached several \"high-net-worth individuals\" in an effort to secure start-up capital for Long-Term Capital Management. With the help of Merrill Lynch, LTCM secured hundreds of millions of dollars from business owners, celebrities and even private university endowments and later the Italian central bank. The bulk of the money, however, came from companies and individuals connected to the financial industry. By 24 February 1994, the day LTCM began trading, the company had amassed just over $1.01 billion in capital.\n\nTrading strategies \n\nThe core investment strategy of the company was then known as involving convergence trading: using quantitative models to exploit deviations from fair value in the relationships between liquid securities across nations and asset classes.  In fixed income the company was involved in US Treasuries, Japanese Government Bonds, UK Gilts, Italian BTPs, and Latin American debt, although their activities were not confined to these markets or to government bonds.\n\nFixed Income Arbitrage \n\nFixed income securities pay a set of coupons at specified dates in the future, and make a defined redemption payment at maturity.  Since bonds of similar maturities and the same credit quality are close substitutes for investors, there tends to be a close relationship between their prices (and yields).  Whereas it is possible to construct a single set of valuation curves for derivative instruments based on LIBOR-type fixings, it is not possible to do so for government bond securities because every bond has slightly different characteristics.  It is therefore necessary to construct a theoretical model of what the relationships between different but closely related fixed income securities should be.\n\nFor example, the most recently issued treasury bond in the US – known as the benchmark – will be more liquid than bonds of similar but slightly shorter maturity that were issued previously.  Trading is concentrated in the benchmark bond, and transaction costs are lower for buying or selling it.  As a consequence, it tends to trade more expensively than less liquid older bonds, but this expensiveness (or richness) tends to have a limited duration, because after a certain time there will be a new benchmark, and trading will shift to this security newly issued by the Treasury.  One core trade in the LTCM strategies was to purchase the old benchmark – now a 29.75-year bond, and which no longer had a significant premium – and to sell short the newly issued benchmark 30-year, which traded at a premium.  Over time the valuations of the two bonds would tend to converge as the richness of the benchmark faded once a new benchmark was issued.  If the coupons of the two bonds were similar, then this trade would create an exposure to changes in the shape of the yield curve: a flattening would depress the yields and raise the prices of longer-dated bonds, and raise the yields and depress the prices of shorter-dated bonds.  It would therefore tend to create losses by making the 30-year bond that LTCM was short more expensive (and the 29.75-year bond they owned cheaper) even if there had been no change in the true relative valuation of the securities.  This exposure to the shape of the yield curve could be managed at a portfolio level, and hedged out by entering a smaller steepener in other similar securities.\n\nLeverage and Portfolio Composition \n\nBecause the magnitude of discrepancies in valuations in this kind of trade is small (for the benchmark Treasury convergence trade, typically a few basis points), in order to earn significant returns for investors, LTCM used leverage to create a portfolio that was a significant multiple (varying over time depending on their portfolio composition) of investors' equity in the fund.  It was also necessary to access the financing market in order to borrow the securities that they had sold short.  In order to maintain their portfolio, LTCM was therefore dependent on the willingness of its counterparties in the government bond (repo) market to continue to finance their portfolio.  If the company was unable to extend its financing agreements, then it would be forced to sell the securities it owned and to buy back the securities it was short at market prices, regardless of whether these were favourable from a valuation perspective.\n\nAt the beginning of 1998, the firm had equity of $4.72 billion and had borrowed over $124.5 billion with assets of around $129 billion, for a debt-to-equity ratio of over 25 to 1. It had off-balance sheet derivative positions with a notional value of approximately $1.25 trillion, most of which were in interest rate derivatives such as interest rate swaps. The fund also invested in other derivatives such as equity options.\n\nUBS Investment \n\nUnder prevailing US tax laws, there was a different treatment of long-term capital gains, which were taxed at 20.0 percent, and income, which was taxed at 39.6 percent.  The earnings for partners in a hedge fund was taxed at the higher rate applying to income, and LTCM applied its financial engineering expertise to legally transform income into capital gains.  It did so by engaging in a transaction with UBS (Union Bank of Switzerland) that would defer foreign interest income for seven years, thereby being able to earn the more favourable capital gains treatment.  LTCM purchased a call option on 1 million of their own shares (valued then at $800 million) for a premium paid to UBS of $300 million.  This transaction was completed in three tranches: in June, August, and October 1997.  Under the terms of the deal, UBS agreed to reinvest the $300 million premium directly back into LTCM for a minimum of three years.  In order to hedge its exposure from being short the call option, UBS also purchased 1 million of LTCM shares.  Put-call parity means that being short a call and long the same amount of notional as underlying the call is equivalent to being short a put.  So the net effect of the transaction was for UBS to lend $300 million to LTCM at LIBOR+50 and to be short a put on 1 million shares.  UBS's own motivation for the trade was to be able to invest in LTCM – a possibility that was not open to investors generally – and to become closer to LTCM as a client.  LTCM quickly became the largest client of the hedge fund desk, generating $15 million in fees annually.\n\nDiminishing Opportunities and Broadening of Strategies \n\nLTCM attempted to create a splinter fund in 1996 called LTCM-X that would invest in even higher risk trades and focus on Latin American markets. LTCM turned to UBS to invest in and write the warrant for this new spin-off company.\n\nLTCM faced challenges in deploying capital as their capital base grew due to initially strong returns, and as the magnitude of anomalies in market pricing diminished over time. James Surowiecki concludes that LTCM grew such a large portion of such illiquid markets that there was no diversity in buyers in them, or no buyers at all, so the wisdom of the market did not function and it was impossible to determine a price for its assets (such as Danish bonds in September 1998).\n\nIn Q4 1997, a year in which they earned 27%, LTCM returned capital to investors.  They also broadened their strategies to include new approaches in markets outside of fixed income: many of these were not market neutral – they were not dependent on overall interest rates or stock prices going up (or down) – and they were not traditional convergence trades.  By 1998, LTCM had accumulated extremely large positions in areas such as merger arbitrage (betting on differences between a proprietary view of the likelihood of success of mergers and other corporate transactions would be completed and the implied market pricing) and S&P 500 options (net short long-term S&P volatility). LTCM had become a major supplier of S&P 500 vega, which had been in demand by companies seeking to essentially insure equities against future declines.\n\nDownturn \n\nAlthough periods of distress have often created tremendous opportunities for relative value strategies, this did not prove to be the case on this occasion, and the seeds of LTCM's demise were sown before the Russian default of 17 August 1998.  LTCM had returned $2.7 bn to investors in Q4 of 1997, although it had also raised a total in capital of $1.066bn from UBS and $133m from CSFB.  Since position sizes had not been reduced, the net effect was to raise the leverage of the fund.\n\nAlthough 1997 had been a very profitable year for LTCM (27%), the lingering effects of the 1997 Asian crisis continued to shape developments in asset markets into 1998.  Although this crisis had originated in Asia, its effects were not confined to that region.  The rise in risk aversion had raised concerns amongst investors regarding all markets heavily dependent on international capital flows, and this shaped asset pricing in markets outside Asia too.\n\nIn May and June 1998 returns from the fund were -6.42% and -10.14% respectively, reducing LTCM's capital by $461 million. This was further aggravated by the exit of Salomon Brothers from the arbitrage business in July 1998. Because the Salomon arbitrage group (where many of LTCM's strategies had first been incubated) had been a significant player in the kinds of strategies also pursued by LTCM, the liquidation of the Salomon portfolio (and its announcement itself) had the effect of depressing the prices of the securities owned by LTCM and bidding up the prices of the securities LTCM was short.  According to Michael Lewis in the New York Times article of July 1998, returns that month were circa -10%. One LTCM partner commented that because there was a clear temporary reason to explain the widening of arbitrage spreads, at the time it gave them more conviction that these trades would eventually return to fair value (as they did, but not without widening much further first).\n\nSuch losses were accentuated through the 1998 Russian financial crisis in August and September 1998, when the Russian government defaulted on its domestic local currency bonds. This came as a surprise to many investors because according to traditional economic thinking of the time, a sovereign issuer should never need to default given access to the printing press.  There was a flight to quality, bidding up the prices of the most liquid and benchmark securities that LTCM was short, and depressing the price of the less liquid securities it owned. This phenomenon occurred not merely in the US Treasury market but across the full spectrum of financial assets.  Although LTCM was diversified, the nature of its strategy implied an exposure to a latent factor risk of the price of liquidity across markets. As a consequence, when a much larger flight to liquidity occurred than had been anticipated when constructing its portfolio, its positions designed to profit from convergence to fair value incurred large losses as expensive but liquid securities became more expensive, and cheap but illiquid securities became cheaper. By the end of August, the fund had lost $1.85 billion in capital.\n\nBecause LTCM was not the only fund pursuing such a strategy, and because the proprietary trading desks of the banks also held some similar trades, the divergence from fair value was made worse as these other positions were also liquidated.  As rumours of LTCM's difficulties spread, some market participants positioned in anticipation of a forced liquidation.  Victor Haghani, a partner at LTCM, said about this time \"it was as if there was someone out there with our exact portfolio,... only it was three times as large as ours, and they were liquidating all at once.\"\n\nBecause these losses reduced the capital base of LTCM, and its ability to maintain the magnitude of its existing portfolio, LTCM was forced to liquidate a number of its positions at a highly unfavorable moment and suffer further losses. A vivid illustration of the consequences of these forced liquidations is given by Lowenstein (2000). He reports that LTCM established an arbitrage position in the dual-listed company (or \"DLC\") Royal Dutch Shell in the summer of 1997, when Royal Dutch traded at an 8%–10% premium relative to Shell. In total $2.3 billion was invested, half of which was \"long\" in Shell and the other half was \"short\" in Royal Dutch.\n\nLTCM was essentially betting that the share prices of Royal Dutch and Shell would converge because in their belief the present value of the future cashflows of the two securities should be similar.  This might have happened in the long run, but due to its losses on other positions, LTCM had to unwind its position in Royal Dutch Shell. Lowenstein reports that the premium of Royal Dutch had increased to about 22%, which implies that LTCM incurred a large loss on this arbitrage strategy. LTCM lost $286 million in equity pairs trading and more than half of this loss is accounted for by the Royal Dutch Shell trade.\n\nThe company, which had historically earned annualised compounded returns of almost 40% up to this point, experienced a flight to liquidity. In the first three weeks of September, LTCM's equity tumbled from $2.3 billion at the start of the month to just $400 million by September 25. With liabilities still over $100 billion, this translated to an effective leverage ratio of more than 250-to-1.\n\n1998 bailout \n\nLong-Term Capital Management did business with nearly everyone important on Wall Street. Indeed, much of LTCM's capital was composed of funds from the same financial professionals with whom it traded. As LTCM teetered, Wall Street feared that Long-Term's failure could cause a chain reaction in numerous markets, causing catastrophic losses throughout the financial system.\n\nAfter LTCM failed to raise more money on its own, it became clear it was running out of options. On September 23, 1998, Goldman Sachs, AIG, and Berkshire Hathaway offered then to buy out the fund's partners for $250 million, to inject $3.75 billion and to operate LTCM within Goldman's own trading division.  The offer was stunningly low to LTCM's partners because at the start of the year their firm had been worth $4.7 billion. Warren Buffett gave Meriwether less than one hour to accept the deal; the time lapsed before a deal could be worked out.\n\nSeeing no options left, the Federal Reserve Bank of New York organized a bailout of $3.625 billion by the major creditors to avoid a wider collapse in the financial markets. The principal negotiator for LTCM was general counsel James G. Rickards.Kathryn M. Welling, [http://www.docstoc.com/docs/27535620/Rickards-Interview \"Threat Finance: Capital Markets Risk Complex and Supercritical, Says Jim Rickards\"] welling@weeden (February 25, 2010). Retrieved May 13, 2011 The contributions from the various institutions were as follows:Wall Street Journal, 25 September 1998[https://www.bloomberg.com/apps/news?pid20601109&refer\nhome&sid=a2mbR8rPyzto Bloomberg.com: Exclusive]\n* $300 million: Bankers Trust, Barclays, Chase, Credit Suisse First Boston, Deutsche Bank, Goldman Sachs, Merrill Lynch, J.P.Morgan, Morgan Stanley, Salomon Smith Barney, UBS\n* $125 million: Société Générale\n* $100 million: Paribas, Credit Agricolehttp://eml.berkeley.edu/~webfac/craine/e137_f03/137lessons.pdf\n* Bear Stearns and Lehman Brothers declined to participate.\n\nIn return, the participating banks got a 90% share in the fund and a promise that a supervisory board would be established. LTCM's partners received a 10% stake, still worth about $400 million, but this money was completely consumed by their debts. The partners once had $1.9 billion of their own money invested in LTCM, all of which was wiped out.\n\nThe fear was that there would be a chain reaction as the company liquidated its securities to cover its debt, leading to a drop in prices, which would force other companies to liquidate their own debt in a vicious cycle.\n\nThe total losses were found to be $4.6 billion. The losses in the major investment categories were (ordered by magnitude):\n* $1.6 bn in swaps\n* $1.3 bn in equity volatility\n* $430 mn in Russia and other emerging markets\n* $371 mn in directional trades in developed countries\n* $286 mn in Dual-listed company pairs (such as VW, Shell)\n* $215 mn in yield curve arbitrage\n* $203 mn in S&P 500 stocks\n* $100 mn in junk bond arbitrage\n* no substantial losses in merger arbitrage\n\nLong-Term Capital was audited by Price Waterhouse LLP. After the bailout by the other investors, the panic abated, and the positions formerly held by LTCM were eventually liquidated at a small profit to the rescuers.  Although termed a bailout, the transaction effectively amounted to an orderly liquidation of the positions held by LTCM with creditor involvement and supervision by the Federal Reserve Bank.  No public money was injected or directly at risk, and the companies involved in providing support to LTCM were also those that stood to lose from its failure.  The creditors themselves did not lose money from being involved in the transaction.\n\nSome industry officials said that Federal Reserve Bank of New York involvement in the rescue, however benign, would encourage large financial institutions to assume more risk, in the belief that the Federal Reserve would intervene on their behalf in the event of trouble. Federal Reserve Bank of New York actions raised concerns among some market observers that it could create moral hazard since even though the Fed had not directly injected capital, its use of moral suasion to encourage creditor involvement emphasized its interest in supporting the financial system .[http://www.gao.gov/archive/2000/gg00067r.pdf GAO/GGD-00-67R Questions Concerning LTCM and Our Responses] General Accouting Office, February 23, 2000\n\nLTCM's strategies were compared (a contrast with the market efficiency aphorism that there are no $100 bills lying on the street, as someone else has already picked them up) to \"picking up nickels in front of a bulldozer\"—a likely small gain balanced against a small chance of a large loss, like the payouts from selling an out-of-the-money naked call option.\n\nAftermath \n\nAfter the bailout, Long-Term Capital Management continued operations. In the year following the bailout, it earned 10%. By early 2000, the fund had been liquidated, and the consortium of banks that financed the bailout had been paid back, but the collapse was devastating for many involved. Mullins, once considered a possible successor to Alan Greenspan, saw his future with the Fed dashed. The theories of Merton and Scholes took a public beating. In its annual reports, Merrill Lynch observed that mathematical risk models \"may provide a greater sense of security than warranted; therefore, reliance on these models should be limited.\"\n\nAfter helping unwind LTCM, Meriwether launched JWM Partners. Haghani, Hilibrand, Leahy, and Rosenfeld signed up as principals of the new firm. By December 1999, they had raised $250 million for a fund that would continue many of LTCM's strategies—this time, using less leverage. With the credit crisis of 2008, JWM Partners LLC was hit with a 44% loss from September 2007 to February 2009 in its Relative Value Opportunity II fund. As such, JWM Hedge Fund was shut down in July 2009.\n\nIn 1998, the chairman of Union Bank of Switzerland resigned as a result of a $780 million loss incurred from the short put option on LTCM, which had become very significantly in the money due to its collapse.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Long-Term Capital Management" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18673" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Long-Term Capital Management L.P. (LTCM) was a hedge fund management firmA financial History of the United States Volume II: 1970–2001, Jerry W. Markham, Chapter 5: \"Bank Consolidation\", M. E. Sharpe, Inc., 2002 based in Greenwich, Connecticut that used absolute-return trading strategies combined with high financial leverage. The firm's master hedge fund, Long-Term Capital Portfolio L.P., collapsed in the late 1990s, leading to an agreement on September 23, 1998, among 16 financial institutions—which included Bankers Trust, Barclays, Bear Stearns, Chase Manhattan Bank, Credit Agricole, Credit Suisse First Boston, Deutsche Bank, Goldman Sachs, JP Morgan, Lehman Brothers, Merrill Lynch, Morgan Stanley, Paribas, Salomon Smith Barney, Societe Generale, and UBS—for a $3.6 billion recapitalization (bailout) under the supervision of the Federal Reserve.\n\nLTCM was founded in 1994 by John W. Meriwether, the former vice-chairman and head of bond trading at Salomon Brothers. Members of LTCM's board of directors included Myron S. Scholes and Robert C. Merton, who shared the 1997 Nobel Memorial Prize in Economic Sciences for a \"new method to determine the value of derivatives\".[http://nobelprize.org/economics/laureates/1997/index.html The Bank of Sweden Prize in Economic Sciences 1997]. Robert C. Merton and Myron S. Scholes pictures. Myron S. Scholes with location named as \"Long Term Capital Management, Greenwich, CT, USA\" where the prize was received. Initially successful with annualized return of over 21% (after fees) in its first year, 43% in the second year and 41% in the third year, in 1998 it lost $4.6 billion in less than four months following the 1997 Asian financial crisis and 1998 Russian financial crisis, requiring financial intervention by the Federal Reserve, with the fund liquidating and dissolving in early 2000.\n\nFounding \n\nJohn W. Meriwether headed Salomon Brothers' bond arbitrage desk until he resigned in 1991 amid a trading scandal.  According to Chi-Fu Huang, later a Principal at LTCM, the bond arbitrage group was responsible for 80–100% of Salomon's global total earnings from the late 80s until the early 90s.\nIn 1993 Meriwether created Long-Term Capital as a hedge fund and recruited several Salomon bond traders—Larry Hilibrand and Victor Haghani in particular would wield substantial clout—and two future winners of the Nobel Memorial Prize, Myron S. Scholes and Robert C. Merton. Other principals included Eric Rosenfeld, Greg Hawkins, William Krasker, Dick Leahy, James McEntee, Robert Shustak, and David W. Mullins Jr.\n\nThe company consisted of Long-Term Capital Management (LTCM), a company incorporated in Delaware but based in Greenwich, Connecticut. LTCM managed trades in Long-Term Capital Portfolio LP, a partnership registered in the Cayman Islands. The fund's operation was designed to have extremely low overhead; trades were conducted through a partnership with Bear Stearns and client relations were handled by Merrill Lynch.\n\nMeriwether chose to start a hedge fund to avoid the financial regulation imposed on more traditional investment vehicles, such as mutual funds, as established by the Investment Company Act of 1940—funds which accepted stakes from 100 or fewer individuals with more than $1 million in net worth each were exempt from most of the regulations that bound other investment companies. In late 1993, Meriwether approached several \"high-net-worth individuals\" in an effort to secure start-up capital for Long-Term Capital Management. With the help of Merrill Lynch, LTCM secured hundreds of millions of dollars from business owners, celebrities and even private university endowments and later the Italian central bank. The bulk of the money, however, came from companies and individuals connected to the financial industry. By 24 February 1994, the day LTCM began trading, the company had amassed just over $1.01 billion in capital.\n\nTrading strategies \n\nThe core investment strategy of the company was then known as involving convergence trading: using quantitative models to exploit deviations from fair value in the relationships between liquid securities across nations and asset classes.  In fixed income the company was involved in US Treasuries, Japanese Government Bonds, UK Gilts, Italian BTPs, and Latin American debt, although their activities were not confined to these markets or to government bonds.\n\nFixed Income Arbitrage \n\nFixed income securities pay a set of coupons at specified dates in the future, and make a defined redemption payment at maturity.  Since bonds of similar maturities and the same credit quality are close substitutes for investors, there tends to be a close relationship between their prices (and yields).  Whereas it is possible to construct a single set of valuation curves for derivative instruments based on LIBOR-type fixings, it is not possible to do so for government bond securities because every bond has slightly different characteristics.  It is therefore necessary to construct a theoretical model of what the relationships between different but closely related fixed income securities should be.\n\nFor example, the most recently issued treasury bond in the US – known as the benchmark – will be more liquid than bonds of similar but slightly shorter maturity that were issued previously.  Trading is concentrated in the benchmark bond, and transaction costs are lower for buying or selling it.  As a consequence, it tends to trade more expensively than less liquid older bonds, but this expensiveness (or richness) tends to have a limited duration, because after a certain time there will be a new benchmark, and trading will shift to this security newly issued by the Treasury.  One core trade in the LTCM strategies was to purchase the old benchmark – now a 29.75-year bond, and which no longer had a significant premium – and to sell short the newly issued benchmark 30-year, which traded at a premium.  Over time the valuations of the two bonds would tend to converge as the richness of the benchmark faded once a new benchmark was issued.  If the coupons of the two bonds were similar, then this trade would create an exposure to changes in the shape of the yield curve: a flattening would depress the yields and raise the prices of longer-dated bonds, and raise the yields and depress the prices of shorter-dated bonds.  It would therefore tend to create losses by making the 30-year bond that LTCM was short more expensive (and the 29.75-year bond they owned cheaper) even if there had been no change in the true relative valuation of the securities.  This exposure to the shape of the yield curve could be managed at a portfolio level, and hedged out by entering a smaller steepener in other similar securities.\n\nLeverage and Portfolio Composition \n\nBecause the magnitude of discrepancies in valuations in this kind of trade is small (for the benchmark Treasury convergence trade, typically a few basis points), in order to earn significant returns for investors, LTCM used leverage to create a portfolio that was a significant multiple (varying over time depending on their portfolio composition) of investors' equity in the fund.  It was also necessary to access the financing market in order to borrow the securities that they had sold short.  In order to maintain their portfolio, LTCM was therefore dependent on the willingness of its counterparties in the government bond (repo) market to continue to finance their portfolio.  If the company was unable to extend its financing agreements, then it would be forced to sell the securities it owned and to buy back the securities it was short at market prices, regardless of whether these were favourable from a valuation perspective.\n\nAt the beginning of 1998, the firm had equity of $4.72 billion and had borrowed over $124.5 billion with assets of around $129 billion, for a debt-to-equity ratio of over 25 to 1. It had off-balance sheet derivative positions with a notional value of approximately $1.25 trillion, most of which were in interest rate derivatives such as interest rate swaps. The fund also invested in other derivatives such as equity options.\n\nUBS Investment \n\nUnder prevailing US tax laws, there was a different treatment of long-term capital gains, which were taxed at 20.0 percent, and income, which was taxed at 39.6 percent.  The earnings for partners in a hedge fund was taxed at the higher rate applying to income, and LTCM applied its financial engineering expertise to legally transform income into capital gains.  It did so by engaging in a transaction with UBS (Union Bank of Switzerland) that would defer foreign interest income for seven years, thereby being able to earn the more favourable capital gains treatment.  LTCM purchased a call option on 1 million of their own shares (valued then at $800 million) for a premium paid to UBS of $300 million.  This transaction was completed in three tranches: in June, August, and October 1997.  Under the terms of the deal, UBS agreed to reinvest the $300 million premium directly back into LTCM for a minimum of three years.  In order to hedge its exposure from being short the call option, UBS also purchased 1 million of LTCM shares.  Put-call parity means that being short a call and long the same amount of notional as underlying the call is equivalent to being short a put.  So the net effect of the transaction was for UBS to lend $300 million to LTCM at LIBOR+50 and to be short a put on 1 million shares.  UBS's own motivation for the trade was to be able to invest in LTCM – a possibility that was not open to investors generally – and to become closer to LTCM as a client.  LTCM quickly became the largest client of the hedge fund desk, generating $15 million in fees annually.\n\nDiminishing Opportunities and Broadening of Strategies \n\nLTCM attempted to create a splinter fund in 1996 called LTCM-X that would invest in even higher risk trades and focus on Latin American markets. LTCM turned to UBS to invest in and write the warrant for this new spin-off company.\n\nLTCM faced challenges in deploying capital as their capital base grew due to initially strong returns, and as the magnitude of anomalies in market pricing diminished over time. James Surowiecki concludes that LTCM grew such a large portion of such illiquid markets that there was no diversity in buyers in them, or no buyers at all, so the wisdom of the market did not function and it was impossible to determine a price for its assets (such as Danish bonds in September 1998).\n\nIn Q4 1997, a year in which they earned 27%, LTCM returned capital to investors.  They also broadened their strategies to include new approaches in markets outside of fixed income: many of these were not market neutral – they were not dependent on overall interest rates or stock prices going up (or down) – and they were not traditional convergence trades.  By 1998, LTCM had accumulated extremely large positions in areas such as merger arbitrage (betting on differences between a proprietary view of the likelihood of success of mergers and other corporate transactions would be completed and the implied market pricing) and S&P 500 options (net short long-term S&P volatility). LTCM had become a major supplier of S&P 500 vega, which had been in demand by companies seeking to essentially insure equities against future declines.\n\nDownturn \n\nAlthough periods of distress have often created tremendous opportunities for relative value strategies, this did not prove to be the case on this occasion, and the seeds of LTCM's demise were sown before the Russian default of 17 August 1998.  LTCM had returned $2.7 bn to investors in Q4 of 1997, although it had also raised a total in capital of $1.066bn from UBS and $133m from CSFB.  Since position sizes had not been reduced, the net effect was to raise the leverage of the fund.\n\nAlthough 1997 had been a very profitable year for LTCM (27%), the lingering effects of the 1997 Asian crisis continued to shape developments in asset markets into 1998.  Although this crisis had originated in Asia, its effects were not confined to that region.  The rise in risk aversion had raised concerns amongst investors regarding all markets heavily dependent on international capital flows, and this shaped asset pricing in markets outside Asia too.\n\nIn May and June 1998 returns from the fund were -6.42% and -10.14% respectively, reducing LTCM's capital by $461 million. This was further aggravated by the exit of Salomon Brothers from the arbitrage business in July 1998. Because the Salomon arbitrage group (where many of LTCM's strategies had first been incubated) had been a significant player in the kinds of strategies also pursued by LTCM, the liquidation of the Salomon portfolio (and its announcement itself) had the effect of depressing the prices of the securities owned by LTCM and bidding up the prices of the securities LTCM was short.  According to Michael Lewis in the New York Times article of July 1998, returns that month were circa -10%. One LTCM partner commented that because there was a clear temporary reason to explain the widening of arbitrage spreads, at the time it gave them more conviction that these trades would eventually return to fair value (as they did, but not without widening much further first).\n\nSuch losses were accentuated through the 1998 Russian financial crisis in August and September 1998, when the Russian government defaulted on its domestic local currency bonds. This came as a surprise to many investors because according to traditional economic thinking of the time, a sovereign issuer should never need to default given access to the printing press.  There was a flight to quality, bidding up the prices of the most liquid and benchmark securities that LTCM was short, and depressing the price of the less liquid securities it owned. This phenomenon occurred not merely in the US Treasury market but across the full spectrum of financial assets.  Although LTCM was diversified, the nature of its strategy implied an exposure to a latent factor risk of the price of liquidity across markets. As a consequence, when a much larger flight to liquidity occurred than had been anticipated when constructing its portfolio, its positions designed to profit from convergence to fair value incurred large losses as expensive but liquid securities became more expensive, and cheap but illiquid securities became cheaper. By the end of August, the fund had lost $1.85 billion in capital.\n\nBecause LTCM was not the only fund pursuing such a strategy, and because the proprietary trading desks of the banks also held some similar trades, the divergence from fair value was made worse as these other positions were also liquidated.  As rumours of LTCM's difficulties spread, some market participants positioned in anticipation of a forced liquidation.  Victor Haghani, a partner at LTCM, said about this time \"it was as if there was someone out there with our exact portfolio,... only it was three times as large as ours, and they were liquidating all at once.\"\n\nBecause these losses reduced the capital base of LTCM, and its ability to maintain the magnitude of its existing portfolio, LTCM was forced to liquidate a number of its positions at a highly unfavorable moment and suffer further losses. A vivid illustration of the consequences of these forced liquidations is given by Lowenstein (2000). He reports that LTCM established an arbitrage position in the dual-listed company (or \"DLC\") Royal Dutch Shell in the summer of 1997, when Royal Dutch traded at an 8%–10% premium relative to Shell. In total $2.3 billion was invested, half of which was \"long\" in Shell and the other half was \"short\" in Royal Dutch.\n\nLTCM was essentially betting that the share prices of Royal Dutch and Shell would converge because in their belief the present value of the future cashflows of the two securities should be similar.  This might have happened in the long run, but due to its losses on other positions, LTCM had to unwind its position in Royal Dutch Shell. Lowenstein reports that the premium of Royal Dutch had increased to about 22%, which implies that LTCM incurred a large loss on this arbitrage strategy. LTCM lost $286 million in equity pairs trading and more than half of this loss is accounted for by the Royal Dutch Shell trade.\n\nThe company, which had historically earned annualised compounded returns of almost 40% up to this point, experienced a flight to liquidity. In the first three weeks of September, LTCM's equity tumbled from $2.3 billion at the start of the month to just $400 million by September 25. With liabilities still over $100 billion, this translated to an effective leverage ratio of more than 250-to-1.\n\n1998 bailout \n\nLong-Term Capital Management did business with nearly everyone important on Wall Street. Indeed, much of LTCM's capital was composed of funds from the same financial professionals with whom it traded. As LTCM teetered, Wall Street feared that Long-Term's failure could cause a chain reaction in numerous markets, causing catastrophic losses throughout the financial system.\n\nAfter LTCM failed to raise more money on its own, it became clear it was running out of options. On September 23, 1998, Goldman Sachs, AIG, and Berkshire Hathaway offered then to buy out the fund's partners for $250 million, to inject $3.75 billion and to operate LTCM within Goldman's own trading division.  The offer was stunningly low to LTCM's partners because at the start of the year their firm had been worth $4.7 billion. Warren Buffett gave Meriwether less than one hour to accept the deal; the time lapsed before a deal could be worked out.\n\nSeeing no options left, the Federal Reserve Bank of New York organized a bailout of $3.625 billion by the major creditors to avoid a wider collapse in the financial markets. The principal negotiator for LTCM was general counsel James G. Rickards.Kathryn M. Welling, [http://www.docstoc.com/docs/27535620/Rickards-Interview \"Threat Finance: Capital Markets Risk Complex and Supercritical, Says Jim Rickards\"] welling@weeden (February 25, 2010). Retrieved May 13, 2011 The contributions from the various institutions were as follows:Wall Street Journal, 25 September 1998[https://www.bloomberg.com/apps/news?pid20601109&refer\nhome&sid=a2mbR8rPyzto Bloomberg.com: Exclusive]\n* $300 million: Bankers Trust, Barclays, Chase, Credit Suisse First Boston, Deutsche Bank, Goldman Sachs, Merrill Lynch, J.P.Morgan, Morgan Stanley, Salomon Smith Barney, UBS\n* $125 million: Société Générale\n* $100 million: Paribas, Credit Agricolehttp://eml.berkeley.edu/~webfac/craine/e137_f03/137lessons.pdf\n* Bear Stearns and Lehman Brothers declined to participate.\n\nIn return, the participating banks got a 90% share in the fund and a promise that a supervisory board would be established. LTCM's partners received a 10% stake, still worth about $400 million, but this money was completely consumed by their debts. The partners once had $1.9 billion of their own money invested in LTCM, all of which was wiped out.\n\nThe fear was that there would be a chain reaction as the company liquidated its securities to cover its debt, leading to a drop in prices, which would force other companies to liquidate their own debt in a vicious cycle.\n\nThe total losses were found to be $4.6 billion. The losses in the major investment categories were (ordered by magnitude):\n* $1.6 bn in swaps\n* $1.3 bn in equity volatility\n* $430 mn in Russia and other emerging markets\n* $371 mn in directional trades in developed countries\n* $286 mn in Dual-listed company pairs (such as VW, Shell)\n* $215 mn in yield curve arbitrage\n* $203 mn in S&P 500 stocks\n* $100 mn in junk bond arbitrage\n* no substantial losses in merger arbitrage\n\nLong-Term Capital was audited by Price Waterhouse LLP. After the bailout by the other investors, the panic abated, and the positions formerly held by LTCM were eventually liquidated at a small profit to the rescuers.  Although termed a bailout, the transaction effectively amounted to an orderly liquidation of the positions held by LTCM with creditor involvement and supervision by the Federal Reserve Bank.  No public money was injected or directly at risk, and the companies involved in providing support to LTCM were also those that stood to lose from its failure.  The creditors themselves did not lose money from being involved in the transaction.\n\nSome industry officials said that Federal Reserve Bank of New York involvement in the rescue, however benign, would encourage large financial institutions to assume more risk, in the belief that the Federal Reserve would intervene on their behalf in the event of trouble. Federal Reserve Bank of New York actions raised concerns among some market observers that it could create moral hazard since even though the Fed had not directly injected capital, its use of moral suasion to encourage creditor involvement emphasized its interest in supporting the financial system .[http://www.gao.gov/archive/2000/gg00067r.pdf GAO/GGD-00-67R Questions Concerning LTCM and Our Responses] General Accouting Office, February 23, 2000\n\nLTCM's strategies were compared (a contrast with the market efficiency aphorism that there are no $100 bills lying on the street, as someone else has already picked them up) to \"picking up nickels in front of a bulldozer\"—a likely small gain balanced against a small chance of a large loss, like the payouts from selling an out-of-the-money naked call option.\n\nAftermath \n\nAfter the bailout, Long-Term Capital Management continued operations. In the year following the bailout, it earned 10%. By early 2000, the fund had been liquidated, and the consortium of banks that financed the bailout had been paid back, but the collapse was devastating for many involved. Mullins, once considered a possible successor to Alan Greenspan, saw his future with the Fed dashed. The theories of Merton and Scholes took a public beating. In its annual reports, Merrill Lynch observed that mathematical risk models \"may provide a greater sense of security than warranted; therefore, reliance on these models should be limited.\"\n\nAfter helping unwind LTCM, Meriwether launched JWM Partners. Haghani, Hilibrand, Leahy, and Rosenfeld signed up as principals of the new firm. By December 1999, they had raised $250 million for a fund that would continue many of LTCM's strategies—this time, using less leverage. With the credit crisis of 2008, JWM Partners LLC was hit with a 44% loss from September 2007 to February 2009 in its Relative Value Opportunity II fund. As such, JWM Hedge Fund was shut down in July 2009.\n\nIn 1998, the chairman of Union Bank of Switzerland resigned as a result of a $780 million loss incurred from the short put option on LTCM, which had become very significantly in the money due to its collapse. Long-Term Capital Management. http://en.wikipedia.org/?curid=18673."
  }
}
