{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15068",
  "eid" : "19db7830-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778552627,
  "textBody" : "Infantry is the branch of an army that engages in military combat on foot, distinguished from cavalry, artillery, and tank forces. Also known as foot soldiers, infantry traditionally relies on moving by foot between combats as well, but may also use mounts, military vehicles, or other transport. Infantry make up a large portion of all armed forces in most nations, and typically bear the largest brunt in warfare, as measured by casualties, deprivation, or physical and psychological stress.\n\nThe first military forces in history were infantry. In antiquity, infantry were armed with an early melee weapon such as a spear, axe or sword, or an early ranged weapon like a javelin, sling, or bow, with a few infantrymen having both a melee and a ranged weapon. With the development of gunpowder, infantry began converting to primarily firearms. By the time of Napoleonic warfare, infantry, cavalry, and artillery formed a basic triad of ground forces, though infantry usually remained the most numerous. With armoured warfare, armoured fighting vehicles have replaced the horses of cavalry, and airpower has added a new dimension to ground combat, but infantry remains pivotal to all modern combined arms operations.\n\nInfantry have much greater local situational awareness than other military forces, due to their inherent intimate contact with the battlefield (\"boots on the ground\"); this is vital for taking or holding ground (any military objectives), securing battlefield victories, maintaining military area control and security both at and behind the front lines, for capturing ordnance or materiel, taking prisoners, and military occupation. Infantry can more easily recognise, adapt and respond to local conditions, weather, and changing enemy weapons or tactics. They can operate in a wide range of terrain inaccessible to military vehicles, and can operate with a lower logistical burden. Infantry are most easily deliverable forces to ground combat areas, by simple and reliable marching, or by trucks, sea or air transport; they can also be inserted directly into combat by amphibious landing, or for air assault by parachute or helicopter (\"airmobile\" or \"airborne\" infantry). They can be augmented with a variety of crew-served weapons and armored personnel carriers.\n\nEtymology and terminology \n\nIn English, use of the term infantry began about the 1570s, describing soldiers who march and fight on foot. The word derives from Middle French infanterie, from older Italian (also Spanish) infanteria (foot soldiers too inexperienced for cavalry), from Latin īnfāns (without speech, newborn, foolish), from which English also gets infant. The individual-soldier term infantryman was not coined until 1837. In modern usage, foot soldiers of any era are now considered infantry and infantrymen.\n\nFrom the mid-18th century until 1881 the British Army named its infantry as numbered regiments \"of Foot\" to distinguish them from cavalry and dragoon regiments (see List of Regiments of Foot).\n\nInfantry equipped with special weapons were often named after that weapon, such as grenadiers for their grenades, or fusiliers for their fusils.A fusil was early flintlock firearm that was safer to use around the gunpowder stores of cannons than matchlocks. These names can persist long after the weapon specialty; examples of infantry units that retained such names are the Royal Irish Fusiliers and the Grenadier Guards.\n\nMore commonly in modern times, infantry with special tactics are named for their roles, such as commandos, rangers, snipers, marines, (who all have additional training) and militia (who have reduced training); they are still infantry due to their expectation to fight as infantry when they enter combat.\n\nDragoons were created as mounted infantry, with horses for travel between battles; they were still considered infantry since they dismounted before combat. However, if light cavalry was lacking in an army, any available dragoons might be assigned their duties; this practise increased over time, and dragoons eventually received all the weapons and training as both infantry and cavalry, and could be classified as both. Conversely, starting about the mid-19th century, regular cavalry have been forced to spend more of their time dismounted in combat due to the ever-increasing effectiveness of enemy infantry firearms. Thus most cavalry transitioned to mounted infantry. As with grenadiers, the dragoon and cavalry designations can be retained long after their horses, such as in the Royal Dragoon Guards, Royal Lancers, and King's Royal Hussars.\n\nSimilarly, motorised infantry have trucks and other unarmed vehicles for non-combat movement, but are still infantry since they leave their vehicles for any combat. Most modern infantry have vehicle transport, to the point where infantry being motorised is generally assumed, and the few exceptions might be identified as modern light infantry, or \"leg infantry\" colloquially. Mechanised infantry go beyond motorised, having transport vehicles with combat abilities, armoured personnel carriers (APCs), providing at least some options for combat without leaving their vehicles. In modern infantry, some APCs have evolved to be infantry fighting vehicles (IFVs), which are transport vehicles with more substantial combat abilities, approaching those of light tanks. Some well-equipped mechanised infantry can be designated as armoured infantry.  Given that infantry forces typically also have some tanks, and given that most amoured forces have more mechanised infantry units than tank units in their organisation, the distinction between mechanised infantry and armour forces has blurred.\n\nThe terms \"infantry\", \"armour\", and \"cavalry\" used in the official names for military units like divisions, brigades, or regiments might be better understood as a description of their expected balance of defensive, offensive, and mobility roles, rather than just use of vehicles. Some modern mechanised infantry units are termed cavalry or armoured cavalry, even though they never had horses, to emphasise their combat mobility.\n\nIn the modern US Army, about 15% of soldiers are officially Infantry. The basic training for all new US Army soldiers includes use of infantry weapons and tactics, even for tank crews, artillery crews, and base and logistical personnel.\n\nHistory \n\nThe first warriors, adopting hunting weapons or improvised melee weapons, before the existence of any organised military, likely started essentially as loose groups without any organisation or formation. But this changed sometime before recorded history; the first ancient empires (2500–1500 BC) are shown to have some soldiers with standardised military equipment, and the training and discipline required for battlefield formations and manoeuvers: regular infantry.Keeley, War Before Civilization, 1996, Oxford University Press, pg.45, Fig. 3.1 Though the main force of the army, these forces were usually kept small due to their cost of training and upkeep, and might be supplemented by local short-term mass-conscript forces using the older irregular infantry weapons and tactics; this remained a common practice almost up to modern times.\n\nBefore the adoption of the chariot to create the first mobile fighting forces , all armies were pure infantry. Even after, with a few exceptions like the Mongol Empire, infantry has been the largest component of most armies in history.\n\nIn the Western world, from Classical Antiquity through the Middle Ages ( 8th century BC to 15th century AD), infantry are categorised as either heavy infantry or light infantry. Heavy infantry, such as Greek hoplites, Macedonian phalangites, and Roman legionaries, specialised in dense, solid formations driving into the main enemy lines, using weight of numbers to achieve a decisive victory, and were usually equipped with heavier weapons and armour to fit their role. Light infantry, such as Greek peltasts, Balearic slingers, and Roman velites, using open formations and greater manoeuverability, took on most other combat roles: scouting, screening the army on the march, skirmishing to delay, disrupt, or weaken the enemy to prepare for the main forces' battlefield attack, protecting them from flanking maneuvers, and then afterwards either pursuing the fleeing enemy or covering their army's retreat.\n\nAfter the fall of Rome, the quality of heavy infantry declined, and warfare was dominated by heavy cavalry, such as knights, forming small elite units for decisive shock combat, supported by peasant infantry militias and assorted light infantry from the lower classes. Towards the end of Middle Ages, this began to change, where more professional and better trained light infantry could be effective against knights, such as the English longbowmen in the Hundred Years' War. By the start of the Renaissance, the infantry began to return to dominance, with Swiss pikemen and German Landsknechts filling the role of heavy infantry again, using dense formations of pikes to drive off any cavalry.\n\nDense formations are vulnerable to ranged weapons. Technological developments allowed the raising of large numbers of light infantry units armed with ranged weapons, without the years of training expected for traditional high-skilled archers and slingers. This started slowly, first with crossbowmen, then hand cannoneers and arquebusiers, each with increasing effectiveness, marking the beginning of early modern warfare, when firearms rendered the use of heavy infantry obsolete. The introduction of musketeers using bayonets in the mid 17th century began replacement of the pike with the infantry square replacing the pike square.\n\nTo maximise their firepower, musketeer infantry were trained to fight in wide lines facing the enemy, creating line infantry. These fulfilled the central battlefield role of earlier heavy infantry, using ranged weapons instead of melee weapons. To support these lines, smaller infantry formations using dispersed skirmish lines were created, called light infantry, fulfilling the same multiple roles as earlier light infantry. Their arms were no lighter than line infantry; they were distinguished by their skirmish formation and flexible tactics.\n\nThe modern rifleman infantry became the primary force for taking and holding ground on battlefields worldwide, a vital element of combined arms combat. As firepower continued to increase, use of infantry lines diminished, until all infantry became light infantry in practice.\n\nModern classifications of infantry have expanded to reflect modern equipment and tactics, such as motorised infantry, mechanised or armoured infantry, mountain infantry, marine infantry, and airborne infantry.\n\nEquipment \n\nAn infantryman's equipment is of vital concern both for the man and the military. The needs of the infantryman to maintain fitness and effectiveness must be constantly balanced against being overburdened. While soldiers in other military branches can use their mount or vehicle for carrying equipment, and tend to operate together as crews serving their vehicle or ordnance, infantrymen must operate more independently; each infantryman usually having much more personal equipment to use and carry. This encourages searching for ingenious combinations of effective, rugged, serviceable and adaptable, yet light, compact, and handy infantry equipment.\n\nBeyond their main arms and armour, each infantryman's \"military kit\" includes combat boots, battledress or combat uniform, camping gear, heavy weather gear, survival gear, secondary weapons and ammunition, weapon service and repair kits, health and hygiene items, mess kit, rations, filled water canteen, and all other consumables each infantryman needs for the expected duration of time operating away from their unit's base, plus any special mission-specific equipment. One of the most valuable pieces of gear is the entrenching tool—basically a folding spade—which can be employed not only to dig important defenses, but also in a variety of other daily tasks, and even sometimes as a weapon. Infantry typically have shared equipment on top of this, like tents or heavy weapons, where the carrying burden is spread across several infantrymen. In all, this can reach  for each soldier on the march. Such heavy infantry burdens have changed little over centuries of warfare; in the late Roman Republic, legionaries were nicknamed Marius' mules as their main activity seemed to be carrying the weight of their legion around on their backs.Marius' reforms of the Roman army included making each man responsible for carrying his own supplies, weapons and several days' worth of ration. This made the legions less dependent on the baggage train and therefore more mobile.\n\nWhen combat is expected, infantry typically switch to \"packing light\", meaning reducing their equipment to weapons, ammo, and bare essentials, and leaving the rest with their transport, at camp or rally point, in temporary hidden caches, or even (in emergencies) discarding whatever may slow them down. Additional specialised equipment may be required, depending on the mission or to the particular terrain or environment, including satchel charges, demolition tools, mines, barbed wire, carried by the infantry or attached specialists.\n\nHistorically, infantry have suffered high casualty rates from disease, exposure, exhaustion and privation — often in excess of the casualties suffered from enemy attacks. Better infantry equipment to support their health, energy, and protect from environmental factors greatly reduces these rates of loss, and increase their level of effective action. Health, energy, and morale are greatly influenced by how the soldier is fed, so militaries often standardized field rations, starting from hardtack, to US K-rations, to modern MREs.\n\nCommunications gear has become a necessity, as it allows effective command of infantry units over greater distances, and communication with artillery and other support units. Modern infantry can have GPS, encrypted individual communications equipment, surveillance and night vision equipment, advanced intelligence and other high-tech mission-unique aids.\n\nArmies have sought to improve and standardise infantry gear to reduce fatigue for extended carrying, increase freedom of movement, accessibility, and compatibility with other carried gear, such as the US All-purpose Lightweight Individual Carrying Equipment (ALICE).\n\nWeapons \n\nInfantrymen are defined by their primary arms – the personal weapons and body armor for their own individual use. The available technology, resources, history, and society can produce quite different weapons for each military and era, but common infantry weapons can be distinguished in a few basic categories.\n\n* Ranged combat weapons: javelins, slings, blowguns, bows, crossbows, hand cannons, arquebuses, muskets, grenades, flamethrowers.\n* Close combat weapons: bludgeoning weapons like clubs, flails and maces; bladed weapons like swords, daggers, and axes; pole weapons like spears, halberds, naginata, and pikes.\n* Both ranged and close weapons: the bayonet fixed to a firearm allows infantrymen to use the same weapon for both ranged combat and close combat. This started with muskets and continued with rifles to automatic firearms. Use of the bayonet has declined with modern automatic firearms, but still generally kept as a weapon of last resort.\n\nInfantrymen often carry secondary or back-up weapons, sometimes called a sidearm or ancillary weapons in modern terminology, either issued officially as an addition to the soldier's standard arms, or acquired unofficially by any other means as an individual preference. Such weapons are used when the primary weapon is no longer effective, such it becoming damaged, running out of ammunition, malfunction, or in a change of tactical situation where another weapon is preferred, such as going from ranged to close combat. Infantry with ranged or pole weapons often carried a sword or dagger for possible hand-to-hand combat. The pilum was a javelin of the Roman legionaries threw just before drawing their primary weapon, the gladius (short sword), and closing with the enemy line.\n\nModern infantrymen now treat the bayonet as a backup weapon, but may also have handguns or pistols. They may also deploy anti-personnel mines, booby traps, incendiary or explosive devices defensively before combat.\n\nSome non-weapon equipment are designed for close combat shock effects, to get and psychological edge before melee, such as battle flags, war drums, brilliant uniforms, fierce body paint or tattoos, and even battle cries. These have become mostly only ceremonial since the decline of close combat military tactics.\n\nProtection \n\nInfantry have employed many different methods of protection from enemy attacks, including various kinds of armour and other gear, and tactical procedures.\n\nThe most basic is personal armour. This includes shields, helmets and many types of armor – padded linen, leather, lamellar, mail, plate, and kevlar. Initially, armor was used to defend both from ranged and close combat; even a fairly light shield could help defend against most slings and javelins, though high-strength bows and crossbows could penetrate most armor at very close range. Infantry armour had to compromises between protection and coverage, as a full suit of attack-proof armor would be too heavy to wear in combat.\n\nAs firearms improved, armor for ranged defense had to be thicker and stronger. With the introduction of the heavy arquebus to piece standard steel armour, it was proved easier to make heavier firearms than heavier armor; armor transitioned to be only for close combat purposes. Pikemen armour tended to be just steel helmets and breastplates, and gunners little or no armour. By the time of the musket, the dominance of firepower shifted militaries away from any close combat, and use of armour decreased, until infantry typically went without any armor.\n\nHelmets were added back during in World War I as artillery began to dominate the battlefield, to protect against their fragmentation and other blast effects beyond a direct hit. Modern developments in bullet-proof composite materials like kevlar have started a return to body armor for infantry, though the extra weight is a notable burden.\n\nIn modern times, infantrymen must also often carry protective measures against chemical and biological attack, including gas masks, counter-agents, and protective suits. All of these protective measures add to the weight an infantryman must carry, and may decrease combat efficiency. Modern militaries are struggling to balance the value of personal body protection versus the weight burden and ability to move under such weight.\n\nInfantry-served weapons \n\nEarly crew-served weapons were siege weapons, like the ballista, trebuchet, and battering ram. Modern versions include machine guns, anti-tank missiles, and infantry mortars.\n\nFormations \n\nBeginning with the development the first regular military forces, close-combat regular infantry fought less as unorganised groups of individuals and more in coordinated units, maintaining a defined tactical formation during combat, for increased battlefield effectiveness; such infantry formations and the arms they used developed together, starting with the spear and the shield.\n\nA spear has decent attack abilities with the additional advantage keeping opponents at distance; this advantage can be increased by using longer spears, but this could allow the opponent to side-step the point of the spear and close for hand-to-hand combat where the longer spear is near useless. This can be avoided when each spearman stays side-by-side with the others in close formation, each covering the ones next to him, presenting a solid wall of spears to the enemy that they cannot get around.\n\nSimilarly, a shield has decent defense abilities, but is literally hit-or-miss; an attack from an unexpected angle can bypass it completely. Larger shields can cover more, but are also heavier and less manoeuverable, making unexpected attacks even more of a problem. This can be avoided by having shield-armed soldiers stand close together, side-by-side, each protecting both themselves and their immediate comrades, presenting a solid shield wall to the enemy.\n\nThe opponents for these first formations, the close-combat infantry of more tribal societies, or any military without regular infantry (so called \"barbarians\") used arms that focused on the individual – weapons using personal strength and force, such as larger swinging swords, axes, and clubs. These take more room and individual freedom to swing and wield, necessitating a more loose organization. While this may allow for a fierce running attack (an initial shock advantage) the tighter formation of the heavy spear and shield infantry gave them a local manpower advantage where several might be able to fight each opponent.\n\nThus tight formations heightened advantages of heavy arms, and gave greater local numbers in melee. To also increase their staying power, multiple rows of heavy infantrymen were added. This also increased their shock combat effect; individual opponents saw themselves literally lined-up against several heavy infantryman each, with seemingly no chance of defeating all of them. Heavy infantry developed into huge solid block formations, up to a hundred meters wide and a dozen rows deep.\n\nMaintaining the advantages of heavy infantry meant maintaining formation; this became even more important when two forces with heavy infantry met in battle; the solidity of the formation became the deciding factor. Intense discipline and training became paramount. Empires formed around their military.\n\nOrganisation \n\nThe organization of military forces into regular military units is first noted in Egyptian records of the Battle of Kadesh (). Soldiers were grouped into units of 50, which were in turn grouped into larger units of 250, then 1000, and finally into units of up to 5000 – the largest independent command. Several of these Egyptian \"divisions\" made up an army, but operated independently, both on the march and tactically, demonstrating sufficient military command and control organisation for basic battlefield manoeuvres. Similar hierarchical organizations have been noted in other ancient armies, typically with approximately 10 to 100 to 1000 ratios (even where base 10 was not common), similar to modern sections (squads), companies, and regiments.\n\nTraining \n\nThe training of the infantry has differed drastically over time and from place to place. \nThe cost of maintaining an army in fighting order and the seasonal nature of warfare precluded large permanent armies.\nThe antiquity saw everything from the well-trained and motivated citizen armies of Greek and Rome, the tribal host assembled from farmers and hunters with only passing acquaintance with warfare and masses of lightly armed and ill-trained militia put up as a last ditch effort.\n\nIn medieval times the foot soldiers varied from peasant levies to semi-permanent companies of mercenaries, foremost among them the Swiss, English, Aragonese and German, to men-at-arms who went into battle as well-armored as knights, the latter of which at times also fought on foot.\n\nThe creation of standing armies - permanently assembled for war or defence - saw increase in training and experience. The increased use of firearms and the need for drill to handle them efficiently.\n\nThe introduction of national and mass armies saw an establishment of minimum requirements and the introduction of special troops (first of them the engineers going back to medieval times, but also different kinds of infantry adopted to specific terrain, bicycle, motorcycle, motorised and mechanised troops) culminating with the introduction of highly trained special forces during the first and second World War.\n\nCombat role \n\nAs a branch of the armed forces, the role of the infantry in warfare is to engage, fight, and kill the enemy at close range—using either a firearm (rifle, pistol, machine gun), an edged-weapon (knife, bayonet), or bare hands (close quarters combat)—as required by the mission to hand; thus\n\n* in the Australian Army and New Zealand Army the role of the infantry is \"to seek out and close with the enemy, to kill or capture him, to seize and hold ground, to repel attack, by day or night, regardless of season, weather or terrain\".[http://www.army.gov.au/stayarmy/RAINF.asp Royal Australian Corps of Infantry] at www.army.gov.au\n* in the Canadian Army, the role of the infantry is \"to close with, and destroy the enemy\".Canadian Forces Publication B-GL-392-001/FP-001 The Infantry Battalion in Battle, Volume 1Canadian Forces Publication B-GL-301-002/FP-001 The battle Group in Operations, Change 2, 1992-02-03.\n* in the U.S. Army, the \"infantry closes with the enemy, by means of fire and manoeuver, in order to destroy or capture him, or to repel his assault by fire, close combat, and counterattack\".FM7-8, Infantry Rifle Platoon and Squad\n* in the U.S. Marine Corps, the role of the infantry is to \"locate, close with, and destroy the enemy with fire and manoeuver, and to repel the enemy assault by fire and close combat\".MOS 0311\n\nBeginning with the Napoleonic Wars of the early 19th century, artillery has become an increasingly dominant force on the battlefield. Since World War I, combat aircraft and armoured vehicles have also become dominant. However, the most effective method for locating all enemy forces on a battlefield is still the infantry patrol, and it is the presence or absence of infantry that ultimately determines whether a particular piece of ground has been captured or held. In 20th and 21st century warfare, infantry functions most effectively as part of a combined arms team including artillery, armour, and combat aircraft. Studies have shown that of all casualties, 50% or more were caused by artillery; about 10% were caused by machine guns; 2–5% by rifle fire; and 1% or less by hand grenades, bayonets, knives, and unarmed combat combined. Several infantry divisions both Allied and Axis in the European theatre of WWII suffered higher than 100% combat and non combat casualties and some above 200%, meaning that the number of service personnel that became casualties was greater than the sum of the divisions' available service positions at full strength.\n\nOperations \n\nAttack operations\n\nAttack operations are the most basic role of the infantry, and along with defense, form the main stances of the infantry on the battlefield. Traditionally, in an open battle, or meeting engagement, two armies would manoeuver to contact, at which point they would form up their infantry and other units opposite each other. Then one or both would advance and attempt to defeat the enemy force. The goal of an attack remains the same: to advance into an enemy-held objective, most frequently a hill, river crossing, city or other dominant terrain feature, and dislodge the enemy, thereby establishing control of the objective.\n\nAttacks are often feared by the infantry conducting them because of the high number of casualties suffered while advancing to close with and destroy the enemy while under enemy fire. In mechanised infantry the armored personnel carrier (APC) is considered the assaulting position. These APCs can deliver infantrymen through the front lines to the battle and—in the case of infantry fighting vehicles—contribute supporting firepower to engage the enemy. Successful attacks rely on sufficient force, preparative reconnaissance and battlefield preparation with bomb assets. Retention of discipline and cohesion throughout the attack is paramount to success. A subcategory of attacks is the ambush, where infantrymen lie in wait for enemy forces before attacking at a vulnerable moment. This gives the ambushing infantrymen the combat advantage of surprise, concealment and superior firing positions, and causes confusion. The ambushed unit does not know what it is up against, or where they are attacking from.\n\nPatrol operations\n\nPatrolling is the most common infantry mission. Full-scale attacks and defensive efforts are occasional, but patrols are constant. Patrols consist of small groups of infantry moving about in areas of possible enemy activity to locate the enemy and destroy them when found. Patrols are used not only on the front-lines, but in rear areas where enemy infiltration or insurgencies are possible.\n\nPursuit operations\n\nPursuit is a role that the infantry often assumes. The objective of pursuit operations is the destruction of withdrawing enemy forces which are not capable of effectively engaging friendly units, before they can build their strength to the point where they are effective. Infantry traditionally have been the main force to overrun these units in the past, and in modern combat are used to pursue enemy forces in constricted terrain (urban areas in particular), where faster forces, such as armoured vehicles are incapable of going or would be exposed to ambush.\n\nDefense operations\n\nDefense operations are the natural counter to attacks, in which the mission is to hold an objective and defeat enemy forces attempting to dislodge the defender. Defensive posture offers many advantages to the infantry, including the ability to use terrain and constructed fortifications to advantage; these reduce exposure to enemy fire compared with advancing forces. Effective defense relies on minimizing losses to enemy fire, breaking the enemy's cohesion before their advance is completed, and preventing enemy penetration of defensive positions.\n\nEscort operations\n\nEscorting consists of protecting support units from ambush, particularly from hostile infantry forces. Combat support units (a majority of the military) are not as well armed or trained as infantry units and have a different mission. Therefore, they need the protection of the infantry, particularly when on the move. This is one of the most important roles for the modern infantry, particularly when operating alongside armored vehicles. In this capacity, infantry essentially conducts patrol on the move, scouring terrain which may hide enemy infantry waiting to ambush friendly vehicles, and identifying enemy strong points for attack by the heavier units.\n\nBase defense\n\nInfantry units are tasked to protect certain areas like command posts or airbases. Units assigned to this job usually have a large number of military police attached to them for control of checkpoints and prisons.\n\nManoeuvering operations\n\nManeouvering consumes much of an infantry unit's time. Infantry, like all combat arms units, are often manoeuvered to meet battlefield needs, and often must do so under enemy attack. The infantry must maintain their cohesion and readiness during the move to ensure their usefulness when they reach their objective. Traditionally, infantry have relied on their own legs for mobility, but mechanised or armoured infantry often uses trucks and armored vehicles for transport. These units can quickly disembark and transition to light infantry, without vehicles, to access terrain which armoured vehicles can't effectively access.\n\nReconnaissance/intelligence gathering\n\nSurveillance operations are often carried out with the employment of small recon units or sniper teams which gather information about the enemy, reporting on characteristics such as size, activity, location, unit and equipment. These infantry units typically are known for their stealth and ability to operate for periods of time within close proximity of the enemy without being detected. They may engage high-profile targets, or be employed to hunt down terrorist cells and insurgents within a given area. These units may also entice the enemy to engage a located recon unit, thus disclosing their location to be destroyed by more powerful friendly forces.\n\nMilitary reserve force\n\nSome assignments for infantry units involve deployment behind the front, although patrol and security operations are usually maintained in case of enemy infiltration. This is usually the best time for infantry units to integrate replacements into units and to maintain equipment. Additionally, soldiers can be rested and general readiness should improve. However, the unit must be ready for deployment at any point.\n\nConstruction/engineering\n\nThis can be undertaken either in reserve or on the front, but consists of using infantry troops as labor for construction of field positions, roads, bridges, airfields, and all other manner of structures. The infantry is often given this assignment because of the physical quantity of strong men within the unit, although it can lessen a unit's morale and limit the unit's ability to maintain readiness and perform other missions. More often, such jobs are given to specialist engineering corps.\n\nRaids/hostage rescue\n\nInfantry units are trained to quickly mobilise, infiltrate, enter and neutralise threat forces when appropriate combat intelligence indicates to secure a location, rescue or capture high-profile targets.\n\nUrban combat\n\nUrban combat poses unique challenges to the combat forces. It is one of the most complicated type of operations an infantry unit will undertake. With many places for the enemy to hide and ambush from, infantry units must be trained in how to enter a city, and systematically clear the buildings, which most likely will be booby trapped, in order to kill or capture enemy personnel within the city. Care must be taken to differentiate innocent civilians who often hide and support the enemy from the non-uniformed armed enemy forces. Civilian and military casualties both are usually very high.[http://www.dtic.mil/cgi-bin/GetTRDoc?AD=ADA326510 The United States Army's Preparedness to Conduct Urban Combat: A Strategic Priority, pp. 2–3]\n\nDay to day service \n\nBecause of an infantryman's duties with firearms, explosives, physical and emotional stress, and physical violence, casualties and deaths are not uncommon in both war and in peacetime training or operations. It is a highly dangerous and demanding combat service; in World War II, military doctors concluded that even physically unwounded soldiers were psychologically worn out after about 200 days of combat.\n\nThe physical, mental, and environmental operating demands of the infantryman are high. All of the combat necessities such as ammunition, weapon systems, food, water, clothing, and shelter are carried on the backs of the infantrymen, at least in light role as opposed to mounted/mechanised. Combat loads of over 36 kg (80 lbs) are standard, and greater loads in excess of 45 kg (100 lbs) are very common. These heavy loads, combined with long foot patrols of over 40 km a day, in any climate from 43 to in temperature, require the infantryman to be in good physical and mental condition. Infantrymen live, fight and die outdoors in all types of brutal climates, often with no physical shelter. Poor climate conditions adds misery to this already demanding existence. Disease epidemics, frostbite, heat stroke, trench foot, insect and wild animal bites are common along with stress disorders and these have sometimes caused more casualties than enemy action.\n\nInfantrymen are expected to continue with their combat missions despite the death and injury of friends, fear, despair, fatigue, and bodily injury.\n\nSome infantry units are considered Special Forces. The earliest Special Forces commando units were more highly trained infantrymen, with special weapons, equipment, and missions. Special Forces units recruit heavily from regular infantry units to fill their ranks.\n\nForeign and domestic militaries typically have a slang term for their infantrymen. In the U.S. military, the slang term among both Marine and Army infantrymen for themselves is \"grunt.\" In the British Army, they are the \"squaddies.\" The infantry is a small close-knit community, and the slang names are terms of endearment that convey mutual respect and shared experiences.\n\nAir force and naval infantry \n\nNaval infantry, commonly known as marines, are primarily a category of infantry that form part of the naval forces of states and perform roles on land and at sea, including amphibious operations, as well as other, naval roles. They also perform other tasks, including land warfare, separate from naval operations.\n\nAir force infantry and base defence forces, such as the Royal Air Force Regiment, Royal Australian Air Force Airfield Defence Guards, United States Air Force Security Forces and Indonesian Air Force Paskhas Corps, are used primarily for ground-based defence of air bases and other air force facilities. They also have a number of other, specialist roles. These include, among others, Chemical, Biological, Radiological and Nuclear (CBRN) defence and training other airmen in basic ground defence tactics.\n\nDescriptions of infantry \n\n* \"Ah, yes, mere infantry—poor beggars. ...\" — Plautus, Roman playwrightp. 156, Heinl\n* \"Let us be clear about three facts: First, all battles and all wars are won, in the end, by the infantryman. Secondly, the infantryman always bears the brunt; his casualties are heavier, he suffers greater extremes of discomfort and fatigue than the other [combat] arms. Thirdly, the art of the infantryman is less stereotyped, and far harder to acquire in modern war, than that of any other arm.\" — Field Marshal Earl Wavell (1945)[http://regimentalrogue.com/misc/in_praise_of_infantry.htm In Praise of Infantry], by Field Marshal Archibald Wavell, 1st Earl Wavell, The Times, Thursday, 19 April 1945\n* \"I love the infantry, because they are the underdogs. They are the mud-rain-frost-and-wind boys. They have no comforts, and they even learn to live without the necessities; and, in the end, they are the guys that wars can't be won without.\" — Ernie Pylep. 257, Tobin\n* \"I’m convinced that the infantry is the group in the army which gives more, and gets less, than anybody else.\" — Up Front (1945), by Bill Mauldinp. 5, Mauldin & Ambrose\n* \"Never think that war, no matter how necessary, nor how justified, is not a crime. Ask the infantry, and ask the dead.\" — Ernest Hemingwayp. 262, Trogdon\n* \"One might as well try to charge through a wall\". — Napoleon - on St Helena (regarding the British infantry)\n* \"The infantry doesn't change. We're the only arm [of the army] where the weapon is the man, himself.\" —C.T. ShortisThe New York Times, Shortis\n* \"The army's infantry is its most essential component. Even today, no army can take and hold any ground without the use of infantry.\" — George Nafzigerp. 13, Nafziger\n* \"There is no beating these [British and Spanish] troops, in spite of their generals. I always thought they were bad soldiers, now I am sure of it. I had turned their right, pierced their centre, and, everywhere, victory was mine — but they did not know how to run!\" — Field Marshal Jean de Dieu Soult, Battle of Albuera (16 May 1811), the Peninsular War (1808–14)\n* \"Americans in 1950 rediscovered something that since Hiroshima they had forgotten: you may fly over a land forever; you may bomb it, atomize it, pulverize it and wipe it clean of life – but if you desire to defend it, protect it, and keep it for civilization, you must do this on the ground, the way the Roman legions did, by putting your young men into the mud.\" — military historian T.R. Fehrenbach",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Infantry" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15068" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Infantry is the branch of an army that engages in military combat on foot, distinguished from cavalry, artillery, and tank forces. Also known as foot soldiers, infantry traditionally relies on moving by foot between combats as well, but may also use mounts, military vehicles, or other transport. Infantry make up a large portion of all armed forces in most nations, and typically bear the largest brunt in warfare, as measured by casualties, deprivation, or physical and psychological stress.\n\nThe first military forces in history were infantry. In antiquity, infantry were armed with an early melee weapon such as a spear, axe or sword, or an early ranged weapon like a javelin, sling, or bow, with a few infantrymen having both a melee and a ranged weapon. With the development of gunpowder, infantry began converting to primarily firearms. By the time of Napoleonic warfare, infantry, cavalry, and artillery formed a basic triad of ground forces, though infantry usually remained the most numerous. With armoured warfare, armoured fighting vehicles have replaced the horses of cavalry, and airpower has added a new dimension to ground combat, but infantry remains pivotal to all modern combined arms operations.\n\nInfantry have much greater local situational awareness than other military forces, due to their inherent intimate contact with the battlefield (\"boots on the ground\"); this is vital for taking or holding ground (any military objectives), securing battlefield victories, maintaining military area control and security both at and behind the front lines, for capturing ordnance or materiel, taking prisoners, and military occupation. Infantry can more easily recognise, adapt and respond to local conditions, weather, and changing enemy weapons or tactics. They can operate in a wide range of terrain inaccessible to military vehicles, and can operate with a lower logistical burden. Infantry are most easily deliverable forces to ground combat areas, by simple and reliable marching, or by trucks, sea or air transport; they can also be inserted directly into combat by amphibious landing, or for air assault by parachute or helicopter (\"airmobile\" or \"airborne\" infantry). They can be augmented with a variety of crew-served weapons and armored personnel carriers.\n\nEtymology and terminology \n\nIn English, use of the term infantry began about the 1570s, describing soldiers who march and fight on foot. The word derives from Middle French infanterie, from older Italian (also Spanish) infanteria (foot soldiers too inexperienced for cavalry), from Latin īnfāns (without speech, newborn, foolish), from which English also gets infant. The individual-soldier term infantryman was not coined until 1837. In modern usage, foot soldiers of any era are now considered infantry and infantrymen.\n\nFrom the mid-18th century until 1881 the British Army named its infantry as numbered regiments \"of Foot\" to distinguish them from cavalry and dragoon regiments (see List of Regiments of Foot).\n\nInfantry equipped with special weapons were often named after that weapon, such as grenadiers for their grenades, or fusiliers for their fusils.A fusil was early flintlock firearm that was safer to use around the gunpowder stores of cannons than matchlocks. These names can persist long after the weapon specialty; examples of infantry units that retained such names are the Royal Irish Fusiliers and the Grenadier Guards.\n\nMore commonly in modern times, infantry with special tactics are named for their roles, such as commandos, rangers, snipers, marines, (who all have additional training) and militia (who have reduced training); they are still infantry due to their expectation to fight as infantry when they enter combat.\n\nDragoons were created as mounted infantry, with horses for travel between battles; they were still considered infantry since they dismounted before combat. However, if light cavalry was lacking in an army, any available dragoons might be assigned their duties; this practise increased over time, and dragoons eventually received all the weapons and training as both infantry and cavalry, and could be classified as both. Conversely, starting about the mid-19th century, regular cavalry have been forced to spend more of their time dismounted in combat due to the ever-increasing effectiveness of enemy infantry firearms. Thus most cavalry transitioned to mounted infantry. As with grenadiers, the dragoon and cavalry designations can be retained long after their horses, such as in the Royal Dragoon Guards, Royal Lancers, and King's Royal Hussars.\n\nSimilarly, motorised infantry have trucks and other unarmed vehicles for non-combat movement, but are still infantry since they leave their vehicles for any combat. Most modern infantry have vehicle transport, to the point where infantry being motorised is generally assumed, and the few exceptions might be identified as modern light infantry, or \"leg infantry\" colloquially. Mechanised infantry go beyond motorised, having transport vehicles with combat abilities, armoured personnel carriers (APCs), providing at least some options for combat without leaving their vehicles. In modern infantry, some APCs have evolved to be infantry fighting vehicles (IFVs), which are transport vehicles with more substantial combat abilities, approaching those of light tanks. Some well-equipped mechanised infantry can be designated as armoured infantry.  Given that infantry forces typically also have some tanks, and given that most amoured forces have more mechanised infantry units than tank units in their organisation, the distinction between mechanised infantry and armour forces has blurred.\n\nThe terms \"infantry\", \"armour\", and \"cavalry\" used in the official names for military units like divisions, brigades, or regiments might be better understood as a description of their expected balance of defensive, offensive, and mobility roles, rather than just use of vehicles. Some modern mechanised infantry units are termed cavalry or armoured cavalry, even though they never had horses, to emphasise their combat mobility.\n\nIn the modern US Army, about 15% of soldiers are officially Infantry. The basic training for all new US Army soldiers includes use of infantry weapons and tactics, even for tank crews, artillery crews, and base and logistical personnel.\n\nHistory \n\nThe first warriors, adopting hunting weapons or improvised melee weapons, before the existence of any organised military, likely started essentially as loose groups without any organisation or formation. But this changed sometime before recorded history; the first ancient empires (2500–1500 BC) are shown to have some soldiers with standardised military equipment, and the training and discipline required for battlefield formations and manoeuvers: regular infantry.Keeley, War Before Civilization, 1996, Oxford University Press, pg.45, Fig. 3.1 Though the main force of the army, these forces were usually kept small due to their cost of training and upkeep, and might be supplemented by local short-term mass-conscript forces using the older irregular infantry weapons and tactics; this remained a common practice almost up to modern times.\n\nBefore the adoption of the chariot to create the first mobile fighting forces , all armies were pure infantry. Even after, with a few exceptions like the Mongol Empire, infantry has been the largest component of most armies in history.\n\nIn the Western world, from Classical Antiquity through the Middle Ages ( 8th century BC to 15th century AD), infantry are categorised as either heavy infantry or light infantry. Heavy infantry, such as Greek hoplites, Macedonian phalangites, and Roman legionaries, specialised in dense, solid formations driving into the main enemy lines, using weight of numbers to achieve a decisive victory, and were usually equipped with heavier weapons and armour to fit their role. Light infantry, such as Greek peltasts, Balearic slingers, and Roman velites, using open formations and greater manoeuverability, took on most other combat roles: scouting, screening the army on the march, skirmishing to delay, disrupt, or weaken the enemy to prepare for the main forces' battlefield attack, protecting them from flanking maneuvers, and then afterwards either pursuing the fleeing enemy or covering their army's retreat.\n\nAfter the fall of Rome, the quality of heavy infantry declined, and warfare was dominated by heavy cavalry, such as knights, forming small elite units for decisive shock combat, supported by peasant infantry militias and assorted light infantry from the lower classes. Towards the end of Middle Ages, this began to change, where more professional and better trained light infantry could be effective against knights, such as the English longbowmen in the Hundred Years' War. By the start of the Renaissance, the infantry began to return to dominance, with Swiss pikemen and German Landsknechts filling the role of heavy infantry again, using dense formations of pikes to drive off any cavalry.\n\nDense formations are vulnerable to ranged weapons. Technological developments allowed the raising of large numbers of light infantry units armed with ranged weapons, without the years of training expected for traditional high-skilled archers and slingers. This started slowly, first with crossbowmen, then hand cannoneers and arquebusiers, each with increasing effectiveness, marking the beginning of early modern warfare, when firearms rendered the use of heavy infantry obsolete. The introduction of musketeers using bayonets in the mid 17th century began replacement of the pike with the infantry square replacing the pike square.\n\nTo maximise their firepower, musketeer infantry were trained to fight in wide lines facing the enemy, creating line infantry. These fulfilled the central battlefield role of earlier heavy infantry, using ranged weapons instead of melee weapons. To support these lines, smaller infantry formations using dispersed skirmish lines were created, called light infantry, fulfilling the same multiple roles as earlier light infantry. Their arms were no lighter than line infantry; they were distinguished by their skirmish formation and flexible tactics.\n\nThe modern rifleman infantry became the primary force for taking and holding ground on battlefields worldwide, a vital element of combined arms combat. As firepower continued to increase, use of infantry lines diminished, until all infantry became light infantry in practice.\n\nModern classifications of infantry have expanded to reflect modern equipment and tactics, such as motorised infantry, mechanised or armoured infantry, mountain infantry, marine infantry, and airborne infantry.\n\nEquipment \n\nAn infantryman's equipment is of vital concern both for the man and the military. The needs of the infantryman to maintain fitness and effectiveness must be constantly balanced against being overburdened. While soldiers in other military branches can use their mount or vehicle for carrying equipment, and tend to operate together as crews serving their vehicle or ordnance, infantrymen must operate more independently; each infantryman usually having much more personal equipment to use and carry. This encourages searching for ingenious combinations of effective, rugged, serviceable and adaptable, yet light, compact, and handy infantry equipment.\n\nBeyond their main arms and armour, each infantryman's \"military kit\" includes combat boots, battledress or combat uniform, camping gear, heavy weather gear, survival gear, secondary weapons and ammunition, weapon service and repair kits, health and hygiene items, mess kit, rations, filled water canteen, and all other consumables each infantryman needs for the expected duration of time operating away from their unit's base, plus any special mission-specific equipment. One of the most valuable pieces of gear is the entrenching tool—basically a folding spade—which can be employed not only to dig important defenses, but also in a variety of other daily tasks, and even sometimes as a weapon. Infantry typically have shared equipment on top of this, like tents or heavy weapons, where the carrying burden is spread across several infantrymen. In all, this can reach  for each soldier on the march. Such heavy infantry burdens have changed little over centuries of warfare; in the late Roman Republic, legionaries were nicknamed Marius' mules as their main activity seemed to be carrying the weight of their legion around on their backs.Marius' reforms of the Roman army included making each man responsible for carrying his own supplies, weapons and several days' worth of ration. This made the legions less dependent on the baggage train and therefore more mobile.\n\nWhen combat is expected, infantry typically switch to \"packing light\", meaning reducing their equipment to weapons, ammo, and bare essentials, and leaving the rest with their transport, at camp or rally point, in temporary hidden caches, or even (in emergencies) discarding whatever may slow them down. Additional specialised equipment may be required, depending on the mission or to the particular terrain or environment, including satchel charges, demolition tools, mines, barbed wire, carried by the infantry or attached specialists.\n\nHistorically, infantry have suffered high casualty rates from disease, exposure, exhaustion and privation — often in excess of the casualties suffered from enemy attacks. Better infantry equipment to support their health, energy, and protect from environmental factors greatly reduces these rates of loss, and increase their level of effective action. Health, energy, and morale are greatly influenced by how the soldier is fed, so militaries often standardized field rations, starting from hardtack, to US K-rations, to modern MREs.\n\nCommunications gear has become a necessity, as it allows effective command of infantry units over greater distances, and communication with artillery and other support units. Modern infantry can have GPS, encrypted individual communications equipment, surveillance and night vision equipment, advanced intelligence and other high-tech mission-unique aids.\n\nArmies have sought to improve and standardise infantry gear to reduce fatigue for extended carrying, increase freedom of movement, accessibility, and compatibility with other carried gear, such as the US All-purpose Lightweight Individual Carrying Equipment (ALICE).\n\nWeapons \n\nInfantrymen are defined by their primary arms – the personal weapons and body armor for their own individual use. The available technology, resources, history, and society can produce quite different weapons for each military and era, but common infantry weapons can be distinguished in a few basic categories.\n\n* Ranged combat weapons: javelins, slings, blowguns, bows, crossbows, hand cannons, arquebuses, muskets, grenades, flamethrowers.\n* Close combat weapons: bludgeoning weapons like clubs, flails and maces; bladed weapons like swords, daggers, and axes; pole weapons like spears, halberds, naginata, and pikes.\n* Both ranged and close weapons: the bayonet fixed to a firearm allows infantrymen to use the same weapon for both ranged combat and close combat. This started with muskets and continued with rifles to automatic firearms. Use of the bayonet has declined with modern automatic firearms, but still generally kept as a weapon of last resort.\n\nInfantrymen often carry secondary or back-up weapons, sometimes called a sidearm or ancillary weapons in modern terminology, either issued officially as an addition to the soldier's standard arms, or acquired unofficially by any other means as an individual preference. Such weapons are used when the primary weapon is no longer effective, such it becoming damaged, running out of ammunition, malfunction, or in a change of tactical situation where another weapon is preferred, such as going from ranged to close combat. Infantry with ranged or pole weapons often carried a sword or dagger for possible hand-to-hand combat. The pilum was a javelin of the Roman legionaries threw just before drawing their primary weapon, the gladius (short sword), and closing with the enemy line.\n\nModern infantrymen now treat the bayonet as a backup weapon, but may also have handguns or pistols. They may also deploy anti-personnel mines, booby traps, incendiary or explosive devices defensively before combat.\n\nSome non-weapon equipment are designed for close combat shock effects, to get and psychological edge before melee, such as battle flags, war drums, brilliant uniforms, fierce body paint or tattoos, and even battle cries. These have become mostly only ceremonial since the decline of close combat military tactics.\n\nProtection \n\nInfantry have employed many different methods of protection from enemy attacks, including various kinds of armour and other gear, and tactical procedures.\n\nThe most basic is personal armour. This includes shields, helmets and many types of armor – padded linen, leather, lamellar, mail, plate, and kevlar. Initially, armor was used to defend both from ranged and close combat; even a fairly light shield could help defend against most slings and javelins, though high-strength bows and crossbows could penetrate most armor at very close range. Infantry armour had to compromises between protection and coverage, as a full suit of attack-proof armor would be too heavy to wear in combat.\n\nAs firearms improved, armor for ranged defense had to be thicker and stronger. With the introduction of the heavy arquebus to piece standard steel armour, it was proved easier to make heavier firearms than heavier armor; armor transitioned to be only for close combat purposes. Pikemen armour tended to be just steel helmets and breastplates, and gunners little or no armour. By the time of the musket, the dominance of firepower shifted militaries away from any close combat, and use of armour decreased, until infantry typically went without any armor.\n\nHelmets were added back during in World War I as artillery began to dominate the battlefield, to protect against their fragmentation and other blast effects beyond a direct hit. Modern developments in bullet-proof composite materials like kevlar have started a return to body armor for infantry, though the extra weight is a notable burden.\n\nIn modern times, infantrymen must also often carry protective measures against chemical and biological attack, including gas masks, counter-agents, and protective suits. All of these protective measures add to the weight an infantryman must carry, and may decrease combat efficiency. Modern militaries are struggling to balance the value of personal body protection versus the weight burden and ability to move under such weight.\n\nInfantry-served weapons \n\nEarly crew-served weapons were siege weapons, like the ballista, trebuchet, and battering ram. Modern versions include machine guns, anti-tank missiles, and infantry mortars.\n\nFormations \n\nBeginning with the development the first regular military forces, close-combat regular infantry fought less as unorganised groups of individuals and more in coordinated units, maintaining a defined tactical formation during combat, for increased battlefield effectiveness; such infantry formations and the arms they used developed together, starting with the spear and the shield.\n\nA spear has decent attack abilities with the additional advantage keeping opponents at distance; this advantage can be increased by using longer spears, but this could allow the opponent to side-step the point of the spear and close for hand-to-hand combat where the longer spear is near useless. This can be avoided when each spearman stays side-by-side with the others in close formation, each covering the ones next to him, presenting a solid wall of spears to the enemy that they cannot get around.\n\nSimilarly, a shield has decent defense abilities, but is literally hit-or-miss; an attack from an unexpected angle can bypass it completely. Larger shields can cover more, but are also heavier and less manoeuverable, making unexpected attacks even more of a problem. This can be avoided by having shield-armed soldiers stand close together, side-by-side, each protecting both themselves and their immediate comrades, presenting a solid shield wall to the enemy.\n\nThe opponents for these first formations, the close-combat infantry of more tribal societies, or any military without regular infantry (so called \"barbarians\") used arms that focused on the individual – weapons using personal strength and force, such as larger swinging swords, axes, and clubs. These take more room and individual freedom to swing and wield, necessitating a more loose organization. While this may allow for a fierce running attack (an initial shock advantage) the tighter formation of the heavy spear and shield infantry gave them a local manpower advantage where several might be able to fight each opponent.\n\nThus tight formations heightened advantages of heavy arms, and gave greater local numbers in melee. To also increase their staying power, multiple rows of heavy infantrymen were added. This also increased their shock combat effect; individual opponents saw themselves literally lined-up against several heavy infantryman each, with seemingly no chance of defeating all of them. Heavy infantry developed into huge solid block formations, up to a hundred meters wide and a dozen rows deep.\n\nMaintaining the advantages of heavy infantry meant maintaining formation; this became even more important when two forces with heavy infantry met in battle; the solidity of the formation became the deciding factor. Intense discipline and training became paramount. Empires formed around their military.\n\nOrganisation \n\nThe organization of military forces into regular military units is first noted in Egyptian records of the Battle of Kadesh (). Soldiers were grouped into units of 50, which were in turn grouped into larger units of 250, then 1000, and finally into units of up to 5000 – the largest independent command. Several of these Egyptian \"divisions\" made up an army, but operated independently, both on the march and tactically, demonstrating sufficient military command and control organisation for basic battlefield manoeuvres. Similar hierarchical organizations have been noted in other ancient armies, typically with approximately 10 to 100 to 1000 ratios (even where base 10 was not common), similar to modern sections (squads), companies, and regiments.\n\nTraining \n\nThe training of the infantry has differed drastically over time and from place to place. \nThe cost of maintaining an army in fighting order and the seasonal nature of warfare precluded large permanent armies.\nThe antiquity saw everything from the well-trained and motivated citizen armies of Greek and Rome, the tribal host assembled from farmers and hunters with only passing acquaintance with warfare and masses of lightly armed and ill-trained militia put up as a last ditch effort.\n\nIn medieval times the foot soldiers varied from peasant levies to semi-permanent companies of mercenaries, foremost among them the Swiss, English, Aragonese and German, to men-at-arms who went into battle as well-armored as knights, the latter of which at times also fought on foot.\n\nThe creation of standing armies - permanently assembled for war or defence - saw increase in training and experience. The increased use of firearms and the need for drill to handle them efficiently.\n\nThe introduction of national and mass armies saw an establishment of minimum requirements and the introduction of special troops (first of them the engineers going back to medieval times, but also different kinds of infantry adopted to specific terrain, bicycle, motorcycle, motorised and mechanised troops) culminating with the introduction of highly trained special forces during the first and second World War.\n\nCombat role \n\nAs a branch of the armed forces, the role of the infantry in warfare is to engage, fight, and kill the enemy at close range—using either a firearm (rifle, pistol, machine gun), an edged-weapon (knife, bayonet), or bare hands (close quarters combat)—as required by the mission to hand; thus\n\n* in the Australian Army and New Zealand Army the role of the infantry is \"to seek out and close with the enemy, to kill or capture him, to seize and hold ground, to repel attack, by day or night, regardless of season, weather or terrain\".[http://www.army.gov.au/stayarmy/RAINF.asp Royal Australian Corps of Infantry] at www.army.gov.au\n* in the Canadian Army, the role of the infantry is \"to close with, and destroy the enemy\".Canadian Forces Publication B-GL-392-001/FP-001 The Infantry Battalion in Battle, Volume 1Canadian Forces Publication B-GL-301-002/FP-001 The battle Group in Operations, Change 2, 1992-02-03.\n* in the U.S. Army, the \"infantry closes with the enemy, by means of fire and manoeuver, in order to destroy or capture him, or to repel his assault by fire, close combat, and counterattack\".FM7-8, Infantry Rifle Platoon and Squad\n* in the U.S. Marine Corps, the role of the infantry is to \"locate, close with, and destroy the enemy with fire and manoeuver, and to repel the enemy assault by fire and close combat\".MOS 0311\n\nBeginning with the Napoleonic Wars of the early 19th century, artillery has become an increasingly dominant force on the battlefield. Since World War I, combat aircraft and armoured vehicles have also become dominant. However, the most effective method for locating all enemy forces on a battlefield is still the infantry patrol, and it is the presence or absence of infantry that ultimately determines whether a particular piece of ground has been captured or held. In 20th and 21st century warfare, infantry functions most effectively as part of a combined arms team including artillery, armour, and combat aircraft. Studies have shown that of all casualties, 50% or more were caused by artillery; about 10% were caused by machine guns; 2–5% by rifle fire; and 1% or less by hand grenades, bayonets, knives, and unarmed combat combined. Several infantry divisions both Allied and Axis in the European theatre of WWII suffered higher than 100% combat and non combat casualties and some above 200%, meaning that the number of service personnel that became casualties was greater than the sum of the divisions' available service positions at full strength.\n\nOperations \n\nAttack operations\n\nAttack operations are the most basic role of the infantry, and along with defense, form the main stances of the infantry on the battlefield. Traditionally, in an open battle, or meeting engagement, two armies would manoeuver to contact, at which point they would form up their infantry and other units opposite each other. Then one or both would advance and attempt to defeat the enemy force. The goal of an attack remains the same: to advance into an enemy-held objective, most frequently a hill, river crossing, city or other dominant terrain feature, and dislodge the enemy, thereby establishing control of the objective.\n\nAttacks are often feared by the infantry conducting them because of the high number of casualties suffered while advancing to close with and destroy the enemy while under enemy fire. In mechanised infantry the armored personnel carrier (APC) is considered the assaulting position. These APCs can deliver infantrymen through the front lines to the battle and—in the case of infantry fighting vehicles—contribute supporting firepower to engage the enemy. Successful attacks rely on sufficient force, preparative reconnaissance and battlefield preparation with bomb assets. Retention of discipline and cohesion throughout the attack is paramount to success. A subcategory of attacks is the ambush, where infantrymen lie in wait for enemy forces before attacking at a vulnerable moment. This gives the ambushing infantrymen the combat advantage of surprise, concealment and superior firing positions, and causes confusion. The ambushed unit does not know what it is up against, or where they are attacking from.\n\nPatrol operations\n\nPatrolling is the most common infantry mission. Full-scale attacks and defensive efforts are occasional, but patrols are constant. Patrols consist of small groups of infantry moving about in areas of possible enemy activity to locate the enemy and destroy them when found. Patrols are used not only on the front-lines, but in rear areas where enemy infiltration or insurgencies are possible.\n\nPursuit operations\n\nPursuit is a role that the infantry often assumes. The objective of pursuit operations is the destruction of withdrawing enemy forces which are not capable of effectively engaging friendly units, before they can build their strength to the point where they are effective. Infantry traditionally have been the main force to overrun these units in the past, and in modern combat are used to pursue enemy forces in constricted terrain (urban areas in particular), where faster forces, such as armoured vehicles are incapable of going or would be exposed to ambush.\n\nDefense operations\n\nDefense operations are the natural counter to attacks, in which the mission is to hold an objective and defeat enemy forces attempting to dislodge the defender. Defensive posture offers many advantages to the infantry, including the ability to use terrain and constructed fortifications to advantage; these reduce exposure to enemy fire compared with advancing forces. Effective defense relies on minimizing losses to enemy fire, breaking the enemy's cohesion before their advance is completed, and preventing enemy penetration of defensive positions.\n\nEscort operations\n\nEscorting consists of protecting support units from ambush, particularly from hostile infantry forces. Combat support units (a majority of the military) are not as well armed or trained as infantry units and have a different mission. Therefore, they need the protection of the infantry, particularly when on the move. This is one of the most important roles for the modern infantry, particularly when operating alongside armored vehicles. In this capacity, infantry essentially conducts patrol on the move, scouring terrain which may hide enemy infantry waiting to ambush friendly vehicles, and identifying enemy strong points for attack by the heavier units.\n\nBase defense\n\nInfantry units are tasked to protect certain areas like command posts or airbases. Units assigned to this job usually have a large number of military police attached to them for control of checkpoints and prisons.\n\nManoeuvering operations\n\nManeouvering consumes much of an infantry unit's time. Infantry, like all combat arms units, are often manoeuvered to meet battlefield needs, and often must do so under enemy attack. The infantry must maintain their cohesion and readiness during the move to ensure their usefulness when they reach their objective. Traditionally, infantry have relied on their own legs for mobility, but mechanised or armoured infantry often uses trucks and armored vehicles for transport. These units can quickly disembark and transition to light infantry, without vehicles, to access terrain which armoured vehicles can't effectively access.\n\nReconnaissance/intelligence gathering\n\nSurveillance operations are often carried out with the employment of small recon units or sniper teams which gather information about the enemy, reporting on characteristics such as size, activity, location, unit and equipment. These infantry units typically are known for their stealth and ability to operate for periods of time within close proximity of the enemy without being detected. They may engage high-profile targets, or be employed to hunt down terrorist cells and insurgents within a given area. These units may also entice the enemy to engage a located recon unit, thus disclosing their location to be destroyed by more powerful friendly forces.\n\nMilitary reserve force\n\nSome assignments for infantry units involve deployment behind the front, although patrol and security operations are usually maintained in case of enemy infiltration. This is usually the best time for infantry units to integrate replacements into units and to maintain equipment. Additionally, soldiers can be rested and general readiness should improve. However, the unit must be ready for deployment at any point.\n\nConstruction/engineering\n\nThis can be undertaken either in reserve or on the front, but consists of using infantry troops as labor for construction of field positions, roads, bridges, airfields, and all other manner of structures. The infantry is often given this assignment because of the physical quantity of strong men within the unit, although it can lessen a unit's morale and limit the unit's ability to maintain readiness and perform other missions. More often, such jobs are given to specialist engineering corps.\n\nRaids/hostage rescue\n\nInfantry units are trained to quickly mobilise, infiltrate, enter and neutralise threat forces when appropriate combat intelligence indicates to secure a location, rescue or capture high-profile targets.\n\nUrban combat\n\nUrban combat poses unique challenges to the combat forces. It is one of the most complicated type of operations an infantry unit will undertake. With many places for the enemy to hide and ambush from, infantry units must be trained in how to enter a city, and systematically clear the buildings, which most likely will be booby trapped, in order to kill or capture enemy personnel within the city. Care must be taken to differentiate innocent civilians who often hide and support the enemy from the non-uniformed armed enemy forces. Civilian and military casualties both are usually very high.[http://www.dtic.mil/cgi-bin/GetTRDoc?AD=ADA326510 The United States Army's Preparedness to Conduct Urban Combat: A Strategic Priority, pp. 2–3]\n\nDay to day service \n\nBecause of an infantryman's duties with firearms, explosives, physical and emotional stress, and physical violence, casualties and deaths are not uncommon in both war and in peacetime training or operations. It is a highly dangerous and demanding combat service; in World War II, military doctors concluded that even physically unwounded soldiers were psychologically worn out after about 200 days of combat.\n\nThe physical, mental, and environmental operating demands of the infantryman are high. All of the combat necessities such as ammunition, weapon systems, food, water, clothing, and shelter are carried on the backs of the infantrymen, at least in light role as opposed to mounted/mechanised. Combat loads of over 36 kg (80 lbs) are standard, and greater loads in excess of 45 kg (100 lbs) are very common. These heavy loads, combined with long foot patrols of over 40 km a day, in any climate from 43 to in temperature, require the infantryman to be in good physical and mental condition. Infantrymen live, fight and die outdoors in all types of brutal climates, often with no physical shelter. Poor climate conditions adds misery to this already demanding existence. Disease epidemics, frostbite, heat stroke, trench foot, insect and wild animal bites are common along with stress disorders and these have sometimes caused more casualties than enemy action.\n\nInfantrymen are expected to continue with their combat missions despite the death and injury of friends, fear, despair, fatigue, and bodily injury.\n\nSome infantry units are considered Special Forces. The earliest Special Forces commando units were more highly trained infantrymen, with special weapons, equipment, and missions. Special Forces units recruit heavily from regular infantry units to fill their ranks.\n\nForeign and domestic militaries typically have a slang term for their infantrymen. In the U.S. military, the slang term among both Marine and Army infantrymen for themselves is \"grunt.\" In the British Army, they are the \"squaddies.\" The infantry is a small close-knit community, and the slang names are terms of endearment that convey mutual respect and shared experiences.\n\nAir force and naval infantry \n\nNaval infantry, commonly known as marines, are primarily a category of infantry that form part of the naval forces of states and perform roles on land and at sea, including amphibious operations, as well as other, naval roles. They also perform other tasks, including land warfare, separate from naval operations.\n\nAir force infantry and base defence forces, such as the Royal Air Force Regiment, Royal Australian Air Force Airfield Defence Guards, United States Air Force Security Forces and Indonesian Air Force Paskhas Corps, are used primarily for ground-based defence of air bases and other air force facilities. They also have a number of other, specialist roles. These include, among others, Chemical, Biological, Radiological and Nuclear (CBRN) defence and training other airmen in basic ground defence tactics.\n\nDescriptions of infantry \n\n* \"Ah, yes, mere infantry—poor beggars. ...\" — Plautus, Roman playwrightp. 156, Heinl\n* \"Let us be clear about three facts: First, all battles and all wars are won, in the end, by the infantryman. Secondly, the infantryman always bears the brunt; his casualties are heavier, he suffers greater extremes of discomfort and fatigue than the other [combat] arms. Thirdly, the art of the infantryman is less stereotyped, and far harder to acquire in modern war, than that of any other arm.\" — Field Marshal Earl Wavell (1945)[http://regimentalrogue.com/misc/in_praise_of_infantry.htm In Praise of Infantry], by Field Marshal Archibald Wavell, 1st Earl Wavell, The Times, Thursday, 19 April 1945\n* \"I love the infantry, because they are the underdogs. They are the mud-rain-frost-and-wind boys. They have no comforts, and they even learn to live without the necessities; and, in the end, they are the guys that wars can't be won without.\" — Ernie Pylep. 257, Tobin\n* \"I’m convinced that the infantry is the group in the army which gives more, and gets less, than anybody else.\" — Up Front (1945), by Bill Mauldinp. 5, Mauldin & Ambrose\n* \"Never think that war, no matter how necessary, nor how justified, is not a crime. Ask the infantry, and ask the dead.\" — Ernest Hemingwayp. 262, Trogdon\n* \"One might as well try to charge through a wall\". — Napoleon - on St Helena (regarding the British infantry)\n* \"The infantry doesn't change. We're the only arm [of the army] where the weapon is the man, himself.\" —C.T. ShortisThe New York Times, Shortis\n* \"The army's infantry is its most essential component. Even today, no army can take and hold any ground without the use of infantry.\" — George Nafzigerp. 13, Nafziger\n* \"There is no beating these [British and Spanish] troops, in spite of their generals. I always thought they were bad soldiers, now I am sure of it. I had turned their right, pierced their centre, and, everywhere, victory was mine — but they did not know how to run!\" — Field Marshal Jean de Dieu Soult, Battle of Albuera (16 May 1811), the Peninsular War (1808–14)\n* \"Americans in 1950 rediscovered something that since Hiroshima they had forgotten: you may fly over a land forever; you may bomb it, atomize it, pulverize it and wipe it clean of life – but if you desire to defend it, protect it, and keep it for civilization, you must do this on the ground, the way the Roman legions did, by putting your young men into the mud.\" — military historian T.R. Fehrenbach. Infantry. http://en.wikipedia.org/?curid=15068."
  }
}
