{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=20060",
  "eid" : "3f936240-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778615908,
  "textBody" : "MPEG-2 (a.k.a. H.222/H.262 as defined by the ITU) is a standard for \"the generic coding of moving pictures and associated audio information\".[http://www.iso.org/iso/en/CatalogueDetailPage.CatalogueDetail?CSNUMBER=31537 ISO/IEC 13818 MPEG-2 at the ISO Store.] It describes a combination of lossy video compression and lossy audio data compression methods, which permit storage and transmission of movies using currently available storage media and transmission bandwidth. While MPEG-2 is not as efficient as newer standards such as H.264/AVC and H.265/HEVC, backwards compatibility with existing hardware and software means it is still widely used, for example in over-the-air digital television broadcasting and in the DVD-Video standard.\n\nMain characteristics\n\nMPEG-2 is widely used as the format of digital television signals that are broadcast by terrestrial (over-the-air), cable, and direct broadcast satellite TV systems.  It also specifies the format of movies and other programs that are distributed on DVD and similar discs. TV stations, TV receivers, DVD players, and other equipment are often designed to this standard.  MPEG-2 was the second of several standards developed by the Moving Pictures Expert Group (MPEG) and is an international standard (ISO/IEC 13818). Parts 1 and 2 of MPEG-2 were developed in a collaboration with ITU-T, and they have a respective catalog number in the ITU-T Recommendation Series.\n\nWhile MPEG-2 is the core of most digital television and DVD formats, it does not completely specify them.  Regional institutions can adapt it to their needs by restricting and augmenting aspects of the standard.  See Video profiles and levels.\n\nSystems\n\nMPEG-2 includes a Systems section, part 1, that defines two distinct, but related, container formats. One is the transport stream, a data packet format designed to transmit one data packet in four ATM data packets for streaming digital video and audio over fixed or mobile transmission mediums, where the beginning and the end of the stream may not be identified, such as radio frequency, cable and linear recording mediums, examples of which include ATSC/DVB/ISDB/SBTVD broadcasting, and HDV recording on tape. The other is the program stream, an extended version of the MPEG-1 container format with less overhead than transport stream. Program stream is designed for random access storage mediums such as hard disk drives, optical discs and flash memory.\n\nTransport stream file formats include M2TS, which is used on Blu-ray discs, AVCHD on re-writable DVDs and HDV on compact flash cards. Program stream files include VOB on DVDs and Enhanced VOB on the short lived HD DVD.  The standard MPEG-2 transport stream contains packets of 188 bytes. M2TS prepends each packet with 4 bytes containing a 2-bit copy permission indicator and 30-bit timestamp.\n\nMPEG-2 Systems is formally known as ISO/IEC 13818-1 and as ITU-T Rec. H.222.0. ISO authorized the \"SMPTE Registration Authority, LLC\" as the registration authority for MPEG-2 format identifiers. The registration descriptor of MPEG-2 transport is provided by ISO/IEC 13818-1 in order to enable users of the standard to unambiguously carry data when its format is not necessarily a recognized international standard. This provision will permit the MPEG-2 transport standard to carry all types of data while providing for a method of unambiguous identification of the characteristics of the underlying private data.[http://smpte-ra.org/mpegreg/mpeg.html SMPTE Registration Authority, LLC - registration authority for MPEG-2 format identifiers]  Retrieved on 2009-07-06\n\nVideo\n\nThe Video section, part 2 of MPEG-2, is similar to the previous MPEG-1 standard, but also provides support for interlaced video, the format used by analog broadcast TV systems. MPEG-2 video is not optimized for low bit-rates, especially less than 1 Mbit/s at standard definition resolutions. All standards-compliant MPEG-2 Video decoders are fully capable of playing back MPEG-1 Video streams conforming to the Constrained Parameters Bitstream syntax. MPEG-2/Video is formally known as ISO/IEC 13818-2 and as ITU-T Rec. H.262.\n\nWith some enhancements, MPEG-2 Video and Systems are also used in some HDTV transmission systems, and is the standard format for over-the-air ATSC digital television.\n\nAudio\n\nMPEG-2 introduces new audio encoding methods compared to MPEG-1:\n\nMPEG-2 Part 3 \n\nThe MPEG-2 Audio section, defined in Part 3 (ISO/IEC 13818-3) of the standard, enhances MPEG-1's audio by allowing the coding of audio programs with more than two channels, up to 5.1 multichannel. This method is backwards-compatible (also known as MPEG-2 BC), allowing MPEG-1 audio decoders to decode the two main stereo components of the presentation. MPEG-2 part 3 also defined additional bit rates and sample rates for MPEG-1 Audio Layer I, II and III.Predrag Supurovic, [http://www.mpgedit.org/mpgedit/mpeg_format/mpeghdr.htm MPEG Audio Frame Header] , Retrieved on 2009-07-11\n\nMPEG-2 BC (backward compatible with MPEG-1 audio formats)\n* low bitrate encoding with halved sampling rate (MPEG-1 Layer 1/2/3 LSF - a.k.a. MPEG-2 LSF - \"Low Sampling Frequencies\")\n* multichannel encoding with up to 5.1 channels, a.k.a. MPEG Multichannel\n\nMPEG-2 Part 7 \n\nPart 7 (ISO/IEC 13818-7) of the MPEG-2 standard specifies a rather different, non-backwards-compatible audio format (also known as MPEG-2 NBC). Part 7 is referred to as MPEG-2 AAC. AAC is more efficient than the previous MPEG audio standards, and is in some ways less complicated than its predecessor, MPEG-1 Audio, Layer 3, in that it does not have the hybrid filter bank. It supports from 1 to 48 channels at sampling rates of 8 to 96 kHz, with multichannel, multilingual, and multiprogram capabilities. Advanced Audio is also defined in Part 3 of the MPEG-4 standard.\n\nMPEG-2 NBC (Non-Backward Compatible)\n* MPEG-2 AAC\n* multichannel encoding with up to 48 channels\n\nISO/IEC 13818\n\nMPEG-2 standards are published as parts of ISO/IEC 13818. Each part covers a certain aspect of the whole specification.\n; Part 1: Systems – describes synchronization and multiplexing of video and audio. (It is also known as ITU-T Rec. H.222.0.) See MPEG transport stream and MPEG program stream.\n; Part 2: Video – video coding format for interlaced and non-interlaced video signals (Also known as ITU-T Rec. H.262).\n; Part 3: Audio – audio coding format for perceptual coding of audio signals. A multichannel-enabled extension and extension of bit rates and sample rates for MPEG-1 Audio Layer I, II and III of MPEG-1 audio.\n; Part 4: Describes procedures for testing compliance.\n; Part 5: Describes systems for Software simulation.\n; Part 6: Describes extensions for DSM-CC (Digital Storage Media Command and Control).\n; Part 7: Advanced Audio Coding (AAC).\n; Part 8: 10-bit video extension. Primary application was studio video, allowing artifact-free processing without giving up compression. Part 8 has been withdrawn due to lack of interest by industry.\n; Part 9: Extension for real time interfaces.\n; Part 10: Conformance extensions for DSM-CC.\n; Part 11: Intellectual property management (IPMP)\n\nHistory\n\nMPEG-2 evolved out of the shortcomings of MPEG-1.\n\nMPEG-1's known weaknesses:\n* An audio compression system limited to two channels (stereo).\n* No standardized support for interlaced video with poor compression when used for interlaced video\n* Only one standardized \"profile\" (Constrained Parameters Bitstream), which was unsuited for higher resolution video. MPEG-1 could support 4k video but there was no easy way to encode video for higher resolutions, and identify hardware capable of supporting it, as the limitations of such hardware were not defined.\n* Support for only one chroma subsampling, 4:2:0.\n\nSakae Okubo of NTT was also the ITU-T coordinator for developing the H.262/MPEG-2 Part 2 video coding standard and the requirements chairman in MPEG for the MPEG-2 set of standards.\n\nFilename extensions \n\n.mpg, .mpeg, .m2v, .mp2, mp3 are some of a number of filename extensions used for MPEG-1 or MPEG-2 audio and video file formats.\n\nApplications\n\nDVD-Video \n\nThe DVD-Video standard uses MPEG-2 video, but imposes some restrictions:\n* Allowed Dimensions\n** 720 × 480, 704 × 480, 352 × 480, 352 × 240 pixel (NTSC)\n** 720 × 576, 704 × 576, 352 × 576, 352 × 288 pixel (PAL)\n* Allowed Aspect ratios (Display AR)\n** 4:3 (for letterboxed widescreen and non-widescreen frames)\n** 16:9  (for anamorphic widescreen1.85:1 and 2.35:1, among others, are often listed as valid DVD aspect ratios, but are wider film aspects with letterbox style padding to create a 16:9 image)\n\n* Allowed frame rates\n** 29.97 interlaced frame/s (NTSC)\n** 23.978 progressive frame/s (for NTSC 2:3 pull-down to 29.97By using a pattern of REPEAT_FIRST_FIELD flags on the headers of encoded pictures, pictures can be displayed for either two or three fields and almost any picture display rate (minimum ⅔ of the frame rate) can be achieved. This is most often used to display 23.976 (approximately film rate) video on NTSC. See telecine for more information on how this works.)\n** 25 interlaced frame/s (PAL)\n\n* Audio + video bitrate\n** Video peak 9.8 Mbit/s\n** Total peak 10.08 Mbit/s\n** Minimum 300 kbit/s\n* YUV 4:2:0\n* Additional subtitles possible\n* Closed captioning (NTSC only)\n* Audio\n** Linear Pulse Code Modulation (LPCM): 48 kHz or 96 kHz; 16- or 24-bit; up to six channels (not all combinations possible due to bitrate constraints)\n** MPEG Layer 2 (MP2): 48 kHz, up to 5.1 channels (required in PAL players only)\n** Dolby Digital (DD, also known as AC-3): 48 kHz, 32–448 kbit/s, up to 5.1 channels\n** Digital Theater Systems (DTS): 754 kbit/s or 1510 kbit/s (not required for DVD player compliance)\n** NTSC DVDs must contain at least one LPCM or Dolby Digital audio track.\n** PAL DVDs must contain at least one MPEG Layer 2, LPCM, or Dolby Digital audio track.\n** Players are not required to play back audio with more than two channels, but must be able to downmix multichannel audio to two channels.\n* GOP structure (Group Of Pictures)\n** Sequence header must be present at the beginning of every GOP\n** Maximum frames per GOP: 18 (NTSC) / 15 (PAL), i.e. 0.6 seconds both\n** Closed GOP required for multi-angle DVDs\n\nHDV\n\nHDV is a format for recording and playback of high-definition MPEG-2 video on a DV cassette tape.\n\nMOD and TOD\n\nMOD and TOD are recording formats for use in consumer digital file-based camcorders.\n\nXDCAM\n\nXDCAM is a professional file-based video recording format.\n\nDVB\n\nApplication-specific restrictions on MPEG-2 video in the DVB standard:\n\nAllowed resolutions for SDTV:\n* 720, 640, 544, 528, 480 or 352 × 480 pixel, 24/1.001, 24, 30/1.001 or 30 frame/s\n* 352 × 240 pixel, 24/1.001, 24, 30/1.001 or 30 frame/s\n* 720, 704, 544, 528, 480 or 352 × 576 pixel, 25 frame/s\n* 352 × 288 pixel, 25 frame/s\nFor HDTV:\n* 720 x 576 x 50 frame/s progressive  (576p50)\n* 1280 x 720 x 25 or 50 frame/s progressive  (720p50)\n* 1440 or 1920 x 1080 x 25 frame/s progressive (1080p25 = film mode)\n* 1440 or 1920 x 1080 x 25 frame/s interlace (1080i50)\n\nATSC\n\nThe ATSC A/53 standard used in the United States, uses MPEG-2 video at the Main Profile @ High Level (MP@HL), with additional restrictions such as the maximum bitrate of 19.4 Mbit/s for broadcast television and 38.8 Mbit/s for cable television, 4:2:0 chroma subsampling format, and mandatory colorimetry information.\n\nATSC allows the following video resolutions, aspect ratios, and frame/field rates:\n* 1920 × 1080 pixel (16:9, square pixels), at 30p, 29.97p, 24p, 23.976p, 60i, 59.94i.\n* 1280 × 720 pixel (16:9, square pixels), at 60p, 59.94p, 30p, 29.97p, 24p, or 23.976p\n* 704 × 480 pixel (4:3 or 16:9, non-square pixels), at 60p, 59.94p, 30p, 29.97p, 24p, 23.976p, 60i, or 59.94i\n* 640 × 480 pixel (4:3, square pixels), at 60p, 59.94p, 30p, 29.97p, 24p, 23.976p, 60i, or 59.94i\n\nATSC standard A/63 defines additional resolutions and aspect rates for 50 Hz (PAL) signal.\n\nThe ATSC specification and MPEG-2 allow the use of progressive frames, even within an interlaced video sequence. For example, a station that transmits 1080i60 video sequence can use a coding method where those 60 fields are coded with 24 progressive frames and metadata instructs the decoder to interlace them and perform 3:2 pulldown before display. This allows broadcasters to switch between 60 Hz interlaced (news, soap operas) and 24 Hz progressive (prime-time) content without ending the MPEG-2 sequence and introducing a several seconds of delay as the TV switches formats. This is the reason why 1080p30 and 1080p24 sequences allowed by the ATSC specification are not used in practice.\n\nThe 1080-line formats are encoded with 1920 × 1088 pixel luma matrices and 960 × 540 chroma matrices, but the last 8 lines are discarded by the MPEG-2 decoding and display process.\n\nATSC A/72 is the newest revision of ATSC standards for digital television, which allows the use of H.264/AVC video coding format and 1080p60 signal.\n\nMPEG-2 audio was a contender for the ATSC standard during the DTV \"Grand Alliance\" shootout, but lost out to Dolby AC-3.\n\nISDB-T\n\nTechnical features of MPEG-2 in ATSC are also valid for ISDB-T, except that in the main TS has aggregated a second program for mobile devices compressed in MPEG-4 H.264 AVC for video and AAC-LC for audio, mainly known as 1seg.\n\nBlu-ray\n\nCommercial Blu-ray discs encode the first 10 second long \"FBI anti-piracy warning\" in MPEG-2 regardless of the rest of the disc's encoding. The feature film can also be in MPEG-2, which was common on early Blu-ray releases, but recent releases most often use H.264 or VC-1.\n\nPatent pool\n\nAll MPEG-2 patents is officially expired and can be used freely.http://mobile.osnews.com/story.php/24954/US_Patent_Expiration_for_MP3_MPEG-2_H_264\n\nMPEG LA, a private patent licensing organization, has acquired rights from over 20 corporations and one university to license a patent pool of approximately 640 worldwide patents, which it claims are the \"essential\" to use of MPEG-2 technology, although many of the patents have since expired.[http://www.mpegla.com/m2/m2-patentlist.cfm Mpeg La] [https://web.archive.org/web/20040318031406/http://www.audiompeg.com/us_patents.asp audioMPEG.com - - - US Patents]  Where software patentability is upheld, the use of MPEG-2 requires the payment of licensing fees to the patent holders. Other patents are licensed by Audio MPEG, Inc. The development of the standard itself took less time than the patent negotiations.[http://www.mpegla.com/m2/m2-att1.pdf ]   Patent pooling between essential and peripheral patent holders in the MPEG-2 pool is the subject of a study by the University of Wisconsin.  Over half of the patents expired in 2012.\n\nAccording to the MPEG-2 licensing agreement any use of MPEG-2 technology is subject to royalties. MPEG-2 encoders are subject to a royalty of $2.00 per unit, decoders are subject to a royalty of $2.00 per unit, and royalty-based sales of encoders and decoders are subject to different rules and $2.50 per unit. Also, any packaged medium (DVDs/Data Streams) is subject to licence fees according to length of recording/broadcast. \nA criticism of the MPEG-2 patent pool is that even though the number of patents will decrease from 1,048 to 416 by June 2013 the license fee has not decreased with the expiration rate of MPEG-2 patents. Since January 1, 2010, the MPEG-2 patent pool has remained at $2 for a decoding license and $2 for an encoding license. By 2015 more than 90% of the MPEG-2 patents will have expired but as long as there are one or more active patents in the MPEG-2 patent pool in either the country of manufacture or the country of sale the MPEG-2 license agreement requires that licensees pay a license fee that does not change based on the number of patents that have expired.\n\nPatents (U.S. only)\n\nThe last United States patent expired on .",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "MPEG-2" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=20060" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "MPEG-2 (a.k.a. H.222/H.262 as defined by the ITU) is a standard for \"the generic coding of moving pictures and associated audio information\".[http://www.iso.org/iso/en/CatalogueDetailPage.CatalogueDetail?CSNUMBER=31537 ISO/IEC 13818 MPEG-2 at the ISO Store.] It describes a combination of lossy video compression and lossy audio data compression methods, which permit storage and transmission of movies using currently available storage media and transmission bandwidth. While MPEG-2 is not as efficient as newer standards such as H.264/AVC and H.265/HEVC, backwards compatibility with existing hardware and software means it is still widely used, for example in over-the-air digital television broadcasting and in the DVD-Video standard.\n\nMain characteristics\n\nMPEG-2 is widely used as the format of digital television signals that are broadcast by terrestrial (over-the-air), cable, and direct broadcast satellite TV systems.  It also specifies the format of movies and other programs that are distributed on DVD and similar discs. TV stations, TV receivers, DVD players, and other equipment are often designed to this standard.  MPEG-2 was the second of several standards developed by the Moving Pictures Expert Group (MPEG) and is an international standard (ISO/IEC 13818). Parts 1 and 2 of MPEG-2 were developed in a collaboration with ITU-T, and they have a respective catalog number in the ITU-T Recommendation Series.\n\nWhile MPEG-2 is the core of most digital television and DVD formats, it does not completely specify them.  Regional institutions can adapt it to their needs by restricting and augmenting aspects of the standard.  See Video profiles and levels.\n\nSystems\n\nMPEG-2 includes a Systems section, part 1, that defines two distinct, but related, container formats. One is the transport stream, a data packet format designed to transmit one data packet in four ATM data packets for streaming digital video and audio over fixed or mobile transmission mediums, where the beginning and the end of the stream may not be identified, such as radio frequency, cable and linear recording mediums, examples of which include ATSC/DVB/ISDB/SBTVD broadcasting, and HDV recording on tape. The other is the program stream, an extended version of the MPEG-1 container format with less overhead than transport stream. Program stream is designed for random access storage mediums such as hard disk drives, optical discs and flash memory.\n\nTransport stream file formats include M2TS, which is used on Blu-ray discs, AVCHD on re-writable DVDs and HDV on compact flash cards. Program stream files include VOB on DVDs and Enhanced VOB on the short lived HD DVD.  The standard MPEG-2 transport stream contains packets of 188 bytes. M2TS prepends each packet with 4 bytes containing a 2-bit copy permission indicator and 30-bit timestamp.\n\nMPEG-2 Systems is formally known as ISO/IEC 13818-1 and as ITU-T Rec. H.222.0. ISO authorized the \"SMPTE Registration Authority, LLC\" as the registration authority for MPEG-2 format identifiers. The registration descriptor of MPEG-2 transport is provided by ISO/IEC 13818-1 in order to enable users of the standard to unambiguously carry data when its format is not necessarily a recognized international standard. This provision will permit the MPEG-2 transport standard to carry all types of data while providing for a method of unambiguous identification of the characteristics of the underlying private data.[http://smpte-ra.org/mpegreg/mpeg.html SMPTE Registration Authority, LLC - registration authority for MPEG-2 format identifiers]  Retrieved on 2009-07-06\n\nVideo\n\nThe Video section, part 2 of MPEG-2, is similar to the previous MPEG-1 standard, but also provides support for interlaced video, the format used by analog broadcast TV systems. MPEG-2 video is not optimized for low bit-rates, especially less than 1 Mbit/s at standard definition resolutions. All standards-compliant MPEG-2 Video decoders are fully capable of playing back MPEG-1 Video streams conforming to the Constrained Parameters Bitstream syntax. MPEG-2/Video is formally known as ISO/IEC 13818-2 and as ITU-T Rec. H.262.\n\nWith some enhancements, MPEG-2 Video and Systems are also used in some HDTV transmission systems, and is the standard format for over-the-air ATSC digital television.\n\nAudio\n\nMPEG-2 introduces new audio encoding methods compared to MPEG-1:\n\nMPEG-2 Part 3 \n\nThe MPEG-2 Audio section, defined in Part 3 (ISO/IEC 13818-3) of the standard, enhances MPEG-1's audio by allowing the coding of audio programs with more than two channels, up to 5.1 multichannel. This method is backwards-compatible (also known as MPEG-2 BC), allowing MPEG-1 audio decoders to decode the two main stereo components of the presentation. MPEG-2 part 3 also defined additional bit rates and sample rates for MPEG-1 Audio Layer I, II and III.Predrag Supurovic, [http://www.mpgedit.org/mpgedit/mpeg_format/mpeghdr.htm MPEG Audio Frame Header] , Retrieved on 2009-07-11\n\nMPEG-2 BC (backward compatible with MPEG-1 audio formats)\n* low bitrate encoding with halved sampling rate (MPEG-1 Layer 1/2/3 LSF - a.k.a. MPEG-2 LSF - \"Low Sampling Frequencies\")\n* multichannel encoding with up to 5.1 channels, a.k.a. MPEG Multichannel\n\nMPEG-2 Part 7 \n\nPart 7 (ISO/IEC 13818-7) of the MPEG-2 standard specifies a rather different, non-backwards-compatible audio format (also known as MPEG-2 NBC). Part 7 is referred to as MPEG-2 AAC. AAC is more efficient than the previous MPEG audio standards, and is in some ways less complicated than its predecessor, MPEG-1 Audio, Layer 3, in that it does not have the hybrid filter bank. It supports from 1 to 48 channels at sampling rates of 8 to 96 kHz, with multichannel, multilingual, and multiprogram capabilities. Advanced Audio is also defined in Part 3 of the MPEG-4 standard.\n\nMPEG-2 NBC (Non-Backward Compatible)\n* MPEG-2 AAC\n* multichannel encoding with up to 48 channels\n\nISO/IEC 13818\n\nMPEG-2 standards are published as parts of ISO/IEC 13818. Each part covers a certain aspect of the whole specification.\n; Part 1: Systems – describes synchronization and multiplexing of video and audio. (It is also known as ITU-T Rec. H.222.0.) See MPEG transport stream and MPEG program stream.\n; Part 2: Video – video coding format for interlaced and non-interlaced video signals (Also known as ITU-T Rec. H.262).\n; Part 3: Audio – audio coding format for perceptual coding of audio signals. A multichannel-enabled extension and extension of bit rates and sample rates for MPEG-1 Audio Layer I, II and III of MPEG-1 audio.\n; Part 4: Describes procedures for testing compliance.\n; Part 5: Describes systems for Software simulation.\n; Part 6: Describes extensions for DSM-CC (Digital Storage Media Command and Control).\n; Part 7: Advanced Audio Coding (AAC).\n; Part 8: 10-bit video extension. Primary application was studio video, allowing artifact-free processing without giving up compression. Part 8 has been withdrawn due to lack of interest by industry.\n; Part 9: Extension for real time interfaces.\n; Part 10: Conformance extensions for DSM-CC.\n; Part 11: Intellectual property management (IPMP)\n\nHistory\n\nMPEG-2 evolved out of the shortcomings of MPEG-1.\n\nMPEG-1's known weaknesses:\n* An audio compression system limited to two channels (stereo).\n* No standardized support for interlaced video with poor compression when used for interlaced video\n* Only one standardized \"profile\" (Constrained Parameters Bitstream), which was unsuited for higher resolution video. MPEG-1 could support 4k video but there was no easy way to encode video for higher resolutions, and identify hardware capable of supporting it, as the limitations of such hardware were not defined.\n* Support for only one chroma subsampling, 4:2:0.\n\nSakae Okubo of NTT was also the ITU-T coordinator for developing the H.262/MPEG-2 Part 2 video coding standard and the requirements chairman in MPEG for the MPEG-2 set of standards.\n\nFilename extensions \n\n.mpg, .mpeg, .m2v, .mp2, mp3 are some of a number of filename extensions used for MPEG-1 or MPEG-2 audio and video file formats.\n\nApplications\n\nDVD-Video \n\nThe DVD-Video standard uses MPEG-2 video, but imposes some restrictions:\n* Allowed Dimensions\n** 720 × 480, 704 × 480, 352 × 480, 352 × 240 pixel (NTSC)\n** 720 × 576, 704 × 576, 352 × 576, 352 × 288 pixel (PAL)\n* Allowed Aspect ratios (Display AR)\n** 4:3 (for letterboxed widescreen and non-widescreen frames)\n** 16:9  (for anamorphic widescreen1.85:1 and 2.35:1, among others, are often listed as valid DVD aspect ratios, but are wider film aspects with letterbox style padding to create a 16:9 image)\n\n* Allowed frame rates\n** 29.97 interlaced frame/s (NTSC)\n** 23.978 progressive frame/s (for NTSC 2:3 pull-down to 29.97By using a pattern of REPEAT_FIRST_FIELD flags on the headers of encoded pictures, pictures can be displayed for either two or three fields and almost any picture display rate (minimum ⅔ of the frame rate) can be achieved. This is most often used to display 23.976 (approximately film rate) video on NTSC. See telecine for more information on how this works.)\n** 25 interlaced frame/s (PAL)\n\n* Audio + video bitrate\n** Video peak 9.8 Mbit/s\n** Total peak 10.08 Mbit/s\n** Minimum 300 kbit/s\n* YUV 4:2:0\n* Additional subtitles possible\n* Closed captioning (NTSC only)\n* Audio\n** Linear Pulse Code Modulation (LPCM): 48 kHz or 96 kHz; 16- or 24-bit; up to six channels (not all combinations possible due to bitrate constraints)\n** MPEG Layer 2 (MP2): 48 kHz, up to 5.1 channels (required in PAL players only)\n** Dolby Digital (DD, also known as AC-3): 48 kHz, 32–448 kbit/s, up to 5.1 channels\n** Digital Theater Systems (DTS): 754 kbit/s or 1510 kbit/s (not required for DVD player compliance)\n** NTSC DVDs must contain at least one LPCM or Dolby Digital audio track.\n** PAL DVDs must contain at least one MPEG Layer 2, LPCM, or Dolby Digital audio track.\n** Players are not required to play back audio with more than two channels, but must be able to downmix multichannel audio to two channels.\n* GOP structure (Group Of Pictures)\n** Sequence header must be present at the beginning of every GOP\n** Maximum frames per GOP: 18 (NTSC) / 15 (PAL), i.e. 0.6 seconds both\n** Closed GOP required for multi-angle DVDs\n\nHDV\n\nHDV is a format for recording and playback of high-definition MPEG-2 video on a DV cassette tape.\n\nMOD and TOD\n\nMOD and TOD are recording formats for use in consumer digital file-based camcorders.\n\nXDCAM\n\nXDCAM is a professional file-based video recording format.\n\nDVB\n\nApplication-specific restrictions on MPEG-2 video in the DVB standard:\n\nAllowed resolutions for SDTV:\n* 720, 640, 544, 528, 480 or 352 × 480 pixel, 24/1.001, 24, 30/1.001 or 30 frame/s\n* 352 × 240 pixel, 24/1.001, 24, 30/1.001 or 30 frame/s\n* 720, 704, 544, 528, 480 or 352 × 576 pixel, 25 frame/s\n* 352 × 288 pixel, 25 frame/s\nFor HDTV:\n* 720 x 576 x 50 frame/s progressive  (576p50)\n* 1280 x 720 x 25 or 50 frame/s progressive  (720p50)\n* 1440 or 1920 x 1080 x 25 frame/s progressive (1080p25 = film mode)\n* 1440 or 1920 x 1080 x 25 frame/s interlace (1080i50)\n\nATSC\n\nThe ATSC A/53 standard used in the United States, uses MPEG-2 video at the Main Profile @ High Level (MP@HL), with additional restrictions such as the maximum bitrate of 19.4 Mbit/s for broadcast television and 38.8 Mbit/s for cable television, 4:2:0 chroma subsampling format, and mandatory colorimetry information.\n\nATSC allows the following video resolutions, aspect ratios, and frame/field rates:\n* 1920 × 1080 pixel (16:9, square pixels), at 30p, 29.97p, 24p, 23.976p, 60i, 59.94i.\n* 1280 × 720 pixel (16:9, square pixels), at 60p, 59.94p, 30p, 29.97p, 24p, or 23.976p\n* 704 × 480 pixel (4:3 or 16:9, non-square pixels), at 60p, 59.94p, 30p, 29.97p, 24p, 23.976p, 60i, or 59.94i\n* 640 × 480 pixel (4:3, square pixels), at 60p, 59.94p, 30p, 29.97p, 24p, 23.976p, 60i, or 59.94i\n\nATSC standard A/63 defines additional resolutions and aspect rates for 50 Hz (PAL) signal.\n\nThe ATSC specification and MPEG-2 allow the use of progressive frames, even within an interlaced video sequence. For example, a station that transmits 1080i60 video sequence can use a coding method where those 60 fields are coded with 24 progressive frames and metadata instructs the decoder to interlace them and perform 3:2 pulldown before display. This allows broadcasters to switch between 60 Hz interlaced (news, soap operas) and 24 Hz progressive (prime-time) content without ending the MPEG-2 sequence and introducing a several seconds of delay as the TV switches formats. This is the reason why 1080p30 and 1080p24 sequences allowed by the ATSC specification are not used in practice.\n\nThe 1080-line formats are encoded with 1920 × 1088 pixel luma matrices and 960 × 540 chroma matrices, but the last 8 lines are discarded by the MPEG-2 decoding and display process.\n\nATSC A/72 is the newest revision of ATSC standards for digital television, which allows the use of H.264/AVC video coding format and 1080p60 signal.\n\nMPEG-2 audio was a contender for the ATSC standard during the DTV \"Grand Alliance\" shootout, but lost out to Dolby AC-3.\n\nISDB-T\n\nTechnical features of MPEG-2 in ATSC are also valid for ISDB-T, except that in the main TS has aggregated a second program for mobile devices compressed in MPEG-4 H.264 AVC for video and AAC-LC for audio, mainly known as 1seg.\n\nBlu-ray\n\nCommercial Blu-ray discs encode the first 10 second long \"FBI anti-piracy warning\" in MPEG-2 regardless of the rest of the disc's encoding. The feature film can also be in MPEG-2, which was common on early Blu-ray releases, but recent releases most often use H.264 or VC-1.\n\nPatent pool\n\nAll MPEG-2 patents is officially expired and can be used freely.http://mobile.osnews.com/story.php/24954/US_Patent_Expiration_for_MP3_MPEG-2_H_264\n\nMPEG LA, a private patent licensing organization, has acquired rights from over 20 corporations and one university to license a patent pool of approximately 640 worldwide patents, which it claims are the \"essential\" to use of MPEG-2 technology, although many of the patents have since expired.[http://www.mpegla.com/m2/m2-patentlist.cfm Mpeg La] [https://web.archive.org/web/20040318031406/http://www.audiompeg.com/us_patents.asp audioMPEG.com - - - US Patents]  Where software patentability is upheld, the use of MPEG-2 requires the payment of licensing fees to the patent holders. Other patents are licensed by Audio MPEG, Inc. The development of the standard itself took less time than the patent negotiations.[http://www.mpegla.com/m2/m2-att1.pdf ]   Patent pooling between essential and peripheral patent holders in the MPEG-2 pool is the subject of a study by the University of Wisconsin.  Over half of the patents expired in 2012.\n\nAccording to the MPEG-2 licensing agreement any use of MPEG-2 technology is subject to royalties. MPEG-2 encoders are subject to a royalty of $2.00 per unit, decoders are subject to a royalty of $2.00 per unit, and royalty-based sales of encoders and decoders are subject to different rules and $2.50 per unit. Also, any packaged medium (DVDs/Data Streams) is subject to licence fees according to length of recording/broadcast. \nA criticism of the MPEG-2 patent pool is that even though the number of patents will decrease from 1,048 to 416 by June 2013 the license fee has not decreased with the expiration rate of MPEG-2 patents. Since January 1, 2010, the MPEG-2 patent pool has remained at $2 for a decoding license and $2 for an encoding license. By 2015 more than 90% of the MPEG-2 patents will have expired but as long as there are one or more active patents in the MPEG-2 patent pool in either the country of manufacture or the country of sale the MPEG-2 license agreement requires that licensees pay a license fee that does not change based on the number of patents that have expired.\n\nPatents (U.S. only)\n\nThe last United States patent expired on . MPEG-2. http://en.wikipedia.org/?curid=20060."
  }
}
