{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19516",
  "eid" : "3b5606b0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778608795,
  "textBody" : "Events\n\n* 537 – Siege of Rome: The Ostrogoth army under king Vitiges begins the siege of the capital. Belisarius conducts a delaying action outside the Flaminian Gate; he and a detachment of his bucellarii are almost cut off.\n* 986 – Louis V becomes King of the Franks.\n*1127 – Assassination of Charles the Good, Count of Flanders.\n*1444 – Skanderbeg organizes a group of Albanian nobles to form the League of Lezhë.\n*1458 – George of Poděbrady is chosen as the king of Bohemia.\n*1476 – Burgundian Wars: The Old Swiss Confederacy hands Charles the Bold, Duke of Burgundy, a major defeat in the Battle of Grandson in Canton of Neuchâtel.\n*1484 – The College of Arms is formally incorporated by Royal Charter signed by King Richard III of England.\n*1498 – Vasco da Gama's fleet visits the Island of Mozambique.\n*1561 – Mendoza, Argentina is founded by Spanish conquistador Pedro del Castillo.\n*1657 – Great Fire of Meireki: A fire in Edo (now Tokyo), Japan, caused more than 100,000 deaths; it lasted three days\n*1717 – The Loves of Mars and Venus is the first ballet performed in England.\n*1776 – American Revolutionary War: Patriot militia units arrest the Royal Governor of Georgia James Wright and attempt to prevent capture of supply ships in the Battle of the Rice Boats.\n*1791 – Long-distance communication speeds up with the unveiling of a semaphore machine in Paris.\n*1797 – The Bank of England issues the first one-pound and two-pound banknotes.\n*1807 – The U.S. Congress passes the Act Prohibiting Importation of Slaves, disallowing the importation of new slaves into the country.\n*1808 – The inaugural meeting of the Wernerian Natural History Society, a former Scottish learned society, is held in Edinburgh.\n*1811 – Argentine War of Independence: A royalist fleet defeats a small flotilla of revolutionary ships in the Battle of San Nicolás on the River Plate.\n*1815 – Signing of the Kandyan Convention treaty by British invaders and the leaders of the Kingdom of Kandy.\n*1825 – Roberto Cofresí, one of the last successful Caribbean pirates, is defeated in combat and captured by authorities.\n*1836 – Texas Revolution: The Declaration of independence of the Republic of Texas from Mexico is adopted.\n*1855 – Alexander II becomes Tsar of Russia.\n*1859 – The two-day Great Slave Auction, the largest such auction in United States history, begins.\n*1865 – East Cape War: The Völkner Incident in New Zealand.\n*1867 – The U.S. Congress passes the first Reconstruction Act.\n*1877 – U.S. presidential election, 1876: Just two days before inauguration, the U.S. Congress declares Rutherford B. Hayes the winner of the election even though Samuel J. Tilden had won the popular vote on November 7, 1876.\n*1882 – Queen Victoria narrowly escapes an assassination attempt by Roderick McLean in Windsor.\n*1896 – Ethiopian victory over the Italian forces in the Battle of Adwa.\n*1901 – United States Steel Corporation is founded as a result of a merger between Carnegie Steel Company and Federal Steel Company which became the first corporation in the world with a market capital over $1 billion.\n*1901 – The U.S. Congress passes the Platt Amendment limiting the autonomy of Cuba, as a condition of the withdrawal of American troops.\n*1903 – In New York City the Martha Washington Hotel opens, becoming the first hotel exclusively for women.\n*1917 – The enactment of the Jones–Shafroth Act grants Puerto Ricans United States citizenship.\n*1919 – The first Communist International meets in Moscow.\n*1933 – The film King Kong opens at New York's Radio City Music Hall.\n*1937 – The Steel Workers Organizing Committee signs a collective bargaining agreement with U.S. Steel, leading to unionization of the United States steel industry.\n*1939 – Cardinal Eugenio Pacelli is elected Pope and takes the name Pius XII.\n*1941 – World War II: First German military units enter Bulgaria after it joins the Axis Pact.\n*1943 – World War II: Battle of the Bismarck Sea: United States and Australian forces sink Japanese convoy ships.\n*1946 – Ho Chi Minh is elected the President of North Vietnam.\n*1949 – Captain James Gallagher lands his B-50 Superfortress Lucky Lady II in Fort Worth, Texas after completing the first non-stop around-the-world airplane flight in 94 hours and one minute.\n*1955 – Norodom Sihanouk, king of Cambodia, abdicates the throne in favor of his father, Norodom Suramarit.\n*1956 – Morocco gains its independence from France.\n*1961 – John F. Kennedy announces the creation of the Peace Corps in a nationally televised broadcast.\n*1962 – In Burma, the army led by General Ne Win seizes power in a coup d'état.\n*  1962   – Wilt Chamberlain sets the single-game scoring record in the National Basketball Association by scoring 100 points.\n*1965 – The US and Republic of Vietnam Air Force begin Operation Rolling Thunder, a sustained bombing campaign against North Vietnam.\n*1968 – Baggeridge Colliery closes marking the end of over 300 years of coal mining in the Black Country.http://www.blackcountrysociety.co.uk/articles/baggeridge2.htm\n*1969 – In Toulouse, France, the first test flight of the Anglo-French Concorde is conducted.\n*1970 – Rhodesia declares itself a republic, breaking its last links with the British crown.\n*1972 – The Pioneer 10 space probe is launched from Cape Canaveral, Florida with a mission to explore the outer planets.\n*1977 – Libya becomes the Socialist People's Libyan Arab Jamahiriya as the General People's Congress adopted the \"Declaration on the Establishment of the Authority of the People\".\n*1978 – Czech Vladimír Remek becomes the first non-Russian or non-American to go into space, when he is launched aboard Soyuz 28.\n*1983 – Compact discs and players are released for the first time in the United States and other markets. They had previously been available only in Japan.\n*1989 – Twelve European Community nations agree to ban the production of all chlorofluorocarbons (CFCs) by the end of the century.\n*1990 – Nelson Mandela is elected deputy President of the African National Congress.\n*1991 – Battle at Rumaila oil field brings an end to the 1991 Gulf War.\n*1992 – Armenia, Azerbaijan, Kazakhstan, Kyrgyzstan, Moldova, San Marino, Tajikistan, Turkmenistan and Uzbekistan join the United Nations.\n*1995 – Researchers at Fermilab announce the discovery of the top quark.\n*1998 – Data sent from the Galileo spacecraft indicates that Jupiter's moon Europa has a liquid ocean under a thick crust of ice.\n*2002 – U.S. invasion of Afghanistan: Operation Anaconda begins, (ending on March 19 after killing 500 Taliban and al-Qaeda fighters, with 11 Western troop fatalities).\n*2004 – War in Iraq: Al-Qaeda carries out the Ashoura Massacre in Iraq, killing 170 and wounding over 500.\n*2012 – A tornado outbreak occurred over a large section of the Southern United States and into the Ohio Valley region, resulting in 40 tornado-related fatalities\n*2017 – The elements Moscovium, Tennessine, and Oganesson were officially added to the periodic table at a conference in Moscow, Russia\n\nBirths\n\n* 480 – Benedict of Nursia, Italian Christian saint (d. 543 or 547)\n*1316 – Robert II of Scotland (d. 1390)\n*1409 – Jean II, Duke of Alençon (d. 1476)\n*1432 – Countess Palatine Margaret of Mosbach, countess consort of Hanau (d. 1457)\n*1453 – Johannes Engel, German doctor, astronomer and astrologer (d. 1512)\n*1459 – Pope Adrian VI (d. 1523)\n*1481 – Franz von Sickingen, German knight (d. 1523)\n*1545 – Thomas Bodley, English diplomat and scholar, founded the Bodleian Library (d. 1613)\n*1577 – George Sandys, English traveller, colonist and poet (d. 1644)\n*1628 – Cornelis Speelman, Governor-General of the Dutch East Indies (d. 1684)\n*1651 – Carlo Gimach, Maltese architect, engineer and poet (d. 1730)\n*1705 – William Murray, 1st Earl of Mansfield, Scottish lawyer, judge, and politician, Chancellor of the Exchequer (d. 1793)\n*1740 – Nicholas Pocock, English sea painter (d.1821)\n*1760 – Camille Desmoulins, French journalist and politician (d. 1794)\n*1769 – DeWitt Clinton, American lawyer and politician, 6th Governor of New York (d. 1828)\n*1770 – Louis-Gabriel Suchet, French general (d. 1826)\n*1779 – Joel Roberts Poinsett, American physician and politician, 15th United States Secretary of War (d. 1851)\n*1793 – Sam Houston, American soldier and politician, 1st President of the Republic of Texas (d. 1863)\n*1800 – Yevgeny Baratynsky, Russian-Italian poet and philosopher (d. 1844)\n*1810 – Pope Leo XIII (d. 1903)\n*1816 – Alexander Bullock, American lawyer and politician, 26th Governor of Massachusetts (d. 1882)\n*1817 – János Arany, Hungarian journalist and poet (d. 1882)\n*1820 – Multatuli, Dutch writer (d. 1887)\n*1824 – Bedřich Smetana, Czech pianist and composer (d. 1884)\n*1829 – Carl Schurz, German-American general, lawyer, and politician, 13th United States Secretary of the Interior (d. 1906)\n*1836 – Henry Billings Brown, American lawyer and judge (d. 1913)\n*1842 – Carl Jacobsen, Danish brewer, art collector, and philanthropist (d. 1914)\n*1846 – Marie Roze, French soprano (d. 1926)\n*1849 – Robert Means Thompson, American commander, lawyer, and businessman (d. 1930)\n*1859 – Sholem Aleichem, Ukrainian-American author and playwright (d. 1916)\n*1860 – Susanna M. Salter, American activist and politician (d. 1961)\n*1862 – John Jay Chapman, American lawyer, author, and poet (d. 1933)\n*1876 – Pope Pius XII (d. 1958)\n*1878 – William Kissam Vanderbilt II, American sailor and race car driver (d. 1944)\n*1886 – Willis H. O'Brien, American animator and director (d. 1962)\n*  1886   – Kurt Grelling, German logician and philosopher (d. 1942)\n*1900 – Kurt Weill, German-American pianist and composer (d. 1950)\n*1901 – Grete Hermann, German mathematician and philosopher (d. 1984)\n*1902 – Moe Berg, American baseball player and spy (d. 1972)\n*  1902   – Edward Condon, American physicist and academic (d. 1974)\n*1904 – Dr. Seuss, American children's book writer, poet, and illustrator (d. 1991)\n*1905 – Marc Blitzstein, American composer and songwriter (d. 1964)\n*  1905   – Geoffrey Grigson, English poet and critic (d. 1985)\n*1908 – Walter Bruch, German engineer (d. 1990)\n*1909 – Mel Ott, American baseball player, manager, and sportscaster (d. 1958)\n*1912 – Henry Katzman, American pianist, composer, and painter (d. 2001)\n*1913 – Godfried Bomans, Flemish television host and author (d. 1971)\n*  1913   – Mort Cooper, American baseball player (d. 1958)\n*1914 – Martin Ritt, American actor and film director (d. 1990)\n*1915 – John Burton, Australian public servant and diplomat, Australian High Commissioner to Ceylon (d. 2010)\n*1917 – Desi Arnaz, Cuban-American actor, singer, and producer (d. 1986)\n*  1917   – David Goodis, American author and screenwriter (d. 1967)\n*  1917   – Jim Konstanty, American baseball player and coach (d. 1976)\n*1919 – Jennifer Jones, American actress (d. 2009)\n*  1919   – Eddie Lawrence, American actor, singer, and playwright (d. 2014)\n*  1919   – Tamara Toumanova, American ballerina and actress (d. 1996)\n*1921 – Kazimierz Górski, Polish footballer and coach (d. 2006)\n*  1921   – Ernst Haas, Austrian-American photographer and journalist (d. 1986)\n*1922 – Eddie \"Lockjaw\" Davis, American saxophonist (d. 1986)\n*  1922   – Bill Quackenbush, Canadian-American ice hockey player and coach (d. 1999)\n*  1922   – Frances Spence, American computer programmer (d. 2012)\n*1923 – Basil Hume, English cardinal (d. 1999)\n*  1923   – Robert H. Michel, American soldier and politician (d. 2017)\n*  1923   – Dave Strack, American basketball player and coach (d. 2014)\n*1924 – Cal Abrams, American baseball player (d. 1997)\n*  1924   – Renos Apostolidis, Greek philologist, author, and critic (d. 2004)\n*1926 – Bernard Agré, Ivorian cardinal (d. 2014)\n*  1926   – Murray Rothbard, American economist and historian (d. 1995)\n*1927 – Roger Walkowiak, French cyclist and economist (d. 2017)\n*1930 – John Cullum, American actor and singer\n*  1930   – Emma Penella, Spanish actress (d. 2007)\n*1931 – Mikhail Gorbachev, Russian lawyer and politician, President of the Soviet Union, Nobel Prize laureate\n*  1931   – Tom Wolfe, American journalist and author\n*1932 – Gun Hägglund, Swedish journalist and translator (d. 2011)\n*1934 – Dottie Rambo, American singer-songwriter (d. 2008)\n*1935 – Gene Stallings, American football player and coach\n*1936 – Haroon Ahmed, Pakistani-English engineer and academic\n*  1936   – John Tusa, Czech-English journalist and academic\n*1937 – Abdelaziz Bouteflika, Algerian soldier and politician, 5th President of Algeria\n*1938 – Ricardo Lagos, Chilean economist, lawyer, and politician, 33rd President of Chile\n*  1938   – Lawrence Payton, American singer-songwriter and producer (d. 1997)\n*  1938   – Clark Gesner, American author and composer (d. 2002)\n*1939 – Jan Howard Finder, American author and academic (d. 2013)\n*1940 – Mamnoon Hussain, Pakistani businessman and politician, 12th President of Pakistan\n*1941 – John Cornell, Australian actor, director, and producer\n*  1941   – David Satcher, American admiral and physician, 16th Surgeon General of the United States\n*1942 – John Irving, American novelist and screenwriter\n*  1942   – Claude Larose, Canadian ice hockey player and coach\n*  1942   – Mir-Hossein Mousavi, Iranian architect and politician, 79th Prime Minister of Iran\n*  1942   – Lou Reed, American singer-songwriter, guitarist, producer, and actor (d. 2013)\n*  1942   – Derek Woodley, English footballer (d. 2002)\n*1943 – George Layton, English actor, director, and screenwriter\n*  1943   – Peter Straub, American author and poet\n*  1943   – Robert Williams, American painter and cartoonist\n*1945 – Derek Watkins, English trumpet player and composer (d. 2013)\n*1947 – Nelson Ned, Brazilian singer-songwriter (d. 2014)\n*  1947   – Harry Redknapp, English footballer and manager\n*1948 – Larry Carlton, American guitarist and songwriter\n*  1948   – Rory Gallagher, Irish singer-songwriter, guitarist, and producer (d. 1995)\n*  1948   – Jeff Kennett, Australian journalist and politician, 43rd Premier of Victoria\n*1950 – Karen Carpenter, American singer (d. 1983)\n*1952 – Mark Evanier, American author and screenwriter\n*  1952   – Laraine Newman, American actress and comedian\n*1953 – Russ Feingold, American lawyer and politician\n*1954 – Ed Johnstone, Canadian ice hockey player and coach\n*1955 – Dale Bozzio, American pop-rock singer-songwriter\n*  1955   – Jay Osmond, American singer, drummer, actor, and TV/film producer\n*  1955   – Ken Salazar, American lawyer and politician, 50th United States Secretary of the Interior\n*  1955   – Steve Small, Australian cricketer\n*1956 – John Cowsill, American musician, songwriter, and producer \n*  1956   – Mark Evans, Australian rock bass player\n*1957 – Hossein Dehghan, Iranian general and politician, Iranian Minister of Defense\n*  1957   – Dito Tsintsadze, Georgian film director and screenwriter\n*  1957   – Mark Dean, American inventor and computer engineer\n*1958 – Kevin Curren, South African-American tennis player\n*  1958   – Ian Woosnam, English-Welsh golfer\n*1959 – Larry Stewart, American singer-songwriter and guitarist \n*1961 – Simone Young, Australian conductor, director, and composer\n*1962 – Jon Bon Jovi, American singer-songwriter, guitarist, producer, and actor \n*  1962   – Paul Farrelly, English journalist and politician\n*  1962   – Tom Nordlie, Norwegian footballer and coach\n*  1962   – Brendan O'Connor, Australian politician, Australian Minister for Employment\n*  1962   – Raimo Summanen, Finnish ice hockey player and coach\n*  1962   – Gabriele Tarquini, Italian race car driver\n*1963 – Alvin Youngblood Hart, American singer and guitarist\n*  1963   – Anthony Albanese, Australian politician, 15th Deputy Prime Minister of Australia\n*1964 – Laird Hamilton, American surfer and actor\n*  1964   – Mike Von Erich, American wrestler (d. 1987)\n*1965 – Ron Gant, American baseball player and journalist\n*  1965   – Lembit Öpik, Northern Irish politician\n*1966 – Simon Reevell, English lawyer and politician\n*1968 – Daniel Craig, English actor and producer\n*1970 – James Purnell, English politician, Secretary of State for Work and Pensions\n*  1970   – Ciriaco Sforza, Swiss footballer and manager\n*  1970   – Wibi Soerjadi, Dutch pianist and composer\n*1971 – Method Man, American rapper, record producer and actor \n*1972 – Mauricio Pochettino, Argentinian footballer and manager\n*1973 – Dejan Bodiroga, Serbian basketball player\n*  1973   – Trevor Sinclair, English footballer and manager\n*1974 – Hayley Lewis, Australian swimmer and television host\n*1975 – Daryl Gibson, New Zealand rugby player\n*1977 – Dominique Canty, American basketball player and coach\n*  1977   – Chris Martin, English singer-songwriter and producer \n*  1977   – Stephen Parry, English swimmer and sportscaster\n*  1977   – Andrew Strauss, South African-English cricketer\n*1978 – Gabby Eigenmann, Filipino actor and singer\n*  1978   – Lee Hodges, English footballer and manager\n*  1978   – Tomáš Kaberle, Czech ice hockey player\n*1979 – Damien Duff, Irish footballer\n*  1979   – Jim Troughton, English cricketer\n*  1979   – Nicky Weaver, English footballer\n*1980 – Chris Barker, English footballer and manager\n*  1980   – Rebel Wilson, Australian actress and screenwriter\n*1981 – Lance Cade, American wrestler (d. 2010)\n*  1981   – Bryce Dallas Howard, American actress \n*1982 – Kevin Kurányi, German footballer\n*  1982   – Henrik Lundqvist, Swedish ice hockey player\n*  1982   – Ben Roethlisberger, American football player\n*  1982   – Corey Webster, American football player\n*1983 – Deuce, American singer-songwriter and producer \n*  1983   – Lisandro López, Argentinian footballer\n*  1983   – Jay McClement, Canadian ice hockey player\n*  1983   – Glen Perkins, American baseball player\n*  1983   – Ryan Shannon, American ice hockey player\n*1985 – Reggie Bush, American football player\n*  1985   – Suso Santana, Spanish footballer\n*1986 – Jonathan D'Aversa, Canadian ice hockey player\n*1987 – Jonas Jerebko, Swedish basketball player\n*1988 – Édgar Andrade, Mexican footballer\n*  1988   – James Arthur, English singer-songwriter\n*  1988   – Laura Kaeppeler, Miss America 2012\n*  1988   – Matthew Mitcham, Australian diver\n*  1988   – Chris Rainey, American football player\n*  1988   – Geert Arend Roorda, Dutch footballer\n*1989 – Alemão, Brazilian footballer\n*  1989   – Toby Alderweireld, Belgian footballer\n*  1989   – André Bernardes Santos, Portuguese footballer\n*  1989   – Marcel Hirscher, Austrian skier\n*  1989   – Shane Vereen, American football player\n*  1989   – Chris Woakes, English cricketer\n*1990 – Rauno Alliku, Estonian footballer\n*  1990   – Malcolm Butler, American football player\n*  1990   – Josh McGuire, Australian rugby league player\n*  1991   – Nick Franklin, American baseball player\n*1992 – Jack Stockwell, Australian rugby league player\n*1995 – Ange-Freddy Plumain, French footballer\n*2016 – Prince Oscar, duke of Skåne and prince of Sweden\n\nDeaths\n\n* 274 – Mani, Persian prophet and founder of Manichaeism (b. 216)\n* 672 – Chad of Mercia, English bishop and saint (b. 634)\n* 986 – Lothair, king of West Francia (b.941)\n* 968 – William, archbishop of Mainz (b. 929)\n*1316 – Marjorie Bruce, Scottish daughter of Robert the Bruce (b. 1296)\n*1333 – Wladyslaw I, king of Poland (b. 1261)\n*1589 – Alessandro Farnese, Italian cardinal and diplomat (b. 1520)\n*1619 – Anne of Denmark (b. 1574)\n*1729 – Francesco Bianchini, Italian astronomer and philosopher (b. 1662)\n*1755 – Louis de Rouvroy, duc de Saint-Simon, French duke and diplomat (b. 1675)\n*1791 – John Wesley, English cleric and theologian (b. 1703)\n*1793 – Carl Gustaf Pilo, Swedish-Danish painter and academic (b. 1711)\n*1797 – Horace Walpole, English historian and politician (b. 1717)\n*1830 – Samuel Thomas von Sömmerring, German physician, anatomist, and anthropologist (b. 1755)\n*1835 – Francis II, Holy Roman Emperor (b. 1768)\n*1840 – Heinrich Wilhelm Matthias Olbers, German physician and astronomer (b. 1758)\n*1855 – Nicholas I of Russia (b. 1796)\n*1864 – Ulric Dahlgren, American colonel (b. 1842)\n*1865 – Carl Sylvius Völkner, German-New Zealand priest and missionary (b. 1819)\n*1880 – John Benjamin Macneill, Irish engineer (b. 1790)\n*1895 – Berthe Morisot, French painter (b. 1841)\n*  1895   – Isma'il Pasha, Egyptian politician (b. 1830)\n*1896 – Jubal Early, American general (b. 1816)\n*1919 – Melchora Aquino, Filipino activist (b. 1812)\n*1921 – Champ Clark, American lawyer and politician, 41st Speaker of the United States House of Representatives (b. 1850)\n*1930 – D. H. Lawrence, English novelist, poet, playwright, and critic (b. 1885)\n*1938 – Ben Harney, American pianist and composer (b. 1871)\n*1939 – Howard Carter, English archaeologist and historian (b. 1874)\n*1943 – Gisela Januszewska, Jewish-Austrian physician (b.1867)\n*1945 – Emily Carr, Canadian painter and author (b. 1871)\n*1946 – Fidél Pálffy, Hungarian politician, Hungarian Minister of Agriculture (b. 1895)\n*  1946   – George E. Stewart, American colonel, Medal of Honor recipient (b. 1872)\n*1947 – Frans Johan Louwrens Ghijsels, Dutch architect and urban planner (b. 1882)\n*1949 – Sarojini Naidu, Indian poet and activist (b. 1879)\n*1953 – James Lightbody, American runner (b. 1882)\n*1957 – Selim Sırrı Tarcan, Turkish educator and politician (b. 1874)\n*1958 – Fred Merkle, American baseball player and manager (b. 1888)\n*1962 – Charles Jean de la Vallée-Poussin, Belgian mathematician and academic (b. 1866)\n*1967 – José Martínez Ruiz, Spanish author and critic (b. 1873)\n*1972 – Léo-Ernest Ouimet, Canadian director and producer (b. 1877)\n*1979 – Christy Ring, Irish hurler (b. 1920)\n*1982 – Philip K. Dick, American philosopher and author (b. 1928)\n*1987 – Randolph Scott, American actor and director (b. 1898)\n*  1987   – Lolo Soetoro, Indonesian geographer and academic (b. 1935)\n*1991 – Serge Gainsbourg, French singer-songwriter, actor, and director (b. 1928)\n*1992 – Sandy Dennis, American actress (b. 1937)\n*1994 – Anita Morris, American actress, singer, and dancer (b. 1943)\n*1999 – Dusty Springfield, English singer (b. 1939)\n*2003 – Hank Ballard, American singer-songwriter (b. 1927)\n*  2003   – Malcolm Williamson, Australian pianist and composer (b. 1931)\n*2004 – Cormac McAnallen, Irish footballer (b. 1980)\n*  2004   – Mercedes McCambridge, American actress (b. 1916)\n*  2004   – Marge Schott, American businesswoman (b. 1928)\n*2005 – Martin Denny, American pianist and composer (b. 1911)\n*2007 – Thomas S. Kleppe, American soldier and politician, 41st United States Secretary of the Interior (b. 1919)\n*  2007   – Clem Labine, American baseball player (b. 1926)\n*  2007   – Ivan Safronov, Russian colonel and journalist (b. 1956)\n*  2007   – Henri Troyat, Russian-French historian and author (b. 1911)\n*2008 – Jeff Healey, Canadian singer-songwriter and guitarist (b. 1966)\n*2009 – João Bernardo Vieira, Bissau-Guinean politician, President of Guinea-Bissau (b. 1939)\n*2010 – Winston Churchill, English journalist and politician (b. 1940)\n*2012 – Lawrence Anthony, South African environmentalist, explorer, and author (b. 1950)\n*  2012   – Van T. Barfoot, American colonel, Medal of Honor recipient (b. 1919)\n*  2012   – Norman St John-Stevas, English academic and politician, Chancellor of the Duchy of Lancaster (b. 1929)\n*  2012   – James Q. Wilson, American political scientist and academic (b. 1931)\n*2013 – Peter Harvey, Australian journalist (b. 1944)\n*  2013   – Giorgos Kolokithas, Greek basketball player (b. 1945)\n*  2013   – Shabnam Shakeel, Pakistani poet and author (b. 1942)\n*2014 – Ryhor Baradulin, Belarusian poet and translator (b. 1935)\n*2015 – Dean Hess, American minister and colonel (b. 1917)\n*  2015   – Dave Mackay, Scottish-English footballer and manager (b. 1934)\n*  2015   – Mal Peet, English author and illustrator (b. 1947)\n*2016 – Benoît Lacroix, Canadian priest, historian, and philosopher (b. 1915)\n*  2016   – Aubrey McClendon, American businessman (b. 1959)\n\nHolidays and observances\n\n*Christian feast day:\n**Agnes of Bohemia\n**Angela of the Cross\n**Blessed Charles the Good, Count of Flanders\n**Chad of Mercia (Catholic Church, Anglican Communion, Eastern Orthodox Church)\n**John Maron \n**March 2 (Eastern Orthodox liturgics)\n*Feast of 'Alá (Loftiness), First day of the 19th month of the Bahá'í calendar (Bahá'í Faith) and first day of the Baha'i Nineteen Day Fast\n*Air Force Day (Sri Lanka)\n*Jamahiriya Day (Libya)\n*Peasants' Day (Burma)\n*Texas Independence Day\n*Victory at Adwa Day (Ethiopia)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "March 2" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19516" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* 537 – Siege of Rome: The Ostrogoth army under king Vitiges begins the siege of the capital. Belisarius conducts a delaying action outside the Flaminian Gate; he and a detachment of his bucellarii are almost cut off.\n* 986 – Louis V becomes King of the Franks.\n*1127 – Assassination of Charles the Good, Count of Flanders.\n*1444 – Skanderbeg organizes a group of Albanian nobles to form the League of Lezhë.\n*1458 – George of Poděbrady is chosen as the king of Bohemia.\n*1476 – Burgundian Wars: The Old Swiss Confederacy hands Charles the Bold, Duke of Burgundy, a major defeat in the Battle of Grandson in Canton of Neuchâtel.\n*1484 – The College of Arms is formally incorporated by Royal Charter signed by King Richard III of England.\n*1498 – Vasco da Gama's fleet visits the Island of Mozambique.\n*1561 – Mendoza, Argentina is founded by Spanish conquistador Pedro del Castillo.\n*1657 – Great Fire of Meireki: A fire in Edo (now Tokyo), Japan, caused more than 100,000 deaths; it lasted three days\n*1717 – The Loves of Mars and Venus is the first ballet performed in England.\n*1776 – American Revolutionary War: Patriot militia units arrest the Royal Governor of Georgia James Wright and attempt to prevent capture of supply ships in the Battle of the Rice Boats.\n*1791 – Long-distance communication speeds up with the unveiling of a semaphore machine in Paris.\n*1797 – The Bank of England issues the first one-pound and two-pound banknotes.\n*1807 – The U.S. Congress passes the Act Prohibiting Importation of Slaves, disallowing the importation of new slaves into the country.\n*1808 – The inaugural meeting of the Wernerian Natural History Society, a former Scottish learned society, is held in Edinburgh.\n*1811 – Argentine War of Independence: A royalist fleet defeats a small flotilla of revolutionary ships in the Battle of San Nicolás on the River Plate.\n*1815 – Signing of the Kandyan Convention treaty by British invaders and the leaders of the Kingdom of Kandy.\n*1825 – Roberto Cofresí, one of the last successful Caribbean pirates, is defeated in combat and captured by authorities.\n*1836 – Texas Revolution: The Declaration of independence of the Republic of Texas from Mexico is adopted.\n*1855 – Alexander II becomes Tsar of Russia.\n*1859 – The two-day Great Slave Auction, the largest such auction in United States history, begins.\n*1865 – East Cape War: The Völkner Incident in New Zealand.\n*1867 – The U.S. Congress passes the first Reconstruction Act.\n*1877 – U.S. presidential election, 1876: Just two days before inauguration, the U.S. Congress declares Rutherford B. Hayes the winner of the election even though Samuel J. Tilden had won the popular vote on November 7, 1876.\n*1882 – Queen Victoria narrowly escapes an assassination attempt by Roderick McLean in Windsor.\n*1896 – Ethiopian victory over the Italian forces in the Battle of Adwa.\n*1901 – United States Steel Corporation is founded as a result of a merger between Carnegie Steel Company and Federal Steel Company which became the first corporation in the world with a market capital over $1 billion.\n*1901 – The U.S. Congress passes the Platt Amendment limiting the autonomy of Cuba, as a condition of the withdrawal of American troops.\n*1903 – In New York City the Martha Washington Hotel opens, becoming the first hotel exclusively for women.\n*1917 – The enactment of the Jones–Shafroth Act grants Puerto Ricans United States citizenship.\n*1919 – The first Communist International meets in Moscow.\n*1933 – The film King Kong opens at New York's Radio City Music Hall.\n*1937 – The Steel Workers Organizing Committee signs a collective bargaining agreement with U.S. Steel, leading to unionization of the United States steel industry.\n*1939 – Cardinal Eugenio Pacelli is elected Pope and takes the name Pius XII.\n*1941 – World War II: First German military units enter Bulgaria after it joins the Axis Pact.\n*1943 – World War II: Battle of the Bismarck Sea: United States and Australian forces sink Japanese convoy ships.\n*1946 – Ho Chi Minh is elected the President of North Vietnam.\n*1949 – Captain James Gallagher lands his B-50 Superfortress Lucky Lady II in Fort Worth, Texas after completing the first non-stop around-the-world airplane flight in 94 hours and one minute.\n*1955 – Norodom Sihanouk, king of Cambodia, abdicates the throne in favor of his father, Norodom Suramarit.\n*1956 – Morocco gains its independence from France.\n*1961 – John F. Kennedy announces the creation of the Peace Corps in a nationally televised broadcast.\n*1962 – In Burma, the army led by General Ne Win seizes power in a coup d'état.\n*  1962   – Wilt Chamberlain sets the single-game scoring record in the National Basketball Association by scoring 100 points.\n*1965 – The US and Republic of Vietnam Air Force begin Operation Rolling Thunder, a sustained bombing campaign against North Vietnam.\n*1968 – Baggeridge Colliery closes marking the end of over 300 years of coal mining in the Black Country.http://www.blackcountrysociety.co.uk/articles/baggeridge2.htm\n*1969 – In Toulouse, France, the first test flight of the Anglo-French Concorde is conducted.\n*1970 – Rhodesia declares itself a republic, breaking its last links with the British crown.\n*1972 – The Pioneer 10 space probe is launched from Cape Canaveral, Florida with a mission to explore the outer planets.\n*1977 – Libya becomes the Socialist People's Libyan Arab Jamahiriya as the General People's Congress adopted the \"Declaration on the Establishment of the Authority of the People\".\n*1978 – Czech Vladimír Remek becomes the first non-Russian or non-American to go into space, when he is launched aboard Soyuz 28.\n*1983 – Compact discs and players are released for the first time in the United States and other markets. They had previously been available only in Japan.\n*1989 – Twelve European Community nations agree to ban the production of all chlorofluorocarbons (CFCs) by the end of the century.\n*1990 – Nelson Mandela is elected deputy President of the African National Congress.\n*1991 – Battle at Rumaila oil field brings an end to the 1991 Gulf War.\n*1992 – Armenia, Azerbaijan, Kazakhstan, Kyrgyzstan, Moldova, San Marino, Tajikistan, Turkmenistan and Uzbekistan join the United Nations.\n*1995 – Researchers at Fermilab announce the discovery of the top quark.\n*1998 – Data sent from the Galileo spacecraft indicates that Jupiter's moon Europa has a liquid ocean under a thick crust of ice.\n*2002 – U.S. invasion of Afghanistan: Operation Anaconda begins, (ending on March 19 after killing 500 Taliban and al-Qaeda fighters, with 11 Western troop fatalities).\n*2004 – War in Iraq: Al-Qaeda carries out the Ashoura Massacre in Iraq, killing 170 and wounding over 500.\n*2012 – A tornado outbreak occurred over a large section of the Southern United States and into the Ohio Valley region, resulting in 40 tornado-related fatalities\n*2017 – The elements Moscovium, Tennessine, and Oganesson were officially added to the periodic table at a conference in Moscow, Russia\n\nBirths\n\n* 480 – Benedict of Nursia, Italian Christian saint (d. 543 or 547)\n*1316 – Robert II of Scotland (d. 1390)\n*1409 – Jean II, Duke of Alençon (d. 1476)\n*1432 – Countess Palatine Margaret of Mosbach, countess consort of Hanau (d. 1457)\n*1453 – Johannes Engel, German doctor, astronomer and astrologer (d. 1512)\n*1459 – Pope Adrian VI (d. 1523)\n*1481 – Franz von Sickingen, German knight (d. 1523)\n*1545 – Thomas Bodley, English diplomat and scholar, founded the Bodleian Library (d. 1613)\n*1577 – George Sandys, English traveller, colonist and poet (d. 1644)\n*1628 – Cornelis Speelman, Governor-General of the Dutch East Indies (d. 1684)\n*1651 – Carlo Gimach, Maltese architect, engineer and poet (d. 1730)\n*1705 – William Murray, 1st Earl of Mansfield, Scottish lawyer, judge, and politician, Chancellor of the Exchequer (d. 1793)\n*1740 – Nicholas Pocock, English sea painter (d.1821)\n*1760 – Camille Desmoulins, French journalist and politician (d. 1794)\n*1769 – DeWitt Clinton, American lawyer and politician, 6th Governor of New York (d. 1828)\n*1770 – Louis-Gabriel Suchet, French general (d. 1826)\n*1779 – Joel Roberts Poinsett, American physician and politician, 15th United States Secretary of War (d. 1851)\n*1793 – Sam Houston, American soldier and politician, 1st President of the Republic of Texas (d. 1863)\n*1800 – Yevgeny Baratynsky, Russian-Italian poet and philosopher (d. 1844)\n*1810 – Pope Leo XIII (d. 1903)\n*1816 – Alexander Bullock, American lawyer and politician, 26th Governor of Massachusetts (d. 1882)\n*1817 – János Arany, Hungarian journalist and poet (d. 1882)\n*1820 – Multatuli, Dutch writer (d. 1887)\n*1824 – Bedřich Smetana, Czech pianist and composer (d. 1884)\n*1829 – Carl Schurz, German-American general, lawyer, and politician, 13th United States Secretary of the Interior (d. 1906)\n*1836 – Henry Billings Brown, American lawyer and judge (d. 1913)\n*1842 – Carl Jacobsen, Danish brewer, art collector, and philanthropist (d. 1914)\n*1846 – Marie Roze, French soprano (d. 1926)\n*1849 – Robert Means Thompson, American commander, lawyer, and businessman (d. 1930)\n*1859 – Sholem Aleichem, Ukrainian-American author and playwright (d. 1916)\n*1860 – Susanna M. Salter, American activist and politician (d. 1961)\n*1862 – John Jay Chapman, American lawyer, author, and poet (d. 1933)\n*1876 – Pope Pius XII (d. 1958)\n*1878 – William Kissam Vanderbilt II, American sailor and race car driver (d. 1944)\n*1886 – Willis H. O'Brien, American animator and director (d. 1962)\n*  1886   – Kurt Grelling, German logician and philosopher (d. 1942)\n*1900 – Kurt Weill, German-American pianist and composer (d. 1950)\n*1901 – Grete Hermann, German mathematician and philosopher (d. 1984)\n*1902 – Moe Berg, American baseball player and spy (d. 1972)\n*  1902   – Edward Condon, American physicist and academic (d. 1974)\n*1904 – Dr. Seuss, American children's book writer, poet, and illustrator (d. 1991)\n*1905 – Marc Blitzstein, American composer and songwriter (d. 1964)\n*  1905   – Geoffrey Grigson, English poet and critic (d. 1985)\n*1908 – Walter Bruch, German engineer (d. 1990)\n*1909 – Mel Ott, American baseball player, manager, and sportscaster (d. 1958)\n*1912 – Henry Katzman, American pianist, composer, and painter (d. 2001)\n*1913 – Godfried Bomans, Flemish television host and author (d. 1971)\n*  1913   – Mort Cooper, American baseball player (d. 1958)\n*1914 – Martin Ritt, American actor and film director (d. 1990)\n*1915 – John Burton, Australian public servant and diplomat, Australian High Commissioner to Ceylon (d. 2010)\n*1917 – Desi Arnaz, Cuban-American actor, singer, and producer (d. 1986)\n*  1917   – David Goodis, American author and screenwriter (d. 1967)\n*  1917   – Jim Konstanty, American baseball player and coach (d. 1976)\n*1919 – Jennifer Jones, American actress (d. 2009)\n*  1919   – Eddie Lawrence, American actor, singer, and playwright (d. 2014)\n*  1919   – Tamara Toumanova, American ballerina and actress (d. 1996)\n*1921 – Kazimierz Górski, Polish footballer and coach (d. 2006)\n*  1921   – Ernst Haas, Austrian-American photographer and journalist (d. 1986)\n*1922 – Eddie \"Lockjaw\" Davis, American saxophonist (d. 1986)\n*  1922   – Bill Quackenbush, Canadian-American ice hockey player and coach (d. 1999)\n*  1922   – Frances Spence, American computer programmer (d. 2012)\n*1923 – Basil Hume, English cardinal (d. 1999)\n*  1923   – Robert H. Michel, American soldier and politician (d. 2017)\n*  1923   – Dave Strack, American basketball player and coach (d. 2014)\n*1924 – Cal Abrams, American baseball player (d. 1997)\n*  1924   – Renos Apostolidis, Greek philologist, author, and critic (d. 2004)\n*1926 – Bernard Agré, Ivorian cardinal (d. 2014)\n*  1926   – Murray Rothbard, American economist and historian (d. 1995)\n*1927 – Roger Walkowiak, French cyclist and economist (d. 2017)\n*1930 – John Cullum, American actor and singer\n*  1930   – Emma Penella, Spanish actress (d. 2007)\n*1931 – Mikhail Gorbachev, Russian lawyer and politician, President of the Soviet Union, Nobel Prize laureate\n*  1931   – Tom Wolfe, American journalist and author\n*1932 – Gun Hägglund, Swedish journalist and translator (d. 2011)\n*1934 – Dottie Rambo, American singer-songwriter (d. 2008)\n*1935 – Gene Stallings, American football player and coach\n*1936 – Haroon Ahmed, Pakistani-English engineer and academic\n*  1936   – John Tusa, Czech-English journalist and academic\n*1937 – Abdelaziz Bouteflika, Algerian soldier and politician, 5th President of Algeria\n*1938 – Ricardo Lagos, Chilean economist, lawyer, and politician, 33rd President of Chile\n*  1938   – Lawrence Payton, American singer-songwriter and producer (d. 1997)\n*  1938   – Clark Gesner, American author and composer (d. 2002)\n*1939 – Jan Howard Finder, American author and academic (d. 2013)\n*1940 – Mamnoon Hussain, Pakistani businessman and politician, 12th President of Pakistan\n*1941 – John Cornell, Australian actor, director, and producer\n*  1941   – David Satcher, American admiral and physician, 16th Surgeon General of the United States\n*1942 – John Irving, American novelist and screenwriter\n*  1942   – Claude Larose, Canadian ice hockey player and coach\n*  1942   – Mir-Hossein Mousavi, Iranian architect and politician, 79th Prime Minister of Iran\n*  1942   – Lou Reed, American singer-songwriter, guitarist, producer, and actor (d. 2013)\n*  1942   – Derek Woodley, English footballer (d. 2002)\n*1943 – George Layton, English actor, director, and screenwriter\n*  1943   – Peter Straub, American author and poet\n*  1943   – Robert Williams, American painter and cartoonist\n*1945 – Derek Watkins, English trumpet player and composer (d. 2013)\n*1947 – Nelson Ned, Brazilian singer-songwriter (d. 2014)\n*  1947   – Harry Redknapp, English footballer and manager\n*1948 – Larry Carlton, American guitarist and songwriter\n*  1948   – Rory Gallagher, Irish singer-songwriter, guitarist, and producer (d. 1995)\n*  1948   – Jeff Kennett, Australian journalist and politician, 43rd Premier of Victoria\n*1950 – Karen Carpenter, American singer (d. 1983)\n*1952 – Mark Evanier, American author and screenwriter\n*  1952   – Laraine Newman, American actress and comedian\n*1953 – Russ Feingold, American lawyer and politician\n*1954 – Ed Johnstone, Canadian ice hockey player and coach\n*1955 – Dale Bozzio, American pop-rock singer-songwriter\n*  1955   – Jay Osmond, American singer, drummer, actor, and TV/film producer\n*  1955   – Ken Salazar, American lawyer and politician, 50th United States Secretary of the Interior\n*  1955   – Steve Small, Australian cricketer\n*1956 – John Cowsill, American musician, songwriter, and producer \n*  1956   – Mark Evans, Australian rock bass player\n*1957 – Hossein Dehghan, Iranian general and politician, Iranian Minister of Defense\n*  1957   – Dito Tsintsadze, Georgian film director and screenwriter\n*  1957   – Mark Dean, American inventor and computer engineer\n*1958 – Kevin Curren, South African-American tennis player\n*  1958   – Ian Woosnam, English-Welsh golfer\n*1959 – Larry Stewart, American singer-songwriter and guitarist \n*1961 – Simone Young, Australian conductor, director, and composer\n*1962 – Jon Bon Jovi, American singer-songwriter, guitarist, producer, and actor \n*  1962   – Paul Farrelly, English journalist and politician\n*  1962   – Tom Nordlie, Norwegian footballer and coach\n*  1962   – Brendan O'Connor, Australian politician, Australian Minister for Employment\n*  1962   – Raimo Summanen, Finnish ice hockey player and coach\n*  1962   – Gabriele Tarquini, Italian race car driver\n*1963 – Alvin Youngblood Hart, American singer and guitarist\n*  1963   – Anthony Albanese, Australian politician, 15th Deputy Prime Minister of Australia\n*1964 – Laird Hamilton, American surfer and actor\n*  1964   – Mike Von Erich, American wrestler (d. 1987)\n*1965 – Ron Gant, American baseball player and journalist\n*  1965   – Lembit Öpik, Northern Irish politician\n*1966 – Simon Reevell, English lawyer and politician\n*1968 – Daniel Craig, English actor and producer\n*1970 – James Purnell, English politician, Secretary of State for Work and Pensions\n*  1970   – Ciriaco Sforza, Swiss footballer and manager\n*  1970   – Wibi Soerjadi, Dutch pianist and composer\n*1971 – Method Man, American rapper, record producer and actor \n*1972 – Mauricio Pochettino, Argentinian footballer and manager\n*1973 – Dejan Bodiroga, Serbian basketball player\n*  1973   – Trevor Sinclair, English footballer and manager\n*1974 – Hayley Lewis, Australian swimmer and television host\n*1975 – Daryl Gibson, New Zealand rugby player\n*1977 – Dominique Canty, American basketball player and coach\n*  1977   – Chris Martin, English singer-songwriter and producer \n*  1977   – Stephen Parry, English swimmer and sportscaster\n*  1977   – Andrew Strauss, South African-English cricketer\n*1978 – Gabby Eigenmann, Filipino actor and singer\n*  1978   – Lee Hodges, English footballer and manager\n*  1978   – Tomáš Kaberle, Czech ice hockey player\n*1979 – Damien Duff, Irish footballer\n*  1979   – Jim Troughton, English cricketer\n*  1979   – Nicky Weaver, English footballer\n*1980 – Chris Barker, English footballer and manager\n*  1980   – Rebel Wilson, Australian actress and screenwriter\n*1981 – Lance Cade, American wrestler (d. 2010)\n*  1981   – Bryce Dallas Howard, American actress \n*1982 – Kevin Kurányi, German footballer\n*  1982   – Henrik Lundqvist, Swedish ice hockey player\n*  1982   – Ben Roethlisberger, American football player\n*  1982   – Corey Webster, American football player\n*1983 – Deuce, American singer-songwriter and producer \n*  1983   – Lisandro López, Argentinian footballer\n*  1983   – Jay McClement, Canadian ice hockey player\n*  1983   – Glen Perkins, American baseball player\n*  1983   – Ryan Shannon, American ice hockey player\n*1985 – Reggie Bush, American football player\n*  1985   – Suso Santana, Spanish footballer\n*1986 – Jonathan D'Aversa, Canadian ice hockey player\n*1987 – Jonas Jerebko, Swedish basketball player\n*1988 – Édgar Andrade, Mexican footballer\n*  1988   – James Arthur, English singer-songwriter\n*  1988   – Laura Kaeppeler, Miss America 2012\n*  1988   – Matthew Mitcham, Australian diver\n*  1988   – Chris Rainey, American football player\n*  1988   – Geert Arend Roorda, Dutch footballer\n*1989 – Alemão, Brazilian footballer\n*  1989   – Toby Alderweireld, Belgian footballer\n*  1989   – André Bernardes Santos, Portuguese footballer\n*  1989   – Marcel Hirscher, Austrian skier\n*  1989   – Shane Vereen, American football player\n*  1989   – Chris Woakes, English cricketer\n*1990 – Rauno Alliku, Estonian footballer\n*  1990   – Malcolm Butler, American football player\n*  1990   – Josh McGuire, Australian rugby league player\n*  1991   – Nick Franklin, American baseball player\n*1992 – Jack Stockwell, Australian rugby league player\n*1995 – Ange-Freddy Plumain, French footballer\n*2016 – Prince Oscar, duke of Skåne and prince of Sweden\n\nDeaths\n\n* 274 – Mani, Persian prophet and founder of Manichaeism (b. 216)\n* 672 – Chad of Mercia, English bishop and saint (b. 634)\n* 986 – Lothair, king of West Francia (b.941)\n* 968 – William, archbishop of Mainz (b. 929)\n*1316 – Marjorie Bruce, Scottish daughter of Robert the Bruce (b. 1296)\n*1333 – Wladyslaw I, king of Poland (b. 1261)\n*1589 – Alessandro Farnese, Italian cardinal and diplomat (b. 1520)\n*1619 – Anne of Denmark (b. 1574)\n*1729 – Francesco Bianchini, Italian astronomer and philosopher (b. 1662)\n*1755 – Louis de Rouvroy, duc de Saint-Simon, French duke and diplomat (b. 1675)\n*1791 – John Wesley, English cleric and theologian (b. 1703)\n*1793 – Carl Gustaf Pilo, Swedish-Danish painter and academic (b. 1711)\n*1797 – Horace Walpole, English historian and politician (b. 1717)\n*1830 – Samuel Thomas von Sömmerring, German physician, anatomist, and anthropologist (b. 1755)\n*1835 – Francis II, Holy Roman Emperor (b. 1768)\n*1840 – Heinrich Wilhelm Matthias Olbers, German physician and astronomer (b. 1758)\n*1855 – Nicholas I of Russia (b. 1796)\n*1864 – Ulric Dahlgren, American colonel (b. 1842)\n*1865 – Carl Sylvius Völkner, German-New Zealand priest and missionary (b. 1819)\n*1880 – John Benjamin Macneill, Irish engineer (b. 1790)\n*1895 – Berthe Morisot, French painter (b. 1841)\n*  1895   – Isma'il Pasha, Egyptian politician (b. 1830)\n*1896 – Jubal Early, American general (b. 1816)\n*1919 – Melchora Aquino, Filipino activist (b. 1812)\n*1921 – Champ Clark, American lawyer and politician, 41st Speaker of the United States House of Representatives (b. 1850)\n*1930 – D. H. Lawrence, English novelist, poet, playwright, and critic (b. 1885)\n*1938 – Ben Harney, American pianist and composer (b. 1871)\n*1939 – Howard Carter, English archaeologist and historian (b. 1874)\n*1943 – Gisela Januszewska, Jewish-Austrian physician (b.1867)\n*1945 – Emily Carr, Canadian painter and author (b. 1871)\n*1946 – Fidél Pálffy, Hungarian politician, Hungarian Minister of Agriculture (b. 1895)\n*  1946   – George E. Stewart, American colonel, Medal of Honor recipient (b. 1872)\n*1947 – Frans Johan Louwrens Ghijsels, Dutch architect and urban planner (b. 1882)\n*1949 – Sarojini Naidu, Indian poet and activist (b. 1879)\n*1953 – James Lightbody, American runner (b. 1882)\n*1957 – Selim Sırrı Tarcan, Turkish educator and politician (b. 1874)\n*1958 – Fred Merkle, American baseball player and manager (b. 1888)\n*1962 – Charles Jean de la Vallée-Poussin, Belgian mathematician and academic (b. 1866)\n*1967 – José Martínez Ruiz, Spanish author and critic (b. 1873)\n*1972 – Léo-Ernest Ouimet, Canadian director and producer (b. 1877)\n*1979 – Christy Ring, Irish hurler (b. 1920)\n*1982 – Philip K. Dick, American philosopher and author (b. 1928)\n*1987 – Randolph Scott, American actor and director (b. 1898)\n*  1987   – Lolo Soetoro, Indonesian geographer and academic (b. 1935)\n*1991 – Serge Gainsbourg, French singer-songwriter, actor, and director (b. 1928)\n*1992 – Sandy Dennis, American actress (b. 1937)\n*1994 – Anita Morris, American actress, singer, and dancer (b. 1943)\n*1999 – Dusty Springfield, English singer (b. 1939)\n*2003 – Hank Ballard, American singer-songwriter (b. 1927)\n*  2003   – Malcolm Williamson, Australian pianist and composer (b. 1931)\n*2004 – Cormac McAnallen, Irish footballer (b. 1980)\n*  2004   – Mercedes McCambridge, American actress (b. 1916)\n*  2004   – Marge Schott, American businesswoman (b. 1928)\n*2005 – Martin Denny, American pianist and composer (b. 1911)\n*2007 – Thomas S. Kleppe, American soldier and politician, 41st United States Secretary of the Interior (b. 1919)\n*  2007   – Clem Labine, American baseball player (b. 1926)\n*  2007   – Ivan Safronov, Russian colonel and journalist (b. 1956)\n*  2007   – Henri Troyat, Russian-French historian and author (b. 1911)\n*2008 – Jeff Healey, Canadian singer-songwriter and guitarist (b. 1966)\n*2009 – João Bernardo Vieira, Bissau-Guinean politician, President of Guinea-Bissau (b. 1939)\n*2010 – Winston Churchill, English journalist and politician (b. 1940)\n*2012 – Lawrence Anthony, South African environmentalist, explorer, and author (b. 1950)\n*  2012   – Van T. Barfoot, American colonel, Medal of Honor recipient (b. 1919)\n*  2012   – Norman St John-Stevas, English academic and politician, Chancellor of the Duchy of Lancaster (b. 1929)\n*  2012   – James Q. Wilson, American political scientist and academic (b. 1931)\n*2013 – Peter Harvey, Australian journalist (b. 1944)\n*  2013   – Giorgos Kolokithas, Greek basketball player (b. 1945)\n*  2013   – Shabnam Shakeel, Pakistani poet and author (b. 1942)\n*2014 – Ryhor Baradulin, Belarusian poet and translator (b. 1935)\n*2015 – Dean Hess, American minister and colonel (b. 1917)\n*  2015   – Dave Mackay, Scottish-English footballer and manager (b. 1934)\n*  2015   – Mal Peet, English author and illustrator (b. 1947)\n*2016 – Benoît Lacroix, Canadian priest, historian, and philosopher (b. 1915)\n*  2016   – Aubrey McClendon, American businessman (b. 1959)\n\nHolidays and observances\n\n*Christian feast day:\n**Agnes of Bohemia\n**Angela of the Cross\n**Blessed Charles the Good, Count of Flanders\n**Chad of Mercia (Catholic Church, Anglican Communion, Eastern Orthodox Church)\n**John Maron \n**March 2 (Eastern Orthodox liturgics)\n*Feast of 'Alá (Loftiness), First day of the 19th month of the Bahá'í calendar (Bahá'í Faith) and first day of the Baha'i Nineteen Day Fast\n*Air Force Day (Sri Lanka)\n*Jamahiriya Day (Libya)\n*Peasants' Day (Burma)\n*Texas Independence Day\n*Victory at Adwa Day (Ethiopia). March 2. http://en.wikipedia.org/?curid=19516."
  }
}
