{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8964",
  "eid" : "eb954f00-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778474992,
  "textBody" : "The Daily Planet is a fictional broadsheet newspaper appearing in American comic books published by DC Comics, commonly in association with Superman. The newspaper was first mentioned in Action Comics #23 (April 1940).\n\nThe newspaper is based out of the fictional city of Metropolis, and employs Clark Kent, Lois Lane, and Jimmy Olsen, with Perry White as its editor-in-chief. In the Batman: Hush storyline, it is named a subsidiary of Wayne Entertainment. The building's original features appear to be based upon the Old Toronto Star Building, where Superman co-creator Joe Shuster was a newsboy when the Toronto Star was still called the Daily Star. Shuster has claimed that Metropolis was visually inspired by Toronto.[http://www.ctv.ca/servlet/ArticleNews/story/CTVNews/20060628/superman_returns_cdn_060628/20060628?hub\nEntertainment \"Superman Co-Creator has Humble Canadian Roots,\" CTV (Jan. 28, 2006).]. Retrieved July 25, 2007. However, over the years, Metropolis has served as a fictional analogue to New York City.Fleisher, Michael and Lincoln, Janet E. The Great Superman Book (Grand Central Publishing, 1978), pp. 223–225.\n\nThe newspaper is said to be located in the heart of Metropolis, at the corner of Fifth Street and Concord Lane. The Daily Planet building's most distinguishing and famous feature is the enormous globe that sits on top of the building.\n\nFictional history\n\nGolden and Silver Age\n\nWhen Superman first appeared in comics (specifically 1938's Action Comics #1), his alter ego Clark Kent worked for a newspaper named the Daily Star, under editor George Taylor. Superman co-creator Joe Shuster named the Daily Star after the Toronto Daily Star newspaper in Toronto, Ontario, which had been the newspaper that Shuster's parents received and for which Shuster had worked as a newsboy. It was not until later years that the fictional paper became the Daily Planet. (The real-world newspaper was called the Evening Star prior to 1899, the Toronto Daily Star is now known as the Toronto Star.)\n\nWhile choosing a name for the fictitious newspaper, consideration was given to combining the names of the Globe and Mail and the Daily Star to become The Daily Globe. But when the comic strip appeared, the newspaper's name was permanently  made the Daily Planet to avoid a name conflict with real newspapers. In Superman (volume 1) #5 (Summer 1940), the publisher of the Daily Planet is shown to be Burt Mason, a man who is determined to print the truth even when corrupt politician Alex Evell threatens him.  In Superman #6 (September–October 1940), Mason gives free printing equipment to The Gateston Gazette after its editor, Jim Tirrell, is killed and its equipment is destroyed by racketeers that Tirrell insisted on reporting.\n\nWhen DC made use of its multiverse means of continuity tracking between the early 1960s and mid-1980s, it was declared that the Daily Star was the newspapers name in the Golden Age or \"Earth-Two\" versions of Clark Kent, Lois Lane and Jimmy Olsen, while the Daily Planet was used in the Silver Age or \"Earth-One\" versions. The Clark Kent of Earth-Two eventually became the editor-in-chief of the Daily Star, something his Earth-One counterpart did not achieve.Superman Family #196 (July–August 1979)\n\nIn the Silver and Bronze Age universes, Clark's first contact with the Daily Planet came when reporter (and future editor) Perry White came to Smallville to write a story about Superboy, and wound up getting an interview where the Boy of Steel first revealed his extraterrestrial origins. The story resulted in Perry earning a Pulitzer Prize.New Adventures of Superboy #12 (December 1980) During Clark Kent's years in college, Perry White was promoted to editor-in-chief upon the retirement of the Daily Planets previous editor, the Earth-One version of George Taylor.Superman: The Secret Years #4 (May 1985)\n\nAfter graduating from Metropolis University with a degree in journalism, Clark Kent went to work at the Planet, and quickly met Lois Lane (who had been working there for some time already).Superman (vol. 1) #133 (November 1959) After Clark was hired, Jimmy Olsen joined the paper's staff.Superman’s Pal, Jimmy Olsen #36 (April 1959)\n\nIn 1971, the Daily Planet was purchased by Morgan Edge, president of the Galaxy Broadcasting System. Edge proceeded to integrate Metropolis television station WGBS-TV's studios into the Daily Planet building, and named Clark Kent as the anchor for the WGBS evening news.Superman (vol. 1) #233 (January 1971) Eventually, Clark's former schoolmate from Smallville Lana Lang joined Clark as a co-anchor.Superman (vol. 1) #317 (November 1977)\n\nAfter the 1985–1986 miniseries Crisis on Infinite Earths, many of these elements, including Morgan Edge buying the Daily Planet, were retroactively changed or eliminated from the Superman canon.\n\nPost-Crisis\n\nIn the post-Crisis comics' canon, years before Clark or Lois began working for the paper, Lex Luthor owned the Daily Planet. When Luthor, deciding to sell the paper, began taking bids for the Planet, Perry White convinced an international conglomerate, TransNational Enterprises, to buy the paper. They agreed to this venture with only one stipulation: that Perry White would become editor-in-chief. White had served as the Planet editor-in-chief ever since, barring the few times he was absent. During those times people such as Sam Foswell and Clark Kent have looked after the paper. Franklin Stern, an old friend of White's, became the Daily Planets publisher.\n\nThe Planet saw its share of rough times during White's tenure. For example, it had many violent worker strikes. The building itself, along with most of the city, was destroyed during the \"Fall of Metropolis\" storyline; it is only much later that it was restored by the efforts of various superheroes. The Planet building sustained heavy damages after the villain Doomsday's rampage. Later, Franklin Stern decided to put the paper up for sale. Lex Luthor, disliking the heavy criticism of himself and his company that the Planet became noted for, purchased the Daily Planet and subsequently closed the paper down. Luthor fired every employee of the newspaper except for four people: Simone D'Neige, Dirk Armstrong, Jimmy Olsen, and Lois Lane. As a final insult, Luthor saw to it that the Planet globe was unceremoniously dumped in the Metropolis landfill. In the Planets place emerged \"LexCom,\" a news-oriented Internet website that primarily catered to Luthor's views of \"quality journalism.\"\n\nAfter Lois Lane made a deal with Luthor where, in exchange for him returning the Planet to Perry, she would kill one story of his choosing with no questions asked, Luthor sold the Daily Planet to Perry White for the token sum of one dollar. The paper was quickly reinstated, rehiring all of its old staff. Some time later, ownership of the Planet fell into the hands of Bruce Wayne, where it has remained ever since.\n\nDuring the \"Y2K\" storyline (involving the city of Metropolis being infused with futuristic technology thanks to a descendant of the villain Brainiac), the Daily Planet building was \"upgraded\" along with the rest of Metropolis, and a holographic globe replaced the physical one. Eventually due to temporal instabilities caused by the B13 Virus, Metropolis and the Daily Planet building, globe and all, were restored to their former states.\n\nIn the current comics and media spinoffs, the Daily Planet is presented as a thoroughly modern news operation, including operating an Internet web site much like most large newspapers. The Planets reporters also have access to the best modern equipment to aid their work, though Perry White has often been shown as still favoring his manual typewriter. In 2008, it was said that Clark (at least in this era/continuity) uses a typewriter at his desk due to his powers causing minor interference in regular desktop computers.Action Comics Annual #11 (2008)\n\nDuring this era, the Planet's major competitors in Metropolis include the tabloid newspaper the Daily Star, WGBS-TV (which also employed Jimmy Olsen and Cat Grant for a time), and Lex Luthor's various media operations. A contemporary publication is Newstime Magazine, where Clark Kent worked as editor for a time. The publisher of Newstime is Colin Thornton, who is secretly the demon Satanus, an enemy of Superman's.\n\nSuperman: Birthright\n\nIn the Superman: Birthright limited series, the Daily Planets publisher was Quentin Galloway, an abrasive overbearing loudmouth who bullied Jimmy Olsen, and later Clark Kent, before being told off by Lois Lane, whom Galloway could not fire because of her star status.Bailey, Neal. [http://www.supermanhomepage.com/comics/comics.php?topic=articles/birthright \"Birthright\"! AKA Article 250: Let's Start Over Again...\" Superman Home Page (Aug. 3, 2004).] Accessed May 5, 2009. This was meant to be a new origin for Superman but one that applied to the Post-Crisis continuity, so later Planet history concerning Luthor temporarily owning it and other events still applied.\n\nPost-Infinite Crisis\n\nDuring the story Infinite Crisis, parts of the Post-Crisis history were altered. These changes were explained gradually over the next several years. The 2009 mini-series Superman: Secret Origin clarified the earlier history of the Planet in the new continuity. The story established that while Lex Luthor, in the revised history, owns every media in Metropolis and uses it to enforce his public image as a wealthy benefactor, the Planet had always stood free, refusing him ownership and even condemning his actions in editorials signed by Perry White himself. As a result, when Clark Kent is first inducted into the Planet, the newspaper was almost bankrupt, dilapidated and unable to afford new reporters.Superman: Secret Origin #3 (January 2010) This changed after Superman begins his career. Thanks to Superman granting exclusive interviews and photographs to Lois Lane and Jimmy Olsen when he debuts, the paper's circulation increased 700%.\n\nGeneral Sam Lane (Lois' father) attempted to capture Superman, seeing him as an alien threat. When he failed to do so, he forcibly shut down the Planet as part of an attempt to force Perry White and Lois to turn over any information they had on Superman that they haven't released to the public. Eventually, Superman turned the public to his favor and Sam Lane was seen in a bad light after his soldier John Corben AKA Metallo ruthlessly endangered civilians. These events lead to the people of Metropolis no longer looking at Lex Luthor as a savior and The Daily Planet becomes the city's top-selling paper, as well as a major player in media.\n\nIn Final Crisis #2, the villain Clayface triggers an explosion in The Daily Planet building, greatly damaging the offices, leaving many injured and at least one person dead. Lois Lane is hospitalized. Despite the chaos of Final Crisis and more than half of humanity being enslaved by evil, the newspaper continues to spread news and inform the public via a printing press in Superman's Fortress of Solitude. In Final Crisis #7, it is shown functioning once again.\n\nThe New 52\n\nWith the reboot of DC's line of comics in 2011, the Daily Planet was shown in the Superman comics as being bought by Morgan Edge and merged with the Galaxy Broadcasting System, similar to the Silver/Bronze Age continuity.Superman (vol. 3) #1 (September 2011) In Action Comics, it is revealed that in the new history/universe, Clark Kent begins his journalism career in Metropolis roughly six years before Galaxy Broadcasting merges with the Daily Planet. Along with being a writer for The Daily Star, partly because editor George Taylor was a friend of his adopted parents, Clark is an active blogger who speaks against political corruption and reports on the troubles of everyday citizens who are not often the focus of news media. While working at the Star, Clark meets Planet photographer Jimmy Olsen and the two become friends despite working at rival publications. Clark is also a great fan of Lois Lane's work at the Daily Planet, eventually meeting her through Jimmy. Months after Superman makes his public debut, Clark leaves The Daily Star on good terms and accepts a position at The Daily Planet.\n\nAfter the merger with Galaxy Broadcasting, Lois was promoted to run the TV division, with Clark acting as an on-the-scene reporter for the TV division. Clark is later assigned the \"Superman beat.\" But after rising tension between himself and Lois, as well as with Galaxy Broadcasting head Morgan Edge, Clark concludes that the Daily Planet is now more concerned with ratings and internet page views than actual journalism. He quits and goes off to begin an independent, internet news site with fellow journalist Cat Grant. Though Lois and Jimmy consider this to be a bad and risky decision, they continue to act as Clark's friends and confidants, offering aid when they can.\n\nAt the conclusion of the New 52, following the New 52 Superman's death, Lex Luthor buys the Daily Planet.Justice League Vol. 2 #52\n\n30th and 31st Centuries\n\nIn virtually every incarnation of the era inhabited by the Legion of Super-Heroes, the Daily Planet is depicted as a fixture in Metropolis, and one of Earth's major media sources. Frequently, the Flash's wife Iris West Allen (a native of the era) is depicted as a member of its staff or editorial board.\n\nFictional employees\n\nDaily Planet's staff at various times included:\n* Clark Kent - Reporter\n* Lois Lane - Reporter\n* Jimmy Olsen - Photographer and Cub Reporter\n* Perry White - Editor-in-Chief\n* Lana Lang - Business Columnist and editor\n* Cat Grant - Gossip Columnist and editor\n* Ron Troupe - Political Columnist and editor\n* Steve Lombard - Sports columnist and editor\n\nIn other media\n\nThe Daily Planet has been featured in all adaptations of Superman to other media.\n*From 1976-1981, the Daily Planet was a promotional page appearing in regular DC publications (similar to Marvel Comics' Bullpen Bulletins), featuring previews of upcoming publications set in the format of a page from the titular newspaper. Notable features of the page were \"The Answer Man\", where DC writer/editor Bob Rozakis would answer questions sent in by readers, and a comic strip by cartoonist Fred Hembeck poking fun at DC characters.Voiles, Mike. [http://www.dcindexes.com/planet/weeklyplanet.php?issue=2 \"Daily Planet Remembered,\" Mike's Amazing World of DC Comics, DCIndexes.com.]\n*A 16-page \"Special Invasion Edition\" of The Daily Planet was published by DC in November 1988 as a tie-in to the Invasion! crossover event,Kimball, Kirk. [http://www.dialbforblog.com/archives/372/ \"Present at the Creation,\" Dial B for Blog (Oct. 10, 2006).] ostensibly the same edition of the paper shown on the final page of Invasion! #1.[http://www.sequart.com/columns/index.php?col12&column\n926 \"The DC Canon: Invasion!\", Sequart Research & Literacy Organization] \n\nLive-action television\n\n*During most of the 1950s television series Adventures of Superman, the Daily Planet exterior was Los Angeles City Hall.\n*Lois and Clark: The New Adventures of Superman introduced the idea of a smaller globe above the building's entrance (the rooftop was never shown). At the end of the first season the paper was bought and closed down by Luthor (as would later happen in the comics). Its relaunch was funded by Metropolis businessman Franklin Stern.\n* In the 2000s live-action television series Smallville, the Daily Planet building is located across the street from the LuthorCorp building. One of the main characters of Smallville, Chloe Sullivan, worked in the basement of the Planet (seasons 5-7). Her cousin Lois Lane continues to work there, as did Chloe's on again/off again love interest (and eventual husband) Jimmy Olsen until his death at the end of season 8. Clark Kent started to work at the Daily Planet as a copy boy in the show's eighth season, but eventually worked his way up to a reporter in the ninth season. In episode 10 of the 6th season a street sign is shown as Chloe (Allison Mack) runs out of the Daily Planet from Linda Lake (Tori Spelling) and shows that the Planet is located at 355 Burrard St. Smallville also features the Daily Star as a separate newspaper, which was first seen in \"Icarus\".\n* The Daily Planet was mentioned in the pilot episode of Supergirl.\n\nFilms\n\n*In 1978's Superman and its sequels, the Daily Planet exterior was the New York Daily News building. The globe, which used to be on the top of the building, was apparently replaced with one in the lobby as to make room for a helipad on the roof. In fact, The Daily News building in New York has featured a globe in its lobby for almost all of its history. The real-life Daily News was headquartered in The News Building until the mid-1990s.\n*The 2006 Superman Returns movie has redesigned the Daily Planet as a completely computer generated image of a fictional building inserted into the Empire State Building skyline.\n*In the 2013 film Man of Steel the Daily Planet exterior was filmed in the Chicago Board of Trade Building. The interior was filmed in the Willis Tower.http://www.chicagobusiness.com/article/20110907/NEWS07/110909951/willis-tower-cbot-building-star-in-superman-filming The Planet appears again in Batman v Superman: Dawn of Justice.\n\nAnimations\n\n* In Superman: The Animated Series, in the episode \"World's Finest Part 2\", it is mentioned that the Daily Planet has offices in Gotham City, as well when Lois Lane says she is transferring \"to the Planet's Gotham City bureau.\"\n*The Daily Planet appears in Superman: Doomsday.\n*The Daily Planet appears in Superman Unbound.\n*In Justice League: War, the Daily Planet building is seen in the background of a fight between Superman, Batman, and Green Lantern.\n\nVideo games\n\n* The Daily Planet appears as a stage in Mortal Kombat vs. DC Universe.\n* The Daily Planet appears in DC Universe Online. It is located in Downtown Metropolis and has been bottled up by Brainiac.\n* The Daily Planet building can be seen off in the distance in Batman Arkham Knight. Additionally, newspapers can be found outside a storage crate that say strange meteors have struck Smallville hinting at the discovery of Kryptonite.\n* The Daily Planet appears in Lego Dimensions where it is transported into the Back to the Future world by Lord Vortech.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Daily Planet" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8964" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Daily Planet is a fictional broadsheet newspaper appearing in American comic books published by DC Comics, commonly in association with Superman. The newspaper was first mentioned in Action Comics #23 (April 1940).\n\nThe newspaper is based out of the fictional city of Metropolis, and employs Clark Kent, Lois Lane, and Jimmy Olsen, with Perry White as its editor-in-chief. In the Batman: Hush storyline, it is named a subsidiary of Wayne Entertainment. The building's original features appear to be based upon the Old Toronto Star Building, where Superman co-creator Joe Shuster was a newsboy when the Toronto Star was still called the Daily Star. Shuster has claimed that Metropolis was visually inspired by Toronto.[http://www.ctv.ca/servlet/ArticleNews/story/CTVNews/20060628/superman_returns_cdn_060628/20060628?hub\nEntertainment \"Superman Co-Creator has Humble Canadian Roots,\" CTV (Jan. 28, 2006).]. Retrieved July 25, 2007. However, over the years, Metropolis has served as a fictional analogue to New York City.Fleisher, Michael and Lincoln, Janet E. The Great Superman Book (Grand Central Publishing, 1978), pp. 223–225.\n\nThe newspaper is said to be located in the heart of Metropolis, at the corner of Fifth Street and Concord Lane. The Daily Planet building's most distinguishing and famous feature is the enormous globe that sits on top of the building.\n\nFictional history\n\nGolden and Silver Age\n\nWhen Superman first appeared in comics (specifically 1938's Action Comics #1), his alter ego Clark Kent worked for a newspaper named the Daily Star, under editor George Taylor. Superman co-creator Joe Shuster named the Daily Star after the Toronto Daily Star newspaper in Toronto, Ontario, which had been the newspaper that Shuster's parents received and for which Shuster had worked as a newsboy. It was not until later years that the fictional paper became the Daily Planet. (The real-world newspaper was called the Evening Star prior to 1899, the Toronto Daily Star is now known as the Toronto Star.)\n\nWhile choosing a name for the fictitious newspaper, consideration was given to combining the names of the Globe and Mail and the Daily Star to become The Daily Globe. But when the comic strip appeared, the newspaper's name was permanently  made the Daily Planet to avoid a name conflict with real newspapers. In Superman (volume 1) #5 (Summer 1940), the publisher of the Daily Planet is shown to be Burt Mason, a man who is determined to print the truth even when corrupt politician Alex Evell threatens him.  In Superman #6 (September–October 1940), Mason gives free printing equipment to The Gateston Gazette after its editor, Jim Tirrell, is killed and its equipment is destroyed by racketeers that Tirrell insisted on reporting.\n\nWhen DC made use of its multiverse means of continuity tracking between the early 1960s and mid-1980s, it was declared that the Daily Star was the newspapers name in the Golden Age or \"Earth-Two\" versions of Clark Kent, Lois Lane and Jimmy Olsen, while the Daily Planet was used in the Silver Age or \"Earth-One\" versions. The Clark Kent of Earth-Two eventually became the editor-in-chief of the Daily Star, something his Earth-One counterpart did not achieve.Superman Family #196 (July–August 1979)\n\nIn the Silver and Bronze Age universes, Clark's first contact with the Daily Planet came when reporter (and future editor) Perry White came to Smallville to write a story about Superboy, and wound up getting an interview where the Boy of Steel first revealed his extraterrestrial origins. The story resulted in Perry earning a Pulitzer Prize.New Adventures of Superboy #12 (December 1980) During Clark Kent's years in college, Perry White was promoted to editor-in-chief upon the retirement of the Daily Planets previous editor, the Earth-One version of George Taylor.Superman: The Secret Years #4 (May 1985)\n\nAfter graduating from Metropolis University with a degree in journalism, Clark Kent went to work at the Planet, and quickly met Lois Lane (who had been working there for some time already).Superman (vol. 1) #133 (November 1959) After Clark was hired, Jimmy Olsen joined the paper's staff.Superman’s Pal, Jimmy Olsen #36 (April 1959)\n\nIn 1971, the Daily Planet was purchased by Morgan Edge, president of the Galaxy Broadcasting System. Edge proceeded to integrate Metropolis television station WGBS-TV's studios into the Daily Planet building, and named Clark Kent as the anchor for the WGBS evening news.Superman (vol. 1) #233 (January 1971) Eventually, Clark's former schoolmate from Smallville Lana Lang joined Clark as a co-anchor.Superman (vol. 1) #317 (November 1977)\n\nAfter the 1985–1986 miniseries Crisis on Infinite Earths, many of these elements, including Morgan Edge buying the Daily Planet, were retroactively changed or eliminated from the Superman canon.\n\nPost-Crisis\n\nIn the post-Crisis comics' canon, years before Clark or Lois began working for the paper, Lex Luthor owned the Daily Planet. When Luthor, deciding to sell the paper, began taking bids for the Planet, Perry White convinced an international conglomerate, TransNational Enterprises, to buy the paper. They agreed to this venture with only one stipulation: that Perry White would become editor-in-chief. White had served as the Planet editor-in-chief ever since, barring the few times he was absent. During those times people such as Sam Foswell and Clark Kent have looked after the paper. Franklin Stern, an old friend of White's, became the Daily Planets publisher.\n\nThe Planet saw its share of rough times during White's tenure. For example, it had many violent worker strikes. The building itself, along with most of the city, was destroyed during the \"Fall of Metropolis\" storyline; it is only much later that it was restored by the efforts of various superheroes. The Planet building sustained heavy damages after the villain Doomsday's rampage. Later, Franklin Stern decided to put the paper up for sale. Lex Luthor, disliking the heavy criticism of himself and his company that the Planet became noted for, purchased the Daily Planet and subsequently closed the paper down. Luthor fired every employee of the newspaper except for four people: Simone D'Neige, Dirk Armstrong, Jimmy Olsen, and Lois Lane. As a final insult, Luthor saw to it that the Planet globe was unceremoniously dumped in the Metropolis landfill. In the Planets place emerged \"LexCom,\" a news-oriented Internet website that primarily catered to Luthor's views of \"quality journalism.\"\n\nAfter Lois Lane made a deal with Luthor where, in exchange for him returning the Planet to Perry, she would kill one story of his choosing with no questions asked, Luthor sold the Daily Planet to Perry White for the token sum of one dollar. The paper was quickly reinstated, rehiring all of its old staff. Some time later, ownership of the Planet fell into the hands of Bruce Wayne, where it has remained ever since.\n\nDuring the \"Y2K\" storyline (involving the city of Metropolis being infused with futuristic technology thanks to a descendant of the villain Brainiac), the Daily Planet building was \"upgraded\" along with the rest of Metropolis, and a holographic globe replaced the physical one. Eventually due to temporal instabilities caused by the B13 Virus, Metropolis and the Daily Planet building, globe and all, were restored to their former states.\n\nIn the current comics and media spinoffs, the Daily Planet is presented as a thoroughly modern news operation, including operating an Internet web site much like most large newspapers. The Planets reporters also have access to the best modern equipment to aid their work, though Perry White has often been shown as still favoring his manual typewriter. In 2008, it was said that Clark (at least in this era/continuity) uses a typewriter at his desk due to his powers causing minor interference in regular desktop computers.Action Comics Annual #11 (2008)\n\nDuring this era, the Planet's major competitors in Metropolis include the tabloid newspaper the Daily Star, WGBS-TV (which also employed Jimmy Olsen and Cat Grant for a time), and Lex Luthor's various media operations. A contemporary publication is Newstime Magazine, where Clark Kent worked as editor for a time. The publisher of Newstime is Colin Thornton, who is secretly the demon Satanus, an enemy of Superman's.\n\nSuperman: Birthright\n\nIn the Superman: Birthright limited series, the Daily Planets publisher was Quentin Galloway, an abrasive overbearing loudmouth who bullied Jimmy Olsen, and later Clark Kent, before being told off by Lois Lane, whom Galloway could not fire because of her star status.Bailey, Neal. [http://www.supermanhomepage.com/comics/comics.php?topic=articles/birthright \"Birthright\"! AKA Article 250: Let's Start Over Again...\" Superman Home Page (Aug. 3, 2004).] Accessed May 5, 2009. This was meant to be a new origin for Superman but one that applied to the Post-Crisis continuity, so later Planet history concerning Luthor temporarily owning it and other events still applied.\n\nPost-Infinite Crisis\n\nDuring the story Infinite Crisis, parts of the Post-Crisis history were altered. These changes were explained gradually over the next several years. The 2009 mini-series Superman: Secret Origin clarified the earlier history of the Planet in the new continuity. The story established that while Lex Luthor, in the revised history, owns every media in Metropolis and uses it to enforce his public image as a wealthy benefactor, the Planet had always stood free, refusing him ownership and even condemning his actions in editorials signed by Perry White himself. As a result, when Clark Kent is first inducted into the Planet, the newspaper was almost bankrupt, dilapidated and unable to afford new reporters.Superman: Secret Origin #3 (January 2010) This changed after Superman begins his career. Thanks to Superman granting exclusive interviews and photographs to Lois Lane and Jimmy Olsen when he debuts, the paper's circulation increased 700%.\n\nGeneral Sam Lane (Lois' father) attempted to capture Superman, seeing him as an alien threat. When he failed to do so, he forcibly shut down the Planet as part of an attempt to force Perry White and Lois to turn over any information they had on Superman that they haven't released to the public. Eventually, Superman turned the public to his favor and Sam Lane was seen in a bad light after his soldier John Corben AKA Metallo ruthlessly endangered civilians. These events lead to the people of Metropolis no longer looking at Lex Luthor as a savior and The Daily Planet becomes the city's top-selling paper, as well as a major player in media.\n\nIn Final Crisis #2, the villain Clayface triggers an explosion in The Daily Planet building, greatly damaging the offices, leaving many injured and at least one person dead. Lois Lane is hospitalized. Despite the chaos of Final Crisis and more than half of humanity being enslaved by evil, the newspaper continues to spread news and inform the public via a printing press in Superman's Fortress of Solitude. In Final Crisis #7, it is shown functioning once again.\n\nThe New 52\n\nWith the reboot of DC's line of comics in 2011, the Daily Planet was shown in the Superman comics as being bought by Morgan Edge and merged with the Galaxy Broadcasting System, similar to the Silver/Bronze Age continuity.Superman (vol. 3) #1 (September 2011) In Action Comics, it is revealed that in the new history/universe, Clark Kent begins his journalism career in Metropolis roughly six years before Galaxy Broadcasting merges with the Daily Planet. Along with being a writer for The Daily Star, partly because editor George Taylor was a friend of his adopted parents, Clark is an active blogger who speaks against political corruption and reports on the troubles of everyday citizens who are not often the focus of news media. While working at the Star, Clark meets Planet photographer Jimmy Olsen and the two become friends despite working at rival publications. Clark is also a great fan of Lois Lane's work at the Daily Planet, eventually meeting her through Jimmy. Months after Superman makes his public debut, Clark leaves The Daily Star on good terms and accepts a position at The Daily Planet.\n\nAfter the merger with Galaxy Broadcasting, Lois was promoted to run the TV division, with Clark acting as an on-the-scene reporter for the TV division. Clark is later assigned the \"Superman beat.\" But after rising tension between himself and Lois, as well as with Galaxy Broadcasting head Morgan Edge, Clark concludes that the Daily Planet is now more concerned with ratings and internet page views than actual journalism. He quits and goes off to begin an independent, internet news site with fellow journalist Cat Grant. Though Lois and Jimmy consider this to be a bad and risky decision, they continue to act as Clark's friends and confidants, offering aid when they can.\n\nAt the conclusion of the New 52, following the New 52 Superman's death, Lex Luthor buys the Daily Planet.Justice League Vol. 2 #52\n\n30th and 31st Centuries\n\nIn virtually every incarnation of the era inhabited by the Legion of Super-Heroes, the Daily Planet is depicted as a fixture in Metropolis, and one of Earth's major media sources. Frequently, the Flash's wife Iris West Allen (a native of the era) is depicted as a member of its staff or editorial board.\n\nFictional employees\n\nDaily Planet's staff at various times included:\n* Clark Kent - Reporter\n* Lois Lane - Reporter\n* Jimmy Olsen - Photographer and Cub Reporter\n* Perry White - Editor-in-Chief\n* Lana Lang - Business Columnist and editor\n* Cat Grant - Gossip Columnist and editor\n* Ron Troupe - Political Columnist and editor\n* Steve Lombard - Sports columnist and editor\n\nIn other media\n\nThe Daily Planet has been featured in all adaptations of Superman to other media.\n*From 1976-1981, the Daily Planet was a promotional page appearing in regular DC publications (similar to Marvel Comics' Bullpen Bulletins), featuring previews of upcoming publications set in the format of a page from the titular newspaper. Notable features of the page were \"The Answer Man\", where DC writer/editor Bob Rozakis would answer questions sent in by readers, and a comic strip by cartoonist Fred Hembeck poking fun at DC characters.Voiles, Mike. [http://www.dcindexes.com/planet/weeklyplanet.php?issue=2 \"Daily Planet Remembered,\" Mike's Amazing World of DC Comics, DCIndexes.com.]\n*A 16-page \"Special Invasion Edition\" of The Daily Planet was published by DC in November 1988 as a tie-in to the Invasion! crossover event,Kimball, Kirk. [http://www.dialbforblog.com/archives/372/ \"Present at the Creation,\" Dial B for Blog (Oct. 10, 2006).] ostensibly the same edition of the paper shown on the final page of Invasion! #1.[http://www.sequart.com/columns/index.php?col12&column\n926 \"The DC Canon: Invasion!\", Sequart Research & Literacy Organization] \n\nLive-action television\n\n*During most of the 1950s television series Adventures of Superman, the Daily Planet exterior was Los Angeles City Hall.\n*Lois and Clark: The New Adventures of Superman introduced the idea of a smaller globe above the building's entrance (the rooftop was never shown). At the end of the first season the paper was bought and closed down by Luthor (as would later happen in the comics). Its relaunch was funded by Metropolis businessman Franklin Stern.\n* In the 2000s live-action television series Smallville, the Daily Planet building is located across the street from the LuthorCorp building. One of the main characters of Smallville, Chloe Sullivan, worked in the basement of the Planet (seasons 5-7). Her cousin Lois Lane continues to work there, as did Chloe's on again/off again love interest (and eventual husband) Jimmy Olsen until his death at the end of season 8. Clark Kent started to work at the Daily Planet as a copy boy in the show's eighth season, but eventually worked his way up to a reporter in the ninth season. In episode 10 of the 6th season a street sign is shown as Chloe (Allison Mack) runs out of the Daily Planet from Linda Lake (Tori Spelling) and shows that the Planet is located at 355 Burrard St. Smallville also features the Daily Star as a separate newspaper, which was first seen in \"Icarus\".\n* The Daily Planet was mentioned in the pilot episode of Supergirl.\n\nFilms\n\n*In 1978's Superman and its sequels, the Daily Planet exterior was the New York Daily News building. The globe, which used to be on the top of the building, was apparently replaced with one in the lobby as to make room for a helipad on the roof. In fact, The Daily News building in New York has featured a globe in its lobby for almost all of its history. The real-life Daily News was headquartered in The News Building until the mid-1990s.\n*The 2006 Superman Returns movie has redesigned the Daily Planet as a completely computer generated image of a fictional building inserted into the Empire State Building skyline.\n*In the 2013 film Man of Steel the Daily Planet exterior was filmed in the Chicago Board of Trade Building. The interior was filmed in the Willis Tower.http://www.chicagobusiness.com/article/20110907/NEWS07/110909951/willis-tower-cbot-building-star-in-superman-filming The Planet appears again in Batman v Superman: Dawn of Justice.\n\nAnimations\n\n* In Superman: The Animated Series, in the episode \"World's Finest Part 2\", it is mentioned that the Daily Planet has offices in Gotham City, as well when Lois Lane says she is transferring \"to the Planet's Gotham City bureau.\"\n*The Daily Planet appears in Superman: Doomsday.\n*The Daily Planet appears in Superman Unbound.\n*In Justice League: War, the Daily Planet building is seen in the background of a fight between Superman, Batman, and Green Lantern.\n\nVideo games\n\n* The Daily Planet appears as a stage in Mortal Kombat vs. DC Universe.\n* The Daily Planet appears in DC Universe Online. It is located in Downtown Metropolis and has been bottled up by Brainiac.\n* The Daily Planet building can be seen off in the distance in Batman Arkham Knight. Additionally, newspapers can be found outside a storage crate that say strange meteors have struck Smallville hinting at the discovery of Kryptonite.\n* The Daily Planet appears in Lego Dimensions where it is transported into the Back to the Future world by Lord Vortech. Daily Planet. http://en.wikipedia.org/?curid=8964."
  }
}
