{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=5693",
  "eid" : "d70f18e0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778440558,
  "textBody" : "Claude Elwood Shannon (April 30, 1916 – February 24, 2001) was an American mathematician, electrical engineer, and cryptographer known as \"the father of information theory\".\n\nShannon is noted for having founded information theory with a landmark paper, A Mathematical Theory of Communication, that he published in 1948. He is, perhaps, equally well known for founding digital circuit design theory in 1937, when—as a 21-year-old master's degree student at the Massachusetts Institute of Technology (MIT)—he wrote his thesis demonstrating that electrical applications of Boolean algebra could construct any logical, numerical relationship. Shannon contributed to the field of cryptanalysis for national defense during World War II, including his fundamental work on codebreaking and secure telecommunications.\n\nBiography\n\nChildhood\n\nShannon was born in Petoskey, Michigan and grew up in Gaylord, Michigan. His father, Claude, Sr. (1862–1934), a descendant of early settlers of New Jersey, was a self-made businessman, and for a while, a Judge of Probate. Shannon's mother, Mabel Wolf Shannon (1890–1945), was a language teacher, and also served as the principal of Gaylord High School.\n\nMost of the first 16 years of Shannon's life were spent in Gaylord, where he attended public school, graduating from Gaylord High School in 1932. Shannon showed an inclination towards mechanical and electrical things. His best subjects were science and mathematics. At home he constructed such devices as models of planes, a radio-controlled model boat and a barbed-wire telegraph system to a friend's house a half-mile away.[https://www.nytimes.com/2001/12/30/magazine/the-lives-they-lived-claude-shannon-b-1916-bit-player.html?mcubz=1 \"The Lives They Lived: Claude Shannon\", New York Times, 30 December 2001] While growing up, he also worked as a messenger for the Western Union company.\n\nHis childhood hero was Thomas Edison, who he later learned was a distant cousin. Both Shannon and Edison were descendants of John Ogden (1609–1682), a colonial leader and an ancestor of many distinguished people.[http://web.mit.edu/newsoffice/2001/shannon.html MIT Professor Claude Shannon dies; was founder of digital communications], MIT — News office, Cambridge, Massachusetts, February 27, 2001\n\nShannon was apolitical and an atheist.\n\nLogic circuits\n\nIn 1932, Shannon entered the University of Michigan, where he was introduced to the work of George Boole. He graduated in 1936 with two bachelor's degrees: one in electrical engineering and the other in mathematics.\n\nIn 1936, Shannon began his graduate studies in electrical engineering at MIT, where he worked on Vannevar Bush's differential analyzer, an early analog computer. While studying the complicated ad hoc circuits of this analyzer, Shannon designed switching circuits based on Boole's concepts. In 1937, he wrote his master's degree thesis, A Symbolic Analysis of Relay and Switching Circuits,Claude Shannon, [http://dspace.mit.edu/bitstream/handle/1721.1/11173/34541425-MIT.pdf?sequence\n2 \"A Symbolic Analysis of Relay and Switching Circuits,\"] unpublished MS Thesis, Massachusetts Institute of Technology, August 10, 1937. A paper from this thesis was published in 1938. In this work, Shannon proved that his switching circuits could be used to simplify the arrangement of the electromechanical relays that were used then in telephone call routing switches. Next, he expanded this concept, proving that these circuits could solve all problems that Boolean algebra could solve. In the last chapter, he presents diagrams of several circuits, including a 4-bit full adder.\n\nUsing this property of electrical switches to implement logic is the fundamental concept that underlies all electronic digital computers. Shannon's work became the foundation of digital circuit design, as it became widely known in the electrical engineering community during and after World War II. The theoretical rigor of Shannon's work superseded the ad hoc methods that had prevailed previously. Howard Gardner called Shannon's thesis \"possibly the most important, and also the most noted, master's thesis of the century.\"\n\nShannon received his Ph.D. degree from MIT in 1940. Vannevar Bush suggested that Shannon should work on his dissertation at the Cold Spring Harbor Laboratory, in order to develop a mathematical formulation for Mendelian genetics. This research resulted in Shannon's PhD thesis, called An Algebra for Theoretical Genetics. C. E. Shannon, \"An algebra for theoretical genetics,\" (Ph.D. Thesis, Massachusetts Institute of Technology, 1940), MIT-THESES//1940–3 [http://hdl.handle.net/1721.1/11174 Online text at MIT] — Contains a biography on pp. 64–65.\n\nIn 1940, Shannon became a National Research Fellow at the Institute for Advanced Study in Princeton, New Jersey. In Princeton, Shannon had the opportunity to discuss his ideas with influential scientists and mathematicians such as Hermann Weyl and John von Neumann, and he also had occasional encounters with Albert Einstein and Kurt Gödel. Shannon worked freely across disciplines, and this ability may have contributed to his later development of mathematical information theory.Erico Marui Guizzo, “[http://dspace.mit.edu/bitstream/handle/1721.1/39429/54526133-MIT.pdf?sequence=2 The Essential Message: Claude Shannon and the Making of Information Theory]” (M.S. Thesis, Massachusetts Institute of Technology, Dept. of Humanities, Program in Writing and Humanistic Studies, 2003), 14.\n\nWartime research\n\nShannon then joined Bell Labs to work on fire-control systems and cryptography during World War II, under a contract with section D-2 (Control Systems section) of the National Defense Research Committee (NDRC).\n\nShannon is credited with the invention of signal-flow graphs, in 1942. He discovered the topological gain formula while investigating the functional operation of an analog computer.\n\nFor two months early in 1943, Shannon came into contact with the leading British mathematician Alan Turing. Turing had been posted to Washington to share with the U.S. Navy's cryptanalytic service the methods used by the British Government Code and Cypher School at Bletchley Park to break the ciphers used by the Kriegsmarine U-boats in the north Atlantic Ocean. He was also interested in the encipherment of speech and to this end spent time at Bell Labs. Shannon and Turing met at teatime in the cafeteria. Turing showed Shannon his 1936 paper that defined what is now known as the \"Universal Turing machine\"; This impressed Shannon, as many of its ideas complemented his own.\n\nIn 1945, as the war was coming to an end, the NDRC was issuing a summary of technical reports as a last step prior to its eventual closing down. Inside the volume on fire control, a special essay titled Data Smoothing and Prediction in Fire-Control Systems, coauthored by Shannon, Ralph Beebe Blackman, and Hendrik Wade Bode, formally treated the problem of smoothing the data in fire-control by analogy with \"the problem of separating a signal from interfering noise in communications systems.\"David A. Mindell, Between Human and Machine: Feedback, Control, and Computing Before Cybernetics, (Baltimore: Johns Hopkins University Press), 2004, pp. 319-320. . In other words, it modeled the problem in terms of data and signal processing and thus heralded the coming of the Information Age.\n\nShannon's work on cryptography was even more closely related to his later publications on communication theory.David Kahn, The Codebreakers, rev. ed., (New York: Simon and Schuster), 1996, pp. 743–751. . At the close of the war, he prepared a classified memorandum for Bell Telephone Labs entitled \"A Mathematical Theory of Cryptography,\" dated September 1945. A declassified version of this paper was published in 1949 as \"Communication Theory of Secrecy Systems\" in the Bell System Technical Journal. This paper incorporated many of the concepts and mathematical formulations that also appeared in his A Mathematical Theory of Communication. Shannon said that his wartime insights into communication theory and cryptography developed simultaneously and that \"they were so close together you couldn’t separate them\".quoted in Kahn, The Codebreakers, p. 744. In a footnote near the beginning of the classified report, Shannon announced his intention to \"develop these results … in a forthcoming memorandum on the transmission of information.\"quoted in Erico Marui Guizzo, [http://dspace.mit.edu/bitstream/1721.1/39429/1/54526133.pdf \"The Essential Message: Claude Shannon and the Making of Information Theory,\"]  unpublished MS thesis, Massachusetts Institute of Technology, 2003, p. 21.\n\nWhile he was at Bell Labs, Shannon proved that the cryptographic one-time pad is unbreakable in his classified research that was later published in October 1949. He also proved that any unbreakable system must have essentially the same characteristics as the one-time pad: the key must be truly random, as large as the plaintext, never reused in whole or part, and be kept secret.Shannon, Claude (1949). \"Communication Theory of Secrecy Systems\". Bell System Technical Journal 28 (4): 656–715.\n\nInformation theory\n\nIn 1948, the promised memorandum appeared as \"A Mathematical Theory of Communication,\" an article in two parts in the July and October issues of the Bell System Technical Journal. This work focuses on the problem of how best to encode the information a sender wants to transmit. In this fundamental work, he used tools in probability theory, developed by Norbert Wiener, which were in their nascent stages of being applied to communication theory at that time. Shannon developed information entropy as a measure of the uncertainty in a message while essentially inventing the field of information theory.\n\nThe book, co-authored with Warren Weaver, The Mathematical Theory of Communication, reprints Shannon's 1948 article and Weaver's popularization of it, which is accessible to the non-specialist. Warren Weaver pointed out that the word information in communication theory is not related to what you do say, but to what you could say. That is, information is a measure of one's freedom of choice when one selects a message. Shannon's concepts were also popularized, subject to his own proofreading, in John Robinson Pierce's Symbols, Signals, and Noise.\n\nInformation theory's fundamental contribution to natural language processing and computational linguistics was further established in 1951, in his article \"Prediction and Entropy of Printed English\", showing upper and lower bounds of entropy on the statistics of English – giving a statistical foundation to language analysis. In addition, he proved that treating whitespace as the 27th letter of the alphabet actually lowers uncertainty in written language, providing a clear quantifiable link between cultural practice and probabilistic cognition.\n\nAnother notable paper published in 1949 is \"Communication Theory of Secrecy Systems\", a declassified version of his wartime work on the mathematical theory of cryptography, in which he proved that all theoretically unbreakable ciphers must have the same requirements as the one-time pad. He is also credited with the introduction of sampling theory, which is concerned with representing a continuous-time signal from a (uniform) discrete set of samples. This theory was essential in enabling telecommunications to move from analog to digital transmissions systems in the 1960s and later.\n\nHe returned to MIT to hold an endowed chair in 1956.\n\nTeaching at MIT\n\nIn 1956 Shannon joined the MIT faculty to work in the Research Laboratory of Electronics (RLE). He continued to serve on the MIT faculty until 1978.\n\nLater life\n\nShannon developed Alzheimer's disease and spent the last few years of his life in a nursing home in Massachusetts oblivious to the marvels of the digital revolution he had helped create. He died in 2001. He was survived by his wife, Mary Elizabeth Moore Shannon, his son, Andrew Moore Shannon, his daughter, Margarita Shannon, his sister, Catherine Shannon Kay, and his two granddaughters. His wife stated in his obituary that, had it not been for Alzheimer's disease, \"He would have been bemused\" by it all.\n\nHobbies and inventions\n\nOutside of his academic pursuits, Shannon was interested in juggling, unicycling, and chess. He also invented many devices, including a Roman numeral computer called THROBAC, juggling machines, and a flame-throwing trumpet. One of his more humorous devices was a box kept on his desk called the \"Ultimate Machine\", based on an idea by Marvin Minsky. Otherwise featureless, the box possessed a single switch on its side. When the switch was flipped, the lid of the box opened and a mechanical hand reached out, flipped off the switch, then retracted back inside the box. Renewed interest in the \"Ultimate Machine\" has emerged on YouTube and Thingiverse. In addition, he built a device that could solve the Rubik's Cube puzzle.\n\nShannon designed the Minivac 601, a digital computer trainer to teach business people about how computers functioned. It was sold by the Scientific Development Corp starting in 1961.\n\nHe is also considered the co-inventor of the first wearable computer along with Edward O. Thorp.[http://www1.cs.columbia.edu/graphics/courses/mobwear/resources/thorp-iswc98.pdf The Invention of the First Wearable Computer Online paper by Edward O. Thorp of Edward O. Thorp & Associates] The device was used to improve the odds when playing roulette.\n\nPersonal life\n\nShannon married Norma Levor, a wealthy, Jewish, left-wing intellectual in January 1940. The marriage ended in divorce after about a year. Levor later married Ben Barzman.\n\nShannon met his second wife Betty Shannon (née Mary Elizabeth Moore) when she was a numerical analyst at Bell Labs. They were married in 1949. Betty assisted Claude in building some of his most famous inventions.. \n\nClaude and Betty Shannon had three children, Robert James Shannon, Andrew Moore Shannon, and Margarita Shannon, and raised his family in Winchester, Massachusetts. Their oldest son, Robert Shannon, died in 1998 at the age of 45.\n\nTributes\n\nTo commemorate Shannon's achievements, there were celebrations of his work in 2001.\n\nThere are currently six statues of Shannon sculpted by Eugene Daub: one at the University of Michigan; one at MIT in the Laboratory for Information and Decision Systems; one in Gaylord, Michigan; one at the University of California, San Diego; one at Bell Labs; and another at AT&T Shannon Labs. After the breakup of the Bell System, the part of Bell Labs that remained with AT&T Corporation was named Shannon Labs in his honor.\n\nAccording to Neil Sloane, an AT&T Fellow who co-edited Shannon's large collection of papers in 1993, the perspective introduced by Shannon's communication theory (now called information theory) is the foundation of the digital revolution, and every device containing a microprocessor or microcontroller is a conceptual descendant of Shannon's publication in 1948:C. E. Shannon: A mathematical theory of communication. Bell System Technical Journal, vol. 27, pp. 379–423 and 623–656, July and October 1948 \"He's one of the great men of the century. Without him, none of the things we know today would exist. The whole digital revolution started with him.\"Bell Labs digital guru dead at 84 — Pioneer scientist led high-tech revolution (The Star-Ledger, obituary by Kevin Coughlin February 27, 2001) The unit shannon is named after Claude Shannon.\n\nA Mind at Play, a biography of Shannon written by Jimmy Soni and Rob Goodman, was published in 2017.\n\nOther work\n\nShannon's mouse\n\n\"Theseus\", created in 1950, was a magnetic mouse controlled by an electromechanical relay circuit that enabled it to move around a labyrinth of 25 squares. Its dimensions were the same as those of an average mouse. The maze configuration was flexible and it could be modified arbitrarily by rearranging movable partitions. The mouse was designed to search through the corridors until it found the target. Having travelled through the maze, the mouse could then be placed anywhere it had been before, and because of its prior experience it could go directly to the target. If placed in unfamiliar territory, it was programmed to search until it reached a known location and then it would proceed to the target, adding the new knowledge to its memory and learning new behavior. Shannon's mouse appears to have been the first artificial learning device of its kind.\n\nShannon's estimate for the complexity of chess\n\nIn 1949 Shannon completed a paper (published in March 1950) which estimates the game-tree complexity of chess, which is approximately 10120. This number is now often referred to as the \"Shannon number\", and is still regarded today as an accurate estimate of the game's complexity. The number is often cited as one of the barriers to solving the game of chess using an exhaustive analysis (i.e. brute force analysis).Dr. James Grime. [https://www.youtube.com/watch?v\nKm024eldY1A \"How many chess games are possible? (films by Brady Haran). MSRI, Mathematical Sciences\".] Numberphile, July 24, 2015.\n\nShannon's computer chess program\n\nOn March 9, 1949, Shannon presented a paper called \"Programming a Computer for playing Chess.\" The paper was presented at the National Institute for Radio Engineers Convention in New York. He described how to program a computer to play chess based on position scoring and move selection. He proposed basic strategies for restricting the number of possibilities to be considered in a game of chess. In March 1950 it was published in Philosophical Magazine, and is considered one of the first articles published on the topic of programming a computer for playing chess, and using a computer to solve the game.http://billwall.phpwebhosting.com/articles/computer_early_chess.htm His process for having the computer decide on which move to make was a minimax procedure, based on an evaluation function of a given chess position. Shannon gave a rough example of an evaluation function in which the value of the black position was subtracted from that of the white position. Material was counted according to the usual chess piece relative value (1 point for a pawn, 3 points for a knight or bishop, 5 points for a rook, and 9 points for a queen). He considered some positional factors, subtracting ½ point for each doubled pawn, backward pawn, and isolated pawn. Another positional factor in the evaluation function was mobility, adding 0.1 point for each legal move available. Finally, he considered checkmate to be the capture of the king, and gave the king the artificial value of 200 points. Quoting from the paper:\n\nThe coefficients .5 and .1 are merely the writer's rough estimate. Furthermore, there are many other terms that should be included. The formula is given only for illustrative purposes. Checkmate has been artificially included here by giving the king the large value 200 (anything greater than the maximum of all other terms would do).\n\nThe evaluation function was clearly for illustrative purposes, as Shannon stated. For example, according to the function, pawns that are doubled as well as isolated would have no value at all, which is clearly unrealistic.\n\nShannon's maxim\n\nShannon formulated a version of Kerckhoffs' principle as \"The enemy knows the system\". In this form it is known as \"Shannon's maxim\".\n\nCommemorations\n\nShannon Centenary\n\nThe Shannon Centenary, 2016, marked the life and influence of Claude Elwood Shannon on the hundredth anniversary of his birth on April 30, 1916. It was inspired in part by the Alan Turing Year. An ad hoc committee of the IEEE Information Theory Society including Christina Fragouli, Rüdiger Urbanke, Michelle Effros, Lav Varshney and Sergio Verdú, coordinated worldwide events. The initiative was announced in the History Panel at the 2015 IEEE Information Theory Workshop Jerusalem and the IEEE Information Theory Society Newsletter.\n\nA detailed listing of confirmed events was available on the website of the IEEE Information Theory Society.\n\nSome of the planned activities included:\n* Bell Labs hosted the First Shannon Conference on the Future of the Information Age on April 28 – 29, 2016 in Murray Hill, NJ to celebrate Claude Shannon and the continued impact of his legacy on society. The event includes keynote speeches by global luminaries and visionaries of the information age who will explore the impact of information theory on society and our digital future, informal recollections, and leading technical presentations on subsequent related work in other areas such as bioinformatics, economic systems, and social networks. There is also a student competition\n* Bell Labs launched a [https://www.bell-labs.com/claude-shannon/ Web exhibit] on April 30, 2016, chronicling Shannon's hiring at Bell Labs (under an NDRC contract with US Government), his subsequent work there from 1942 through 1957, and details of Mathematics Department. The exhibit also displayed bios of colleagues and managers during his tenure, as well as original versions of some of the technical memoranda which subsequently became well known in published form.\n* In July 2016, the postal service of Republic of Macedonia (Macedonian Post) issued a commemorative stamp with Claude E. Shannon to mark the 100 years anniversary of his birth. The initiative about issuing a postal stamp with Shannon came from Sergio Verdú in a communication to Ninoslav Marina. Ninoslav Marina initiated the procedure with the Deputy Director General of the Macedonian Post Goce Bobolinski and the stamp came out of print on July 12, 2016 during the International Symposium on Information Theory in Barcelona. Initially, 7000 stamps were printed, however more may be printed if necessary. The stamp was officially promoted during the speech at the opening ceremony of the academic year 2016/17 at the University of Information Science and Technology “St. Paul the Apostle” in Ohrid, Republic of Macedonia, where Ninoslav Marina currently holds the position of a Rector. A USPS commemorative stamp is being proposed, with an active petition.\n* A documentary on Claude Shannon and on the impact of information theory is being produced by Sergio Verdú and Mark Levinson.\n* A trans-Atlantic celebration of both George Boole's bicentenary and Claude Shannon's centenary that is being led by University College Cork and the Massachusetts Institute of Technology. A first event was a workshop in Cork, When Boole Meets Shannon, and will continue with exhibits at the Boston Museum of Science and at the MIT Museum.\n* Many organizations around the world are holding observance events, including the Boston Museum of Science, the Heinz-Nixdorf Museum, the Institute for Advanced Study, Technische Universität Berlin, University of South Australia (UniSA), Unicamp (Universidade Estadual de Campinas), University of Toronto, Chinese University of Hong Kong, Cairo University, Telecom ParisTech, National Technical University of Athens, Indian Institute of Science, Indian Institute of Technology Bombay, Indian Institute of Technology Kanpur, Nanyang Technological University of Singapore, University of Maryland, University of Illinois at Chicago, École Polytechnique Federale de Lausanne, The Pennsylvania State University (Penn State), University of California Los Angeles, Massachusetts Institute of Technology, Chongqing University of Posts and Telecommunications, and University of Illinois at Urbana-Champaign.\n* A series of geocaches, dedicated to the work of Claude Shannon, will be deployed in Munich, Germany. The first cache has already been placed.\n* A logo that appears on this page was crowdsourced on Crowdspring.\n* The Math Encounters presentation of May 4, 2016 at the National Museum of Mathematics in New York, titled Saving Face: Information Tricks for Love and Life, focused on Shannon's work in Information Theory. A video recording and other material are available.\n\nAwards and honors list\n\nThe Claude E. Shannon Award was established in his honor; he was also its first recipient, in 1972.\n\n* Alfred Noble Prize, 1939 (award of civil engineering societies in the US) \n* Morris Liebmann Memorial Prize of the Institute of Radio Engineers, 1949\n* Yale University (Master of Science), 1954\n* Stuart Ballantine Medal of the Franklin Institute, 1955\n* Research Corporation Award, 1956\n* University of Michigan, honorary doctorate, 1961\n* Rice University Medal of Honor, 1962\n* Princeton University, honorary doctorate, 1962\n* Marvin J. Kelly Award, 1962\n* University of Edinburgh, honorary doctorate, 1964\n* University of Pittsburgh, honorary doctorate, 1964\n* Medal of Honor of the Institute of Electrical and Electronics Engineers, 1966\n* National Medal of Science, 1966, presented by President Lyndon B. Johnson\n* Golden Plate Award, 1967\n* Northwestern University, honorary doctorate, 1970\n* Harvey Prize, the Technion of Haifa, Israel, 1972\n* Royal Netherlands Academy of Arts and Sciences (KNAW), foreign member, 1975\n* University of Oxford, honorary doctorate, 1978\n* Joseph Jacquard Award, 1978\n* Harold Pender Award, 1978\n* University of East Anglia, honorary doctorate, 1982\n* Carnegie Mellon University, honorary doctorate, 1984\n* Audio Engineering Society Gold Medal, 1985\n* Kyoto Prize, 1985\n* Tufts University, honorary doctorate, 1987\n* Universitas Jember, diploma, 1990\n* University of Pennsylvania, honorary doctorate, 1991\n* Basic Research Award, Eduard Rhein Foundation, Germany, 1991\n* National Inventors Hall of Fame inducted, 2004",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Claude Shannon" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=5693" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Claude Elwood Shannon (April 30, 1916 – February 24, 2001) was an American mathematician, electrical engineer, and cryptographer known as \"the father of information theory\".\n\nShannon is noted for having founded information theory with a landmark paper, A Mathematical Theory of Communication, that he published in 1948. He is, perhaps, equally well known for founding digital circuit design theory in 1937, when—as a 21-year-old master's degree student at the Massachusetts Institute of Technology (MIT)—he wrote his thesis demonstrating that electrical applications of Boolean algebra could construct any logical, numerical relationship. Shannon contributed to the field of cryptanalysis for national defense during World War II, including his fundamental work on codebreaking and secure telecommunications.\n\nBiography\n\nChildhood\n\nShannon was born in Petoskey, Michigan and grew up in Gaylord, Michigan. His father, Claude, Sr. (1862–1934), a descendant of early settlers of New Jersey, was a self-made businessman, and for a while, a Judge of Probate. Shannon's mother, Mabel Wolf Shannon (1890–1945), was a language teacher, and also served as the principal of Gaylord High School.\n\nMost of the first 16 years of Shannon's life were spent in Gaylord, where he attended public school, graduating from Gaylord High School in 1932. Shannon showed an inclination towards mechanical and electrical things. His best subjects were science and mathematics. At home he constructed such devices as models of planes, a radio-controlled model boat and a barbed-wire telegraph system to a friend's house a half-mile away.[https://www.nytimes.com/2001/12/30/magazine/the-lives-they-lived-claude-shannon-b-1916-bit-player.html?mcubz=1 \"The Lives They Lived: Claude Shannon\", New York Times, 30 December 2001] While growing up, he also worked as a messenger for the Western Union company.\n\nHis childhood hero was Thomas Edison, who he later learned was a distant cousin. Both Shannon and Edison were descendants of John Ogden (1609–1682), a colonial leader and an ancestor of many distinguished people.[http://web.mit.edu/newsoffice/2001/shannon.html MIT Professor Claude Shannon dies; was founder of digital communications], MIT — News office, Cambridge, Massachusetts, February 27, 2001\n\nShannon was apolitical and an atheist.\n\nLogic circuits\n\nIn 1932, Shannon entered the University of Michigan, where he was introduced to the work of George Boole. He graduated in 1936 with two bachelor's degrees: one in electrical engineering and the other in mathematics.\n\nIn 1936, Shannon began his graduate studies in electrical engineering at MIT, where he worked on Vannevar Bush's differential analyzer, an early analog computer. While studying the complicated ad hoc circuits of this analyzer, Shannon designed switching circuits based on Boole's concepts. In 1937, he wrote his master's degree thesis, A Symbolic Analysis of Relay and Switching Circuits,Claude Shannon, [http://dspace.mit.edu/bitstream/handle/1721.1/11173/34541425-MIT.pdf?sequence\n2 \"A Symbolic Analysis of Relay and Switching Circuits,\"] unpublished MS Thesis, Massachusetts Institute of Technology, August 10, 1937. A paper from this thesis was published in 1938. In this work, Shannon proved that his switching circuits could be used to simplify the arrangement of the electromechanical relays that were used then in telephone call routing switches. Next, he expanded this concept, proving that these circuits could solve all problems that Boolean algebra could solve. In the last chapter, he presents diagrams of several circuits, including a 4-bit full adder.\n\nUsing this property of electrical switches to implement logic is the fundamental concept that underlies all electronic digital computers. Shannon's work became the foundation of digital circuit design, as it became widely known in the electrical engineering community during and after World War II. The theoretical rigor of Shannon's work superseded the ad hoc methods that had prevailed previously. Howard Gardner called Shannon's thesis \"possibly the most important, and also the most noted, master's thesis of the century.\"\n\nShannon received his Ph.D. degree from MIT in 1940. Vannevar Bush suggested that Shannon should work on his dissertation at the Cold Spring Harbor Laboratory, in order to develop a mathematical formulation for Mendelian genetics. This research resulted in Shannon's PhD thesis, called An Algebra for Theoretical Genetics. C. E. Shannon, \"An algebra for theoretical genetics,\" (Ph.D. Thesis, Massachusetts Institute of Technology, 1940), MIT-THESES//1940–3 [http://hdl.handle.net/1721.1/11174 Online text at MIT] — Contains a biography on pp. 64–65.\n\nIn 1940, Shannon became a National Research Fellow at the Institute for Advanced Study in Princeton, New Jersey. In Princeton, Shannon had the opportunity to discuss his ideas with influential scientists and mathematicians such as Hermann Weyl and John von Neumann, and he also had occasional encounters with Albert Einstein and Kurt Gödel. Shannon worked freely across disciplines, and this ability may have contributed to his later development of mathematical information theory.Erico Marui Guizzo, “[http://dspace.mit.edu/bitstream/handle/1721.1/39429/54526133-MIT.pdf?sequence=2 The Essential Message: Claude Shannon and the Making of Information Theory]” (M.S. Thesis, Massachusetts Institute of Technology, Dept. of Humanities, Program in Writing and Humanistic Studies, 2003), 14.\n\nWartime research\n\nShannon then joined Bell Labs to work on fire-control systems and cryptography during World War II, under a contract with section D-2 (Control Systems section) of the National Defense Research Committee (NDRC).\n\nShannon is credited with the invention of signal-flow graphs, in 1942. He discovered the topological gain formula while investigating the functional operation of an analog computer.\n\nFor two months early in 1943, Shannon came into contact with the leading British mathematician Alan Turing. Turing had been posted to Washington to share with the U.S. Navy's cryptanalytic service the methods used by the British Government Code and Cypher School at Bletchley Park to break the ciphers used by the Kriegsmarine U-boats in the north Atlantic Ocean. He was also interested in the encipherment of speech and to this end spent time at Bell Labs. Shannon and Turing met at teatime in the cafeteria. Turing showed Shannon his 1936 paper that defined what is now known as the \"Universal Turing machine\"; This impressed Shannon, as many of its ideas complemented his own.\n\nIn 1945, as the war was coming to an end, the NDRC was issuing a summary of technical reports as a last step prior to its eventual closing down. Inside the volume on fire control, a special essay titled Data Smoothing and Prediction in Fire-Control Systems, coauthored by Shannon, Ralph Beebe Blackman, and Hendrik Wade Bode, formally treated the problem of smoothing the data in fire-control by analogy with \"the problem of separating a signal from interfering noise in communications systems.\"David A. Mindell, Between Human and Machine: Feedback, Control, and Computing Before Cybernetics, (Baltimore: Johns Hopkins University Press), 2004, pp. 319-320. . In other words, it modeled the problem in terms of data and signal processing and thus heralded the coming of the Information Age.\n\nShannon's work on cryptography was even more closely related to his later publications on communication theory.David Kahn, The Codebreakers, rev. ed., (New York: Simon and Schuster), 1996, pp. 743–751. . At the close of the war, he prepared a classified memorandum for Bell Telephone Labs entitled \"A Mathematical Theory of Cryptography,\" dated September 1945. A declassified version of this paper was published in 1949 as \"Communication Theory of Secrecy Systems\" in the Bell System Technical Journal. This paper incorporated many of the concepts and mathematical formulations that also appeared in his A Mathematical Theory of Communication. Shannon said that his wartime insights into communication theory and cryptography developed simultaneously and that \"they were so close together you couldn’t separate them\".quoted in Kahn, The Codebreakers, p. 744. In a footnote near the beginning of the classified report, Shannon announced his intention to \"develop these results … in a forthcoming memorandum on the transmission of information.\"quoted in Erico Marui Guizzo, [http://dspace.mit.edu/bitstream/1721.1/39429/1/54526133.pdf \"The Essential Message: Claude Shannon and the Making of Information Theory,\"]  unpublished MS thesis, Massachusetts Institute of Technology, 2003, p. 21.\n\nWhile he was at Bell Labs, Shannon proved that the cryptographic one-time pad is unbreakable in his classified research that was later published in October 1949. He also proved that any unbreakable system must have essentially the same characteristics as the one-time pad: the key must be truly random, as large as the plaintext, never reused in whole or part, and be kept secret.Shannon, Claude (1949). \"Communication Theory of Secrecy Systems\". Bell System Technical Journal 28 (4): 656–715.\n\nInformation theory\n\nIn 1948, the promised memorandum appeared as \"A Mathematical Theory of Communication,\" an article in two parts in the July and October issues of the Bell System Technical Journal. This work focuses on the problem of how best to encode the information a sender wants to transmit. In this fundamental work, he used tools in probability theory, developed by Norbert Wiener, which were in their nascent stages of being applied to communication theory at that time. Shannon developed information entropy as a measure of the uncertainty in a message while essentially inventing the field of information theory.\n\nThe book, co-authored with Warren Weaver, The Mathematical Theory of Communication, reprints Shannon's 1948 article and Weaver's popularization of it, which is accessible to the non-specialist. Warren Weaver pointed out that the word information in communication theory is not related to what you do say, but to what you could say. That is, information is a measure of one's freedom of choice when one selects a message. Shannon's concepts were also popularized, subject to his own proofreading, in John Robinson Pierce's Symbols, Signals, and Noise.\n\nInformation theory's fundamental contribution to natural language processing and computational linguistics was further established in 1951, in his article \"Prediction and Entropy of Printed English\", showing upper and lower bounds of entropy on the statistics of English – giving a statistical foundation to language analysis. In addition, he proved that treating whitespace as the 27th letter of the alphabet actually lowers uncertainty in written language, providing a clear quantifiable link between cultural practice and probabilistic cognition.\n\nAnother notable paper published in 1949 is \"Communication Theory of Secrecy Systems\", a declassified version of his wartime work on the mathematical theory of cryptography, in which he proved that all theoretically unbreakable ciphers must have the same requirements as the one-time pad. He is also credited with the introduction of sampling theory, which is concerned with representing a continuous-time signal from a (uniform) discrete set of samples. This theory was essential in enabling telecommunications to move from analog to digital transmissions systems in the 1960s and later.\n\nHe returned to MIT to hold an endowed chair in 1956.\n\nTeaching at MIT\n\nIn 1956 Shannon joined the MIT faculty to work in the Research Laboratory of Electronics (RLE). He continued to serve on the MIT faculty until 1978.\n\nLater life\n\nShannon developed Alzheimer's disease and spent the last few years of his life in a nursing home in Massachusetts oblivious to the marvels of the digital revolution he had helped create. He died in 2001. He was survived by his wife, Mary Elizabeth Moore Shannon, his son, Andrew Moore Shannon, his daughter, Margarita Shannon, his sister, Catherine Shannon Kay, and his two granddaughters. His wife stated in his obituary that, had it not been for Alzheimer's disease, \"He would have been bemused\" by it all.\n\nHobbies and inventions\n\nOutside of his academic pursuits, Shannon was interested in juggling, unicycling, and chess. He also invented many devices, including a Roman numeral computer called THROBAC, juggling machines, and a flame-throwing trumpet. One of his more humorous devices was a box kept on his desk called the \"Ultimate Machine\", based on an idea by Marvin Minsky. Otherwise featureless, the box possessed a single switch on its side. When the switch was flipped, the lid of the box opened and a mechanical hand reached out, flipped off the switch, then retracted back inside the box. Renewed interest in the \"Ultimate Machine\" has emerged on YouTube and Thingiverse. In addition, he built a device that could solve the Rubik's Cube puzzle.\n\nShannon designed the Minivac 601, a digital computer trainer to teach business people about how computers functioned. It was sold by the Scientific Development Corp starting in 1961.\n\nHe is also considered the co-inventor of the first wearable computer along with Edward O. Thorp.[http://www1.cs.columbia.edu/graphics/courses/mobwear/resources/thorp-iswc98.pdf The Invention of the First Wearable Computer Online paper by Edward O. Thorp of Edward O. Thorp & Associates] The device was used to improve the odds when playing roulette.\n\nPersonal life\n\nShannon married Norma Levor, a wealthy, Jewish, left-wing intellectual in January 1940. The marriage ended in divorce after about a year. Levor later married Ben Barzman.\n\nShannon met his second wife Betty Shannon (née Mary Elizabeth Moore) when she was a numerical analyst at Bell Labs. They were married in 1949. Betty assisted Claude in building some of his most famous inventions.. \n\nClaude and Betty Shannon had three children, Robert James Shannon, Andrew Moore Shannon, and Margarita Shannon, and raised his family in Winchester, Massachusetts. Their oldest son, Robert Shannon, died in 1998 at the age of 45.\n\nTributes\n\nTo commemorate Shannon's achievements, there were celebrations of his work in 2001.\n\nThere are currently six statues of Shannon sculpted by Eugene Daub: one at the University of Michigan; one at MIT in the Laboratory for Information and Decision Systems; one in Gaylord, Michigan; one at the University of California, San Diego; one at Bell Labs; and another at AT&T Shannon Labs. After the breakup of the Bell System, the part of Bell Labs that remained with AT&T Corporation was named Shannon Labs in his honor.\n\nAccording to Neil Sloane, an AT&T Fellow who co-edited Shannon's large collection of papers in 1993, the perspective introduced by Shannon's communication theory (now called information theory) is the foundation of the digital revolution, and every device containing a microprocessor or microcontroller is a conceptual descendant of Shannon's publication in 1948:C. E. Shannon: A mathematical theory of communication. Bell System Technical Journal, vol. 27, pp. 379–423 and 623–656, July and October 1948 \"He's one of the great men of the century. Without him, none of the things we know today would exist. The whole digital revolution started with him.\"Bell Labs digital guru dead at 84 — Pioneer scientist led high-tech revolution (The Star-Ledger, obituary by Kevin Coughlin February 27, 2001) The unit shannon is named after Claude Shannon.\n\nA Mind at Play, a biography of Shannon written by Jimmy Soni and Rob Goodman, was published in 2017.\n\nOther work\n\nShannon's mouse\n\n\"Theseus\", created in 1950, was a magnetic mouse controlled by an electromechanical relay circuit that enabled it to move around a labyrinth of 25 squares. Its dimensions were the same as those of an average mouse. The maze configuration was flexible and it could be modified arbitrarily by rearranging movable partitions. The mouse was designed to search through the corridors until it found the target. Having travelled through the maze, the mouse could then be placed anywhere it had been before, and because of its prior experience it could go directly to the target. If placed in unfamiliar territory, it was programmed to search until it reached a known location and then it would proceed to the target, adding the new knowledge to its memory and learning new behavior. Shannon's mouse appears to have been the first artificial learning device of its kind.\n\nShannon's estimate for the complexity of chess\n\nIn 1949 Shannon completed a paper (published in March 1950) which estimates the game-tree complexity of chess, which is approximately 10120. This number is now often referred to as the \"Shannon number\", and is still regarded today as an accurate estimate of the game's complexity. The number is often cited as one of the barriers to solving the game of chess using an exhaustive analysis (i.e. brute force analysis).Dr. James Grime. [https://www.youtube.com/watch?v\nKm024eldY1A \"How many chess games are possible? (films by Brady Haran). MSRI, Mathematical Sciences\".] Numberphile, July 24, 2015.\n\nShannon's computer chess program\n\nOn March 9, 1949, Shannon presented a paper called \"Programming a Computer for playing Chess.\" The paper was presented at the National Institute for Radio Engineers Convention in New York. He described how to program a computer to play chess based on position scoring and move selection. He proposed basic strategies for restricting the number of possibilities to be considered in a game of chess. In March 1950 it was published in Philosophical Magazine, and is considered one of the first articles published on the topic of programming a computer for playing chess, and using a computer to solve the game.http://billwall.phpwebhosting.com/articles/computer_early_chess.htm His process for having the computer decide on which move to make was a minimax procedure, based on an evaluation function of a given chess position. Shannon gave a rough example of an evaluation function in which the value of the black position was subtracted from that of the white position. Material was counted according to the usual chess piece relative value (1 point for a pawn, 3 points for a knight or bishop, 5 points for a rook, and 9 points for a queen). He considered some positional factors, subtracting ½ point for each doubled pawn, backward pawn, and isolated pawn. Another positional factor in the evaluation function was mobility, adding 0.1 point for each legal move available. Finally, he considered checkmate to be the capture of the king, and gave the king the artificial value of 200 points. Quoting from the paper:\n\nThe coefficients .5 and .1 are merely the writer's rough estimate. Furthermore, there are many other terms that should be included. The formula is given only for illustrative purposes. Checkmate has been artificially included here by giving the king the large value 200 (anything greater than the maximum of all other terms would do).\n\nThe evaluation function was clearly for illustrative purposes, as Shannon stated. For example, according to the function, pawns that are doubled as well as isolated would have no value at all, which is clearly unrealistic.\n\nShannon's maxim\n\nShannon formulated a version of Kerckhoffs' principle as \"The enemy knows the system\". In this form it is known as \"Shannon's maxim\".\n\nCommemorations\n\nShannon Centenary\n\nThe Shannon Centenary, 2016, marked the life and influence of Claude Elwood Shannon on the hundredth anniversary of his birth on April 30, 1916. It was inspired in part by the Alan Turing Year. An ad hoc committee of the IEEE Information Theory Society including Christina Fragouli, Rüdiger Urbanke, Michelle Effros, Lav Varshney and Sergio Verdú, coordinated worldwide events. The initiative was announced in the History Panel at the 2015 IEEE Information Theory Workshop Jerusalem and the IEEE Information Theory Society Newsletter.\n\nA detailed listing of confirmed events was available on the website of the IEEE Information Theory Society.\n\nSome of the planned activities included:\n* Bell Labs hosted the First Shannon Conference on the Future of the Information Age on April 28 – 29, 2016 in Murray Hill, NJ to celebrate Claude Shannon and the continued impact of his legacy on society. The event includes keynote speeches by global luminaries and visionaries of the information age who will explore the impact of information theory on society and our digital future, informal recollections, and leading technical presentations on subsequent related work in other areas such as bioinformatics, economic systems, and social networks. There is also a student competition\n* Bell Labs launched a [https://www.bell-labs.com/claude-shannon/ Web exhibit] on April 30, 2016, chronicling Shannon's hiring at Bell Labs (under an NDRC contract with US Government), his subsequent work there from 1942 through 1957, and details of Mathematics Department. The exhibit also displayed bios of colleagues and managers during his tenure, as well as original versions of some of the technical memoranda which subsequently became well known in published form.\n* In July 2016, the postal service of Republic of Macedonia (Macedonian Post) issued a commemorative stamp with Claude E. Shannon to mark the 100 years anniversary of his birth. The initiative about issuing a postal stamp with Shannon came from Sergio Verdú in a communication to Ninoslav Marina. Ninoslav Marina initiated the procedure with the Deputy Director General of the Macedonian Post Goce Bobolinski and the stamp came out of print on July 12, 2016 during the International Symposium on Information Theory in Barcelona. Initially, 7000 stamps were printed, however more may be printed if necessary. The stamp was officially promoted during the speech at the opening ceremony of the academic year 2016/17 at the University of Information Science and Technology “St. Paul the Apostle” in Ohrid, Republic of Macedonia, where Ninoslav Marina currently holds the position of a Rector. A USPS commemorative stamp is being proposed, with an active petition.\n* A documentary on Claude Shannon and on the impact of information theory is being produced by Sergio Verdú and Mark Levinson.\n* A trans-Atlantic celebration of both George Boole's bicentenary and Claude Shannon's centenary that is being led by University College Cork and the Massachusetts Institute of Technology. A first event was a workshop in Cork, When Boole Meets Shannon, and will continue with exhibits at the Boston Museum of Science and at the MIT Museum.\n* Many organizations around the world are holding observance events, including the Boston Museum of Science, the Heinz-Nixdorf Museum, the Institute for Advanced Study, Technische Universität Berlin, University of South Australia (UniSA), Unicamp (Universidade Estadual de Campinas), University of Toronto, Chinese University of Hong Kong, Cairo University, Telecom ParisTech, National Technical University of Athens, Indian Institute of Science, Indian Institute of Technology Bombay, Indian Institute of Technology Kanpur, Nanyang Technological University of Singapore, University of Maryland, University of Illinois at Chicago, École Polytechnique Federale de Lausanne, The Pennsylvania State University (Penn State), University of California Los Angeles, Massachusetts Institute of Technology, Chongqing University of Posts and Telecommunications, and University of Illinois at Urbana-Champaign.\n* A series of geocaches, dedicated to the work of Claude Shannon, will be deployed in Munich, Germany. The first cache has already been placed.\n* A logo that appears on this page was crowdsourced on Crowdspring.\n* The Math Encounters presentation of May 4, 2016 at the National Museum of Mathematics in New York, titled Saving Face: Information Tricks for Love and Life, focused on Shannon's work in Information Theory. A video recording and other material are available.\n\nAwards and honors list\n\nThe Claude E. Shannon Award was established in his honor; he was also its first recipient, in 1972.\n\n* Alfred Noble Prize, 1939 (award of civil engineering societies in the US) \n* Morris Liebmann Memorial Prize of the Institute of Radio Engineers, 1949\n* Yale University (Master of Science), 1954\n* Stuart Ballantine Medal of the Franklin Institute, 1955\n* Research Corporation Award, 1956\n* University of Michigan, honorary doctorate, 1961\n* Rice University Medal of Honor, 1962\n* Princeton University, honorary doctorate, 1962\n* Marvin J. Kelly Award, 1962\n* University of Edinburgh, honorary doctorate, 1964\n* University of Pittsburgh, honorary doctorate, 1964\n* Medal of Honor of the Institute of Electrical and Electronics Engineers, 1966\n* National Medal of Science, 1966, presented by President Lyndon B. Johnson\n* Golden Plate Award, 1967\n* Northwestern University, honorary doctorate, 1970\n* Harvey Prize, the Technion of Haifa, Israel, 1972\n* Royal Netherlands Academy of Arts and Sciences (KNAW), foreign member, 1975\n* University of Oxford, honorary doctorate, 1978\n* Joseph Jacquard Award, 1978\n* Harold Pender Award, 1978\n* University of East Anglia, honorary doctorate, 1982\n* Carnegie Mellon University, honorary doctorate, 1984\n* Audio Engineering Society Gold Medal, 1985\n* Kyoto Prize, 1985\n* Tufts University, honorary doctorate, 1987\n* Universitas Jember, diploma, 1990\n* University of Pennsylvania, honorary doctorate, 1991\n* Basic Research Award, Eduard Rhein Foundation, Germany, 1991\n* National Inventors Hall of Fame inducted, 2004. Claude Shannon. http://en.wikipedia.org/?curid=5693."
  }
}
