{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11888",
  "eid" : "feb899c0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778507100,
  "textBody" : "In Jewish folklore, a golem ( ; ) is an animated anthropomorphic being that is magically created entirely from inanimate matter (specifically clay or mud). The word was used to mean an amorphous, unformed material in Psalms and medieval writing. page 296\n\nThe most famous golem narrative involves Judah Loew ben Bezalel, the late-16th-century rabbi of Prague. There are many tales differing on how the golem was brought to life and afterward controlled.  According to Moment Magazine, \"the golem is a highly mutable metaphor with seemingly limitless symbolism. It can be victim or villain, Jew or non-Jew, man or woman—or sometimes both. Over the centuries it has been used to connote war, community, isolation, hope and despair.\"Cooper, Marilyn.  [http://www.momentmag.com/jewish-word-golem/ Jewish Word | Golem.\"] Moment Magazine.  17 July 2017.  24 August 2017.\n\nHistory\n\nEtymology\n\nThe word golem occurs once in the Bible in , which uses the word  (galmi; my golem), that means \"my light form\", \"raw\" material, connoting the unfinished human being before God's eyes. The Mishnah uses the term for an uncultivated person: \"Seven characteristics are in an uncultivated person, and seven in a learned one,\" (שבעה דברים בגולם) (Pirkei Avot 5:6 in the Hebrew text; English translations vary). In Modern Hebrew, golem is used to mean \"dumb\" or \"helpless\". Similarly, it is often used today as a metaphor for a brainless lunk or entity who serves a man under controlled conditions but is hostile to him under others. \"Golem\" passed into Yiddish as goylem to mean someone who is clumsy or slow.\n\nEarliest stories\n\nThe oldest stories of golems date to early Judaism. In the Talmud (Tractate Sanhedrin 38b), Adam was initially created as a golem (גולם) when his dust was \"kneaded into a shapeless husk.\" Like Adam, all golems are created from mud by those close to divinity, but no anthropogenic golem is fully human. Early on, the main disability of the golem was its inability to speak. Sanhedrin 65b describes Rava creating a man (gavra). He sent the man to Rav Zeira. Rav Zeira spoke to him, but he did not answer. Rav Zeira said, \"You were created by the sages; return to your dust\".\n\nDuring the Middle Ages, passages from the Sefer Yetzirah (Book of Creation) were studied as a means to create and animate a golem, although there is little in the writings of Jewish mysticism that supports this belief. It was believed that golems could be activated by an ecstatic experience induced by the ritualistic use of various letters of the Hebrew Alphabet forming a \"shem\" (any one of the Names of God), wherein the shem was written on a piece of paper and inserted in the mouth or in the forehead of the golem.\n\nA golem is inscribed with Hebrew words in some tales (for example, some versions of Chełm and Prague, as well as in Polish tales and versions of Brothers Grimm), such as the word emet (אמת, \"truth\" in Hebrew) written on its forehead. The golem could then be deactivated by removing the aleph (א) in emet,Kerstein, Benjamin.  Jewish Ideas Daily.  14 September 2010.  24 August 2017. thus changing the inscription from \"truth\" to \"death\" (met מת, meaning \"dead\").  Rabbi Jacob ben Shalom arrived at Barcelona from Germany in 1325 and remarked that the law of destruction is the reversal of the law of creation.\n\nJoseph Delmedigo informs us in 1625 that \"many legends of this sort are current, particularly in Germany.\"\n\nThe earliest known written account of how to create a golem can be found in Sodei Razayya by Eleazar ben Judah of Worms (1165–1230).\n\nThe Golem of Chełm\n\nThe oldest description of the creation of a golem by a historical figure is included in a tradition connected to Rabbi Eliyahu of Chełm (1550–1583).[http://www.press.umich.edu/pdf/9780472117598-intro.pdf Introduction to \"The Golem Returns\"]. Retrieved 2011-09-23.\n\nA Polish Kabbalist, writing in about 1630–1650, reported the creation of a golem by Rabbi Eliyahu thus: \"And I have heard, in a certain and explicit way, from several respectable persons that one man [living] close to our time, whose name is R. Eliyahu, the master of the name, who made a creature out of matter [Heb. Golem] and form [Heb. tzurah] and it performed hard work for him, for a long period, and the name of emet was hanging upon his neck, until he finally removed it for a certain reason, the name from his neck and it turned to dust.\" A similar account was reported by a Christian author, Christoph Arnold, in 1674.\n\nRabbi Jacob Emden (d. 1776) elaborated on the story in a book published in 1748: \"As an aside, I'll mention here what I heard from my father's holy mouth regarding the Golem created by his ancestor, the Gaon R. Eliyahu Ba'al Shem of blessed memory. When the Gaon saw that the Golem was growing larger and larger, he feared that the Golem would destroy the universe. He then removed the Holy Name that was embedded on his forehead, thus causing him to disintegrate and return to dust. Nonetheless, while he was engaged in extracting the Holy Name from him, the Golem injured him, scarring him on the face.\"שו\"ת שאילת יעב\"ץ, ח\"ב, [http://www.hebrewbooks.org/pdfpager.aspx?req1408&pgnum\n225 סי' פ\"ב]. Cf. his בירת מגדל עוז, Altona, 1748, p. 259a; מטפחת ספרים, Altona, 1768, [http://hebrewbooks.org/pdfpager.aspx?req21115&st\n&pgnum90&hilite\n p. 45a]; and מגילת ספר, ed. Kahana, Warsaw, 1896, [http://www.hebrewbooks.org/pdfpager.aspx?req37017&st\n&pgnum12&hilite\n p. 4]. See also שו\"ת חכם צבי, [http://www.hebrewbooks.org/pdfpager.aspx?req19566&st\n&pgnum=163 סי' צ\"ג], and the references cited in שו\"ת חכם צבי עם ליקוטי הערות, Jerusalem, 1998, vol. 1, p. 421 and in the periodical כפר חב\"ד, number 351 (1988), p. 51. Cited by Leiman, S.Z., [http://seforim.blogspot.com/2007/02/shnayer-z-leiman-did-disciple-of.html \"Did a Disciple of the Maharal Create a Golem?\"]\n\nAccording to the Polish Kabbalist, \"the legend was known to several persons, thus allowing us to speculate that the legend had indeed circulated for some time before it was committed to writing and, consequently, we may assume that its origins are to be traced to the generation immediately following the death of R. Eliyahu, if not earlier.\"The tradition is also recorded in ה לחורבנה / תל-אביב : ארגון יוצאי חלם בישראל ובארה\"ב, תשמ\"א\n\nThe classic narrative: The Golem of Prague\n\nThe most famous golem narrative involves Judah Loew ben Bezalel, the late 16th century rabbi of Prague, also known as the Maharal, who reportedly \"created a [g]olem out of clay from the banks of the Vltava River and brought it to life through rituals and Hebrew incantations to defend the Prague ghetto from anti-Semitic attacks\" and pogroms.Green, Kayla.  [http://www.momentmag.com/the-golem-in-the-attic/ \"The Golem in the Attic.\"] Moment Magazine.  1 February 2011.  25 August 2017. Depending on the version of the legend, the Jews in Prague were to be either expelled or killed under the rule of Rudolf II, the Holy Roman Emperor. To protect the Jewish community, the rabbi constructed the Golem out of clay from the banks of the Vltava river, and brought it to life through rituals and Hebrew incantations. The Golem was called Josef and was known as Yossele. It was said that he could make himself invisible and summon spirits from the dead. Rabbi Loew deactivated the Golem on Friday evenings by removing the shem before the Sabbath (Saturday) began,  so as to let it rest on Sabbath. One Friday evening Rabbi Loew forgot to remove the shem, and feared that the Golem would desecrate the Sabbath. A different story tells of a golem that fell in love, and when rejected, became the violent monster seen in most accounts. Some versions have the golem eventually going on a murderous rampage.\n\nThe rabbi then managed to pull the shem from his mouth and immobilize him in front of the synagogue, whereupon the golem fell in pieces. The Golem's body was stored in the attic genizah of the Old New Synagogue, where it would be restored to life again if needed. According to legend, the body of Rabbi Loew's Golem still lies in the synagogue's attic. When the attic was renovated in 1883, no evidence of the Golem was found.[https://books.google.com/books?idZjolCwAAQBAJ&pg\nPT404&lpgPT404&dq\nattic+golem+1883&sourcebl&ots\nPVluoYidGl&sig9Kw3_01uB-TAEds0uGw5BMk8jzA&hl\nen&saX&ved\n0ahUKEwj2nZeLyvDVAhWhjlQKHUkjA3gQ6AEIYzAN#vonepage&q\nattic%20golem%201883&f=false \"TIME-LIFE Mysteries of the Unknown: Inside the World of the Strange and ....\"] Google Books.  24 August 2017. Some versions of the tale state that the Golem was stolen from the genizah and entombed in a graveyard in Prague's Žižkov district, where the Žižkov Television Tower now stands. A recent legend tells of a Nazi agent ascending to the synagogue attic during World War II and trying to stab the Golem, but he died instead. The attic is not open to the general public.[http://atlasobscura.com/place/old-new-synagogue Old New Synagogue located in Praha, Czech Republic|Atlas Obscura|Curious and Wondrous Travel Destinations]. Atlas Obscura. Retrieved on 2011-09-23.\n\nSome Orthodox Jews believe that the Maharal did actually create a golem.  The evidence for this belief has been analyzed from an Orthodox Jewish perspective by Shnayer Z. Leiman.Leiman, S. Z., [http://seforim.blogspot.com/2010/05/golem-of-prague-in-recent-rabbinic.html The Golem of Prague in Recent Rabbinic Literature]\n\nSources of the Prague narrative\n\nThe general view of historians and critics is that the story of the Golem of Prague was a German literary invention of the early 19th century.  According to John Neubauer, the first writers on the Prague Golem were:\n* 1837: Berthold Auerbach, Spinoza\n* 1841: Gustav Philippson, Der Golam, eine Legende\n* 1841: Franz Klutschak, Der Golam des Rabbi Löw\n* 1842: Adam Tendlau Der Golem des Hoch-Rabbi-Löw\n* 1847: Leopold Weisel, Der Golem\n\nCathy Gelbin found an earlier source in Philippson's The Golem and the Adulteress, published in the Jewish magazine Shulamit in 1834, which describes how the Maharal sent a golem to find the reason for an epidemic among the Jews of Prague.Gelbin, C . S., [https://books.google.com/books?id\n5HkzGcG9YeAC&printsecfrontcover&source\ngbs_ge_summary_r&cad0#v\nonepage&qMaharal&f\nfalse The Golem Returns – From German Romantic Literature to Global Jewish Culture, 1808–2008], University of Michigan, 2011See also [http://www.jewishencyclopedia.com/view.jsp?artid334&letter\nG&search=golem#1137#ixzz1XiylKy6h Jewish Encyclopedia] (1906): \"A legend connected with [the Maharal's] Golem is given in German verse by Gustav Philippson in Allg. Zeit. des Jud. 1841, No. 44 (abridged in Sulamith, viii. 254; translated into Hebrew in Kokebe Yiẓḥaḳ, No. 28, p. 75, Vienna, 1862)\"\n\nAll of these early accounts of the Golem of Prague are in German by Jewish writers. It has been suggested that they emerged as part of a Jewish folklore movement parallel with the contemporary German folklore movement.\n\nThe origins of the story have been obscured by attempts to exaggerate its age and to pretend that it dates from the time of the Maharal. It has been said that Rabbi Yudel Rosenberg (1859–1935)Kieval, Hillel J.  [http://www.yivoencyclopedia.org/article.aspx/Golem_Legend \"Golem Legend.\"] The YIVO Encyclopedia.  24 August 2017. of Tarłów (before moving to Canada where he became one of its most prominent rabbis) originated the idea that the narrative dates from the time of the Maharal. Rosenberg published Nifl'os Maharal (Wonders of Maharal) (Piotrków, 1909) which purported to be an eyewitness account by the Maharal's son-in-law, who had helped to create the Golem. Rosenberg claimed that the book was based upon a manuscript that he found in the main library in Metz. Wonders of Maharal \"is generally recognized in academic circles to be a literary hoax\".[http://traditionarchive.org/news/originals/Volume%2036/No.%201/The%20Adventure%20of%20the.pdf Leiman, S.Z., \" The Adventure of The Maharal of Prague in London: R. Yudl Rosenberg and The Golem of Prague\",] Tradition, 36:1, 2002Sherwin, Byron L. (1985) The Golem Legend: Origins and Implications. New York: University Press of America Gershom Sholem observed that the manuscript \"contains not ancient legends but modern fiction\".Sholem, G., Major Trends in Jewish Mysticism, Schocken, 1961 Rosenberg's claim was further disseminated in Chayim Bloch's (1881–1973) The Golem: Legends of the Ghetto of Prague (English edition 1925).\n\nThe Jewish Encyclopedia of 1906 cites the historical work Zemach David by David Gans, a disciple of the Maharal, published in 1592.[http://www.jewishencyclopedia.com/view.jsp?artid\n334&letterG&search\ngolem#1137 GOLEM]. Jewish Encyclopedia. Retrieved on 2011-09-23.[http://www.epa.hu/01400/01462/00004/pdf/1986_2_296-298.pdf HUNGARIAN STUDIES 2. No. 2. Nemzetközi Magyar Filológiai Társaság. Akadémiai Kiadó Budapest [1986]]. (PDF). Retrieved on 2011-09-23. In it, Gans writes of an audience between the Maharal and Rudolph II: \"Our lord the emperor ... Rudolph ... sent for and called upon our master Rabbi Low ben Bezalel and received him with a welcome and merry expression, and spoke to him face to face, as one would to a friend. The nature and quality of their words are mysterious, sealed and hidden.\"Gans, D., Zemach David, ed. M.Breuer, Jerusalem, 1983, p.145, cited [http://www.rabbiyehudahyudelrosenberg.com/ Rabbi Yehudah Yudel Rosenberg and the Maharal's Golem] But it has been said of this passage, \"Even when [the Maharal is] eulogized, whether in David Gans' Zemach David or on his epitaph …, not a word is said about the creation of a golem. No Hebrew work published in the 16th, 17th, and 18th centuries (even in Prague) is aware that the Maharal created a golem.\"Neubauer, J., [https://books.google.com/books?id\nYINYl4iv4ecC&pgPA303&lpg\nPA303&dqgustav+philippson+the+Golem&source\nbl&otseuPUiGZv7x&sig\npxjaHEMbgMEPZsW6wk9knCLhrTw&hlen&ei\nLs9tTpXgD8i3hAf85JiDDA&saX&oi\nbook_result&ctresult&resnum\n2&ved0CB0Q6AEwAQ#v\nonepage&qgolem&f\nfalse \"How did the Golem get to Prague?\"], in Cornis-Pope, M., and Neubauer, J. History of The Literary Cultures of East-Central Europe, John Benjamins, 2010 Furthermore, the Maharal himself did not refer to the Golem in his writings. Rabbi Yedidiah Tiah Weil (1721–1805), a Prague resident, who described the creation of golems, including those created by Rabbis Avigdor Kara of Prague (died 1439) and Eliyahu of Chelm, did not mention the Maharal, and Rabbi Meir Perels' biography of the Maharal published in 1718 does not mention a golem.\n\nThe Golem of Vilna\n\nThere is a similar tradition relating to the Vilna Gaon or \"the saintly genius from Vilnius\" (1720–1797). Rabbi Chaim Volozhin (Lithuania 1749–1821) reported in an introduction to Sifra de Tzeniuta that he once presented to his teacher, the Vilna Gaon, ten different versions of a certain passage in the Sefer Yetzira and asked the Gaon to determine the correct text.Chaim of Volozhin.  [https://books.google.com/books?id\nUXtWbo-QGoAC&pgPT197&lpg\nPT197&dqgolem+Volozhin&source\nbl&otsQN3UmnwneO&sig\ndgIOspJMP-FDHhtKj0YCaQ20quk&hlen&sa\nX&ved0ahUKEwjFn4nQ2vDVAhUpsVQKHXb0BBkQ6AEITzAL#v\nonepage&qgolem%20Volozhin&f\nfalse \"Sifra de Tzeniuta, Introduction.\"] The Kabbalistic Tradition: An Anthology of Jewish Mysticism, edited by Alan Unterman.  Google Books.  24 August 2017. The Gaon immediately identified one version as the accurate rendition of the passage. The amazed student then commented to his teacher that, with such clarity, he should easily be able to create a live human. The Gaon affirmed Rabbi Chaim's assertion, and said that he once began to create a person when he was a child, under the age of 13, but during the process he received a sign from Heaven ordering him to desist because of his tender age.\n\nHubris theme\n\nThe existence of a golem is sometimes a mixed blessing. Golems are not intelligent, and if commanded to perform a task, they will perform the instructions literally. In many depictions, Golems are inherently perfectly obedient. In its earliest known modern form, the Golem of Chełm became enormous and uncooperative. In one version of this story, the rabbi had to resort to trickery to deactivate it, whereupon it crumbled upon its creator and crushed him. There is a similar hubris theme in Frankenstein, The Sorcerer's Apprentice, and some other stories in popular culture, for example: The Terminator. The theme also manifests itself in R.U.R. (Rossum's Universal Robots), Karel Čapek's 1921 play which coined the term robot; the play was written in Prague, and while Čapek denied that he modeled the robot after the Golem, there are many similarities in the plot.Koreis, Voyen.  Introduction.  [https://books.google.com/books?id\nUP-Ui34-M7UC&pgPA9&lpg\nPA9&dqKarel+%C4%8Capek+golem&source\nbl&ots2WLnFDNDEA&sig\nxgQvJZYlT9nWVC5sqMWcjfPhhUU&hlen&sa\nX&ved0ahUKEwjC-bb4-vLVAhXosFQKHbVyDngQ6AEIQjAE#v\nonepage&qKarel%20%C4%8Capek%20golem&f\nfalse \"Two Plays by Karel Capek: R.U.R. (Rossum's Universal Robots) & The Robber.\"] Google Books.  25 August 2017.\n\nCulture of the Czech Republic\n\nThe Golem is a popular figure in the Czech Republic. There are several restaurants and other businesses whose names make reference to the creature, a Czech strongman (René Richter) goes by the nickname \"Golem\", and a Czech monster truck outfit calls itself the \"Golem Team.\"\n\nAbraham Akkerman preceded his article on human automatism in the contemporary city with a short satirical poem on a pair of golems turning human. Published also as Paper CTS-04-06 by the Center for Theoretical Study, Prague.\n\nClay Boy variation\n\nA Yiddish and Slavic folktale is the Clay Boy, which combines elements of the Golem and The Gingerbread Man, in which a lonely couple make a child out of clay, with disastrous or comical consequences. In one common Russian version, an older couple whose children have left home make a boy out of clay, and dry him by their hearth. The Clay Boy comes to life; at first the couple are delighted and treat him like a real child, but the Clay Boy does not stop growing, and eats all their food, then all their livestock, and then the Clay Boy eats his parents. The Clay Boy rampages through the village until he is smashed by a quick-thinking goat.\n\nGolem in popular culture\n\n* Mainstream European society adopted the golem in the early 20th century. Most notably, Gustav Meyrink's 1914 novel Der Golem is loosely inspired by the tales of the golem created by Rabbi Loew. Another famous treatment from the same era is H. Leivick's 1921 Yiddish-language \"dramatic poem in eight sections\", The Golem. In 1923, Romanian composer Nicolae Bretan wrote the one-act opera The Golem, first performed the following year in Cluj and later revived in Denver, Colorado, US in 1990. Nobel prize winner Isaac Bashevis Singer also wrote a version of the legend, and Elie Wiesel wrote a children's book on the legend.\n\n* Inspired by Gustav Meyrink's novel was a classic set of expressionistic silent movies (1915–1920), Paul Wegener's Golem series, of which The Golem: How He Came into the World (also released as The Golem, 1920, US 1921: the only surviving film of the trilogy) is especially famous. In the first film the golem is revived in modern times before falling from a tower and breaking apart. Also notable is Julien Duvivier's Le Golem (1936), a French/Czechoslovakian sequel to the Wegener film.\n\n* A two-part Czechoslovakian color film The Emperor and the Golem was produced in 1951.\n\n* It! (alternate titles: Anger of the Golem, Curse of the Golem) is a 1967 British horror film made by Seven Arts Productions and Gold Star Productions, Ltd. that features the Golem of Prague as its main subject. It stars Roddy McDowall as the mad assistant museum curator Arthur Pimm, who brings the golem to life.\n\n* In 1974, CBS Radio Mystery Theater aired an episode entitled The Golem, which takes place during the Holocaust, and Marvel Comics published three Strange Tales comic books that included a golem character, and later series included variations of the golem idea. Pavlik, John V.  [https://books.google.com/books?idcCIlDwAAQBAJ&pg\nPA250&lpgPA250&dq\nCBS+Radio+Mystery+Theater+Golem&sourcebl&ots\nxhAmzhqu7X&sigmm4nvw5cCWkTAqhtp9tJxKpX4lI&hl\nen&saX&ved\n0ahUKEwikvarQ_PLVAhULhlQKHQ30BmU4ChDoAQgpMAE#vonepage&q\nCBS%20Radio%20Mystery%20Theater%20Golem&f=false \"Masterful Stories: Lessons from Golden Age Radio.\"] Google Books.  25 August 2017.\n\n* Marge Piercy's 1991 Arthur C. Clarke Award-winning novel He, She and It features a substantial subplot that retells the story of Rabbi Loew and his golem. The novels of Terry Pratchett in the fictional setting of Discworld also include several golems as characters. They are introduced in the 19th Discworld novel, \"Feet of Clay\" (1996).\n\n* The Golem of Prague is an antihero in DC Comics' 1991 reboot of the superhero Ragman. In the story, it serves as the predecessor to the Ragman suit itself, replaced by the Rabbis as a protector when it becomes uncontrollable. When the main character, Rory Regan, gains control of the Ragman suit, the Golem reawakens and hunts him down, but falls in love with a human woman along the way. The Golem later returned in the 1993 sequel series, \"Ragman: Cry of the Dead\".\n\n* In Cynthia Ozick's 1997 novel The Puttermesser Papers, a modern Jewish woman, Ruth Puttermesser, creates a female golem out of the dirt in her flowerpots to serve as the daughter she never had. The golem helps Puttermesser become elected Mayor of New York before it begins to run out of control.\n\n* Pete Hamill's 1997 novel Snow In August includes a story of a rabbi from Prague who has a golem.\n\n* The 1997 The X-Files episode, \"Kaddish,\" featured a golem.\n\n* Golem is also one of the original 151 Pokemon released in 1998.\n\n* Michael Chabon's 2000 novel, The Amazing Adventures of Kavalier & Clay, features one of the protagonists, escape artist Josef Kavalier, smuggling himself out of Prague along with the golem. Petrie describes the theme of escape in the novel, culminating in Kavalier's own drawing of a modern graphic novel centered on a golem.\n\n* Ted Chiang's short story, Seventy-Two Letters, published in 2000, explores the connection between a golem and the name that animates it.\n\n* In James Sturm's 2001 graphic novel The Golem's Mighty Swing, a Jewish baseball team in the 1920s creates a golem to help them win their games.\n\n* In the Michael Scott novel The Alchemyst, the immortal Dr. John Dee attacked Nicholas Flamel with two golems, which, along with being made of mud, each had a pair of shiny stone \"eyes.\"\n\n* Jonathan Stroud's children's fantasy book The Golem's Eye centers on a golem created by magicians in an alternate London. The story depicts the golem as being impervious to magical attacks. The golem is finally destroyed by removing the creation parchment from its mouth.\n\n* In Byron L. Sherwin's 2006 novel The Cubs and the Kabbalist, rabbis create a golem named Sandy Greenberg to help baseball's Chicago Cubs win the World Series.\n\n* Golems appear in the fantasy role-playing game Dungeons & Dragons (first published in the 1970s), and the influence of Dungeons & DragonsPC Gamer, \"How Dungeons & Dragons shaped the modern videogame\" has led to the inclusion of golems in other video games and in tabletop role-playing games.\n\n* The 2016 Deus Ex: Mankind Divided is set in Prague and features a section of the city which is nicknames \"Golem City\", being a ghetto for mechanically augmented people. The augmented were placed in isolation after an event in which many of them suffered a breakdown and turned on \"normal\" humans; this most likely led to the place's nickname, as the \"golem that turned on its master.\"\n\n* In 2014 the theatre group 1927 produced Golem, a show loosely based on the Jewish myth in co-production with Salzburg Festival, Théâtre de la Ville Paris & Young Vic Theatre. It had its world premiere at the Salzburg Festival in August 2014.http://www.19-27.co.uk/1927/",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Golem" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11888" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In Jewish folklore, a golem ( ; ) is an animated anthropomorphic being that is magically created entirely from inanimate matter (specifically clay or mud). The word was used to mean an amorphous, unformed material in Psalms and medieval writing. page 296\n\nThe most famous golem narrative involves Judah Loew ben Bezalel, the late-16th-century rabbi of Prague. There are many tales differing on how the golem was brought to life and afterward controlled.  According to Moment Magazine, \"the golem is a highly mutable metaphor with seemingly limitless symbolism. It can be victim or villain, Jew or non-Jew, man or woman—or sometimes both. Over the centuries it has been used to connote war, community, isolation, hope and despair.\"Cooper, Marilyn.  [http://www.momentmag.com/jewish-word-golem/ Jewish Word | Golem.\"] Moment Magazine.  17 July 2017.  24 August 2017.\n\nHistory\n\nEtymology\n\nThe word golem occurs once in the Bible in , which uses the word  (galmi; my golem), that means \"my light form\", \"raw\" material, connoting the unfinished human being before God's eyes. The Mishnah uses the term for an uncultivated person: \"Seven characteristics are in an uncultivated person, and seven in a learned one,\" (שבעה דברים בגולם) (Pirkei Avot 5:6 in the Hebrew text; English translations vary). In Modern Hebrew, golem is used to mean \"dumb\" or \"helpless\". Similarly, it is often used today as a metaphor for a brainless lunk or entity who serves a man under controlled conditions but is hostile to him under others. \"Golem\" passed into Yiddish as goylem to mean someone who is clumsy or slow.\n\nEarliest stories\n\nThe oldest stories of golems date to early Judaism. In the Talmud (Tractate Sanhedrin 38b), Adam was initially created as a golem (גולם) when his dust was \"kneaded into a shapeless husk.\" Like Adam, all golems are created from mud by those close to divinity, but no anthropogenic golem is fully human. Early on, the main disability of the golem was its inability to speak. Sanhedrin 65b describes Rava creating a man (gavra). He sent the man to Rav Zeira. Rav Zeira spoke to him, but he did not answer. Rav Zeira said, \"You were created by the sages; return to your dust\".\n\nDuring the Middle Ages, passages from the Sefer Yetzirah (Book of Creation) were studied as a means to create and animate a golem, although there is little in the writings of Jewish mysticism that supports this belief. It was believed that golems could be activated by an ecstatic experience induced by the ritualistic use of various letters of the Hebrew Alphabet forming a \"shem\" (any one of the Names of God), wherein the shem was written on a piece of paper and inserted in the mouth or in the forehead of the golem.\n\nA golem is inscribed with Hebrew words in some tales (for example, some versions of Chełm and Prague, as well as in Polish tales and versions of Brothers Grimm), such as the word emet (אמת, \"truth\" in Hebrew) written on its forehead. The golem could then be deactivated by removing the aleph (א) in emet,Kerstein, Benjamin.  Jewish Ideas Daily.  14 September 2010.  24 August 2017. thus changing the inscription from \"truth\" to \"death\" (met מת, meaning \"dead\").  Rabbi Jacob ben Shalom arrived at Barcelona from Germany in 1325 and remarked that the law of destruction is the reversal of the law of creation.\n\nJoseph Delmedigo informs us in 1625 that \"many legends of this sort are current, particularly in Germany.\"\n\nThe earliest known written account of how to create a golem can be found in Sodei Razayya by Eleazar ben Judah of Worms (1165–1230).\n\nThe Golem of Chełm\n\nThe oldest description of the creation of a golem by a historical figure is included in a tradition connected to Rabbi Eliyahu of Chełm (1550–1583).[http://www.press.umich.edu/pdf/9780472117598-intro.pdf Introduction to \"The Golem Returns\"]. Retrieved 2011-09-23.\n\nA Polish Kabbalist, writing in about 1630–1650, reported the creation of a golem by Rabbi Eliyahu thus: \"And I have heard, in a certain and explicit way, from several respectable persons that one man [living] close to our time, whose name is R. Eliyahu, the master of the name, who made a creature out of matter [Heb. Golem] and form [Heb. tzurah] and it performed hard work for him, for a long period, and the name of emet was hanging upon his neck, until he finally removed it for a certain reason, the name from his neck and it turned to dust.\" A similar account was reported by a Christian author, Christoph Arnold, in 1674.\n\nRabbi Jacob Emden (d. 1776) elaborated on the story in a book published in 1748: \"As an aside, I'll mention here what I heard from my father's holy mouth regarding the Golem created by his ancestor, the Gaon R. Eliyahu Ba'al Shem of blessed memory. When the Gaon saw that the Golem was growing larger and larger, he feared that the Golem would destroy the universe. He then removed the Holy Name that was embedded on his forehead, thus causing him to disintegrate and return to dust. Nonetheless, while he was engaged in extracting the Holy Name from him, the Golem injured him, scarring him on the face.\"שו\"ת שאילת יעב\"ץ, ח\"ב, [http://www.hebrewbooks.org/pdfpager.aspx?req1408&pgnum\n225 סי' פ\"ב]. Cf. his בירת מגדל עוז, Altona, 1748, p. 259a; מטפחת ספרים, Altona, 1768, [http://hebrewbooks.org/pdfpager.aspx?req21115&st\n&pgnum90&hilite\n p. 45a]; and מגילת ספר, ed. Kahana, Warsaw, 1896, [http://www.hebrewbooks.org/pdfpager.aspx?req37017&st\n&pgnum12&hilite\n p. 4]. See also שו\"ת חכם צבי, [http://www.hebrewbooks.org/pdfpager.aspx?req19566&st\n&pgnum=163 סי' צ\"ג], and the references cited in שו\"ת חכם צבי עם ליקוטי הערות, Jerusalem, 1998, vol. 1, p. 421 and in the periodical כפר חב\"ד, number 351 (1988), p. 51. Cited by Leiman, S.Z., [http://seforim.blogspot.com/2007/02/shnayer-z-leiman-did-disciple-of.html \"Did a Disciple of the Maharal Create a Golem?\"]\n\nAccording to the Polish Kabbalist, \"the legend was known to several persons, thus allowing us to speculate that the legend had indeed circulated for some time before it was committed to writing and, consequently, we may assume that its origins are to be traced to the generation immediately following the death of R. Eliyahu, if not earlier.\"The tradition is also recorded in ה לחורבנה / תל-אביב : ארגון יוצאי חלם בישראל ובארה\"ב, תשמ\"א\n\nThe classic narrative: The Golem of Prague\n\nThe most famous golem narrative involves Judah Loew ben Bezalel, the late 16th century rabbi of Prague, also known as the Maharal, who reportedly \"created a [g]olem out of clay from the banks of the Vltava River and brought it to life through rituals and Hebrew incantations to defend the Prague ghetto from anti-Semitic attacks\" and pogroms.Green, Kayla.  [http://www.momentmag.com/the-golem-in-the-attic/ \"The Golem in the Attic.\"] Moment Magazine.  1 February 2011.  25 August 2017. Depending on the version of the legend, the Jews in Prague were to be either expelled or killed under the rule of Rudolf II, the Holy Roman Emperor. To protect the Jewish community, the rabbi constructed the Golem out of clay from the banks of the Vltava river, and brought it to life through rituals and Hebrew incantations. The Golem was called Josef and was known as Yossele. It was said that he could make himself invisible and summon spirits from the dead. Rabbi Loew deactivated the Golem on Friday evenings by removing the shem before the Sabbath (Saturday) began,  so as to let it rest on Sabbath. One Friday evening Rabbi Loew forgot to remove the shem, and feared that the Golem would desecrate the Sabbath. A different story tells of a golem that fell in love, and when rejected, became the violent monster seen in most accounts. Some versions have the golem eventually going on a murderous rampage.\n\nThe rabbi then managed to pull the shem from his mouth and immobilize him in front of the synagogue, whereupon the golem fell in pieces. The Golem's body was stored in the attic genizah of the Old New Synagogue, where it would be restored to life again if needed. According to legend, the body of Rabbi Loew's Golem still lies in the synagogue's attic. When the attic was renovated in 1883, no evidence of the Golem was found.[https://books.google.com/books?idZjolCwAAQBAJ&pg\nPT404&lpgPT404&dq\nattic+golem+1883&sourcebl&ots\nPVluoYidGl&sig9Kw3_01uB-TAEds0uGw5BMk8jzA&hl\nen&saX&ved\n0ahUKEwj2nZeLyvDVAhWhjlQKHUkjA3gQ6AEIYzAN#vonepage&q\nattic%20golem%201883&f=false \"TIME-LIFE Mysteries of the Unknown: Inside the World of the Strange and ....\"] Google Books.  24 August 2017. Some versions of the tale state that the Golem was stolen from the genizah and entombed in a graveyard in Prague's Žižkov district, where the Žižkov Television Tower now stands. A recent legend tells of a Nazi agent ascending to the synagogue attic during World War II and trying to stab the Golem, but he died instead. The attic is not open to the general public.[http://atlasobscura.com/place/old-new-synagogue Old New Synagogue located in Praha, Czech Republic|Atlas Obscura|Curious and Wondrous Travel Destinations]. Atlas Obscura. Retrieved on 2011-09-23.\n\nSome Orthodox Jews believe that the Maharal did actually create a golem.  The evidence for this belief has been analyzed from an Orthodox Jewish perspective by Shnayer Z. Leiman.Leiman, S. Z., [http://seforim.blogspot.com/2010/05/golem-of-prague-in-recent-rabbinic.html The Golem of Prague in Recent Rabbinic Literature]\n\nSources of the Prague narrative\n\nThe general view of historians and critics is that the story of the Golem of Prague was a German literary invention of the early 19th century.  According to John Neubauer, the first writers on the Prague Golem were:\n* 1837: Berthold Auerbach, Spinoza\n* 1841: Gustav Philippson, Der Golam, eine Legende\n* 1841: Franz Klutschak, Der Golam des Rabbi Löw\n* 1842: Adam Tendlau Der Golem des Hoch-Rabbi-Löw\n* 1847: Leopold Weisel, Der Golem\n\nCathy Gelbin found an earlier source in Philippson's The Golem and the Adulteress, published in the Jewish magazine Shulamit in 1834, which describes how the Maharal sent a golem to find the reason for an epidemic among the Jews of Prague.Gelbin, C . S., [https://books.google.com/books?id\n5HkzGcG9YeAC&printsecfrontcover&source\ngbs_ge_summary_r&cad0#v\nonepage&qMaharal&f\nfalse The Golem Returns – From German Romantic Literature to Global Jewish Culture, 1808–2008], University of Michigan, 2011See also [http://www.jewishencyclopedia.com/view.jsp?artid334&letter\nG&search=golem#1137#ixzz1XiylKy6h Jewish Encyclopedia] (1906): \"A legend connected with [the Maharal's] Golem is given in German verse by Gustav Philippson in Allg. Zeit. des Jud. 1841, No. 44 (abridged in Sulamith, viii. 254; translated into Hebrew in Kokebe Yiẓḥaḳ, No. 28, p. 75, Vienna, 1862)\"\n\nAll of these early accounts of the Golem of Prague are in German by Jewish writers. It has been suggested that they emerged as part of a Jewish folklore movement parallel with the contemporary German folklore movement.\n\nThe origins of the story have been obscured by attempts to exaggerate its age and to pretend that it dates from the time of the Maharal. It has been said that Rabbi Yudel Rosenberg (1859–1935)Kieval, Hillel J.  [http://www.yivoencyclopedia.org/article.aspx/Golem_Legend \"Golem Legend.\"] The YIVO Encyclopedia.  24 August 2017. of Tarłów (before moving to Canada where he became one of its most prominent rabbis) originated the idea that the narrative dates from the time of the Maharal. Rosenberg published Nifl'os Maharal (Wonders of Maharal) (Piotrków, 1909) which purported to be an eyewitness account by the Maharal's son-in-law, who had helped to create the Golem. Rosenberg claimed that the book was based upon a manuscript that he found in the main library in Metz. Wonders of Maharal \"is generally recognized in academic circles to be a literary hoax\".[http://traditionarchive.org/news/originals/Volume%2036/No.%201/The%20Adventure%20of%20the.pdf Leiman, S.Z., \" The Adventure of The Maharal of Prague in London: R. Yudl Rosenberg and The Golem of Prague\",] Tradition, 36:1, 2002Sherwin, Byron L. (1985) The Golem Legend: Origins and Implications. New York: University Press of America Gershom Sholem observed that the manuscript \"contains not ancient legends but modern fiction\".Sholem, G., Major Trends in Jewish Mysticism, Schocken, 1961 Rosenberg's claim was further disseminated in Chayim Bloch's (1881–1973) The Golem: Legends of the Ghetto of Prague (English edition 1925).\n\nThe Jewish Encyclopedia of 1906 cites the historical work Zemach David by David Gans, a disciple of the Maharal, published in 1592.[http://www.jewishencyclopedia.com/view.jsp?artid\n334&letterG&search\ngolem#1137 GOLEM]. Jewish Encyclopedia. Retrieved on 2011-09-23.[http://www.epa.hu/01400/01462/00004/pdf/1986_2_296-298.pdf HUNGARIAN STUDIES 2. No. 2. Nemzetközi Magyar Filológiai Társaság. Akadémiai Kiadó Budapest [1986]]. (PDF). Retrieved on 2011-09-23. In it, Gans writes of an audience between the Maharal and Rudolph II: \"Our lord the emperor ... Rudolph ... sent for and called upon our master Rabbi Low ben Bezalel and received him with a welcome and merry expression, and spoke to him face to face, as one would to a friend. The nature and quality of their words are mysterious, sealed and hidden.\"Gans, D., Zemach David, ed. M.Breuer, Jerusalem, 1983, p.145, cited [http://www.rabbiyehudahyudelrosenberg.com/ Rabbi Yehudah Yudel Rosenberg and the Maharal's Golem] But it has been said of this passage, \"Even when [the Maharal is] eulogized, whether in David Gans' Zemach David or on his epitaph …, not a word is said about the creation of a golem. No Hebrew work published in the 16th, 17th, and 18th centuries (even in Prague) is aware that the Maharal created a golem.\"Neubauer, J., [https://books.google.com/books?id\nYINYl4iv4ecC&pgPA303&lpg\nPA303&dqgustav+philippson+the+Golem&source\nbl&otseuPUiGZv7x&sig\npxjaHEMbgMEPZsW6wk9knCLhrTw&hlen&ei\nLs9tTpXgD8i3hAf85JiDDA&saX&oi\nbook_result&ctresult&resnum\n2&ved0CB0Q6AEwAQ#v\nonepage&qgolem&f\nfalse \"How did the Golem get to Prague?\"], in Cornis-Pope, M., and Neubauer, J. History of The Literary Cultures of East-Central Europe, John Benjamins, 2010 Furthermore, the Maharal himself did not refer to the Golem in his writings. Rabbi Yedidiah Tiah Weil (1721–1805), a Prague resident, who described the creation of golems, including those created by Rabbis Avigdor Kara of Prague (died 1439) and Eliyahu of Chelm, did not mention the Maharal, and Rabbi Meir Perels' biography of the Maharal published in 1718 does not mention a golem.\n\nThe Golem of Vilna\n\nThere is a similar tradition relating to the Vilna Gaon or \"the saintly genius from Vilnius\" (1720–1797). Rabbi Chaim Volozhin (Lithuania 1749–1821) reported in an introduction to Sifra de Tzeniuta that he once presented to his teacher, the Vilna Gaon, ten different versions of a certain passage in the Sefer Yetzira and asked the Gaon to determine the correct text.Chaim of Volozhin.  [https://books.google.com/books?id\nUXtWbo-QGoAC&pgPT197&lpg\nPT197&dqgolem+Volozhin&source\nbl&otsQN3UmnwneO&sig\ndgIOspJMP-FDHhtKj0YCaQ20quk&hlen&sa\nX&ved0ahUKEwjFn4nQ2vDVAhUpsVQKHXb0BBkQ6AEITzAL#v\nonepage&qgolem%20Volozhin&f\nfalse \"Sifra de Tzeniuta, Introduction.\"] The Kabbalistic Tradition: An Anthology of Jewish Mysticism, edited by Alan Unterman.  Google Books.  24 August 2017. The Gaon immediately identified one version as the accurate rendition of the passage. The amazed student then commented to his teacher that, with such clarity, he should easily be able to create a live human. The Gaon affirmed Rabbi Chaim's assertion, and said that he once began to create a person when he was a child, under the age of 13, but during the process he received a sign from Heaven ordering him to desist because of his tender age.\n\nHubris theme\n\nThe existence of a golem is sometimes a mixed blessing. Golems are not intelligent, and if commanded to perform a task, they will perform the instructions literally. In many depictions, Golems are inherently perfectly obedient. In its earliest known modern form, the Golem of Chełm became enormous and uncooperative. In one version of this story, the rabbi had to resort to trickery to deactivate it, whereupon it crumbled upon its creator and crushed him. There is a similar hubris theme in Frankenstein, The Sorcerer's Apprentice, and some other stories in popular culture, for example: The Terminator. The theme also manifests itself in R.U.R. (Rossum's Universal Robots), Karel Čapek's 1921 play which coined the term robot; the play was written in Prague, and while Čapek denied that he modeled the robot after the Golem, there are many similarities in the plot.Koreis, Voyen.  Introduction.  [https://books.google.com/books?id\nUP-Ui34-M7UC&pgPA9&lpg\nPA9&dqKarel+%C4%8Capek+golem&source\nbl&ots2WLnFDNDEA&sig\nxgQvJZYlT9nWVC5sqMWcjfPhhUU&hlen&sa\nX&ved0ahUKEwjC-bb4-vLVAhXosFQKHbVyDngQ6AEIQjAE#v\nonepage&qKarel%20%C4%8Capek%20golem&f\nfalse \"Two Plays by Karel Capek: R.U.R. (Rossum's Universal Robots) & The Robber.\"] Google Books.  25 August 2017.\n\nCulture of the Czech Republic\n\nThe Golem is a popular figure in the Czech Republic. There are several restaurants and other businesses whose names make reference to the creature, a Czech strongman (René Richter) goes by the nickname \"Golem\", and a Czech monster truck outfit calls itself the \"Golem Team.\"\n\nAbraham Akkerman preceded his article on human automatism in the contemporary city with a short satirical poem on a pair of golems turning human. Published also as Paper CTS-04-06 by the Center for Theoretical Study, Prague.\n\nClay Boy variation\n\nA Yiddish and Slavic folktale is the Clay Boy, which combines elements of the Golem and The Gingerbread Man, in which a lonely couple make a child out of clay, with disastrous or comical consequences. In one common Russian version, an older couple whose children have left home make a boy out of clay, and dry him by their hearth. The Clay Boy comes to life; at first the couple are delighted and treat him like a real child, but the Clay Boy does not stop growing, and eats all their food, then all their livestock, and then the Clay Boy eats his parents. The Clay Boy rampages through the village until he is smashed by a quick-thinking goat.\n\nGolem in popular culture\n\n* Mainstream European society adopted the golem in the early 20th century. Most notably, Gustav Meyrink's 1914 novel Der Golem is loosely inspired by the tales of the golem created by Rabbi Loew. Another famous treatment from the same era is H. Leivick's 1921 Yiddish-language \"dramatic poem in eight sections\", The Golem. In 1923, Romanian composer Nicolae Bretan wrote the one-act opera The Golem, first performed the following year in Cluj and later revived in Denver, Colorado, US in 1990. Nobel prize winner Isaac Bashevis Singer also wrote a version of the legend, and Elie Wiesel wrote a children's book on the legend.\n\n* Inspired by Gustav Meyrink's novel was a classic set of expressionistic silent movies (1915–1920), Paul Wegener's Golem series, of which The Golem: How He Came into the World (also released as The Golem, 1920, US 1921: the only surviving film of the trilogy) is especially famous. In the first film the golem is revived in modern times before falling from a tower and breaking apart. Also notable is Julien Duvivier's Le Golem (1936), a French/Czechoslovakian sequel to the Wegener film.\n\n* A two-part Czechoslovakian color film The Emperor and the Golem was produced in 1951.\n\n* It! (alternate titles: Anger of the Golem, Curse of the Golem) is a 1967 British horror film made by Seven Arts Productions and Gold Star Productions, Ltd. that features the Golem of Prague as its main subject. It stars Roddy McDowall as the mad assistant museum curator Arthur Pimm, who brings the golem to life.\n\n* In 1974, CBS Radio Mystery Theater aired an episode entitled The Golem, which takes place during the Holocaust, and Marvel Comics published three Strange Tales comic books that included a golem character, and later series included variations of the golem idea. Pavlik, John V.  [https://books.google.com/books?idcCIlDwAAQBAJ&pg\nPA250&lpgPA250&dq\nCBS+Radio+Mystery+Theater+Golem&sourcebl&ots\nxhAmzhqu7X&sigmm4nvw5cCWkTAqhtp9tJxKpX4lI&hl\nen&saX&ved\n0ahUKEwikvarQ_PLVAhULhlQKHQ30BmU4ChDoAQgpMAE#vonepage&q\nCBS%20Radio%20Mystery%20Theater%20Golem&f=false \"Masterful Stories: Lessons from Golden Age Radio.\"] Google Books.  25 August 2017.\n\n* Marge Piercy's 1991 Arthur C. Clarke Award-winning novel He, She and It features a substantial subplot that retells the story of Rabbi Loew and his golem. The novels of Terry Pratchett in the fictional setting of Discworld also include several golems as characters. They are introduced in the 19th Discworld novel, \"Feet of Clay\" (1996).\n\n* The Golem of Prague is an antihero in DC Comics' 1991 reboot of the superhero Ragman. In the story, it serves as the predecessor to the Ragman suit itself, replaced by the Rabbis as a protector when it becomes uncontrollable. When the main character, Rory Regan, gains control of the Ragman suit, the Golem reawakens and hunts him down, but falls in love with a human woman along the way. The Golem later returned in the 1993 sequel series, \"Ragman: Cry of the Dead\".\n\n* In Cynthia Ozick's 1997 novel The Puttermesser Papers, a modern Jewish woman, Ruth Puttermesser, creates a female golem out of the dirt in her flowerpots to serve as the daughter she never had. The golem helps Puttermesser become elected Mayor of New York before it begins to run out of control.\n\n* Pete Hamill's 1997 novel Snow In August includes a story of a rabbi from Prague who has a golem.\n\n* The 1997 The X-Files episode, \"Kaddish,\" featured a golem.\n\n* Golem is also one of the original 151 Pokemon released in 1998.\n\n* Michael Chabon's 2000 novel, The Amazing Adventures of Kavalier & Clay, features one of the protagonists, escape artist Josef Kavalier, smuggling himself out of Prague along with the golem. Petrie describes the theme of escape in the novel, culminating in Kavalier's own drawing of a modern graphic novel centered on a golem.\n\n* Ted Chiang's short story, Seventy-Two Letters, published in 2000, explores the connection between a golem and the name that animates it.\n\n* In James Sturm's 2001 graphic novel The Golem's Mighty Swing, a Jewish baseball team in the 1920s creates a golem to help them win their games.\n\n* In the Michael Scott novel The Alchemyst, the immortal Dr. John Dee attacked Nicholas Flamel with two golems, which, along with being made of mud, each had a pair of shiny stone \"eyes.\"\n\n* Jonathan Stroud's children's fantasy book The Golem's Eye centers on a golem created by magicians in an alternate London. The story depicts the golem as being impervious to magical attacks. The golem is finally destroyed by removing the creation parchment from its mouth.\n\n* In Byron L. Sherwin's 2006 novel The Cubs and the Kabbalist, rabbis create a golem named Sandy Greenberg to help baseball's Chicago Cubs win the World Series.\n\n* Golems appear in the fantasy role-playing game Dungeons & Dragons (first published in the 1970s), and the influence of Dungeons & DragonsPC Gamer, \"How Dungeons & Dragons shaped the modern videogame\" has led to the inclusion of golems in other video games and in tabletop role-playing games.\n\n* The 2016 Deus Ex: Mankind Divided is set in Prague and features a section of the city which is nicknames \"Golem City\", being a ghetto for mechanically augmented people. The augmented were placed in isolation after an event in which many of them suffered a breakdown and turned on \"normal\" humans; this most likely led to the place's nickname, as the \"golem that turned on its master.\"\n\n* In 2014 the theatre group 1927 produced Golem, a show loosely based on the Jewish myth in co-production with Salzburg Festival, Théâtre de la Ville Paris & Young Vic Theatre. It had its world premiere at the Salzburg Festival in August 2014.http://www.19-27.co.uk/1927/. Golem. http://en.wikipedia.org/?curid=11888."
  }
}
