{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8500",
  "eid" : "e84bc950-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778469477,
  "textBody" : "Dar es Salaam (from  ', \"the house of peace\"; formerly Mzizima) is the former capital and largest city in Tanzania. It is most populous city in the East Africa coastal region and a regionally important economic centre. Located on the Swahili coast, the city is one of the fastest growing cities in the world.\n\nUntil 1974, Dar es Salaam served as Tanzania’s capital city, at which point the capital city commenced transferring to Dodoma, which was officially completed in 1996. However, as of 2017, it continues to remain a focus of central government bureaucracy, although this is in the process of fully moving to Dodoma. In addition, it is Tanzania's most prominent city in arts, fashion, media, music, film and television and a leading financial centre, with the Dar es Salaam Stock Exchange (DSE) being the country's first and most important stock exchange market. The city is the leading arrival and departure point for most tourists who visit Tanzania, including the national parks for safaris and the islands of Unguja and Pemba. Dar es Salaam is also the largest and most populous Swahili-speaking city in the world.\n\nIt is the capital of the co-extensive Dar es Salaam Region, which is one of Tanzania's 31 administrative regions and consists of five districts: Kinondoni in the north, Ilala in the centre, Ubungo, Temeke in the south and Kigamboni. The region had a population of 4,364,541 as of the official 2012 census.[http://www.nbs.go.tz/sensa/PDF/Census%20General%20Report%20-%2029%20March%202013_Combined_Final%20for%20Printing.pdf Population Distribution by Administrative Units, United Republic of Tanzania, 2013] \n\nHistory\n\nIn the 19th century, Mzizima (Kiswahili for \"healthy town\") was a coastal fishing village on the periphery of Indian Ocean trade routes. In 1865 or 1866, Sultan Majid bin Said of Zanzibar began building a new city very close to Mzizima and named it Dar es Salaam. The name is commonly translated as \"abode/home of peace\", based on the Arabic dar (\"house\"), and the Arabic es salaam (\"of peace\"), as opposed to the \"house of war\" (dar al-harb). Dar es Salaam fell into decline after Majid's death in 1870, but was revived in 1887 when the German East Africa Company established a station there. The town's growth was facilitated by its role as the administrative and commercial centre of German East Africa and industrial expansion resulting from the construction of the Central Railway Line in the early 1900s.\n\nGerman East Africa was captured by the British during World War I and became Tanganyika, with Dar es Salaam remaining the administrative and commercial centre. Under British indirect rule, separate European (e.g., Oyster Bay) and African (e.g., Kariakoo and Ilala) areas developed at a distance from the city centre. The city's population also included a large number of workers from British India, many of whom came to dominate trade and commerce. After World War II, Dar es Salaam experienced a period of rapid growth.\n\nPolitical developments, including the formation and growth of the Tanganyika African National Union, led to Tanganyika attaining independence from colonial rule in December 1961. Dar es Salaam continued to serve as its capital, even when in 1964 Tanganyika and Zanzibar merged to form Tanzania. In 1973, however, provisions were made to relocate the capital to Dodoma, a more centrally located city in the interior. The relocation process has not yet been completed, and Dar es Salaam remains Tanzania's primary city.\n\nIn 1967, the Tanzanian government declared the Ujamaa policy, that set Tanzania into a socialist path. The move slowed down the potential growth of the city as the government encouraged people not to move in cities but stay in Ujamaa socialist villages. But by the 1980s the Ujamaa policy proved to be a failure into combating increasing poverty, hunger, and delayed development that Tanzania faced. This led to the 1980s liberalization policy that virtually ended socialism and its spirit within the Tanzania's government. The move led to increasing immigration of skilled rural tradesmen and women from rural areas from cities with Dar es Salaam hoping to becoming one of the leading city in the world in receiving skilled migrants for trade and commerce from up country areas and internationally.\n\nUntil the late 1990s, Dar es Salaam was not put into the same category as Africa's leading cities like Nairobi, Johannesburg, Lagos, or Addis Ababa. But the 2000s decade became the turning point as the city experienced one of Africa's fastest urbanization rates as businesses were opened and prospered, Tanzanian banks headquartered in the city started to run more proper, the Dar es Salaam Stock Exchange expanded, and the Dar es Salaam harbour proved to be the most important in Tanzania and prominent for entrepot trade with landlocked countries like the Democratic Republic of Congo, Rwanda, Burundi, and Zambia. The CBD skyline hosts tall buildings, among them the 35-floor PSPF Tower, finished in 2015, and the Tanzania Ports Authority (TPA) Tower, currently under construction .\n\nGeography\n\nDar es Salaam is located at 6°48' South, 39°17' East (−6.8000, 39.2833),[http://earth-info.nga.mil/gns/html/cntry_files.html NGA: Country Files] , NGA.mil on a natural harbour on the eastern coast of East Africa, with sandy beaches in some areas.\n\nThe region of Dar es Salaam is divided into five districts.\n\nDistricts of Dar es Salaam Region\n\nDar es Salaam Region is divided into five administrative districts. All five are governed as municipal councils, and so all of the city's suburbs or wards are affiliated with them. The regional commissioner is Paul Makonda.\n\nKinondoni\n\nKinondoni is the most populated amongst the districts, with half of the city's population residing within it. It is also home to high-income suburbs. These include:\n\n* Masaki, Oysterbay and Ada Estate are the high-income suburbs located along the central beach. During the Colonial Era, they were the major European suburbs of the city. Now diplomats and expatriates reside in these areas.  Oysterbay Beach, also known as Coco Beach, is the only white sandy beach in Kinondoni and is the most famous in the area. Many luxury apartments line the waterfront, accommodating the rapid growth of foreigners, mostly Europeans and Asians.\n* Mikocheni and Regent Estate are also suburbs within the district. According to the 2012 census, the Mikocheni ward had a population of 32,947. Mikocheni is the home of some political figures, including the first president of Tanzania, Julius K. Nyerere and opposition party leader, Freeman Mbowe.\n* Msasani is a peninsula to the northeast of the city center. It is home to expatriates from the United Kingdom and other western countries. Msasani contains a mixture of traditional shops and western-oriented resorts and stores.\n* Mbezi Beach is the beachfront suburb located along the northern Dar es Salaam Beach. It is noted for its beautiful beaches with several tourist hotels, and also as the place of residence of people of high social status and some politicians.\n* Sinza, Kijitonyama, Magomeni, Kinondoni and Mwenge are more ethnically mixed than the areas above. The wards also have the most prosperous business climate outside of the central business district, with shops, bars, restaurants and hotels located there.\n* Kimara and Mbezi Louis are hilly, mostly upper class, suburbs far from the city. Due to the distance from the city center, it is quieter, with cooler weather.\n* Manzese, Tandale, Mwananyamala-Kisiwani and Kigogo are considered low-income neighborhoods characterized by poor settlement planning, low quality housing and social services.\n\nIlala\n\nIlala is the administrative district of Dar es Salaam where almost all government offices and ministries are housed. The Central Business District (locally called \"Posta\") is located in this district. It is the transportation hub of the city, as the Julius Nyerere International Airport, Central Railway Station and Tazara Railway Station are all within the district boundaries. The residential areas are mainly middle to high-income, and some of these are:\n* Upanga & Kisutu had the highest concentration of Asian communities within Dar es Salaam, with residents of Indian and Arabian descent. These areas are also famous for the colonial houses and mansions built in Indian, Arabic and European styles.\n* Kariakoo is the shopping district of the city, perhaps the busiest and largest in East Africa. Shops, bazaars and merchants dot the streets, selling products from foodstuffs to hardware materials. The Kariakoo Market, which is the largest, contains the only underground section of the city. It is the major supply point of the food consumed by all the residents of Dar es Salaam.\n* Tabata, Segerea and Ukonga are located a bit farther from the city center. They are growing to become among the busiest in terms of business and entertainment. This has caused serious traffic congestion, which is said to be the worst in all of Dar es Salaam.\n* Ilala is among the middle income suburbs very near to the city center, and is marked by the Askari Monument. It contains some rival gang groups, whose activities include drug trafficking, money laundering, extortion and racketeering. Most famous gang groups are recognized by the color of their scarf (bandanna). These are the black gang, red gang and blue gang, fighting for control and to maintain their territories and interests.\n\nTemeke\n\nTemeke is the industrial district of the city, where the manufacturing centers (heavy and light industry) are located. The Port of Dar es Salaam, which is the largest in the country, is found here. Temeke is believed to have the largest concentration of low-income residents due to industry. Port officials, military and police officers live there.\n*Kurasini located on the Dar es Salaam Harbour, is the home of the Dar es Salaam Port, The Police College, Mgulani Police Barracks and the Dar es Salaam International Trade Fair Grounds. Thus, the main residents are police officers and port officials.\n*Chang'ombe is one of the only higher income areas in Temeke. It has maintained this status due to occupation by African high colonial officers and some industry owners from the colonial era. Chang'ombe is the home of the Dar es Salaam University College of Education, The National Stadium and Uhuru Stadium.\n*Temeke, Mtoni and Tandika are middle to low-income suburbs.\n* Mbagala and Kijichi are middle to low-income suburbs. Mbagala is the largest suburb in the whole district, and is also considered a slum.\n\nUbungo\n\nThe Ubungo terminal is one of the main for the city and serves as a transportation link to most large Dar es salaam urban nodes. The Dar es Salaam commuter rail goes from here to the city centre but it is not fast(narrow gauge) and there are ten level crossings of roads along the route. Its also a hub of industry.\n\nKigamboni\n\n*Kigamboni (South Beach) is a beach front suburb on a peninsula with beautiful, sandy beaches. It is home to a mixed population of lower and higher incomes. There is demand from higher-income people to live in Kigamboni due to its low population density and proximity to the sea, but this demand is constrained by the area being mainly accessible by ferry involving long waiting times for those wishing to cross in a private vehicle, although crossing the ferry on foot or bicycle is quite quick.  There are beach resorts in Kigamboni.\n\nClimate\n\nDue to close proximity to the equator and the warm Indian Ocean, the city experiences tropical climatic conditions, typified by hot and humid weather throughout much of the year. It has a tropical wet and dry climate (Köppen: Aw). Annual rainfall is approximately 1100 mm, and in a normal year there are two rainy seasons: \"the long rains\" in April and May and \"the short rains\" in November and December.\n\nGovernment\n\n\"In 1949 the town became a municipality...[with] four honourable nominated Town Councillors who elected a Mayor.\" \"Until June 1996, Dar es Salaam was managed by the Dar es Salaam City Council...the highest policy-making body in the city.\" As of 2017  Hon Paul Makonda serves as commissioner of Dar es Salaam Region.\n\nGlobalization\n\nDar es Salaam is the city in Tanzania to which villagers flock for better opportunities. Westerners and Asians are also settling in Dar es Salaam, and the surge of foreigners has put pressure on local officials to develop policies better accommodating the growing diverse population of the city and its suburbs.\n\nPopulation\n\nDar es Salaam is the largest city in Tanzania. With a population increase of 5.6 percent per year from 2002 to 2012, the city is the third fastest growing in Africa (ninth fastest in the world), after Bamako and Lagos. The metro population is expected to reach 5.12 million by 2020 and predicted to be as high as 76 million by the year 2100, making Dar Es Salaam the second largest city on earth (after Lagos), by 2100.http://media.wix.com/ugd/672989_62cfa13ec4ba47788f78ad660489a2fa.pdf\n\nAccording to the 2012 national census, the region had a population of 4,364,541, which was much higher than the pre-census projection of 3,270,255.[http://www.nbs.go.tz/sensa/PDF/Census%20General%20Report%20-%2029%20March%202013_Combined_Final%20for%20Printing.pdf Population Distribution by Administrative Units, United Republic of Tanzania, 2013]  For 2002–2012, the region's 5.6 percent average annual population growth rate was the highest in the country. It was also the most densely populated region with 3,133 people per square kilometer.\n\nEconomy and infrastructure\n\nDar es Salaam is Tanzania's most important city for both business and government. The city contains high concentrations of trade and other services and manufacturing compared to other parts of Tanzania, which has about 80 percent of its population in rural areas. Downtown includes  small businesses, many of which are run by traders and proprietors whose families originated from the Middle East and Indian sub-continent—areas of the world with which the settlements of the Tanzanian coast have had long-standing trading relations.\n\nThe Dar es Salaam CBD made up of Kisutu, Kivukoni, Upanga and Kariakoo areas is Tanzania's largest city CBD. All three areas making up the downtown are found in the Ilala district. Kivukoni has the city's important fish market, the Magogoni fish market. Kivukoni also is the place where the Tanzania's central bank, The Bank of Tanzania is located, so is the Dar es Salaam Stock Exchange. Kisutu has businesses and offices and is the location of Dar es Salaam central railway station, the PSPF Towers and the TPA tower. Kariakoo is the prominent shopping area with streets like Congo Street for clothing shops. Uhuru street is for computer and electronics, Msimbazi for mobile phones.\n\nDar es Salaam has a problem with slums. According to a United Nations estimate, 70 percent of the city's population lives in informal settlements.[http://www.bbc.co.uk/news/magazine-18655647 \"Dar es Salaam: Africa's next megacity?\", BBC News, reported by Joe Boyle, 30 July 2012] The poorer residents crowd into downtown areas or large slums, many without running water or basic services. The more wealthy live in beachside mansions in the city's northern districts.\n\nDar es Salaam has had a major construction boom. The PSPF Twin Towers with more than 35 stories is the tallest building in the city and the country. Dar es Salaam has major infrastructural problems, including an outdated transport system and occasional power rationing.\n\nTransportation\n\nOn a natural harbour on the Indian Ocean, it is the hub of the Tanzanian transportation system as the main railways and several  highways originate in or near the city.\n\nLocal Public Transport \n\nThe most common form of transport in Dar es Salaam are the public buses, called dala dala, which are often found at the major bus terminals of Makumbusho and Ubungo. \nDala dalas are cheap and often overcrowded. They are operated by a driver and a conductor: the conductor collects the fare and signals the driver to leave.  They tend to be overcrowded, with passengers sometimes hanging outside the door.Since the introduction of motorcycle transit business known as \"Bodaboda\", most of the people prefer this type of transportation which allows them to get into the city faster compared to the minibuses which face a lot of traffic. Dala dala minibuses are involved in many road accidents, accounting for a large percentage of the 4000+ yearly road deaths.\n\nFurther types of transport are motorcycles and Bajaj a favourite for the tourist hoping to catch the east African sun.\n\nBus \n\nThe government has been introducing a bus rapid transport or metro bus system under Dar es Salaam rapid transit ('mwendo kasi') flagship. The metro buses are managed by UDA (Usafiri Dar es Salaam). \n\nThe bus rapid transit system Phase 1 is completed and already in operation by the Dar Rapid Transit Agency, a government-private sector entity, and began operation on 10 May 2016.  It is branded as UDA-RT (Usafiri Dar-Es-Salaam Rapid Transit).  The first section runs between Kimara in the northwest to Kivukoni on the northern headland of the harbour.Coach & Bus Week, 23 August 2016 Phase 1 was funded by the World Bank, African Development Bank and the Tanzanian government.\n\nFerry \n\nMV Kigamboni ferries are running between Kivukoni and Kigamboni in Dar es Salaam.\n\nRailway \n\nThe Dar es Salaam commuter rail is an urban and suburban commuter rail network serving the commercial city of Dar es Salaam.\nThe city also hosts the head office of Tanzania Zambia Railways Authority (TAZARA) built in the late 1960s to early 1970s. Also it host the offices and infrastructures of the Central Railway Line (Operated by Tanzania Railways Authority, TRL) both railways are used to commute within the city during the day to ease traffic congestion in the already overcrowded roads. Tanzania Railways operates the Central Line from Dar es Salaam to Kigoma. The TAZARA Railway connects Dar es Salaam to Zambia.\n\nAirport \n\nThe Julius Nyerere International Airport is the principal airport serving the country with two operating terminals and one under construction; Terminal Three at Kipawa in Ilala Municipality.\n\nSeaport \n\nThe city has the country's busiest port: The Port of Dar es Salaam handles 90% of the country's cargo. Due to huge influx of cargo and the slow pace of expansion a new cargo port 60 km north of Dar es Salaam is proposed at Bagamoyo.\n\nCulture\n\nDar es Salaam has heavy traffic during the daytime, but after sunset the area is relatively quiet as much of the city's nightlife is located in more residential districts away from the city's mainly commercial centre.\n\nThe sprawling suburbs furthest from the city centre are generally populated by Tanzanians of African descent, with the exception of Oyster Bay, where there is a large population of foreign expatriates. The edges of Dar es Salaam are spreading rapidly, severely taxing the transportation network (which aside from ferries, lacks any kind of mass transit facilities) and raising the prospect of future urban overcrowding.\n\nArt\n\nDar es Salaam (and specifically the area of Oyster Bay) is home to the brightly coloured and tourist-oriented Tingatinga painting style. The Nyumba ya sanaa (\"House of Art\") is a cultural centre, workshop and shop dedicated to Tanzanian art, showcasing and promoting Tanzanian craftmanship.  Prominent Tanzanian sculptor George Lilanga has donated  some of his works to the centre, including decorations of the building's main entrance.\n\nMusic\n\nThe music scene in Dar es Salaam is divided between several styles. The longest standing style is live dance music (muziki wa dansi) bands such as DDC Mlimani Park Orchestra and Malaika Musical Band as examples. Taarab which was traditionally strong in Zanzibar has also found a niche. However, it remains small compared both to dance music and \"Bongo Flava\", a broad category that represents the Tanzanian take on Hip Hop and R&B, which has quickly become the most popular locally produced music. Traditional music, which locally is used to refer to tribal music is still performed but typically only on family oriented occasions such as weddings. Recently there has been development of another music niche, a taste that is rising and to be prominent as BongoFlava known as Singeli with star singers such as Msaga Sumu and Man Fongo.\n\nThis rap scene is also present.[http://www.africanhiphop.com/update/halisi.htm Africanhiphop.com presents: Hali Halisi—the Real Situation]\n\nIn the 1970s, the Ministry of National Youth Culture aimed to create a national culture, which stressed the importance of music.  Dar es Salaam became the music center in Tanzania, with the local radio exposing new bands and dominating the music and cultural scene. With this ujamaa, or family, mentality governing culture and music a unified people’s culture was created, leading to the rise of hip hop music. Throughout the years, the radio in Dar es Salaam has played a major role in the dissemination of music because many people don’t have television and cassettes are used over CDs.\n\nFood\n\nDue in part to the growth of the expatriate community and the increasing importance of tourism, the number of international restaurants has risen  rapidly. The city offers a diversity of cuisine, ranging from traditional Tanzanian Barbecue-style options, such as Nyama Choma (Roasted meat—served with rice or ugali) and Mishkaki (Shish kebab—usually barbecued and served with salt, hot chili peppers, chapati, fries, and rice on the side), as well as the long-established traditional Indian and Zanzibari cuisine, to options from all corners of the globe, including Arab, Chinese, Thai, Turkish, Italian, and Japanese food. People who prefer neither fast food nor traditional restaurants buy their food from street vendors, who usually sell food at low prices. Samosas (sambusas) are common street food items within the city, as the area is largely influenced by the foods brought from India.\n\nTourism\n\nDar es Salaam has two of the five museums comprising the National Museum of Tanzania consortium, namely the National Museum proper and the Makumbusho Cultural Centre & Village Museum.  The National Museum is dedicated to the history of Tanzania; most notably, it exhibits some of the bones of Paranthropus boisei that were among the findings of Louis Leakey at Olduvai.  The Makumbusho Cultural Centre & Village Museum,makumbushovillage.blogspot.de located in the outskirts of the city on the road to Bagamoyo, showcases traditional huts from 16 different Tanzanian ethnic groups.  There are also examples of traditional cultivations, and traditional music and dance shows are held daily. In 2016, there was a breakthrough discovery in Northern Tanzania by a scientist, from the University of Dar es Salaam, of footprints thought to be of a hominid that predates Homo sapiens.\n\nClose to the National Museum are also the botanical gardens, with tropical plants and trees.\n\nThere are beaches on the Msasani peninsula north of Dar es Salaam and in Kigamboni to the south. Trips to the nearby islands of the  Dar es Salaam Marine Reserve are a popular daytrip from the city and a spot for snorkeling, swimming and sunbathing. Bongoyo Island can be reached by boat from the Msasani Slipway.\n\nFurther leisure spots are Mlimani shopping mall.\n\nDar es Salaam boasts of luxury hotels and beaches, some of the major hotels include the Movenpick, Kempinski Kilimanjaro, Peacock, Whitesands and many more.\n\nSports\n\nDar es Salaam is the sports center of Tanzania. Dar es Salaam hosts the second largest stadium in East and Central Africa (National Stadium), which can accommodate up to 60,000 people. The city is home of soccer clubs, the Azam FC, Simba Sports Club (Simba) and Young Africans Sports Club (Yanga) and other teams.\n\nApart from the National Stadium, Dar es salaam is home to the Uhuru Stadium (used mainly for local tournaments and political gatherings), Karume Memorial Stadium (the home of Tanzania Football Federation (TFF)), the Gymkhana Golf Courses (between the city center and the shores of the Indian Ocean), and also has tennis courts, squash courts, and a Fitness club. Outside the metropolitan districts, there is the Lugalo Military Golf Course (located in the Lugalo Military Barracks).\n\nThe National Stadium hosts Dar es Salaam's Young Africans Sports Club, Simba Sports Club, Azam F.C. and other Tanzanian football clubs, and international matches. There is a proposal to build a new stadium in Dodoma, much bigger in capacity than the present one in Dar es salaam by the government as a donation from the Moroccan Kingdom.\n\nDar es Salaam's Mama Africa school, founded in 2003, is known for training some of Africa's finest acrobats.\n\nMedia\n\nNewspapers\n\nDar has newspapers available, particularly from sellers prowling through stationary traffic at road intersections. English-language ones, with online presences, include The Citizen and The Guardian and the leading Kiswahili daily, Mwananchi.Business Times is the only financial and economic newspaper in town. It was established in 1988 and became the first ever private newspaper in Tanzania. Business Times also owns Majira, the Kiswahili leading newspaper in Tanzania.\n\nInternet access\n\nInstallation of a trans-Indian Ocean backbone cable in 2009 has, in theory, made Internet access much more readily available in Dar in particular and in East Africa in general. However, roll-out to end-users is slow, partly because of spotty telephone line coverage, partly due to the substantial prices and long contracts demanded for purchase of bandwidth for small ISPs. Mobile-telephone access to the Internet via 3G and 3.75G is still relatively expensive. 4G is making its way through major cities and towns  with plans to go countrywide in the advanced planning stages.\n\nInternet cafés are found in the city centre and free wifi hotspots in various government and non government institutions as well as public transport.\n\nThe expressed aim of the SEACOM cable is to enable East Africa to develop economically through increased online trading.\n\nEducation\n\nDar es Salaam is the educational centre of Tanzania. The city is home to educational institutions.\n\nUniversities\n\n* The University of Dar es Salaam is the oldest and 2nd largest public university in Tanzania after the University of Dodoma. It is located in the western part of the city, occupying  on the observation hill, 13 km from the city centre. The university has 16,400 undergraduate and 2,700 postgraduate students.http://www.udsm.ac.tz/about_us/index.php\n* Ardhi University (ARU) was established on 1 July 1996 after transforming the former University College of Lands and Architectural Studies (UCLAS) which was then a Constituent College of the University of Dar es Salaam. Historically, Ardhi University, dates back to 1956 when it started as Surveying Training School offering land surveying technician certificate courses at the present location of Mgulani Salvation Army Camp in Dar es Salaam. In 1958, the School was moved to the present location (i.e. the Observation Hill). In 1972, the School was transformed to Ardhi Institute. Then the Institute offered two-year diploma programmes in the fields of Land Surveying and Land Management and Valuation. In the same year, a three-year Diploma program in Urban and Rural Planning was introduced. Later in 1975, all the three-year diploma programmes were upgraded to Advanced Diplomas. The Building Design and Building Economics courses started in 1976 and 1978 respectively. As pointed out earlier, in 1996 Ardhi Institute was affiliated to the University of Dar es Salaam as a Constituent College of the University; subsequently its name changed to the University College of Lands and Architectural Studies (UCLAS). Within ten (10) years, UCLAS increased the number of academic programmes from six (6) to thirty nine (39). The programmes ranging from diplomas to PhDs were offered by two faculties, that is, the Faculty of Architecture and Planning (FAP) and the Faculty of Lands and Environmental Engineering (FLEE). As a result of these changes, student enrollment increased from only 400 in 1996 to about 1,400 in 2007. At the same time, the number of academic staff with PhD increased from 3 in 1996 to over 60 in 2012. At present there are over 80 PhD holders who have graduated from over 25 universities worldwide. In 2007 Ardhi University came into being following the signing of the Ardhi University Charter by His Excellency the President of United Republic of Tanzania. Concurrently, the structure and number of programmes and academic units has increased significantly. At present, the University comprises four Schools, one Institute and several centres. Schools includes; The School of Architecture,Construction Economics and Management(SACEM), The School of Earth Sciences, Real Estates, Business and Informatics(SERBI), The School of Environmental Science and Technology(SEST), and The School of Spatial Planning and Social Science(SSPSS), alongside Institute of Human Settlements Studies (IHSS). The university offers Undergraduate and Postgraduate studies with Postgraduate, Bachelors, Masters and PhD degrees in various disciplines.[http://www.aru.ac.tz Ardhi University] www.aru.ac.tz\n* Muhimbili University of Health and Allied Sciences  has two campuses; Muhimbili Campus and Mloganzila Campus. Muhimbili Campus is situated in Ilala Municipality, in Upanga along United Nations Road. Mloganzila Campus occupies  and is located 3 km off Dar es Salaam-Morogoro highway, 25 km from Dar es Salaam.http://www.muhas.ac.tz/index.php?optioncom_content&task\nview&id16&Itemid\n30\n* The Open University of Tanzania is a fully fledged and accredited public institution of higher learning, running programmes leading to certificates, diplomas, undergraduate and postgraduate qualifications. Since it was founded, the university has enrolled students from Malawi, Uganda, Kenya, Namibia, Hungary, Burundi, Libya, Ethiopia, Rwanda, Saudi Arabia, Lesotho, Botswana and most of Tanzania. , the total enrollment at the university was 44,099, the majority of whom were Tanzanian.\n* The Hubert Kairuki Memorial University is a private institution located on plot No. 322 Regent Estate in the Mikocheni area, some 7-km from the Dar es Salaam City centre, off Ali Hassan Mwinyi and Old Bagamoyo roads.\n* The International Medical and Technological University is a privately owned institute of higher education institution operating in Dar es Salaam.\n* The Kampala International University—began operations in 2009 operating from Quality Plaza along Pugu road. The University Centre is situated on a  60 acre of land,  at Gongo la Mboto area in Ilala District, 7 km from Mwalimu Julius Nyerere International Airport along Pugu road.http://www.kiu.ac.tz/mission.html\n*National institute of Transport\n\nNotable people\n\n* David Adjaye, London-based architect, born in Dar es Salaam in 1966.\n* C.A. \"Peter\" Bransgrove (1914–1966), architect in Dar es Salaam 1947–1966.\n* Joaquim Chissano, former president of Mozambique, headed the FRELIMO headquarters in Dar es Salaam where he lived before returning to Mozambique after the country won independence. He was the first head of state to address the African Union (AU) in Swahili before Swahili became one of the official languages of the AU. He learned the language during the years he spent in Tanzania as a member of FRELIMO and became fluent in it.\n* Kanyama Chiume, one of the main leaders in the independence struggle in Nyasaland (renamed Malawi after the country won independence) where he served as minister of education and then as minister of foreign affairs before going into exile in Tanzania, lived in Dar es Salaam for decades. He grew up in Tanganyika. He spent his childhood in Morogoro and in Dar es Salaam and attended primary school and secondary school in Tanganyika (later renamed Tanzania). When he was in boarding school in Dar es Salaam, he lived in the same dormitory with Rashidi Kawawa who later became vice president of Tanganyika, later Tanzania, after the country won independence. He also attended Tabora Secondary School (then known as Upper School) with Oscar Kambona who became Tanganyika's first minister of defence and foreign affairs after the country became independent. Chiume graduated  from Makerere University College in Uganda and went to teach at Alliance Secondary School in Dodoma, Tanganyika. After he left Malawi in 1964 to go into exile in Tanzania (1964 - 1994), he went to live in Dar es Salaam again. He also worked in Dar es Salaam for many years as a journalist at The Nationalist, a newspaper of the ruling party TANU, together with Benjamin Mkapa who was then the editor and who later became president of Tanzania.\n* Roald Dahl, writer, lived in Dar es Salaam 1934–1939.\n* Jane Goodall, scientist, and primatologist.\n* Marin Hinkle, actress, Two and a Half Men TV Show.\n* Rachel Luttrell, actress, Stargate Atlantis, born in Dar es Salaam in 1971.\n* Nairn McEwan,  rugby union player and second national coach was born in Dar es Salaam.\n* Yoweri Museveni, president of Uganda, lived in Dar es Salaam for many years, first as a student and later as a political refugee. He attended the University of Dar es Salaam where he studied economics and political science. One of his professors was Walter Rodney, a scholar from Guyana who wrote the book How Europe Underdeveloped Africa, in the early seventies when he was teaching at the University of Dar es Salaam.\n* Godfrey Mwakikagile, a prominent Tanzanian author and Africanist. He attended school in Dar es Salaam and worked in the same city as an information officer at the Ministry of Information and Broadcasting and as a news reporter at the Daily News before going to the United States for further studies. He later became an author of non-fiction books about Africa and the African diaspora and an Africanist scholar.\n* Juma Mwapachu, a Tanzanian diplomat, lawyer and author of a number of books about African politics and economics who once served as secretary-general of the East African Community (EAC).\n* Herieth Paul, fashion model.\n* Walter Rodney, Guyanese historian, political activist and scholar. He was the author of How Europe Underdeveloped Africa. He taught at the University of Dar es Salaam in Tanzania from 1966 to 1967 and later at his alma mater, the University of the West Indies, Mona campus, Kingston, Jamaica. In 1969, Rodney returned to the University of Dar es Salaam where he served as a professor of history until 1974 before going back to Guyana where he was assassinated in June 1980.\n* Respicius Rwehumbiza, a Tanzanian activist and author of several academic books and development materials. He has served as the executive director of the True Vision Tanzania (TVTA), a development Organization in Tanzania for several years. He also taught at a number of schools and universities including Feza boys’ high school and the University of Dar es salaam.\n* Justinian Rweyemamu, Tanzanian economist, author and professor of economics at the University of Dar es Salaam. He worked at the United Nations and served as an economic adviser to Tanzania's first president, Julius Nyerere.\n* Issa G. Shivji, a Tanzanian academic and author and one of Africa's experts on  constitutional law and development issues. He served as professor of law at the University of Dar es Salaam for many years and was the first to hold the Mwalimu Julius Nyerere Research Chair in Pan-African Studies at the university. He also taught at a number of universities around the world.\n* Hasheem Thabeet, Oklahoma City Thunder basketball centre.\n* Paul von Lettow-Vorbeck, commander of the German East Africa Army, composed of European German officers and senior non-commissioned officers and native black African askaris, undefeated by the British and South Africans between the Great War's outbreak in August, 1914 and the Armistice in November, 1918.\n* Mbwana Samatta, African footballer of the year 2015 for the domestic players.\n* Sai Grandhi, father of Freddie Mercury.\n\nTwin towns — sister cities\n\nDar es Salaam is twinned with:\n* Hamburg, Germany\n* Samsun, Turkey\n* Yiwu, Zhejiang, China\n* Mazandaran, Iran",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Dar es Salaam" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8500" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Dar es Salaam (from  ', \"the house of peace\"; formerly Mzizima) is the former capital and largest city in Tanzania. It is most populous city in the East Africa coastal region and a regionally important economic centre. Located on the Swahili coast, the city is one of the fastest growing cities in the world.\n\nUntil 1974, Dar es Salaam served as Tanzania’s capital city, at which point the capital city commenced transferring to Dodoma, which was officially completed in 1996. However, as of 2017, it continues to remain a focus of central government bureaucracy, although this is in the process of fully moving to Dodoma. In addition, it is Tanzania's most prominent city in arts, fashion, media, music, film and television and a leading financial centre, with the Dar es Salaam Stock Exchange (DSE) being the country's first and most important stock exchange market. The city is the leading arrival and departure point for most tourists who visit Tanzania, including the national parks for safaris and the islands of Unguja and Pemba. Dar es Salaam is also the largest and most populous Swahili-speaking city in the world.\n\nIt is the capital of the co-extensive Dar es Salaam Region, which is one of Tanzania's 31 administrative regions and consists of five districts: Kinondoni in the north, Ilala in the centre, Ubungo, Temeke in the south and Kigamboni. The region had a population of 4,364,541 as of the official 2012 census.[http://www.nbs.go.tz/sensa/PDF/Census%20General%20Report%20-%2029%20March%202013_Combined_Final%20for%20Printing.pdf Population Distribution by Administrative Units, United Republic of Tanzania, 2013] \n\nHistory\n\nIn the 19th century, Mzizima (Kiswahili for \"healthy town\") was a coastal fishing village on the periphery of Indian Ocean trade routes. In 1865 or 1866, Sultan Majid bin Said of Zanzibar began building a new city very close to Mzizima and named it Dar es Salaam. The name is commonly translated as \"abode/home of peace\", based on the Arabic dar (\"house\"), and the Arabic es salaam (\"of peace\"), as opposed to the \"house of war\" (dar al-harb). Dar es Salaam fell into decline after Majid's death in 1870, but was revived in 1887 when the German East Africa Company established a station there. The town's growth was facilitated by its role as the administrative and commercial centre of German East Africa and industrial expansion resulting from the construction of the Central Railway Line in the early 1900s.\n\nGerman East Africa was captured by the British during World War I and became Tanganyika, with Dar es Salaam remaining the administrative and commercial centre. Under British indirect rule, separate European (e.g., Oyster Bay) and African (e.g., Kariakoo and Ilala) areas developed at a distance from the city centre. The city's population also included a large number of workers from British India, many of whom came to dominate trade and commerce. After World War II, Dar es Salaam experienced a period of rapid growth.\n\nPolitical developments, including the formation and growth of the Tanganyika African National Union, led to Tanganyika attaining independence from colonial rule in December 1961. Dar es Salaam continued to serve as its capital, even when in 1964 Tanganyika and Zanzibar merged to form Tanzania. In 1973, however, provisions were made to relocate the capital to Dodoma, a more centrally located city in the interior. The relocation process has not yet been completed, and Dar es Salaam remains Tanzania's primary city.\n\nIn 1967, the Tanzanian government declared the Ujamaa policy, that set Tanzania into a socialist path. The move slowed down the potential growth of the city as the government encouraged people not to move in cities but stay in Ujamaa socialist villages. But by the 1980s the Ujamaa policy proved to be a failure into combating increasing poverty, hunger, and delayed development that Tanzania faced. This led to the 1980s liberalization policy that virtually ended socialism and its spirit within the Tanzania's government. The move led to increasing immigration of skilled rural tradesmen and women from rural areas from cities with Dar es Salaam hoping to becoming one of the leading city in the world in receiving skilled migrants for trade and commerce from up country areas and internationally.\n\nUntil the late 1990s, Dar es Salaam was not put into the same category as Africa's leading cities like Nairobi, Johannesburg, Lagos, or Addis Ababa. But the 2000s decade became the turning point as the city experienced one of Africa's fastest urbanization rates as businesses were opened and prospered, Tanzanian banks headquartered in the city started to run more proper, the Dar es Salaam Stock Exchange expanded, and the Dar es Salaam harbour proved to be the most important in Tanzania and prominent for entrepot trade with landlocked countries like the Democratic Republic of Congo, Rwanda, Burundi, and Zambia. The CBD skyline hosts tall buildings, among them the 35-floor PSPF Tower, finished in 2015, and the Tanzania Ports Authority (TPA) Tower, currently under construction .\n\nGeography\n\nDar es Salaam is located at 6°48' South, 39°17' East (−6.8000, 39.2833),[http://earth-info.nga.mil/gns/html/cntry_files.html NGA: Country Files] , NGA.mil on a natural harbour on the eastern coast of East Africa, with sandy beaches in some areas.\n\nThe region of Dar es Salaam is divided into five districts.\n\nDistricts of Dar es Salaam Region\n\nDar es Salaam Region is divided into five administrative districts. All five are governed as municipal councils, and so all of the city's suburbs or wards are affiliated with them. The regional commissioner is Paul Makonda.\n\nKinondoni\n\nKinondoni is the most populated amongst the districts, with half of the city's population residing within it. It is also home to high-income suburbs. These include:\n\n* Masaki, Oysterbay and Ada Estate are the high-income suburbs located along the central beach. During the Colonial Era, they were the major European suburbs of the city. Now diplomats and expatriates reside in these areas.  Oysterbay Beach, also known as Coco Beach, is the only white sandy beach in Kinondoni and is the most famous in the area. Many luxury apartments line the waterfront, accommodating the rapid growth of foreigners, mostly Europeans and Asians.\n* Mikocheni and Regent Estate are also suburbs within the district. According to the 2012 census, the Mikocheni ward had a population of 32,947. Mikocheni is the home of some political figures, including the first president of Tanzania, Julius K. Nyerere and opposition party leader, Freeman Mbowe.\n* Msasani is a peninsula to the northeast of the city center. It is home to expatriates from the United Kingdom and other western countries. Msasani contains a mixture of traditional shops and western-oriented resorts and stores.\n* Mbezi Beach is the beachfront suburb located along the northern Dar es Salaam Beach. It is noted for its beautiful beaches with several tourist hotels, and also as the place of residence of people of high social status and some politicians.\n* Sinza, Kijitonyama, Magomeni, Kinondoni and Mwenge are more ethnically mixed than the areas above. The wards also have the most prosperous business climate outside of the central business district, with shops, bars, restaurants and hotels located there.\n* Kimara and Mbezi Louis are hilly, mostly upper class, suburbs far from the city. Due to the distance from the city center, it is quieter, with cooler weather.\n* Manzese, Tandale, Mwananyamala-Kisiwani and Kigogo are considered low-income neighborhoods characterized by poor settlement planning, low quality housing and social services.\n\nIlala\n\nIlala is the administrative district of Dar es Salaam where almost all government offices and ministries are housed. The Central Business District (locally called \"Posta\") is located in this district. It is the transportation hub of the city, as the Julius Nyerere International Airport, Central Railway Station and Tazara Railway Station are all within the district boundaries. The residential areas are mainly middle to high-income, and some of these are:\n* Upanga & Kisutu had the highest concentration of Asian communities within Dar es Salaam, with residents of Indian and Arabian descent. These areas are also famous for the colonial houses and mansions built in Indian, Arabic and European styles.\n* Kariakoo is the shopping district of the city, perhaps the busiest and largest in East Africa. Shops, bazaars and merchants dot the streets, selling products from foodstuffs to hardware materials. The Kariakoo Market, which is the largest, contains the only underground section of the city. It is the major supply point of the food consumed by all the residents of Dar es Salaam.\n* Tabata, Segerea and Ukonga are located a bit farther from the city center. They are growing to become among the busiest in terms of business and entertainment. This has caused serious traffic congestion, which is said to be the worst in all of Dar es Salaam.\n* Ilala is among the middle income suburbs very near to the city center, and is marked by the Askari Monument. It contains some rival gang groups, whose activities include drug trafficking, money laundering, extortion and racketeering. Most famous gang groups are recognized by the color of their scarf (bandanna). These are the black gang, red gang and blue gang, fighting for control and to maintain their territories and interests.\n\nTemeke\n\nTemeke is the industrial district of the city, where the manufacturing centers (heavy and light industry) are located. The Port of Dar es Salaam, which is the largest in the country, is found here. Temeke is believed to have the largest concentration of low-income residents due to industry. Port officials, military and police officers live there.\n*Kurasini located on the Dar es Salaam Harbour, is the home of the Dar es Salaam Port, The Police College, Mgulani Police Barracks and the Dar es Salaam International Trade Fair Grounds. Thus, the main residents are police officers and port officials.\n*Chang'ombe is one of the only higher income areas in Temeke. It has maintained this status due to occupation by African high colonial officers and some industry owners from the colonial era. Chang'ombe is the home of the Dar es Salaam University College of Education, The National Stadium and Uhuru Stadium.\n*Temeke, Mtoni and Tandika are middle to low-income suburbs.\n* Mbagala and Kijichi are middle to low-income suburbs. Mbagala is the largest suburb in the whole district, and is also considered a slum.\n\nUbungo\n\nThe Ubungo terminal is one of the main for the city and serves as a transportation link to most large Dar es salaam urban nodes. The Dar es Salaam commuter rail goes from here to the city centre but it is not fast(narrow gauge) and there are ten level crossings of roads along the route. Its also a hub of industry.\n\nKigamboni\n\n*Kigamboni (South Beach) is a beach front suburb on a peninsula with beautiful, sandy beaches. It is home to a mixed population of lower and higher incomes. There is demand from higher-income people to live in Kigamboni due to its low population density and proximity to the sea, but this demand is constrained by the area being mainly accessible by ferry involving long waiting times for those wishing to cross in a private vehicle, although crossing the ferry on foot or bicycle is quite quick.  There are beach resorts in Kigamboni.\n\nClimate\n\nDue to close proximity to the equator and the warm Indian Ocean, the city experiences tropical climatic conditions, typified by hot and humid weather throughout much of the year. It has a tropical wet and dry climate (Köppen: Aw). Annual rainfall is approximately 1100 mm, and in a normal year there are two rainy seasons: \"the long rains\" in April and May and \"the short rains\" in November and December.\n\nGovernment\n\n\"In 1949 the town became a municipality...[with] four honourable nominated Town Councillors who elected a Mayor.\" \"Until June 1996, Dar es Salaam was managed by the Dar es Salaam City Council...the highest policy-making body in the city.\" As of 2017  Hon Paul Makonda serves as commissioner of Dar es Salaam Region.\n\nGlobalization\n\nDar es Salaam is the city in Tanzania to which villagers flock for better opportunities. Westerners and Asians are also settling in Dar es Salaam, and the surge of foreigners has put pressure on local officials to develop policies better accommodating the growing diverse population of the city and its suburbs.\n\nPopulation\n\nDar es Salaam is the largest city in Tanzania. With a population increase of 5.6 percent per year from 2002 to 2012, the city is the third fastest growing in Africa (ninth fastest in the world), after Bamako and Lagos. The metro population is expected to reach 5.12 million by 2020 and predicted to be as high as 76 million by the year 2100, making Dar Es Salaam the second largest city on earth (after Lagos), by 2100.http://media.wix.com/ugd/672989_62cfa13ec4ba47788f78ad660489a2fa.pdf\n\nAccording to the 2012 national census, the region had a population of 4,364,541, which was much higher than the pre-census projection of 3,270,255.[http://www.nbs.go.tz/sensa/PDF/Census%20General%20Report%20-%2029%20March%202013_Combined_Final%20for%20Printing.pdf Population Distribution by Administrative Units, United Republic of Tanzania, 2013]  For 2002–2012, the region's 5.6 percent average annual population growth rate was the highest in the country. It was also the most densely populated region with 3,133 people per square kilometer.\n\nEconomy and infrastructure\n\nDar es Salaam is Tanzania's most important city for both business and government. The city contains high concentrations of trade and other services and manufacturing compared to other parts of Tanzania, which has about 80 percent of its population in rural areas. Downtown includes  small businesses, many of which are run by traders and proprietors whose families originated from the Middle East and Indian sub-continent—areas of the world with which the settlements of the Tanzanian coast have had long-standing trading relations.\n\nThe Dar es Salaam CBD made up of Kisutu, Kivukoni, Upanga and Kariakoo areas is Tanzania's largest city CBD. All three areas making up the downtown are found in the Ilala district. Kivukoni has the city's important fish market, the Magogoni fish market. Kivukoni also is the place where the Tanzania's central bank, The Bank of Tanzania is located, so is the Dar es Salaam Stock Exchange. Kisutu has businesses and offices and is the location of Dar es Salaam central railway station, the PSPF Towers and the TPA tower. Kariakoo is the prominent shopping area with streets like Congo Street for clothing shops. Uhuru street is for computer and electronics, Msimbazi for mobile phones.\n\nDar es Salaam has a problem with slums. According to a United Nations estimate, 70 percent of the city's population lives in informal settlements.[http://www.bbc.co.uk/news/magazine-18655647 \"Dar es Salaam: Africa's next megacity?\", BBC News, reported by Joe Boyle, 30 July 2012] The poorer residents crowd into downtown areas or large slums, many without running water or basic services. The more wealthy live in beachside mansions in the city's northern districts.\n\nDar es Salaam has had a major construction boom. The PSPF Twin Towers with more than 35 stories is the tallest building in the city and the country. Dar es Salaam has major infrastructural problems, including an outdated transport system and occasional power rationing.\n\nTransportation\n\nOn a natural harbour on the Indian Ocean, it is the hub of the Tanzanian transportation system as the main railways and several  highways originate in or near the city.\n\nLocal Public Transport \n\nThe most common form of transport in Dar es Salaam are the public buses, called dala dala, which are often found at the major bus terminals of Makumbusho and Ubungo. \nDala dalas are cheap and often overcrowded. They are operated by a driver and a conductor: the conductor collects the fare and signals the driver to leave.  They tend to be overcrowded, with passengers sometimes hanging outside the door.Since the introduction of motorcycle transit business known as \"Bodaboda\", most of the people prefer this type of transportation which allows them to get into the city faster compared to the minibuses which face a lot of traffic. Dala dala minibuses are involved in many road accidents, accounting for a large percentage of the 4000+ yearly road deaths.\n\nFurther types of transport are motorcycles and Bajaj a favourite for the tourist hoping to catch the east African sun.\n\nBus \n\nThe government has been introducing a bus rapid transport or metro bus system under Dar es Salaam rapid transit ('mwendo kasi') flagship. The metro buses are managed by UDA (Usafiri Dar es Salaam). \n\nThe bus rapid transit system Phase 1 is completed and already in operation by the Dar Rapid Transit Agency, a government-private sector entity, and began operation on 10 May 2016.  It is branded as UDA-RT (Usafiri Dar-Es-Salaam Rapid Transit).  The first section runs between Kimara in the northwest to Kivukoni on the northern headland of the harbour.Coach & Bus Week, 23 August 2016 Phase 1 was funded by the World Bank, African Development Bank and the Tanzanian government.\n\nFerry \n\nMV Kigamboni ferries are running between Kivukoni and Kigamboni in Dar es Salaam.\n\nRailway \n\nThe Dar es Salaam commuter rail is an urban and suburban commuter rail network serving the commercial city of Dar es Salaam.\nThe city also hosts the head office of Tanzania Zambia Railways Authority (TAZARA) built in the late 1960s to early 1970s. Also it host the offices and infrastructures of the Central Railway Line (Operated by Tanzania Railways Authority, TRL) both railways are used to commute within the city during the day to ease traffic congestion in the already overcrowded roads. Tanzania Railways operates the Central Line from Dar es Salaam to Kigoma. The TAZARA Railway connects Dar es Salaam to Zambia.\n\nAirport \n\nThe Julius Nyerere International Airport is the principal airport serving the country with two operating terminals and one under construction; Terminal Three at Kipawa in Ilala Municipality.\n\nSeaport \n\nThe city has the country's busiest port: The Port of Dar es Salaam handles 90% of the country's cargo. Due to huge influx of cargo and the slow pace of expansion a new cargo port 60 km north of Dar es Salaam is proposed at Bagamoyo.\n\nCulture\n\nDar es Salaam has heavy traffic during the daytime, but after sunset the area is relatively quiet as much of the city's nightlife is located in more residential districts away from the city's mainly commercial centre.\n\nThe sprawling suburbs furthest from the city centre are generally populated by Tanzanians of African descent, with the exception of Oyster Bay, where there is a large population of foreign expatriates. The edges of Dar es Salaam are spreading rapidly, severely taxing the transportation network (which aside from ferries, lacks any kind of mass transit facilities) and raising the prospect of future urban overcrowding.\n\nArt\n\nDar es Salaam (and specifically the area of Oyster Bay) is home to the brightly coloured and tourist-oriented Tingatinga painting style. The Nyumba ya sanaa (\"House of Art\") is a cultural centre, workshop and shop dedicated to Tanzanian art, showcasing and promoting Tanzanian craftmanship.  Prominent Tanzanian sculptor George Lilanga has donated  some of his works to the centre, including decorations of the building's main entrance.\n\nMusic\n\nThe music scene in Dar es Salaam is divided between several styles. The longest standing style is live dance music (muziki wa dansi) bands such as DDC Mlimani Park Orchestra and Malaika Musical Band as examples. Taarab which was traditionally strong in Zanzibar has also found a niche. However, it remains small compared both to dance music and \"Bongo Flava\", a broad category that represents the Tanzanian take on Hip Hop and R&B, which has quickly become the most popular locally produced music. Traditional music, which locally is used to refer to tribal music is still performed but typically only on family oriented occasions such as weddings. Recently there has been development of another music niche, a taste that is rising and to be prominent as BongoFlava known as Singeli with star singers such as Msaga Sumu and Man Fongo.\n\nThis rap scene is also present.[http://www.africanhiphop.com/update/halisi.htm Africanhiphop.com presents: Hali Halisi—the Real Situation]\n\nIn the 1970s, the Ministry of National Youth Culture aimed to create a national culture, which stressed the importance of music.  Dar es Salaam became the music center in Tanzania, with the local radio exposing new bands and dominating the music and cultural scene. With this ujamaa, or family, mentality governing culture and music a unified people’s culture was created, leading to the rise of hip hop music. Throughout the years, the radio in Dar es Salaam has played a major role in the dissemination of music because many people don’t have television and cassettes are used over CDs.\n\nFood\n\nDue in part to the growth of the expatriate community and the increasing importance of tourism, the number of international restaurants has risen  rapidly. The city offers a diversity of cuisine, ranging from traditional Tanzanian Barbecue-style options, such as Nyama Choma (Roasted meat—served with rice or ugali) and Mishkaki (Shish kebab—usually barbecued and served with salt, hot chili peppers, chapati, fries, and rice on the side), as well as the long-established traditional Indian and Zanzibari cuisine, to options from all corners of the globe, including Arab, Chinese, Thai, Turkish, Italian, and Japanese food. People who prefer neither fast food nor traditional restaurants buy their food from street vendors, who usually sell food at low prices. Samosas (sambusas) are common street food items within the city, as the area is largely influenced by the foods brought from India.\n\nTourism\n\nDar es Salaam has two of the five museums comprising the National Museum of Tanzania consortium, namely the National Museum proper and the Makumbusho Cultural Centre & Village Museum.  The National Museum is dedicated to the history of Tanzania; most notably, it exhibits some of the bones of Paranthropus boisei that were among the findings of Louis Leakey at Olduvai.  The Makumbusho Cultural Centre & Village Museum,makumbushovillage.blogspot.de located in the outskirts of the city on the road to Bagamoyo, showcases traditional huts from 16 different Tanzanian ethnic groups.  There are also examples of traditional cultivations, and traditional music and dance shows are held daily. In 2016, there was a breakthrough discovery in Northern Tanzania by a scientist, from the University of Dar es Salaam, of footprints thought to be of a hominid that predates Homo sapiens.\n\nClose to the National Museum are also the botanical gardens, with tropical plants and trees.\n\nThere are beaches on the Msasani peninsula north of Dar es Salaam and in Kigamboni to the south. Trips to the nearby islands of the  Dar es Salaam Marine Reserve are a popular daytrip from the city and a spot for snorkeling, swimming and sunbathing. Bongoyo Island can be reached by boat from the Msasani Slipway.\n\nFurther leisure spots are Mlimani shopping mall.\n\nDar es Salaam boasts of luxury hotels and beaches, some of the major hotels include the Movenpick, Kempinski Kilimanjaro, Peacock, Whitesands and many more.\n\nSports\n\nDar es Salaam is the sports center of Tanzania. Dar es Salaam hosts the second largest stadium in East and Central Africa (National Stadium), which can accommodate up to 60,000 people. The city is home of soccer clubs, the Azam FC, Simba Sports Club (Simba) and Young Africans Sports Club (Yanga) and other teams.\n\nApart from the National Stadium, Dar es salaam is home to the Uhuru Stadium (used mainly for local tournaments and political gatherings), Karume Memorial Stadium (the home of Tanzania Football Federation (TFF)), the Gymkhana Golf Courses (between the city center and the shores of the Indian Ocean), and also has tennis courts, squash courts, and a Fitness club. Outside the metropolitan districts, there is the Lugalo Military Golf Course (located in the Lugalo Military Barracks).\n\nThe National Stadium hosts Dar es Salaam's Young Africans Sports Club, Simba Sports Club, Azam F.C. and other Tanzanian football clubs, and international matches. There is a proposal to build a new stadium in Dodoma, much bigger in capacity than the present one in Dar es salaam by the government as a donation from the Moroccan Kingdom.\n\nDar es Salaam's Mama Africa school, founded in 2003, is known for training some of Africa's finest acrobats.\n\nMedia\n\nNewspapers\n\nDar has newspapers available, particularly from sellers prowling through stationary traffic at road intersections. English-language ones, with online presences, include The Citizen and The Guardian and the leading Kiswahili daily, Mwananchi.Business Times is the only financial and economic newspaper in town. It was established in 1988 and became the first ever private newspaper in Tanzania. Business Times also owns Majira, the Kiswahili leading newspaper in Tanzania.\n\nInternet access\n\nInstallation of a trans-Indian Ocean backbone cable in 2009 has, in theory, made Internet access much more readily available in Dar in particular and in East Africa in general. However, roll-out to end-users is slow, partly because of spotty telephone line coverage, partly due to the substantial prices and long contracts demanded for purchase of bandwidth for small ISPs. Mobile-telephone access to the Internet via 3G and 3.75G is still relatively expensive. 4G is making its way through major cities and towns  with plans to go countrywide in the advanced planning stages.\n\nInternet cafés are found in the city centre and free wifi hotspots in various government and non government institutions as well as public transport.\n\nThe expressed aim of the SEACOM cable is to enable East Africa to develop economically through increased online trading.\n\nEducation\n\nDar es Salaam is the educational centre of Tanzania. The city is home to educational institutions.\n\nUniversities\n\n* The University of Dar es Salaam is the oldest and 2nd largest public university in Tanzania after the University of Dodoma. It is located in the western part of the city, occupying  on the observation hill, 13 km from the city centre. The university has 16,400 undergraduate and 2,700 postgraduate students.http://www.udsm.ac.tz/about_us/index.php\n* Ardhi University (ARU) was established on 1 July 1996 after transforming the former University College of Lands and Architectural Studies (UCLAS) which was then a Constituent College of the University of Dar es Salaam. Historically, Ardhi University, dates back to 1956 when it started as Surveying Training School offering land surveying technician certificate courses at the present location of Mgulani Salvation Army Camp in Dar es Salaam. In 1958, the School was moved to the present location (i.e. the Observation Hill). In 1972, the School was transformed to Ardhi Institute. Then the Institute offered two-year diploma programmes in the fields of Land Surveying and Land Management and Valuation. In the same year, a three-year Diploma program in Urban and Rural Planning was introduced. Later in 1975, all the three-year diploma programmes were upgraded to Advanced Diplomas. The Building Design and Building Economics courses started in 1976 and 1978 respectively. As pointed out earlier, in 1996 Ardhi Institute was affiliated to the University of Dar es Salaam as a Constituent College of the University; subsequently its name changed to the University College of Lands and Architectural Studies (UCLAS). Within ten (10) years, UCLAS increased the number of academic programmes from six (6) to thirty nine (39). The programmes ranging from diplomas to PhDs were offered by two faculties, that is, the Faculty of Architecture and Planning (FAP) and the Faculty of Lands and Environmental Engineering (FLEE). As a result of these changes, student enrollment increased from only 400 in 1996 to about 1,400 in 2007. At the same time, the number of academic staff with PhD increased from 3 in 1996 to over 60 in 2012. At present there are over 80 PhD holders who have graduated from over 25 universities worldwide. In 2007 Ardhi University came into being following the signing of the Ardhi University Charter by His Excellency the President of United Republic of Tanzania. Concurrently, the structure and number of programmes and academic units has increased significantly. At present, the University comprises four Schools, one Institute and several centres. Schools includes; The School of Architecture,Construction Economics and Management(SACEM), The School of Earth Sciences, Real Estates, Business and Informatics(SERBI), The School of Environmental Science and Technology(SEST), and The School of Spatial Planning and Social Science(SSPSS), alongside Institute of Human Settlements Studies (IHSS). The university offers Undergraduate and Postgraduate studies with Postgraduate, Bachelors, Masters and PhD degrees in various disciplines.[http://www.aru.ac.tz Ardhi University] www.aru.ac.tz\n* Muhimbili University of Health and Allied Sciences  has two campuses; Muhimbili Campus and Mloganzila Campus. Muhimbili Campus is situated in Ilala Municipality, in Upanga along United Nations Road. Mloganzila Campus occupies  and is located 3 km off Dar es Salaam-Morogoro highway, 25 km from Dar es Salaam.http://www.muhas.ac.tz/index.php?optioncom_content&task\nview&id16&Itemid\n30\n* The Open University of Tanzania is a fully fledged and accredited public institution of higher learning, running programmes leading to certificates, diplomas, undergraduate and postgraduate qualifications. Since it was founded, the university has enrolled students from Malawi, Uganda, Kenya, Namibia, Hungary, Burundi, Libya, Ethiopia, Rwanda, Saudi Arabia, Lesotho, Botswana and most of Tanzania. , the total enrollment at the university was 44,099, the majority of whom were Tanzanian.\n* The Hubert Kairuki Memorial University is a private institution located on plot No. 322 Regent Estate in the Mikocheni area, some 7-km from the Dar es Salaam City centre, off Ali Hassan Mwinyi and Old Bagamoyo roads.\n* The International Medical and Technological University is a privately owned institute of higher education institution operating in Dar es Salaam.\n* The Kampala International University—began operations in 2009 operating from Quality Plaza along Pugu road. The University Centre is situated on a  60 acre of land,  at Gongo la Mboto area in Ilala District, 7 km from Mwalimu Julius Nyerere International Airport along Pugu road.http://www.kiu.ac.tz/mission.html\n*National institute of Transport\n\nNotable people\n\n* David Adjaye, London-based architect, born in Dar es Salaam in 1966.\n* C.A. \"Peter\" Bransgrove (1914–1966), architect in Dar es Salaam 1947–1966.\n* Joaquim Chissano, former president of Mozambique, headed the FRELIMO headquarters in Dar es Salaam where he lived before returning to Mozambique after the country won independence. He was the first head of state to address the African Union (AU) in Swahili before Swahili became one of the official languages of the AU. He learned the language during the years he spent in Tanzania as a member of FRELIMO and became fluent in it.\n* Kanyama Chiume, one of the main leaders in the independence struggle in Nyasaland (renamed Malawi after the country won independence) where he served as minister of education and then as minister of foreign affairs before going into exile in Tanzania, lived in Dar es Salaam for decades. He grew up in Tanganyika. He spent his childhood in Morogoro and in Dar es Salaam and attended primary school and secondary school in Tanganyika (later renamed Tanzania). When he was in boarding school in Dar es Salaam, he lived in the same dormitory with Rashidi Kawawa who later became vice president of Tanganyika, later Tanzania, after the country won independence. He also attended Tabora Secondary School (then known as Upper School) with Oscar Kambona who became Tanganyika's first minister of defence and foreign affairs after the country became independent. Chiume graduated  from Makerere University College in Uganda and went to teach at Alliance Secondary School in Dodoma, Tanganyika. After he left Malawi in 1964 to go into exile in Tanzania (1964 - 1994), he went to live in Dar es Salaam again. He also worked in Dar es Salaam for many years as a journalist at The Nationalist, a newspaper of the ruling party TANU, together with Benjamin Mkapa who was then the editor and who later became president of Tanzania.\n* Roald Dahl, writer, lived in Dar es Salaam 1934–1939.\n* Jane Goodall, scientist, and primatologist.\n* Marin Hinkle, actress, Two and a Half Men TV Show.\n* Rachel Luttrell, actress, Stargate Atlantis, born in Dar es Salaam in 1971.\n* Nairn McEwan,  rugby union player and second national coach was born in Dar es Salaam.\n* Yoweri Museveni, president of Uganda, lived in Dar es Salaam for many years, first as a student and later as a political refugee. He attended the University of Dar es Salaam where he studied economics and political science. One of his professors was Walter Rodney, a scholar from Guyana who wrote the book How Europe Underdeveloped Africa, in the early seventies when he was teaching at the University of Dar es Salaam.\n* Godfrey Mwakikagile, a prominent Tanzanian author and Africanist. He attended school in Dar es Salaam and worked in the same city as an information officer at the Ministry of Information and Broadcasting and as a news reporter at the Daily News before going to the United States for further studies. He later became an author of non-fiction books about Africa and the African diaspora and an Africanist scholar.\n* Juma Mwapachu, a Tanzanian diplomat, lawyer and author of a number of books about African politics and economics who once served as secretary-general of the East African Community (EAC).\n* Herieth Paul, fashion model.\n* Walter Rodney, Guyanese historian, political activist and scholar. He was the author of How Europe Underdeveloped Africa. He taught at the University of Dar es Salaam in Tanzania from 1966 to 1967 and later at his alma mater, the University of the West Indies, Mona campus, Kingston, Jamaica. In 1969, Rodney returned to the University of Dar es Salaam where he served as a professor of history until 1974 before going back to Guyana where he was assassinated in June 1980.\n* Respicius Rwehumbiza, a Tanzanian activist and author of several academic books and development materials. He has served as the executive director of the True Vision Tanzania (TVTA), a development Organization in Tanzania for several years. He also taught at a number of schools and universities including Feza boys’ high school and the University of Dar es salaam.\n* Justinian Rweyemamu, Tanzanian economist, author and professor of economics at the University of Dar es Salaam. He worked at the United Nations and served as an economic adviser to Tanzania's first president, Julius Nyerere.\n* Issa G. Shivji, a Tanzanian academic and author and one of Africa's experts on  constitutional law and development issues. He served as professor of law at the University of Dar es Salaam for many years and was the first to hold the Mwalimu Julius Nyerere Research Chair in Pan-African Studies at the university. He also taught at a number of universities around the world.\n* Hasheem Thabeet, Oklahoma City Thunder basketball centre.\n* Paul von Lettow-Vorbeck, commander of the German East Africa Army, composed of European German officers and senior non-commissioned officers and native black African askaris, undefeated by the British and South Africans between the Great War's outbreak in August, 1914 and the Armistice in November, 1918.\n* Mbwana Samatta, African footballer of the year 2015 for the domestic players.\n* Sai Grandhi, father of Freddie Mercury.\n\nTwin towns — sister cities\n\nDar es Salaam is twinned with:\n* Hamburg, Germany\n* Samsun, Turkey\n* Yiwu, Zhejiang, China\n* Mazandaran, Iran. Dar es Salaam. http://en.wikipedia.org/?curid=8500."
  }
}
