{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=4670",
  "eid" : "cfbbcac0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778428268,
  "textBody" : "Bruce Lorne Campbell (born June 22, 1958) is an American actor, producer, writer, comedian and director. One of his best-known roles is portraying Ash Williams in Sam Raimi's Evil Dead franchise, beginning with the 1978 short film Within the Woods. He has starred in many low-budget cult films such as Crimewave (1985), Maniac Cop (1988), Sundown: The Vampire in Retreat (1989), and Bubba Ho-Tep (2002).\n\nIn television, Campbell had lead roles in The Adventures of Brisco County, Jr. (1993–94) and Jack of all Trades (2000), starred as Autolycus (the King of Thieves) in Hercules: The Legendary Journeys and Xena: Warrior Princess (1995–99), Sam Axe on the USA Network series Burn Notice (2007–13), and reprised his role as Ash Williams on the Starz series Ash vs. Evil Dead.\n\nCampbell started his directing career with Fanalysis (2002) and A Community Speaks (2004), and then with the horror comedy feature films Man with the Screaming Brain (2005) and My Name Is Bruce (2007), the latter being a spoof of his career. He can also be seen as the role of the father in The Escort (2015).\n\nPersonal life\n\nCampbell was born in Royal Oak, Michigan, the son of Joanne Louise (née Pickens), a homemaker, and Charles Newton Campbell, an amateur actor and traveling billboard inspector. He has an older brother, Don, and an older half-brother, Michael Rendine.[https://movies.yahoo.com/movie/contributor/1800051843/bio Bruce Campbell biography], Yahoo! Movies He is of Scottish descent.\n\nCampbell's first wife was Cristine Deveau, whom he married in 1983. They had two children, Rebecca and Andy, before their divorce in 1989.   Campbell currently lives in Jacksonville, Oregon, with his second wife, costume designer Ida Gearon, whom he met on the set of the movie Mindwarp.\n\nCampbell is also an ordained minister and has officiated weddings for couples.\n\nCareer\n\nEarly years\n\nCampbell began acting as a teenager and soon began making short Super 8 movies with friends. After meeting Sam Raimi in Wylie E. Groves High School, the two became very good friends and started making movies together. Campbell would go on to attend Western Michigan University while he continued to work on his acting career. Campbell and Raimi collaborated on a 30-minute Super 8 version of the first Evil Dead film, titled Within the Woods, which was initially used to attract investors.\n\nMajor film roles\n\nA few years later, Campbell and Raimi got together with family and friends and began work on The Evil Dead. Campbell starred and worked behind the camera, receiving a \"co-executive producer\" credit. Raimi wrote, directed and edited, while fellow Michigander Rob Tapert was producer. Following an endorsement by horror writer Stephen King, the film slowly began to receive distribution. Four years following its original release, it became the number one movie in the UK. It then received distribution in the U.S., spawning two sequels: Evil Dead II and Army of Darkness.\n\nCampbell was also drawn in the Marvel Zombie comics as his character, Ash Williams. He is featured in five comics, all in the series Marvel Zombies vs. Army of Darkness. In them, he fights alongside the Marvel heroes against the heroes and people who have turned into zombies (deadites) while in search of the Necronomicon (Book of the Names of the Dead).\n\nHe has appeared in many of Raimi's films outside of the Evil Dead series, notably having cameos in the director's Spider-Man film series. Campbell also joined the cast in Raimi's Darkman and The Quick and the Dead, though having no actual screen time in the latter film's theatrical cut.\n\nCampbell often takes on quirky roles, such as Elvis Presley in the film Bubba Ho-Tep. Along with Bubba Ho-Tep, he played a supporting role in Maniac Cop and Maniac Cop 2, and spoofed his career in the self-directed My Name is Bruce.\n\nOther mainstream films for Campbell include supporting or featured roles in the Coen Brothers film The Hudsucker Proxy, the Michael Crichton adaptation Congo, the film version of McHale's Navy, Escape From L.A. ( the sequel to John Carpenter's Escape From New York), the Jim Carrey drama The Majestic and the 2005 Disney film Sky High.\n \nCampbell had a starring voice role in the hit 2009 animated adaptation of the children's book Cloudy with a Chance of Meatballs, and a supporting voice role in Pixar's Cars 2.\n\nIn January 2010, he stated in an interview that his new film project is called Bruce vs. Frankenstein. The film is directed and produced by his friend Mike Richardson.\n\nCampbell produced the remake of The Evil Dead, along with Sam Raimi and Rob Tapert. Campbell made an appearance that may allude to his signature character, Ash, with the expectation he would reprise that role in Army of Darkness 2. In a later interview with TV personality Erin Ashley Darling, Campbell announced that Army of Darkness 2 is not happening, saying \"It's all internet B.S. There's no reality whatsoever. These random comments slip out of either my mouth, or Sam Raimi's mouth, next thing you know, we're making a sequel.\" In September of 2017, during a panel at Fan Expo Canada, when asked if audiences could expect 4th Evil Dead film, Campbell said \"Everybody says Evil Dead 4! Evil Dead 4! You know, if we did an Evil Dead 4 Sam Raimi would spend $200,000,000 on it, and it would bomb.\", elaborating that the only future for Evil Dead is unrestricted via a premium cable network, as Ash vs. Evil Dead is on Starz. \n\nTelevision roles\n\nOutside of film, Campbell has appeared in a number of television series. He starred in The Adventures of Brisco County, Jr. a boisterous science fiction comedy western created by Jeffrey Boam and Carlton Cuse that ran for one season. He played a lawyer turned bounty hunter who was trying to hunt down John Bly, the man who killed his father. He starred in the television series Jack of All Trades, set on a fictional island occupied by the French in 1801. Campbell was also credited as co-executive producer, among others. The show was directed by Eric Gruendemann, and was produced by various people, including Sam Raimi. The show aired for two seasons, from 2000 to 2001. He had a recurring role as \"Bill Church Jr.\" based upon the character of Morgan Edge from the Superman comics on Lois & Clark: The New Adventures of Superman.\n\nFrom 1996 to 1997, Campbell was a recurring guest star on the show Ellen as Ed Billik, who becomes Ellen's boss when she sells her bookstore in season four. \n\nHe is also known for his supporting role as the recurring character Autolycus (\"King of Thieves\") on both Hercules: The Legendary Journeys and Xena: Warrior Princess, which reunited him with producer Rob Tapert. Campbell played Hercules/Xena series producer Tapert in two episodes of Hercules set in the present. He directed a number of episodes of Hercules and Xena, including the Hercules series finale. \n\nCampbell also landed the lead role of race car driver Hank Cooper in the Disney made-for-television remake of The Love Bug.\n\nCampbell made a critically acclaimed dramatic guest role as a grief-stricken detective seeking revenge for his father's murder in a two-part episode of the fourth season of  Homicide: Life on the Street. Campbell later played the part of a bigamous demon in The X-Files episode \"Terms of Endearment\". He also starred as Agent Jackman in the episode \"Witch Way Now?\" of the WB series Charmed, as well as playing a state police officer in an episode of the short-lived series American Gothic titled \"Meet the Beetles\".\n\nCampbell co-starred on the television series Burn Notice, which aired from 2007 to 2013 on USA Network. He portrayed Sam Axe, a beer-chugging, womanizing former Navy SEAL now working as an unlicensed private investigator and occasional mercenary with his old friend Michael Westen, the show's main character. When working under cover, his character frequently used the alias Chuck Finley, which Bruce later revealed was the name of one of his father's old co-workers. Campbell was the star of a 2011 Burn Notice made-for-television prequel focusing on Sam's Navy SEAL career, titled Burn Notice: The Fall of Sam Axe.\n\nIn 2014, Campbell played Santa Claus in an episode of The Librarians. Campbell played Ronald Reagan in season 2 of the FX original series Fargo. Most recently Campbell is reprising his role as Ashley \"Ash\" Williams in Ash vs Evil Dead, a series based upon the Evil Dead franchise that launched his career. Ash vs Evil Dead began airing on Starz on October 31, 2015, and was renewed by the cable channel for second and third seasons.\n\nVoice acting\n\nCampbell is featured as a voice actor in several video game titles. He provides the voice of Ash in the three games based on the Evil Dead film series: Evil Dead: Hail to the King, Evil Dead: A Fistful of Boomstick and Evil Dead: Regeneration. He also provided voice talent in other titles such as Pitfall 3D: Beyond the Jungle, Spider-Man: The Movie, Spider-Man 2, Spider-Man 3 and The Amazing Spider-Man.\n\nHe provided the voice of main character Jake Logan in the PC title, Tachyon: The Fringe, the voice of main character Jake Burton in the PlayStation game Broken Helix and the voice of Magnanimous in Megas XLR. Campbell voiced the pulp adventurer Lobster Johnson in Hellboy: The Science of Evil and has done voice-over work for the Codemaster's game Hei$t, a game which was announced on January 28, 2010 to have been \"terminated\". He also provided the voice of The Mayor in the 2009 film Cloudy With a Chance of Meatballs, the voice of Rod \"Torque\" Redline in Cars 2 and the voice of \"Fugax\" in the 2006 film The Ant Bully.\n\nDespite the inclusion of his character \"Ash Williams\" in Telltale Games' Poker Night 2, Danny Webber voices the character in the game, instead of Bruce Campbell.\n\nHe has a voice in the online MOBA game, Tome: Immortal Arena in 2014. Campbell also provided voice-over and motion capture for Sgt. Lennox in the Exo Zombies mode of Call of Duty: Advanced Warfare.\n\nWriting\n\nIn addition to acting and occasionally directing, Campbell has become a writer, starting with an autobiography, If Chins Could Kill: Confessions of a B Movie Actor, published on August 24, 2002. The autobiography was a successful New York Times Best Seller. The paperback version of the book adds a chapter about the reaction of fans at book signings.\n\"Whenever I do mainstream stuff, I think they're pseudo-interested, but they're still interested in seeing weirdo, offbeat stuff, and that's what I'm attracted to\".\nIf Chins Could Kill follows Campbell's career to date as an actor in low-budget films and television, providing his insight into \"Blue-Collar Hollywood\".\n\nCampbell's next book, Make Love! The Bruce Campbell Way was published on May 26, 2005. The book's plot involves Bruce (depicted in a comical way) as the main character struggling to make it into the world of A-list movies. He later recorded an audio play adaptation of Make Love with fellow Michigan actors, including longtime collaborator Ted Raimi. This radio drama was released through the independent label Rykodisc and spans 6 discs with a 6-hour running time.\n\nIn addition to his books, Campbell also wrote a column for X Ray Magazine in 2001, an issue of the popular comic series The Hire, and comic book adaptations of his Man with the Screaming Brain. Most recently he wrote the introduction to Josh Becker's The Complete Guide to Low-Budget Feature Filmmaking.\n\nIn late 2016, Campbell announced that he would be releasing a third book, Hail to the Chin: Further Confessions of a B Movie Actor, which will detail his life from where If Chins Could Kill left off. According to his official website, Hail to the Chin will be released in August 2017.\n\nCampbell maintained a blog on his official website, where he posted mainly about politics and the film industry. The blog has since been discontinued.\n\nBruce Campbell Horror Film Festival\n\nSince 2014, the Bruce Campbell Horror Film Festival, narrated and organized by Campbell, has been held in the Muvico Theater in Rosemont, Illinois. The first festival had his original run from August 21 to 25, 2014 presented by Wizard World, as part of the Chicago Comiccon. The second festival ran from August 20 to 23, 2015, with the guests Tom Holland and Eli Roth.\n\nFilmography\n\nFilm\n\nTelevision\n\nVideo games\n\nAccolades",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Bruce Campbell" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=4670" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Bruce Lorne Campbell (born June 22, 1958) is an American actor, producer, writer, comedian and director. One of his best-known roles is portraying Ash Williams in Sam Raimi's Evil Dead franchise, beginning with the 1978 short film Within the Woods. He has starred in many low-budget cult films such as Crimewave (1985), Maniac Cop (1988), Sundown: The Vampire in Retreat (1989), and Bubba Ho-Tep (2002).\n\nIn television, Campbell had lead roles in The Adventures of Brisco County, Jr. (1993–94) and Jack of all Trades (2000), starred as Autolycus (the King of Thieves) in Hercules: The Legendary Journeys and Xena: Warrior Princess (1995–99), Sam Axe on the USA Network series Burn Notice (2007–13), and reprised his role as Ash Williams on the Starz series Ash vs. Evil Dead.\n\nCampbell started his directing career with Fanalysis (2002) and A Community Speaks (2004), and then with the horror comedy feature films Man with the Screaming Brain (2005) and My Name Is Bruce (2007), the latter being a spoof of his career. He can also be seen as the role of the father in The Escort (2015).\n\nPersonal life\n\nCampbell was born in Royal Oak, Michigan, the son of Joanne Louise (née Pickens), a homemaker, and Charles Newton Campbell, an amateur actor and traveling billboard inspector. He has an older brother, Don, and an older half-brother, Michael Rendine.[https://movies.yahoo.com/movie/contributor/1800051843/bio Bruce Campbell biography], Yahoo! Movies He is of Scottish descent.\n\nCampbell's first wife was Cristine Deveau, whom he married in 1983. They had two children, Rebecca and Andy, before their divorce in 1989.   Campbell currently lives in Jacksonville, Oregon, with his second wife, costume designer Ida Gearon, whom he met on the set of the movie Mindwarp.\n\nCampbell is also an ordained minister and has officiated weddings for couples.\n\nCareer\n\nEarly years\n\nCampbell began acting as a teenager and soon began making short Super 8 movies with friends. After meeting Sam Raimi in Wylie E. Groves High School, the two became very good friends and started making movies together. Campbell would go on to attend Western Michigan University while he continued to work on his acting career. Campbell and Raimi collaborated on a 30-minute Super 8 version of the first Evil Dead film, titled Within the Woods, which was initially used to attract investors.\n\nMajor film roles\n\nA few years later, Campbell and Raimi got together with family and friends and began work on The Evil Dead. Campbell starred and worked behind the camera, receiving a \"co-executive producer\" credit. Raimi wrote, directed and edited, while fellow Michigander Rob Tapert was producer. Following an endorsement by horror writer Stephen King, the film slowly began to receive distribution. Four years following its original release, it became the number one movie in the UK. It then received distribution in the U.S., spawning two sequels: Evil Dead II and Army of Darkness.\n\nCampbell was also drawn in the Marvel Zombie comics as his character, Ash Williams. He is featured in five comics, all in the series Marvel Zombies vs. Army of Darkness. In them, he fights alongside the Marvel heroes against the heroes and people who have turned into zombies (deadites) while in search of the Necronomicon (Book of the Names of the Dead).\n\nHe has appeared in many of Raimi's films outside of the Evil Dead series, notably having cameos in the director's Spider-Man film series. Campbell also joined the cast in Raimi's Darkman and The Quick and the Dead, though having no actual screen time in the latter film's theatrical cut.\n\nCampbell often takes on quirky roles, such as Elvis Presley in the film Bubba Ho-Tep. Along with Bubba Ho-Tep, he played a supporting role in Maniac Cop and Maniac Cop 2, and spoofed his career in the self-directed My Name is Bruce.\n\nOther mainstream films for Campbell include supporting or featured roles in the Coen Brothers film The Hudsucker Proxy, the Michael Crichton adaptation Congo, the film version of McHale's Navy, Escape From L.A. ( the sequel to John Carpenter's Escape From New York), the Jim Carrey drama The Majestic and the 2005 Disney film Sky High.\n \nCampbell had a starring voice role in the hit 2009 animated adaptation of the children's book Cloudy with a Chance of Meatballs, and a supporting voice role in Pixar's Cars 2.\n\nIn January 2010, he stated in an interview that his new film project is called Bruce vs. Frankenstein. The film is directed and produced by his friend Mike Richardson.\n\nCampbell produced the remake of The Evil Dead, along with Sam Raimi and Rob Tapert. Campbell made an appearance that may allude to his signature character, Ash, with the expectation he would reprise that role in Army of Darkness 2. In a later interview with TV personality Erin Ashley Darling, Campbell announced that Army of Darkness 2 is not happening, saying \"It's all internet B.S. There's no reality whatsoever. These random comments slip out of either my mouth, or Sam Raimi's mouth, next thing you know, we're making a sequel.\" In September of 2017, during a panel at Fan Expo Canada, when asked if audiences could expect 4th Evil Dead film, Campbell said \"Everybody says Evil Dead 4! Evil Dead 4! You know, if we did an Evil Dead 4 Sam Raimi would spend $200,000,000 on it, and it would bomb.\", elaborating that the only future for Evil Dead is unrestricted via a premium cable network, as Ash vs. Evil Dead is on Starz. \n\nTelevision roles\n\nOutside of film, Campbell has appeared in a number of television series. He starred in The Adventures of Brisco County, Jr. a boisterous science fiction comedy western created by Jeffrey Boam and Carlton Cuse that ran for one season. He played a lawyer turned bounty hunter who was trying to hunt down John Bly, the man who killed his father. He starred in the television series Jack of All Trades, set on a fictional island occupied by the French in 1801. Campbell was also credited as co-executive producer, among others. The show was directed by Eric Gruendemann, and was produced by various people, including Sam Raimi. The show aired for two seasons, from 2000 to 2001. He had a recurring role as \"Bill Church Jr.\" based upon the character of Morgan Edge from the Superman comics on Lois & Clark: The New Adventures of Superman.\n\nFrom 1996 to 1997, Campbell was a recurring guest star on the show Ellen as Ed Billik, who becomes Ellen's boss when she sells her bookstore in season four. \n\nHe is also known for his supporting role as the recurring character Autolycus (\"King of Thieves\") on both Hercules: The Legendary Journeys and Xena: Warrior Princess, which reunited him with producer Rob Tapert. Campbell played Hercules/Xena series producer Tapert in two episodes of Hercules set in the present. He directed a number of episodes of Hercules and Xena, including the Hercules series finale. \n\nCampbell also landed the lead role of race car driver Hank Cooper in the Disney made-for-television remake of The Love Bug.\n\nCampbell made a critically acclaimed dramatic guest role as a grief-stricken detective seeking revenge for his father's murder in a two-part episode of the fourth season of  Homicide: Life on the Street. Campbell later played the part of a bigamous demon in The X-Files episode \"Terms of Endearment\". He also starred as Agent Jackman in the episode \"Witch Way Now?\" of the WB series Charmed, as well as playing a state police officer in an episode of the short-lived series American Gothic titled \"Meet the Beetles\".\n\nCampbell co-starred on the television series Burn Notice, which aired from 2007 to 2013 on USA Network. He portrayed Sam Axe, a beer-chugging, womanizing former Navy SEAL now working as an unlicensed private investigator and occasional mercenary with his old friend Michael Westen, the show's main character. When working under cover, his character frequently used the alias Chuck Finley, which Bruce later revealed was the name of one of his father's old co-workers. Campbell was the star of a 2011 Burn Notice made-for-television prequel focusing on Sam's Navy SEAL career, titled Burn Notice: The Fall of Sam Axe.\n\nIn 2014, Campbell played Santa Claus in an episode of The Librarians. Campbell played Ronald Reagan in season 2 of the FX original series Fargo. Most recently Campbell is reprising his role as Ashley \"Ash\" Williams in Ash vs Evil Dead, a series based upon the Evil Dead franchise that launched his career. Ash vs Evil Dead began airing on Starz on October 31, 2015, and was renewed by the cable channel for second and third seasons.\n\nVoice acting\n\nCampbell is featured as a voice actor in several video game titles. He provides the voice of Ash in the three games based on the Evil Dead film series: Evil Dead: Hail to the King, Evil Dead: A Fistful of Boomstick and Evil Dead: Regeneration. He also provided voice talent in other titles such as Pitfall 3D: Beyond the Jungle, Spider-Man: The Movie, Spider-Man 2, Spider-Man 3 and The Amazing Spider-Man.\n\nHe provided the voice of main character Jake Logan in the PC title, Tachyon: The Fringe, the voice of main character Jake Burton in the PlayStation game Broken Helix and the voice of Magnanimous in Megas XLR. Campbell voiced the pulp adventurer Lobster Johnson in Hellboy: The Science of Evil and has done voice-over work for the Codemaster's game Hei$t, a game which was announced on January 28, 2010 to have been \"terminated\". He also provided the voice of The Mayor in the 2009 film Cloudy With a Chance of Meatballs, the voice of Rod \"Torque\" Redline in Cars 2 and the voice of \"Fugax\" in the 2006 film The Ant Bully.\n\nDespite the inclusion of his character \"Ash Williams\" in Telltale Games' Poker Night 2, Danny Webber voices the character in the game, instead of Bruce Campbell.\n\nHe has a voice in the online MOBA game, Tome: Immortal Arena in 2014. Campbell also provided voice-over and motion capture for Sgt. Lennox in the Exo Zombies mode of Call of Duty: Advanced Warfare.\n\nWriting\n\nIn addition to acting and occasionally directing, Campbell has become a writer, starting with an autobiography, If Chins Could Kill: Confessions of a B Movie Actor, published on August 24, 2002. The autobiography was a successful New York Times Best Seller. The paperback version of the book adds a chapter about the reaction of fans at book signings.\n\"Whenever I do mainstream stuff, I think they're pseudo-interested, but they're still interested in seeing weirdo, offbeat stuff, and that's what I'm attracted to\".\nIf Chins Could Kill follows Campbell's career to date as an actor in low-budget films and television, providing his insight into \"Blue-Collar Hollywood\".\n\nCampbell's next book, Make Love! The Bruce Campbell Way was published on May 26, 2005. The book's plot involves Bruce (depicted in a comical way) as the main character struggling to make it into the world of A-list movies. He later recorded an audio play adaptation of Make Love with fellow Michigan actors, including longtime collaborator Ted Raimi. This radio drama was released through the independent label Rykodisc and spans 6 discs with a 6-hour running time.\n\nIn addition to his books, Campbell also wrote a column for X Ray Magazine in 2001, an issue of the popular comic series The Hire, and comic book adaptations of his Man with the Screaming Brain. Most recently he wrote the introduction to Josh Becker's The Complete Guide to Low-Budget Feature Filmmaking.\n\nIn late 2016, Campbell announced that he would be releasing a third book, Hail to the Chin: Further Confessions of a B Movie Actor, which will detail his life from where If Chins Could Kill left off. According to his official website, Hail to the Chin will be released in August 2017.\n\nCampbell maintained a blog on his official website, where he posted mainly about politics and the film industry. The blog has since been discontinued.\n\nBruce Campbell Horror Film Festival\n\nSince 2014, the Bruce Campbell Horror Film Festival, narrated and organized by Campbell, has been held in the Muvico Theater in Rosemont, Illinois. The first festival had his original run from August 21 to 25, 2014 presented by Wizard World, as part of the Chicago Comiccon. The second festival ran from August 20 to 23, 2015, with the guests Tom Holland and Eli Roth.\n\nFilmography\n\nFilm\n\nTelevision\n\nVideo games\n\nAccolades. Bruce Campbell. http://en.wikipedia.org/?curid=4670."
  }
}
