{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9277",
  "eid" : "ed9516a0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778478346,
  "textBody" : "In mathematics, an ellipse is a curve in a plane surrounding two focal points such that the sum of the distances to the two focal points is constant for every point on the curve. As such, it is a generalization of a circle, which is a special type of an ellipse having both focal points at the same location. The shape of an ellipse (how \"elongated\" it is) is represented by its eccentricity, which for an ellipse can be any number from 0 (the limiting case of a circle) to arbitrarily close to but less than 1.\n\nEllipses are the closed type of conic section: a plane curve resulting from the intersection of a cone by a plane (see figure to the right). Ellipses have many similarities with the other two forms of conic sections: parabolas and hyperbolas, both of which are open and unbounded. The cross section of a cylinder is an ellipse, unless the section is parallel to the axis of the cylinder.\n\nAnalytically, an ellipse may also be defined as the set of points such that the ratio of the distance of each point on the curve from a given point (called a focus or focal point) to the distance from that same point on the curve to a given line (called the directrix) is a constant. This ratio is called the eccentricity of the ellipse.\n\nAn ellipse may also be defined analytically as the set of points for each of which the sum of its distances to two foci is a fixed number.\n\nEllipses are common in physics, astronomy and engineering. For example, the orbit of each planet in our solar system is approximately an ellipse with the barycenter of the planetSun pair at one of the focal points. The same is true for moons orbiting planets and all other systems having two astronomical bodies. The shapes of planets and stars are often well described by ellipsoids. Ellipses also arise as images of a circle under parallel projection and the bounded cases of perspective projection, which are simply intersections of the projective cone with the plane of projection. It is also the simplest Lissajous figure formed when the horizontal and vertical motions are sinusoids with the same frequency. A similar effect leads to elliptical polarization of light in optics.\n\nThe name, ἔλλειψις (élleipsis, \"omission\"), was given by Apollonius of Perga in his Conics, emphasizing the connection of the curve with \"application of areas\".\n\nDefinition of an ellipse as locus of points \n\nAn ellipse can be defined geometrically as a set of points (locus of points) in the Euclidean plane:\n\n* An ellipse is a set of points, such that for any point P of the set, the sum of the distances |PF_1|,\\ |PF_2| to two fixed points F_1, F_2, the foci, is constant, usually denoted by 2a, \\ a>0\\ . In order to omit the special case of a line segment, one assumes 2a>|F_1F_2|. More formally, for a given a, an ellipse is the set E \\{P\\in \\mathbb{R}^2 \\mid |PF_2| +|PF_1 | \n 2a \\}\\ .\nThe midpoint C of the line segment joining the foci is called the center of the ellipse. The line through the foci is called the major axis, and the line perpendicular to it through the center is called the minor axis. It contains the vertices V_1,V_2, which have distance  a to the center. The distance c of the foci to the center is called the focal distance or linear eccentricity. The quotient \\tfrac{c}{a} is the eccentricity e.\n\nThe case F_1=F_2 yields a circle and is included.\n\nThe equation |PF_2| + |PF_1 | = 2a can be viewed in a different way (see picture):\nIf c_2 is the circle with midpoint F_2 and radius 2a, then the distance of a point P to the circle c_2 equals the distance to the focus F_1:\n:|PF_1|=|Pc_2|.\nc_2 is called the circular directrix (related to focus F_2) of the ellipse.The German term for this circle is Leitkreis which can be translated as \"Director circle\", but that term has a different meaning in the English literature (see Director circle). This property should not be confused with the definition of an ellipse with help of a directrix (line) below.\n\nUsing Dandelin spheres one proves easily the important statement:\n*Any plane section of a cone with a plane, which does not contain the apex and whose slope is less than the slope of the lines on the cone, is an ellipse.\n\nEllipse in Cartesian coordinates \n\nEquation \n\nIf Cartesian coordinates are introduced such that the origin is the center of the ellipse and the x-axis is the major axis and \nthe foci are the points F_1(c,0),\\ F_2\n(-c,0), \nthe vertices are V_1(a, 0),\\ V_2\n(-a,0).\nFor an arbitrary point (x,y) the distance to the focus (c,0) is \n\\sqrt{ (x-c)^2 + y^2 } and to the second focus \\sqrt{ (x+c)^2 + y^2 }. Hence the point (x,y) is on the ellipse if the following condition is fulfilled \n\\sqrt{(x-c)^2 + y^2} + \\sqrt{(x+c)^2 + y^2} = 2a \\ .\nRemove the square roots by suitable squarings and use the relation b^2 = a^2-c^2 to obtain the equation of the ellipse:\n*\\frac{x^2}{a^2}+\\frac{y^2}{b^2}= 1  or solved for y\ny=\\pm\\frac{b}{a}\\sqrt{a^2-x^2}.\nThe shape parameters a,\\; b are called the semi-major and semi-minor axes. The points V_3(0,b),\\; V_4\n(0,-b) are the co-vertices.\n\nIt follows from the equation that the ellipse is symmetric with respect to both of the coordinate axes and hence symmetric with respect to the origin.\n\nSemi-latus rectum \n\nThe length of the chord through one of the foci, which is perpendicular to the major axis of the ellipse is called the latus rectum. One half of it is the semi-latus rectum p. A calculation shows\n*p = \\frac{b^2}a.\nThe semi-latus rectum p may also be viewed as the radius of curvature  of the osculating circles at the vertices (\\pm a,0).\n\nTangent \n\nAn arbitrary line g intersects an ellipse at 0, 1 or 2 points. In the first case the line is called exterior line, in the second case tangent and secant in the third case. Through any point of an ellipse there is exactly one tangent.\nThe tangent at a point (x_0,y_0) of the ellipse \\; \\tfrac{x^2}{a^2}+\\tfrac{y^2}{b^2}= 1\\;  has the coordinate equation \n*\\ \\frac{x_0}{a^2}x+\\frac{y_0}{b^2}y = 1\\; . \nA vector equation of the tangent is \n*\\ \\vec x=\\begin{pmatrix}x_0\\\\ y_0 \\end{pmatrix}+s\\; \\begin{pmatrix}-y_0a^2\\\\ x_0b^2 \\end{pmatrix}\\quad  with \\quad s\\in\\mathbb{R}\\ .\n\nProof:\nLet be (x_0,y_0) an ellipse point and  \\;\\vec x\\begin{pmatrix}x_0\\\\ y_0 \\end{pmatrix}+s\\; \\begin{pmatrix}u\\\\ v \\end{pmatrix}\\; the vector equation of a line g (containing (x_0,y_0)). Inserting the line's equation into the ellipse equation and respecting \\; \\tfrac{x_0^2}{a^2}+\\tfrac{y_0^2}{b^2}\n1\\; yields:\n\\frac{(x_0+su)^2}{a^2}+\\frac{(y_0+sv)^2}{b^2}1\\ , \\quad \\longrightarrow\\quad 2s\\;\\left(\\frac{x_0u}{a^2}+\\frac{y_0v}{b^2}\\right) + s^2\\;\\left(\\frac{u^2}{a^2}+\\frac{v^2}{b^2}\\right)\n 0\\ . \nIn case of \\; (1)\\; \\tfrac{x_0}{a^2}u+\\tfrac{y_0}{b^2}v0\\; line g and the ellipse have only point (x_0,y_0) in common and g is a tangent. The tangent direction is orthogonal to vector  (\\tfrac{x_0}{a^2},\\tfrac{y_0}{b^2})^T which is then a normal vector of the tangent and the tangent has the equation \\;\\tfrac{x_0}{a^2}x+\\tfrac{y_0}{b^2}y \n k\\;  with a still unknown k. Because (x_0,y_0) is on the tangent and on the ellipse, one gets k=1. \nIn case of  \\;(2)\\; \\tfrac{x_0}{a^2}u+\\tfrac{y_0}{b^2}v\\ne0\\; line g has a second point with the ellipse in common.\n\nWith help of (1) one easily checks, that \\;(-y_0a^2,x_0b^2)^T\\;   is a tangent vector at point (x_0,y_0), which proves the vector equation.\n\nRemark: If (x_0,y_0) and (u,v) are two points of the ellipse, such that\n\\; \\tfrac{x_0u}{a^2}+\\tfrac{y_0v}{b^2}0\\; holds, then the points lie on two conjugate diameters of the Ellipse (see below). In case of a\nb the ellipse is a circle and \"conjugate\" means \"orthogonal\".\n\nEquation of a shifted ellipse \n\nIf the ellipse is shifted such that its center is (c_1,c_2) the equation is\n*\\frac{(x-c_1)^2}{a^2}+\\frac{(y-c_2)^2}{b^2}= 1 \\ .\nThe axes are still parallel to the x- and y-axes.\n\nParametric representation \n\nStandard parametric representation:\nUsing the sine and cosine functions \\cos,\\sin, a parametric representation of the ellipse \\tfrac{x^2}{a^2}+\\tfrac{y^2}{b^2}= 1 can be obtained, :\n*(x,y)=(a \\cos t, b \\sin t),\\ 0\\le t\n\nParameter t can be taken as shown in the diagram and is due to de la Hire.K. Strubecker: Vorlesungen über Darstellende Geometrie, GÖTTINGEN, \nVANDENHOECK & RUPRECHT, 1967, p. 26\n\nThe parameter t (called the eccentric anomaly in astronomy) is not the angle of (x(t),y(t))^T with the x-axis (see diagram at right). For other interpretations of parameter t see section Drawing ellipses.\n\nRational representation:\nWith the substitution u = \\tan(t/2) and trigonometric formulae one gets\n\\cos t (1-u^2)/(u^2 + 1)\\ ,\\quad \\sin t \n 2u/(u^2 + 1)\nand the rational parametric equation of an ellipse\n*\\ \\begin{array}{lcl} x(u) & & a(1-u^2)/(u^2+1) \\\\ y(u) & \n & 2bu/(u^2+1) \\end{array}\\; ,\\quad -\\infty\nwhich covers any point of the ellipse \\; \\tfrac{x^2}{a^2}+\\tfrac{y^2}{b^2}=1\\; except the left vertex (-a,0).\nFor u\\in [0,1], this formula represents the right upper quarter of the ellipse moving counter-clockwise with increasing u. The left vertex is the limit \\lim_{u \\to \\pm \\infty} (x(u),y(u))=(-a,0)\\; . \nRational representations of conic sections are popular with Computer Aided Design (see Bezier curve).\n\nTangent slope as parameter:\nA parametric representation, which uses the slope m of the tangent at a point of the ellipse  \ncan be obtained from the derivative of the standard representation \\vec x(t)=(a \\cos t, b \\sin t)^T:\n\\vec x'(t) (-a\\sin t, b\\cos t)^T \\quad \\rightarrow \\quad m \n -\\frac{b}{a}\\cot t\\quad \\rightarrow \\quad \\cot t = -\\frac{ma}{b}.\n  \nWith help of trigonometric formulae\none gets:\n\\cos t \\frac{\\cot t}{\\pm\\sqrt{1+\\cot^2t}} \n \\frac{-ma}{\\pm\\sqrt{m^2a^2+b^2}}\\ ,\\quad\\quad\n\\sin t \\frac{1}{\\pm\\sqrt{1+\\cot^2t}} \n \\frac{b}{\\pm\\sqrt{m^2a^2+b^2}}.\nReplacing \\cos t und \\sin t of the standard representation one yields\n* \\vec c_\\pm(m) = \\left(-\\frac{ma^2}{\\pm\\sqrt{m^2a^2+b^2}}\\;,\\;\\frac{b^2}{\\pm\\sqrt{m^2a^2+b^2}}\\right)^T,\\, m \\in \\R.\nWhere m is the slope of the tangent at the corresponding ellipse point, \\vec c_+ is the upper and \\vec c_- the lower half of the ellipse. The points with vertical tangents (vertices (\\pm a,0)) are not covered by the representation.\nThe equation of the tangent at point \\vec c_\\pm(m) has the form y=mx+n. The still unknown n can be determined by inserting the coordinates of the corresponding ellipse point \\vec c_\\pm(m):\n* y = m x \\pm\\sqrt{m^2a^2+b^2}\\; .\nThis description of the tangents of an ellipse is an essential tool for the determination of the orthoptic of an ellipse. The orthoptic article contains another proof, which omits differential calculus and trigonometric formulae.\n\nShifted Ellipse:\nA shifted ellipse with center (c_1,c_2) can be described by\n*(c_1+a \\cos t\\; ,\\; c_2+ b \\sin t),\\ 0\\le t\n\nA parametric representation of an arbitrary ellipse is contained in the section Ellipse as an affine image of the unit circle x²+y²\n1 below.\n\nRemarks on the parameters a and b \n\nThe parameters a and b represent the lengths of line segments and are therefore non-negative real numbers. Throughout this article a is the semi-major axis, i.e., a\\ge b \\ . In general the canonical ellipse equation \\tfrac{x^2}{a^2}+\\tfrac{y^2}{b^2}= 1  may have a  (and hence the ellipse would be taller than it is wide); in this form the semi-major axis would be b. This form can be converted to the form assumed in the remainder of this article simply by transposing the variable names x and  y and the parameter names a and  b.\n\nDefinition of an ellipse by the directrix property \n\nThe two lines at distance d = \\frac{a^2}c and parallel to the minor axis are called directrices of the ellipse (see diagram). \n* For an arbitrary point P of the ellipse the quotient of the distance to one focus and to the corresponding directrix (see diagram) is equal to the eccentricity:\n:\\frac \\frac \n e= \\frac{c}{a}\\ .\nThe proof for the pair F_1, l_1 follows from the fact that |PF_1|^2(x-c)^2+y^2,\\ |Pl_1|^2\n(x-\\tfrac{a^2}{c})^2 and y^2=\\tfrac{b^2}{a^2}x^2-b^2 satisfy the equation\n|PF_1|^2-\\frac{c^2}{a^2}|Pl_1|^2=0\\ .\nThe second case is proven analogously.\n\nThe inverse statement is also true and can be used to define an ellipse (in a manner similar to the definition of a parabola):\n* For any point F (focus), any line l (directrix) not through F and any real number e with 0 the set of points (locus of points), for which the quotient of the distances to the point and to the line is e\n:E \\{P \\mid  \\frac \n e\\} \nis an ellipse.\nThe choice e=0, which is the eccentricity of a circle, is in this context not allowed. One may consider the directrix of a circle to be the line at infinity.\n\n(The choice e = 1 yields a parabola and if e > 1 a hyperbola.)\n\n;Proof:\nLet F=(f,0) ,\\ e >0 and assume (0,0) is a point on the curve. \nThe directrix l has equation x-\\tfrac{f}{e}. With P\n(x,y), the relation |PF|^2=e^2|Pl|^2 produces the equations\n(x-f)^2+y^2e^2(x+\\tfrac{f}{e})^2\n(e x+f)^2 and x^2(e^2-1)+2xf(1+e)-y^2=0.\nThe substitution p=f(1+e) yields\n* x^2(e^2-1)+2px-y^2=0.\nThis is the equation of an ellipse (e) or a parabola  (e=1) or a hyperbola (e>1). All of these non-degenerate conics have, in common, the origin as a vertex (see diagram).\n\nIf e, introduce new parameters a,b so that\n1-e^2 \\tfrac{b^2}{a^2}, \\text { and }\\ p\n\\tfrac{b^2}{a}, and then the equation above becomes \n\\tfrac{(x-a)^2}{a^2}+\\tfrac{y^2}{b^2}=1\\ ,\nwhich is the equation of an ellipse with center (a,0), the x-axis as major axis and\nthe major/minor semi axis a,b.\n\n;General case:\nIf the focus is F(f_1,f_2)  and the directrix ux+vy+w\n0  one gets the equation\n\\left(x-f_1\\right)^2+\\left(y-f_2\\right)^2= e^2\\cdot\\frac{\\left(ux+vy+w\\right)^2}{u^2+v^2} \n\n(The right side of the equation uses the Hesse normal form of a line to calculate the distance |Pl|.)\n\nThe normal bisects the angle between the lines to the foci \n\nFor an ellipse the following statement is true:\n* The normal at a point P bisects the angle between the lines \\overline{PF_1}, \\overline{PF_2}.\n;Proof:\nBecause the tangent is perpendicular to the normal, the statement is true for the tangent and the complementary angle of the lines to the foci (see diagram), too.\n\nLet L be the point on the line \\overline{PF_2} with the distance 2a to the focus F_2, a is the semi major axis of the ellipse. Line w is the bisector of the angle between the lines \\overline{PF_1}, \\overline{PF_2}. In order to prove that w is the tangent line at point P, one checks that any point Q on line w which is different from P cannot be on the ellipse. Hence w has only point P in common with the ellipse and is, therefore, the tangent at point P. \nFrom the diagram and the triangle inequality one recognizes that 2a|LF_2| holds, which means: |QF_2|+|QF_1|>2a. But if Q is a point of the ellipse, the sum should be 2a.\n;application:\nThe rays from one focus are reflected by the ellipse to the second focus. This property has optical and acoustic applications similar to the reflective property of a parabola (see whispering gallery).\n\nEllipse as an affine image of the unit circle x²+y²\n1 \n\nAnother definition of an Ellipse uses affine transformations:\n*Any Ellipse is the affine image of the unit circle with equation x^2+y^2=1.\n\nAn affine transformation of the Euclidean plane has the form \\vec x \\to \\vec f_0+A\\vec x, where A is a regular matrix (its determinant is not 0) and \\vec f_0 is an arbitrary vector. If \\vec f_1, \\vec f_2 are the column vectors of the matrix A, the unit circle (\\cos(t),\\sin(t)), t \\in [0,2\\pi) , is mapped onto the Ellipse\n* \\vec x \\vec p(t)\n\\vec f_0+ \\vec f_1 \\cos t +\\vec f_2 \\sin t \\ .\n\\vec f_0 is the center, \\vec f_1,\\; \\vec f_2 are the directions of two conjugate diameters of the ellipse. In general the vectors \\vec f_1, \\vec f_2 are not perpendicular. That means, in general  \\vec f_0\\pm \\vec f_1and  \\vec f_0\\pm \\vec f_2are not the vertices of the ellipse.\n\nThe tangent vector at point  \\vec p(t) is \n\\vec p'(t) = -\\vec f_1\\sin t  + \\vec f_2\\cos t \\ .\nBecause at a vertex the tangent is perpendicular to the major/minor axis (diameters) of the ellipse one gets the parameter t_0 of a vertex from the equation \n\\vec p'(t)\\cdot (\\vec p(t) -\\vec f_0) (-\\vec f_1\\sin t + \\vec f_2\\cos t)\\cdot(\\vec f_1 \\cos t +\\vec f_2 \\sin t) \n0\nand hence \n*\\cot (2t_0)= \\tfrac{\\vec f_1^{\\, 2}-\\vec f_2^{\\, 2}}{2\\vec f_1 \\cdot \\vec f_2}.\n(The formulae \\cos^2 t -\\sin^2 t\\cos 2t,\\ 2\\sin t \\cos t \n \\sin 2t were used.)\n\nIf \\vec f_1 \\cdot \\vec f_20, then t_0\n0.\n\nThe 4 vertices of the ellipse are \\vec p(t_0),\\;\\vec p(t_0\\pm\\frac{\\pi}{2}),\\; \\vec p(t_0+\\pi) \\ .\n\nThe advantage of this definition is that one gets a simple parametric representation of an arbitrary ellipse, even in the space, if the vectors \\vec f_0, \\vec f_1, \\vec f_2 are vectors of the Euclidean space.\n\nConjugate diameters and the midpoints of parallel chords \n\nFor a circle,\n(M) the midpoints of parallel chords lie on a diameter. \nThe diameter and the parallel chords are orthogonal. An affine transformation in general does not preserve orthogonality but does preserve parallelism and midpoints of line segments. Hence: property (M) (which omits the term orthogonal) is true for any ellipse.\n;Definition:\nTwo diameters d_1 ,\\; d_2  of an ellipse are conjugate if the midpoints of chords parallel to d_1 lie on d_2\\ .\n\nFrom the diagram one finds:\n(T) Two diameters d_1: \\overline{P_1Q_1} \\; ,\\;d_2: \\overline{P_2Q_2}, of an ellipse are conjugate, if the tangents at  P_1 and  Q_1  are parallel to d_2 and visa versa.\n\nThe term conjugate diameters is a kind of generalization of orthogonal.\n\nConsidering the parametric equation\n\\vec x\\vec p(t) \n \\vec f_0 +\\vec f_1 \\cos t +\\vec f_2 \\sin t\nof an ellipse, any pair \\vec p(t),\\vec p(t+\\pi) of points belong to a diameter and the pair \\vec p(t+\\pi/2),\\vec p(t-\\pi/2) belongs to its conjugate diameter.\n\nOrthogonal tangents \n\nFor the ellipse \\tfrac{x^2}{a^2}+\\tfrac{y^2}{b^2}=1\nthe intersection points of orthogonal tangents lie on the circle  x^2+y^2=a^2+b^2.\n\nThis circle is called orthoptic of the given ellipse.\n\nTheorem of Apollonios on conjugate diameters \n\nFor an ellipse with semi-axes a,\\;b the following is true:\n* Let c_1  and   c_2 be halves of two conjugate diameters (see diagram) then \n(1)  c_1^2+c_2^2=a^2+b^2, \n(2) the triangle formed by c_1, \\; c_2 has the constant area A_\\Delta= \\frac{1}{2}ab\n(3) the parallelogram of tangents adjacent to the given conjugate diameters has the \\text{Area}_{12}=4ab\\ .\n;Proof: \nLet the ellipse be in the canonical form with parametric equation \n \\vec p(t)=(a \\cos t ,b\\sin t)^T.\nThe two points \\vec c_1\\vec p(t),\\ \\vec c_2\n \\vec p(t+\\pi/2) are on conjugate diameters (see previous section). From trigonometric formulae one gets \\vec c_2=(-a\\sin t,b\\cos t)^T and \n |\\vec c_1|^2 + |\\vec c_2|^2 \\cdots \n a^2+b^2 \\ . \nThe area of the triangle generated by   \\vec c_1 , \\vec c_2  is\n A_\\Delta\\tfrac{1}{2}\\det(\\vec c_1, \\vec c_2)\n\\cdots = \\tfrac{1}{2} ab   \nand from the diagram it can be seen that the area of the parallelogram is 8 times that of  A_\\Delta . Hence\n\\text{Area}_{12}=4ab\\ .\n\nDrawing ellipses\n\nEllipses appear in descriptive geometry as images (parallel or central projection) of circles (for details: see Ellipses in DG (German)). So it is essential to have tools to draw an ellipse. Nowadays the best tool is the computer. During the times before this tool was not available and one was restricted to compass and ruler for the construction of single points of an ellipse. But there are technical tools (ellipsographs) to draw an ellipse in a continuous way like a compass for drawing a circle, too. The principle of ellipsographs were known to Greek mathematicians (Archimedes, Proklos) already.\n\nIf there is no ellipsograph available, the best and quickest way to draw an ellipse is to draw an Approximation by the four osculating circles at the vertices.\n\nFor any method described below \n*the knowledge of the axes and the semi-axes is necessary (or equivalent: the foci and the semi-major axis). \nIf this presumption is not fulfilled one has to know at least two conjugate diameters. With help of Rytz's construction the axes and semi-axes can be retrieved.\n\nPins-and-string method\n\nThe characterization of an ellipse as the locus of points so that sum of the distances to the foci is constant leads to a method of drawing one using two drawing pins, a length of string, and a pencil. In this method, pins are pushed into the paper at two points, which become the ellipse's foci. A string tied at each end to the two pins and the tip of a pencil pulls the loop taut to form a triangle. The tip of the pencil then traces an ellipse if it is moved while keeping the string taut. Using two pegs and a rope, gardeners use this procedure to outline an elliptical flower bed—thus it is called the gardener's ellipse.\n\nA similar method for drawing confocal ellipses with a closed string is due to the Irish bishop Charles Graves.\n\nPaper strip methods \n\nThe two following methods rely on the parametric representation (see section parametric representation, above):\n(a\\cos t,\\;b\\sin t)\nThis representation can be modeled technically by two simple methods. In both cases center, the axes and semi axes  a,\\; b have to be known.\n;Method 1\nThe first method starts with \n*a strip of paper of length a+b. \nThe point, where the semi axes meet is marked by P. If the strip slides with both ends on the axes of the desired ellipse, then point P traces the ellipse. For the proof one shows that point P has the parametric representation  (a\\cos t,\\;b\\sin t), where parameter  t  is the angle of the slope of the paper strip.\n\nA technichal realization of the motion of the paper strip can be achieved by a Tusi couple (s. animation). The device is able to draw any ellipse with a fixed sum a+b, which is the radius of the large circle. This restriction may be a disadvantage in real life. More flexible is the second paper strip method.\n\nA nice application: If one stands somewhere in the middle of a ladder, which stands on a slippery ground and leans on a slippery wall, the ladder slides down and the persons feet trace an ellipse.\n\nElliko-pap1.svg|Ellipse construction: paper strip method 1\nTusi couple vs Paper strip plus Ellipses horizontal.gif|Ellipses with Tusi couple. Two examples: red and cyan.\n\nA variation of the paper strip method 1J. van Mannen: Seventeenth century instruments for drawing conic sections. In: The Mathematical Gazette. Vol. 76, 1992, p. 222–230. uses the observation, that the midpoint N of the paper strip is moving on the circle with center M (of the ellipse) and radius \\tfrac{a+b}{2}. Hence the paperstrip can be cut at point N into halves, connected again by a joint at N and the sliding end K fixed at the center M (see diagram). After this operation the movement of the unchanged half of the paperstrip is unchanged. The advantage of this variation is: Only one expensive sliding shoe is necessary.  \nOne should be aware that the end, which is sliding on the minor axis, has to be changed.\n\nEllipse-papsm-1a.svg|Variation of the paper strip method 1\nEllipses with SliderCrank inner Ellipses.gif|Animation of the variation of the paper strip method 1\n\n; Method 2:\nThe second method starts with \n*a strip of paper of length a. \nOne marks the point, which divides the strip into two substrips of length b and a-b. The strip is positioned onto the axes as described in the diagram. Then the free end of the strip traces an ellipse, while the strip is moved. For the proof, one recognizes that the tracing point can be described parametrically by (a\\cos t,\\;b\\sin t), where parameter t is the angle of slope of the paper strip.\n\nThis method is the base for several ellipsographs (see section below).\n\nRemark: Similar to the variation of the paper strip method 1 a variation of the paper strip method 2 can be established (see diagram) by cutting the part between the axes into halves.\n\nFile:Archimedes Trammel.gif|Trammel of Archimedes (principle)\nFile:L-Ellipsenzirkel.png|Ellipsograph due to Benjamin Bramer\nFile:Ellipses with SliderCrank Ellipses at Slider Side.gif|Variation of the paper strip method 2\n\nApproximation by osculating circles \n\nFrom section metric properties one gets:\n*The radius of curvature at the vertices V_1,V_2 is: \\tfrac{b^2}{a}\\ ,\nthe radius of curvature at the co-vertices V_3,V_4 is: \\tfrac{a^2}{b}\\ .\nThe diagram shows an easy way to find the centers C_1(a-\\tfrac{b^2}{a},0),\\; C_3\n(0,b-\\tfrac{a^2}{b}) of curvature at vertex V_1 and co-vertex V_3, resp.:\n(1) mark the auxiliary point H=(a,b) and draw the linesegment V_1V_3\\ ,\n(2) draw the line through H, which is perpendicular to the line V_1V_2\\ ,\n(3) the intersection points of this line with the axes are the centers of the oasculating circles. \n(proof: simple calculation.)\n\nThe centers for the remaining vertices are found by symmetry.\n\nWith help of a French curve one draws a curve, which has smooth contact to the osculating circles.\n\nSteiner generation of an ellipse \n\nThe following method to construct single points of an ellipse relies on the Steiner generation of a non degenerate conic section: \n*Given two pencils B(U),B(V) of lines at two points U,V (all lines containing U and  V, respectively) and a projective but not perspective mapping \\pi of B(U) onto B(V), then the intersection points of corresponding lines form a non-degenerate projective conic section.\n\nFor the generation of points of the ellipse \\tfrac{x^2}{a^2}+\\tfrac{y^2}{b^2}1 one uses the pencils at the vertices V_1,V_2. Let P\n(0,b) be an upper co-vertex of the ellipse and A(-a,2b), B\n(a,2b). \nP is the center of the rectangle V_1,V_2,B,A. The side  \\overline{AB} of the rectangle is divided into n equal spaced line segments and this division is projected parallel with the diagonal AV_2 as direction onto the line segment  \\overline{V_1B} and assign the division as shown in the diagram. The parallel projection together with the reverse of the orientation is part of the projective mapping between the pencils at V_1 and V_2 needed. The intersection points of any two related lines   V_1B_i and V_2A_i are points of the uniquely defined ellipse. With help of the points C_1,\\dotsc the points of the second quarter of the ellipse can be determined. Analogously one gets the points of the lower half of the ellipse.\n\nRemark:\n# The Steiner generation exists for hyperbolas and parabolas, too. \n# The Steiner generation is sometimes called a parallelogram method because one can use other points rather than the vertices, which starts with a parallelogram instead of a rectangle.\n\nEllipsographs \n\nMost technical instruments for drawing ellipses are based on the second paperstrip method. \n*[http://www.history.didaktik.mathematik.uni-wuerzburg.de/ausstell/ellipsenzirkel/index.html Ellipsenzirkel (German)]\n*[http://collectingme.com/drawing/ Drawing instruments]\nFor more principles of ellipsographs:\n*Ellipsographe (French)\n\nInscribed angles for ellipses and the 3-point-form \n\nCircles \n\nA circle with equation (x-c)^2+(y-d)^2=r^2,\\ r> 0\\ ,  is uniquely determined by three points (x_1,y_1),\\;(x_2,y_2),\\; (x_3,y_3) not on a line. A simple way to determine the parameters c,d,r uses the inscribed angle theorem for circles:\nFor four points  P_i(x_i,y_i),\\ i\n1,2,3,4, (see diagram) the following statement is true:\nThe four points are on a circle if and only if the angles at P_3 and P_4 are equal.\n\nUsually one measures inscribed angles by degree or radian . In order to get an equation of a circle determined by three points, the following measurement is more convenient: \n*In order to measure an angle between two lines with equations ym_1x+d_1, \\ y\nm_2x + d_2\\ ,m_1\\ne m_2  one uses the quotient\n:\\frac{1+m_1\\cdot m_2}{m_2-m_1}\\ .\nThis expression is the cotangent of the angle between the two lines.\n\nInscribed angle theorem for circles:\nFor four points  P_i(x_i,y_i),\\ i\n1,2,3,4,, no three of them on a line (see diagram), the following statement is true:\nThe four points are on a circle, if and only if the angles at P_3 and P_4 are equal. In the sense of the measurement above, that means, if\n:\\frac{(x_4-x_1)(x_4-x_2)+(y_4-y_1)(y_4-y_2)}\n             {(y_4-y_1)(x_4-x_2)-(y_4-y_2)(x_4-x_1)}=\n        \\frac{(x_3-x_1)(x_3-x_2)+(y_3-y_1)(y_3-y_2)}\n             {(y_3-y_1)(x_3-x_2)-(y_3-y_2)(x_3-x_1)} \nAt first the masure is available for chords, which are not parallel to the y-axis, only. But the final formula works for any chord.\n\nA consequence of the inscribed angle theorem for circles is the\n\n3-point-form of a circle's equation:\nOne gets the equation of the circle determined by 3 points P_i=(x_i,y_i) not on a line by a conversion of the equation \n:\\frac{({\\color{green}x}-x_1)({\\color{green}x}-x_2)+({\\color{red}y}-y_1)({\\color{red}y}-y_2)}\n             {({\\color{red}y}-y_1)({\\color{green}x}-x_2)-({\\color{red}y}-y_2)({\\color{green}x}-x_1)}=\n        \\frac{(x_3-x_1)(x_3-x_2)+(y_3-y_1)(y_3-y_2)}\n             {(y_3-y_1)(x_3-x_2)-(y_3-y_2)(x_3-x_1)} \\ .\n\nEllipses \n\nIn this section one considers ellipses with an equation\n \\frac{(x-c)^2}{a^2}+ \\frac{(y-d)^2}{b^2}1 \\quad \\leftrightarrow \\quad (x-c)^2+\\frac{a^2}{b^2}(y-d)^2\na^2, \\quad c,d,\\in \\R, \\ a > 0 \\ ,\nwhere the ratio \\frac{a^2}{b^2} is fixed.\nWith the abbreviation {\\color{blue}q}=\\frac{a^2}{b^2}\\  one gets the more convenient form\n*(x-c)^2+{\\color{blue}q}\\; (y-d)^2=a^2,\\quad c,d \\in \\R, a> 0  and q>0 fixed. \nSuch ellipses have their axes parallel to the coordinate axes and their eccentricity fixed. Their major axes are parallel to the x-axis if q>1 and parallel to the y-axis if q.\n\nLike a circle, such an ellipse is determined by three points not on a line.\n\nIn this more general case one introduces the following measurement of an angle,:[http://www.mathematik.tu-darmstadt.de/~ehartmann/circlegeom.pdf E. Hartmann: Lecture Note 'Planar Circle Geometries', an Introduction to Möbius-, Laguerre- and Minkowski Planes, p. 55]W. Benz, Vorlesungen über Geomerie der Algebren, Springer (1973)\n\n*In order to measure an angle between two lines with equations ym_1x+d_1, \\ y\nm_2x + d_2\\ ,m_1\\ne m_2  one uses the quotient\n:\\frac{1+{\\color{blue}q}\\; m_1\\cdot m_2}{m_2-m_1}\\ .\n\nInscribed angle theorem for ellipses\n\nFor four points  P_i(x_i,y_i),\\ i\n1,2,3,4,, no three of them on a line (see diagram), the following statement is true:\nThe four points are on an ellipse with equation (x-c)^2+q\\; (y-d)^2=a^2 , if and only if the angles at P_3 and P_4 are equal in the sense of the measurement above—that is, if\n:\\frac{(x_4-x_1)(x_4-x_2)+{\\color{blue}q}\\;(y_4-y_1)(y_4-y_2)}\n             {(y_4-y_1)(x_4-x_2)-(y_4-y_2)(x_4-x_1)}=\n        \\frac{(x_3-x_1)(x_3-x_2)+{\\color{blue}q}\\;(y_3-y_1)(y_3-y_2)}\n             {(y_3-y_1)(x_3-x_2)-(y_3-y_2)(x_3-x_1)} \\ .\nAt first the measure is available only for chords which are not parallel to the y-axis. But the final formula works for any chord. The proof follows from a straightforward calculation. For the direction of proof given that the points are on an ellipse, one can assume that the center of the ellipse is the origin.\n\nA consequence of the inscribed angle theorem for ellipses is the\n\n3-point-form of an ellipse's equation:\nOne gets the equation of the ellipse determined by 3 points P_i=(x_i,y_i) not on a line by a conversion of the equation \n: \\frac{({\\color{green}x}-x_1)({\\color{green}x}-x_2)+{\\color{blue}q}\\;({\\color{red}y}-y_1)({\\color{red}y}-y_2)}\n             {({\\color{red}y}-y_1)({\\color{green}x}-x_2)-({\\color{red}y}-y_2)({\\color{green}x}-x_1)}=\n        \\frac{(x_3-x_1)(x_3-x_2)+{\\color{blue}q}\\;(y_3-y_1)(y_3-y_2)}\n             {(y_3-y_1)(x_3-x_2)-(y_3-y_2)(x_3-x_1)}\\ . \n\nPole-polar relation for an ellipse \n\nAny ellipse can be described in a suitable coordinate system by an equation \\tfrac{x^2}{a^2}+\\tfrac{y^2}{b^2}1. The equation of the tangent at a point P_0\n(x_0,y_0) of the ellipse is \\tfrac{x_0x}{a^2}+\\tfrac{y_0y}{b^2}1. If one allows point P_0\n(x_0,y_0) to be an arbitrary point different from the origin, then \n* point P_0(x_0,y_0)\\ne(0,0) is mapped onto the line \\frac{x_0x}{a^2}+\\frac{y_0y}{b^2}\n1 , not through the center of the ellipse. \nThis relation between points and lines is a bijection.\n\nThe inverse function maps\n* line y=mx+d,\\ d\\ne 0 onto the point \\left(-\\frac{ma^2}{d},\\frac{b^2}{d}\\right) and\nline x=c,\\ c\\ne 0 onto the point \\left(\\frac{a^2}{c},0\\right)\\ .\n\nSuch a relation between points and lines generated by a conic is called pole-polar relation or just polarity. The pole is the point, the polar the line. See Pole and polar.\n\nBy calculation one checks the following properties of the pole-polar relation of the ellipse:\n* For a point (pole) on the ellipse the polar is the tangent at this point (see diagram: P_1,\\ p_1).\n* For a pole P outside the ellipse the intersection points of its polar with the ellipse are the tangency points of the two tangents passing P (see diagram: P_2,\\ p_2).\n* For a point within the ellipse the polar has no point with the ellipse in common.  (see diagram: F_1,\\ l_1).\n\nRemarks:\n# The intersection point of two polars is the pole of the line through their poles.\n# The foci (c,0), and  (-c,0) respectively and the directrices x\\tfrac{a^2}{c} and x\n-\\tfrac{a^2}{c} respectively belong to pairs of pole and polar.\nPole-polar relations exist for hyperbolas and parabolas, too.\n\nMetric properties \n\nAll metric properties given below refer to an ellipse with equation \\frac{x^2}{a^2}+\\frac{y^2}{b^2}= 1 .\n\nArea \n\nThe area A_\\text{ellipse} enclosed by an ellipse is:\n\n*A_\\text{ellipse} = \\pi ab\n\nwhere a and b are the lengths of the semi-major and semi-minor axes, respectively.  The area formula \\pi a b is intuitive: start with a circle of radius b (so its area is \\pi b^2) and stretch it by a factor a/b to make an ellipse. This scales the area by the same factor: \\pi b^2(a/b) \\pi a b.  It is also easy to rigorously prove the area formula using integration as follows.  Equation () can be rewritten as y(x)\n b \\sqrt{1 - x^2/a^2}.  For x\\in[-a,a], this curve is the top half of the ellipse.  So twice the integral of y(x) over the interval [-a,a] will be the area of the ellipse:\n\n\\begin{align}\nA_\\text{ellipse} &= \\int_{-a}^a 2b\\sqrt{1-x^2/a^2}\\,dx\\\\\n &= \\frac ba \\int_{-a}^a 2\\sqrt{a^2-x^2}\\,dx.\n\\end{align}\n\nThe second integral is the area of a circle of radius a, that is, \\pi a^2. So\n\nA_\\text{ellipse} \\frac{b}{a}\\pi a^2 \n \\pi ab.\nAn ellipse defined implicitly by Ax^2+ Bxy + Cy^2 = 1  has area 2\\pi / \\sqrt{4AC - B^2}.\n\nCircumference\n\nThe circumference C of an ellipse is:\n\nC = 4 a E(e)\nwhere again a is the length of the semi-major axis, e is the eccentricity \\sqrt{1 - b^2/a^2}, and the function E is the complete elliptic integral of the second kind,\n\nE(e) = \\int_0^{\\pi/2}\\sqrt {1 - e^2 \\sin^2\\theta}\\ d\\theta,\n\nwhich calculates the circumference of the ellipse in the first quadrant alone, and the formula for the circumference of an ellipse can thus be written\n\nThe arc length of an ellipse, in general, has no closed-form solution in terms of elementary functions. Elliptic integrals were motivated by this problem. Equation () may be evaluated directly using the Carlson symmetric form. This gives a succinct and quadratically converging iterative method for evaluating the circumference using the arithmetic-geometric mean.\n\nThe exact infinite series is:\n\nC = 2\\pi a \\left[{1 - \\left(\\frac{1}{2}\\right)^2e^2 - \\left(\\frac{1\\cdot 3}{2\\cdot 4}\\right)^2\\frac{e^4}{3} - \\left(\\frac{1\\cdot 3\\cdot 5}{2\\cdot 4\\cdot 6}\\right)^2\\frac{e^6}{5} - \\cdots}\\right]\n\n2\\pi a \\left[1 - \\sum_{n\n1}^\\infty \\left(\\frac{(2n-1)!!}{(2n)!!}\\right)^2 \\frac{e^{2n}}{2n-1}\\right],\nwhere n!! is the double factorial.  Unfortunately, this series converges rather slowly; however, by expanding in terms of h = (a-b)^2 / (a+b)^2, Ivory and Bessel Englisch translation of  derived an expression that converges much more rapidly,\nC \\pi (a+b) \\left[1 + \\sum_{n\n1}^\\infty \\left(\\frac{(2n-1)!!}{2^n n!}\\right)^2 \\frac{h^n}{(2n-1)^2}\\right].\n\nRamanujan gives two good approximations for the circumference in §16 of \"Modular Equations and Approximations to \\pi\"; they are\nC \\approx \\pi \\left[3(a+b) - \\sqrt{(3a+b)(a+3b)}\\right]= \\pi \\left[3(a+b)-\\sqrt{10ab+3(a^2+b^2)}\\right]\n\nand\n\nC\\approx\\pi\\left(a+b\\right)\\left(1+\\frac{3h}{10+\\sqrt{4-3h}}\\right).\n\nThe errors in these approximations, which were obtained empirically, are of order h^3 and h^5, respectively.\n\nMore generally, the arc length of a portion of the circumference, as a function of the angle subtended, is given by an incomplete elliptic integral.\n\nThe inverse function, the angle subtended as a function of the arc length, is given by the elliptic functions.\n\nSome lower and upper bounds on the circumference of the canonical ellipse x^2/a^2 + y^2/b^2 = 1 with a\\geq b are\n\n C\\le 2\\pi a,\n\n\\pi (a+b)\\le C\\le 4(a+b),\n\n4\\sqrt{a^2+b^2}\\le C\\le \\sqrt{2} \\pi \\sqrt{a^2+b^2} .\n\nHere the upper bound 2\\pi a is the circumference of a circumscribed concentric circle passing through the endpoints of the ellipse's major axis, and the lower bound 4\\sqrt{a^2+b^2} is the perimeter of an inscribed rhombus with vertices at the endpoints of the major and minor axes.\n\nCurvature \n\nThe curvature is given by \\kappa = \\frac{1}{a^2 b^2}\\left(\\frac{x^2}{a^4}+\\frac{y^2}{b^4}\\right)^{-\\frac{3}{2}}\\ ,\nradius of curvature at point (x,y):\n\\rho a^2 b^2 \\left(\\frac{x^{2}}{a^4} + \\frac{y^{2}}{b^4}\\right)^{3/2} \n \\frac{1}{a^4 b^4} \\sqrt{\\left(a^4 y^{2} + b^4 x^{2}\\right)^3} \\ .\n\nRadius of curvature at the two vertices (\\pm a,0) and the centers of curvature:\n\\rho_0 \\frac{b^2}{a}\np\\ , \\qquad \\left(\\pm\\frac{c^2}{a}\\,\\bigg|\\,0\\right)\\ .\nRadius of curvature at the two co-vertices (0,\\pm b) and the centers of curvature:\n\\rho_1 = \\frac{a^2}{b}\\ , \\qquad \\left(0\\,\\bigg|\\,\\pm\\frac{c^2}{b}\\right)\\ .\n\nEllipse as quadric \n\nGeneral ellipse\n\nIn analytic geometry, the ellipse is defined as a quadric: the set of points (X,Y) of the Cartesian plane that, in non-degenerate cases, satisfy the implicit equation\n\n~A X^2 + B X Y + C Y^2 + D X + E Y + F = 0\n\nprovided B^2 - 4AC \n\nTo distinguish the degenerate cases from the non-degenerate case, let ∆ be the determinant\n\\begin{vmatrix} A & B/2 & D/2\\\\B/2 & C & E/2\\\\D/2 & E/2 & F \\end{vmatrix}; \nthat is,\n\\Delta = \\left( AC - \\frac{B^2}{4} \\right) F + \\frac{BED}{4} - \\frac{CD^2}{4} - \\frac{AE^2}{4}.\nThen the ellipse is a non-degenerate real ellipse if and only if C∆  0, we have an imaginary ellipse, and if ∆ 0, we have a point ellipse.Lawrence, J. Dennis, A Catalog of Special Plane Curves, Dover Publ., 1972.\n\nThe general equation's coefficients can be obtained from known semi-major axis a, semi-minor axis b, center coordinates (x_c, y_c) and rotation angle \\Theta using the following formulae:\n\\begin{align}A &= a^2 (\\sin\\Theta)^2 + b^2 (\\cos\\Theta)^2\\\\\nB &= 2 (b^2-a^2) \\sin\\Theta \\cos\\Theta\\\\\nC &= a^2 (\\cos\\Theta)^2 + b^2 (\\sin\\Theta)^2\\\\\nD &= -2 A x_c - B y_c\\\\\nE &= -B x_c - 2 C y_c\\\\\nF &= A x_c^2 + B x_c y_c + C y_c^2 - a^2 b^2\\end{align}\nThese expressions can be derived from the canonical equation (see next section) by substituting the coordinates with expressions for rotation and translation of the coordinate system:\n\\frac{x_{can}^2}{a^2} + \\frac{y_{can}^2}{b^2} = 1\nx_{can} = (x-x_c) \\cos\\Theta + (y-y_c) \\sin\\Theta\ny_{can} = -(x-x_c) \\sin\\Theta + (y-y_c) \\cos\\Theta\n\nCanonical form\n\nLet a>b. Through change of coordinates (a rotation of axes and a translation of axes) the general ellipse can be described by the canonical implicit equation\n\n\\frac{x^2}{a^2}+\\frac{y^2}{b^2}=1\n\nHere (x,y) are the point coordinates in the canonical system, whose origin is the center (X_c,Y_c) of the ellipse, whose x-axis is the unit vector (X_a,Y_a) coinciding with the major axis, and whose y-axis is the perpendicular vector (-Y_a,X_a) coinciding with the minor axis. That is, x X_a(X - X_c) + Y_a(Y - Y_c) and y \n -Y_a(X - X_c) + X_a(Y - Y_c).\n\nIn this system, the center is the origin (0,0) and the foci are (-e a, 0) and (+e a, 0).\n\nAny ellipse can be obtained by rotation and translation of a canonical ellipse with the proper semi-diameters. The expression of an ellipse centered at (X_c,Y_c) is\n\n\\frac{(x - X_c)^2}{a^2}+\\frac{(y - Y_c)^2}{b^2}=1\n\nMoreover, any canonical ellipse can be obtained by scaling the unit circle of \\reals^2, defined by the equation\n\nX^2+Y^2=1\\,\n\nby factors a and b along the two axes.\n\nFor an ellipse in canonical form, we have\n\n Y \\pm b\\sqrt{1 - (X/a)^2} \n \\pm \\sqrt{(a^2-X^2)(1 - e^2)}\n\nThe distances from a point (X,Y) on the ellipse to the left and right foci are a + e X and a - e X, respectively.\n\nThe canonical form coefficients can be obtained from the general form coefficients using the following equations:\n\n\\begin{align}\na, b   &= \\frac{-\\sqrt{2 \\Big(A E^2 + C D^2 - B D E + (B^2 - 4 A C) F\\Big)\\left(A + C \\pm \\sqrt{(A - C)^2 + B^2}\\right)}}{B^2 - 4 A C} \\\\\nX_c    &= \\frac{2 C D - B E}{B^2 - 4 A C} \\\\\nY_c    &= \\frac{2 A E - B D}{B^2 - 4 A C} \\\\\n\\Theta &= \\begin{cases}\n  0 & \\text{for } B = 0, A  C\\\\\n  \\arctan\\frac{C - A - \\sqrt{(A - C)^2 + B^2}}{B} & \\text{for } B \\ne 0\n\\end{cases}\n\\end{align}\n\nwhere \\Theta is the angle from the positive horizontal axis to the ellipse's major axis.\n\nPolar forms \n\nPolar form relative to center \n\nIn polar coordinates, with the origin at the center of the ellipse and with the angular coordinate \\theta measured from the major axis, the ellipse's equation is\nr(\\theta)=\\frac{ab}{\\sqrt{(b \\cos \\theta)^2 + (a\\sin \\theta)^2}}\n\nPolar form relative to focus \n\nIf instead we use polar coordinates with the origin at one focus, with the angular coordinate \\theta = 0 still measured from the major axis, the ellipse's equation is\nr(\\theta)=\\frac{a (1-e^2)}{1 \\pm e\\cos\\theta}\nwhere the sign in the denominator is negative if the reference direction \\theta = 0 points towards the center (as illustrated on the right), and positive if that direction points away from the center.\n\nIn the slightly more general case of an ellipse with one focus at the origin and the other focus at angular coordinate \\phi, the polar form is\nr=\\frac{a (1-e^2)}{1 - e\\cos(\\theta - \\phi)}.\n\nThe angle \\theta in these formulas is called the true anomaly of the point. The numerator a (1-e^2) of these formulas is the semi-latus rectum of the ellipse, usually denoted l. It is the distance from a focus of the ellipse to the ellipse itself, measured along a line perpendicular to the major axis.\n\nEllipse as hypotrochoid\n\nThe ellipse is a special case of the hypotrochoid when R  2r, as shown in the adjacent image. The special case of a moving circle with radius r inside a circle with radius R\n2r is called a Tusi couple.\n\nEllipses as plane sections of quadrics \n\nEllipses appear as plane sections of the following quadrics:\n* Ellipsoid\n* Elliptic cone \n* Elliptic cylinder\n* Hyperboloid of one sheet\n* Hyperboloid of two sheets\n\nEllipsoid Quadric.png|Ellipsoid\nQuadric Cone.jpg|Elliptic cone\nElliptic Cylinder Quadric.png|Elliptic cylinder\nHyperboloid1.png|Hyperboloid of one sheet\nHyperboloid2.png|Hyperboloid of two sheets\n\nApplications \n\nPhysics\n\nElliptical reflectors and acoustics \n\nIf the water's surface is disturbed at one focus of an elliptical water tank, the circular waves of that disturbance, after reflecting off the walls, converge simultaneously to a single point: the second focus. This is a consequence of the total travel length being the same along any wall-bouncing path between the two foci.\n\nSimilarly, if a light source is placed at one focus of an elliptic mirror, all light rays on the plane of the ellipse are reflected to the second focus. Since no other smooth curve has such a property, it can be used as an alternative definition of an ellipse. (In the special case of a circle with a source at its center all light would be reflected back to the center.) If the ellipse is rotated along its major axis to produce an ellipsoidal mirror (specifically, a prolate spheroid), this property holds for all rays out of the source. Alternatively, a cylindrical mirror with elliptical cross-section can be used to focus light from a linear fluorescent lamp along a line of the paper; such mirrors are used in some document scanners.\n\nSound waves are reflected in a similar way, so in a large elliptical room a person standing at one focus can hear a person standing at the other focus remarkably well. The effect is even more evident under a vaulted roof shaped as a section of a prolate spheroid. Such a room is called a whisper chamber. The same effect can be demonstrated with two reflectors shaped like the end caps of such a spheroid, placed facing each other at the proper distance. Examples are the National Statuary Hall at the United States Capitol (where John Quincy Adams is said to have used this property for eavesdropping on political matters); the Mormon Tabernacle at Temple Square in Salt Lake City, Utah; at an exhibit on sound at the Museum of Science and Industry in Chicago; in front of the University of Illinois at Urbana-Champaign Foellinger Auditorium; and also at a side chamber of the Palace of Charles V, in the Alhambra.\n\nPlanetary orbits \n\nIn the 17th century, Johannes Kepler discovered that the orbits along which the planets travel around the Sun are ellipses with the Sun [approximately] at one focus, in his first law of planetary motion. Later, Isaac Newton explained this as a corollary of his law of universal gravitation.\n\nMore generally, in the gravitational two-body problem, if the two bodies are bound to each other (that is, the total energy is negative), their orbits are similar ellipses with the common barycenter being one of the foci of each ellipse. The other focus of either ellipse has no known physical significance. Interestingly, the orbit of either body in the reference frame of the other is also an ellipse, with the other body at the same focus.\n\nKeplerian elliptical orbits are the result of any radially directed attraction force whose strength is inversely proportional to the square of the distance. Thus, in principle, the motion of two oppositely charged particles in empty space would also be an ellipse. (However, this conclusion ignores losses due to electromagnetic radiation and quantum effects, which become significant when the particles are moving at high speed.)\n\nFor elliptical orbits, useful relations involving the eccentricity e are:\n\n\\begin{align}e &\\frac{r_{a}-r_{p}}{r_{a}+r_{p}}\n\\frac{r_{a}-r_{p}}{2a}\\\\\nr_{a} &= (1+e)a\\\\\nr_{p} &= (1-e)a\\end{align}\n\nwhere\n*r_{a} is the radius at apoapsis (the farthest distance)\n*r_{p} is the radius at periapsis (the closest distance)\n*a is the length of the semi-major axis\n\nAlso, in terms of r_{a} and r_{p}, the semi-major axis a is their arithmetic mean, the semi-minor axis b is their geometric mean, and the semi-latus rectum l is their harmonic mean. In other words,\n\n\\begin{align}a &= \\frac{r_{a}+r_{p}}{2}\\\\\nb &= \\sqrt{r_{a}\\cdot r_{p}}\\\\\nl &\\frac{2}{\\frac{1}{r_{a}}+\\frac{1}{r_{p}}}\n\\frac{2r_{a}r_{p}}{r_{a}+r_{p}}\\end{align}.\n\nHarmonic oscillators \n\nThe general solution for a harmonic oscillator in two or more dimensions is also an ellipse. Such is the case, for instance, of a long pendulum that is free to move in two dimensions; of a mass attached to a fixed point by a perfectly elastic spring; or of any object that moves under influence of an attractive force that is directly proportional to its distance from a fixed attractor. Unlike Keplerian orbits, however, these \"harmonic orbits\" have the center of attraction at the geometric center of the ellipse, and have fairly simple equations of motion.\n\nPhase visualization \n\nIn electronics, the relative phase of two sinusoidal signals can be compared by feeding them to the vertical and horizontal inputs of an oscilloscope. If the display is an ellipse, rather than a straight line, the two signals are out of phase.\n\nElliptical gears \n\nTwo non-circular gears with the same elliptical outline, each pivoting around one focus and positioned at the proper angle, turn smoothly while maintaining contact at all times. Alternatively, they can be connected by a link chain or timing belt, or in the case of a bicycle the main chainring may be elliptical, or an ovoid similar to an ellipse in form. Such elliptical gears may be used in mechanical equipment to produce variable angular speed or torque from a constant rotation of the driving axle, or in the case of a bicycle to allow a varying crank rotation speed with inversely varying mechanical advantage.\n\nElliptical bicycle gears make it easier for the chain to slide off the cog when changing gears.\nDavid Drew.\n\"Elliptical Gears\".\n[http://jwilson.coe.uga.edu/emt668/EMAT6680.2003.fall/Drew/Emat6890/Elliptical%20Gears.htm]\n\nAn example gear application would be a device that winds thread onto a conical bobbin on a spinning machine. The bobbin would need to wind faster when the thread is near the apex than when it is near the base.\n\nOptics \n\n* In a material that is optically anisotropic (birefringent), the refractive index depends on the direction of the light. The dependency can be described by an index ellipsoid. (If the material is optically isotropic, this ellipsoid is a sphere.)\n* In lamp-pumped solid-state lasers, elliptical cylinder-shaped reflectors have been used to direct light from the pump lamp (coaxial with one ellipse focal axis) to the active medium rod (coaxial with the second focal axis).[http://www.rp-photonics.com/lamp_pumped_lasers.html Encyclopedia of Laser Physics and Technology - lamp-pumped lasers, arc lamps, flash lamps, high-power, Nd:YAG laser]\n* In laser-plasma produced EUV light sources used in microchip lithography, EUV light is generated by plasma positioned in the primary focus of an ellipsoid mirror and is collected in the secondary focus at the input of the lithography machine.\n\nStatistics and finance\n\nIn statistics, a bivariate random vector (X, Y) is jointly elliptically distributed if its iso-density contours—loci of equal values of the density function—are ellipses. The concept extends to an arbitrary number of elements of the random vector, in which case in general the iso-density contours are ellipsoids. A special case is the multivariate normal distribution. The elliptical distributions are important in finance because if rates of return on assets are jointly elliptically distributed then all portfolios can be characterized completely by their mean and variance—that is, any two portfolios with identical mean and variance of portfolio return have identical distributions of portfolio return.\n\nComputer graphics \n\nDrawing an ellipse as a graphics primitive is common in standard display libraries, such as the MacIntosh QuickDraw API, and Direct2D on Windows. Jack Bresenham at IBM is most famous for the invention of 2D drawing primitives, including line and circle drawing, using only fast integer operations such as addition and branch on carry bit. M. L. V. Pitteway extended Bresenham's algorithm for lines to conics in 1967. Another efficient generalization to draw ellipses was invented in 1984 by Jerry Van Aken.\n\nIn 1970 Danny Cohen presented at the \"Computer Graphics 1970\" conference in England a linear algorithm for drawing ellipses and circles. In 1971, L. B. Smith published similar algorithms for all conic sections and proved them to have good properties. These algorithms need only a few multiplications and additions to calculate each vector.\n\nIt is beneficial to use a parametric formulation in computer graphics because the density of points is greatest where there is the most curvature. Thus, the change in slope between each successive point is small, reducing the apparent \"jaggedness\" of the approximation.\n\n;Drawing with Bézier paths:\nComposite Bézier curves may also be used to draw an ellipse to sufficient accuracy, since any ellipse may be construed as an affine transformation of a circle. The spline methods used to draw a circle may be used to draw an ellipse, since the constituent Bézier curves behave appropriately under such transformations.\n\nOptimization theory \n\nIt is sometimes useful to find the minimum bounding ellipse on a set of points. The ellipsoid method is quite useful for attacking this problem.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Ellipse" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9277" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In mathematics, an ellipse is a curve in a plane surrounding two focal points such that the sum of the distances to the two focal points is constant for every point on the curve. As such, it is a generalization of a circle, which is a special type of an ellipse having both focal points at the same location. The shape of an ellipse (how \"elongated\" it is) is represented by its eccentricity, which for an ellipse can be any number from 0 (the limiting case of a circle) to arbitrarily close to but less than 1.\n\nEllipses are the closed type of conic section: a plane curve resulting from the intersection of a cone by a plane (see figure to the right). Ellipses have many similarities with the other two forms of conic sections: parabolas and hyperbolas, both of which are open and unbounded. The cross section of a cylinder is an ellipse, unless the section is parallel to the axis of the cylinder.\n\nAnalytically, an ellipse may also be defined as the set of points such that the ratio of the distance of each point on the curve from a given point (called a focus or focal point) to the distance from that same point on the curve to a given line (called the directrix) is a constant. This ratio is called the eccentricity of the ellipse.\n\nAn ellipse may also be defined analytically as the set of points for each of which the sum of its distances to two foci is a fixed number.\n\nEllipses are common in physics, astronomy and engineering. For example, the orbit of each planet in our solar system is approximately an ellipse with the barycenter of the planetSun pair at one of the focal points. The same is true for moons orbiting planets and all other systems having two astronomical bodies. The shapes of planets and stars are often well described by ellipsoids. Ellipses also arise as images of a circle under parallel projection and the bounded cases of perspective projection, which are simply intersections of the projective cone with the plane of projection. It is also the simplest Lissajous figure formed when the horizontal and vertical motions are sinusoids with the same frequency. A similar effect leads to elliptical polarization of light in optics.\n\nThe name, ἔλλειψις (élleipsis, \"omission\"), was given by Apollonius of Perga in his Conics, emphasizing the connection of the curve with \"application of areas\".\n\nDefinition of an ellipse as locus of points \n\nAn ellipse can be defined geometrically as a set of points (locus of points) in the Euclidean plane:\n\n* An ellipse is a set of points, such that for any point P of the set, the sum of the distances |PF_1|,\\ |PF_2| to two fixed points F_1, F_2, the foci, is constant, usually denoted by 2a, \\ a>0\\ . In order to omit the special case of a line segment, one assumes 2a>|F_1F_2|. More formally, for a given a, an ellipse is the set E \\{P\\in \\mathbb{R}^2 \\mid |PF_2| +|PF_1 | \n 2a \\}\\ .\nThe midpoint C of the line segment joining the foci is called the center of the ellipse. The line through the foci is called the major axis, and the line perpendicular to it through the center is called the minor axis. It contains the vertices V_1,V_2, which have distance  a to the center. The distance c of the foci to the center is called the focal distance or linear eccentricity. The quotient \\tfrac{c}{a} is the eccentricity e.\n\nThe case F_1=F_2 yields a circle and is included.\n\nThe equation |PF_2| + |PF_1 | = 2a can be viewed in a different way (see picture):\nIf c_2 is the circle with midpoint F_2 and radius 2a, then the distance of a point P to the circle c_2 equals the distance to the focus F_1:\n:|PF_1|=|Pc_2|.\nc_2 is called the circular directrix (related to focus F_2) of the ellipse.The German term for this circle is Leitkreis which can be translated as \"Director circle\", but that term has a different meaning in the English literature (see Director circle). This property should not be confused with the definition of an ellipse with help of a directrix (line) below.\n\nUsing Dandelin spheres one proves easily the important statement:\n*Any plane section of a cone with a plane, which does not contain the apex and whose slope is less than the slope of the lines on the cone, is an ellipse.\n\nEllipse in Cartesian coordinates \n\nEquation \n\nIf Cartesian coordinates are introduced such that the origin is the center of the ellipse and the x-axis is the major axis and \nthe foci are the points F_1(c,0),\\ F_2\n(-c,0), \nthe vertices are V_1(a, 0),\\ V_2\n(-a,0).\nFor an arbitrary point (x,y) the distance to the focus (c,0) is \n\\sqrt{ (x-c)^2 + y^2 } and to the second focus \\sqrt{ (x+c)^2 + y^2 }. Hence the point (x,y) is on the ellipse if the following condition is fulfilled \n\\sqrt{(x-c)^2 + y^2} + \\sqrt{(x+c)^2 + y^2} = 2a \\ .\nRemove the square roots by suitable squarings and use the relation b^2 = a^2-c^2 to obtain the equation of the ellipse:\n*\\frac{x^2}{a^2}+\\frac{y^2}{b^2}= 1  or solved for y\ny=\\pm\\frac{b}{a}\\sqrt{a^2-x^2}.\nThe shape parameters a,\\; b are called the semi-major and semi-minor axes. The points V_3(0,b),\\; V_4\n(0,-b) are the co-vertices.\n\nIt follows from the equation that the ellipse is symmetric with respect to both of the coordinate axes and hence symmetric with respect to the origin.\n\nSemi-latus rectum \n\nThe length of the chord through one of the foci, which is perpendicular to the major axis of the ellipse is called the latus rectum. One half of it is the semi-latus rectum p. A calculation shows\n*p = \\frac{b^2}a.\nThe semi-latus rectum p may also be viewed as the radius of curvature  of the osculating circles at the vertices (\\pm a,0).\n\nTangent \n\nAn arbitrary line g intersects an ellipse at 0, 1 or 2 points. In the first case the line is called exterior line, in the second case tangent and secant in the third case. Through any point of an ellipse there is exactly one tangent.\nThe tangent at a point (x_0,y_0) of the ellipse \\; \\tfrac{x^2}{a^2}+\\tfrac{y^2}{b^2}= 1\\;  has the coordinate equation \n*\\ \\frac{x_0}{a^2}x+\\frac{y_0}{b^2}y = 1\\; . \nA vector equation of the tangent is \n*\\ \\vec x=\\begin{pmatrix}x_0\\\\ y_0 \\end{pmatrix}+s\\; \\begin{pmatrix}-y_0a^2\\\\ x_0b^2 \\end{pmatrix}\\quad  with \\quad s\\in\\mathbb{R}\\ .\n\nProof:\nLet be (x_0,y_0) an ellipse point and  \\;\\vec x\\begin{pmatrix}x_0\\\\ y_0 \\end{pmatrix}+s\\; \\begin{pmatrix}u\\\\ v \\end{pmatrix}\\; the vector equation of a line g (containing (x_0,y_0)). Inserting the line's equation into the ellipse equation and respecting \\; \\tfrac{x_0^2}{a^2}+\\tfrac{y_0^2}{b^2}\n1\\; yields:\n\\frac{(x_0+su)^2}{a^2}+\\frac{(y_0+sv)^2}{b^2}1\\ , \\quad \\longrightarrow\\quad 2s\\;\\left(\\frac{x_0u}{a^2}+\\frac{y_0v}{b^2}\\right) + s^2\\;\\left(\\frac{u^2}{a^2}+\\frac{v^2}{b^2}\\right)\n 0\\ . \nIn case of \\; (1)\\; \\tfrac{x_0}{a^2}u+\\tfrac{y_0}{b^2}v0\\; line g and the ellipse have only point (x_0,y_0) in common and g is a tangent. The tangent direction is orthogonal to vector  (\\tfrac{x_0}{a^2},\\tfrac{y_0}{b^2})^T which is then a normal vector of the tangent and the tangent has the equation \\;\\tfrac{x_0}{a^2}x+\\tfrac{y_0}{b^2}y \n k\\;  with a still unknown k. Because (x_0,y_0) is on the tangent and on the ellipse, one gets k=1. \nIn case of  \\;(2)\\; \\tfrac{x_0}{a^2}u+\\tfrac{y_0}{b^2}v\\ne0\\; line g has a second point with the ellipse in common.\n\nWith help of (1) one easily checks, that \\;(-y_0a^2,x_0b^2)^T\\;   is a tangent vector at point (x_0,y_0), which proves the vector equation.\n\nRemark: If (x_0,y_0) and (u,v) are two points of the ellipse, such that\n\\; \\tfrac{x_0u}{a^2}+\\tfrac{y_0v}{b^2}0\\; holds, then the points lie on two conjugate diameters of the Ellipse (see below). In case of a\nb the ellipse is a circle and \"conjugate\" means \"orthogonal\".\n\nEquation of a shifted ellipse \n\nIf the ellipse is shifted such that its center is (c_1,c_2) the equation is\n*\\frac{(x-c_1)^2}{a^2}+\\frac{(y-c_2)^2}{b^2}= 1 \\ .\nThe axes are still parallel to the x- and y-axes.\n\nParametric representation \n\nStandard parametric representation:\nUsing the sine and cosine functions \\cos,\\sin, a parametric representation of the ellipse \\tfrac{x^2}{a^2}+\\tfrac{y^2}{b^2}= 1 can be obtained, :\n*(x,y)=(a \\cos t, b \\sin t),\\ 0\\le t\n\nParameter t can be taken as shown in the diagram and is due to de la Hire.K. Strubecker: Vorlesungen über Darstellende Geometrie, GÖTTINGEN, \nVANDENHOECK & RUPRECHT, 1967, p. 26\n\nThe parameter t (called the eccentric anomaly in astronomy) is not the angle of (x(t),y(t))^T with the x-axis (see diagram at right). For other interpretations of parameter t see section Drawing ellipses.\n\nRational representation:\nWith the substitution u = \\tan(t/2) and trigonometric formulae one gets\n\\cos t (1-u^2)/(u^2 + 1)\\ ,\\quad \\sin t \n 2u/(u^2 + 1)\nand the rational parametric equation of an ellipse\n*\\ \\begin{array}{lcl} x(u) & & a(1-u^2)/(u^2+1) \\\\ y(u) & \n & 2bu/(u^2+1) \\end{array}\\; ,\\quad -\\infty\nwhich covers any point of the ellipse \\; \\tfrac{x^2}{a^2}+\\tfrac{y^2}{b^2}=1\\; except the left vertex (-a,0).\nFor u\\in [0,1], this formula represents the right upper quarter of the ellipse moving counter-clockwise with increasing u. The left vertex is the limit \\lim_{u \\to \\pm \\infty} (x(u),y(u))=(-a,0)\\; . \nRational representations of conic sections are popular with Computer Aided Design (see Bezier curve).\n\nTangent slope as parameter:\nA parametric representation, which uses the slope m of the tangent at a point of the ellipse  \ncan be obtained from the derivative of the standard representation \\vec x(t)=(a \\cos t, b \\sin t)^T:\n\\vec x'(t) (-a\\sin t, b\\cos t)^T \\quad \\rightarrow \\quad m \n -\\frac{b}{a}\\cot t\\quad \\rightarrow \\quad \\cot t = -\\frac{ma}{b}.\n  \nWith help of trigonometric formulae\none gets:\n\\cos t \\frac{\\cot t}{\\pm\\sqrt{1+\\cot^2t}} \n \\frac{-ma}{\\pm\\sqrt{m^2a^2+b^2}}\\ ,\\quad\\quad\n\\sin t \\frac{1}{\\pm\\sqrt{1+\\cot^2t}} \n \\frac{b}{\\pm\\sqrt{m^2a^2+b^2}}.\nReplacing \\cos t und \\sin t of the standard representation one yields\n* \\vec c_\\pm(m) = \\left(-\\frac{ma^2}{\\pm\\sqrt{m^2a^2+b^2}}\\;,\\;\\frac{b^2}{\\pm\\sqrt{m^2a^2+b^2}}\\right)^T,\\, m \\in \\R.\nWhere m is the slope of the tangent at the corresponding ellipse point, \\vec c_+ is the upper and \\vec c_- the lower half of the ellipse. The points with vertical tangents (vertices (\\pm a,0)) are not covered by the representation.\nThe equation of the tangent at point \\vec c_\\pm(m) has the form y=mx+n. The still unknown n can be determined by inserting the coordinates of the corresponding ellipse point \\vec c_\\pm(m):\n* y = m x \\pm\\sqrt{m^2a^2+b^2}\\; .\nThis description of the tangents of an ellipse is an essential tool for the determination of the orthoptic of an ellipse. The orthoptic article contains another proof, which omits differential calculus and trigonometric formulae.\n\nShifted Ellipse:\nA shifted ellipse with center (c_1,c_2) can be described by\n*(c_1+a \\cos t\\; ,\\; c_2+ b \\sin t),\\ 0\\le t\n\nA parametric representation of an arbitrary ellipse is contained in the section Ellipse as an affine image of the unit circle x²+y²\n1 below.\n\nRemarks on the parameters a and b \n\nThe parameters a and b represent the lengths of line segments and are therefore non-negative real numbers. Throughout this article a is the semi-major axis, i.e., a\\ge b \\ . In general the canonical ellipse equation \\tfrac{x^2}{a^2}+\\tfrac{y^2}{b^2}= 1  may have a  (and hence the ellipse would be taller than it is wide); in this form the semi-major axis would be b. This form can be converted to the form assumed in the remainder of this article simply by transposing the variable names x and  y and the parameter names a and  b.\n\nDefinition of an ellipse by the directrix property \n\nThe two lines at distance d = \\frac{a^2}c and parallel to the minor axis are called directrices of the ellipse (see diagram). \n* For an arbitrary point P of the ellipse the quotient of the distance to one focus and to the corresponding directrix (see diagram) is equal to the eccentricity:\n:\\frac \\frac \n e= \\frac{c}{a}\\ .\nThe proof for the pair F_1, l_1 follows from the fact that |PF_1|^2(x-c)^2+y^2,\\ |Pl_1|^2\n(x-\\tfrac{a^2}{c})^2 and y^2=\\tfrac{b^2}{a^2}x^2-b^2 satisfy the equation\n|PF_1|^2-\\frac{c^2}{a^2}|Pl_1|^2=0\\ .\nThe second case is proven analogously.\n\nThe inverse statement is also true and can be used to define an ellipse (in a manner similar to the definition of a parabola):\n* For any point F (focus), any line l (directrix) not through F and any real number e with 0 the set of points (locus of points), for which the quotient of the distances to the point and to the line is e\n:E \\{P \\mid  \\frac \n e\\} \nis an ellipse.\nThe choice e=0, which is the eccentricity of a circle, is in this context not allowed. One may consider the directrix of a circle to be the line at infinity.\n\n(The choice e = 1 yields a parabola and if e > 1 a hyperbola.)\n\n;Proof:\nLet F=(f,0) ,\\ e >0 and assume (0,0) is a point on the curve. \nThe directrix l has equation x-\\tfrac{f}{e}. With P\n(x,y), the relation |PF|^2=e^2|Pl|^2 produces the equations\n(x-f)^2+y^2e^2(x+\\tfrac{f}{e})^2\n(e x+f)^2 and x^2(e^2-1)+2xf(1+e)-y^2=0.\nThe substitution p=f(1+e) yields\n* x^2(e^2-1)+2px-y^2=0.\nThis is the equation of an ellipse (e) or a parabola  (e=1) or a hyperbola (e>1). All of these non-degenerate conics have, in common, the origin as a vertex (see diagram).\n\nIf e, introduce new parameters a,b so that\n1-e^2 \\tfrac{b^2}{a^2}, \\text { and }\\ p\n\\tfrac{b^2}{a}, and then the equation above becomes \n\\tfrac{(x-a)^2}{a^2}+\\tfrac{y^2}{b^2}=1\\ ,\nwhich is the equation of an ellipse with center (a,0), the x-axis as major axis and\nthe major/minor semi axis a,b.\n\n;General case:\nIf the focus is F(f_1,f_2)  and the directrix ux+vy+w\n0  one gets the equation\n\\left(x-f_1\\right)^2+\\left(y-f_2\\right)^2= e^2\\cdot\\frac{\\left(ux+vy+w\\right)^2}{u^2+v^2} \n\n(The right side of the equation uses the Hesse normal form of a line to calculate the distance |Pl|.)\n\nThe normal bisects the angle between the lines to the foci \n\nFor an ellipse the following statement is true:\n* The normal at a point P bisects the angle between the lines \\overline{PF_1}, \\overline{PF_2}.\n;Proof:\nBecause the tangent is perpendicular to the normal, the statement is true for the tangent and the complementary angle of the lines to the foci (see diagram), too.\n\nLet L be the point on the line \\overline{PF_2} with the distance 2a to the focus F_2, a is the semi major axis of the ellipse. Line w is the bisector of the angle between the lines \\overline{PF_1}, \\overline{PF_2}. In order to prove that w is the tangent line at point P, one checks that any point Q on line w which is different from P cannot be on the ellipse. Hence w has only point P in common with the ellipse and is, therefore, the tangent at point P. \nFrom the diagram and the triangle inequality one recognizes that 2a|LF_2| holds, which means: |QF_2|+|QF_1|>2a. But if Q is a point of the ellipse, the sum should be 2a.\n;application:\nThe rays from one focus are reflected by the ellipse to the second focus. This property has optical and acoustic applications similar to the reflective property of a parabola (see whispering gallery).\n\nEllipse as an affine image of the unit circle x²+y²\n1 \n\nAnother definition of an Ellipse uses affine transformations:\n*Any Ellipse is the affine image of the unit circle with equation x^2+y^2=1.\n\nAn affine transformation of the Euclidean plane has the form \\vec x \\to \\vec f_0+A\\vec x, where A is a regular matrix (its determinant is not 0) and \\vec f_0 is an arbitrary vector. If \\vec f_1, \\vec f_2 are the column vectors of the matrix A, the unit circle (\\cos(t),\\sin(t)), t \\in [0,2\\pi) , is mapped onto the Ellipse\n* \\vec x \\vec p(t)\n\\vec f_0+ \\vec f_1 \\cos t +\\vec f_2 \\sin t \\ .\n\\vec f_0 is the center, \\vec f_1,\\; \\vec f_2 are the directions of two conjugate diameters of the ellipse. In general the vectors \\vec f_1, \\vec f_2 are not perpendicular. That means, in general  \\vec f_0\\pm \\vec f_1and  \\vec f_0\\pm \\vec f_2are not the vertices of the ellipse.\n\nThe tangent vector at point  \\vec p(t) is \n\\vec p'(t) = -\\vec f_1\\sin t  + \\vec f_2\\cos t \\ .\nBecause at a vertex the tangent is perpendicular to the major/minor axis (diameters) of the ellipse one gets the parameter t_0 of a vertex from the equation \n\\vec p'(t)\\cdot (\\vec p(t) -\\vec f_0) (-\\vec f_1\\sin t + \\vec f_2\\cos t)\\cdot(\\vec f_1 \\cos t +\\vec f_2 \\sin t) \n0\nand hence \n*\\cot (2t_0)= \\tfrac{\\vec f_1^{\\, 2}-\\vec f_2^{\\, 2}}{2\\vec f_1 \\cdot \\vec f_2}.\n(The formulae \\cos^2 t -\\sin^2 t\\cos 2t,\\ 2\\sin t \\cos t \n \\sin 2t were used.)\n\nIf \\vec f_1 \\cdot \\vec f_20, then t_0\n0.\n\nThe 4 vertices of the ellipse are \\vec p(t_0),\\;\\vec p(t_0\\pm\\frac{\\pi}{2}),\\; \\vec p(t_0+\\pi) \\ .\n\nThe advantage of this definition is that one gets a simple parametric representation of an arbitrary ellipse, even in the space, if the vectors \\vec f_0, \\vec f_1, \\vec f_2 are vectors of the Euclidean space.\n\nConjugate diameters and the midpoints of parallel chords \n\nFor a circle,\n(M) the midpoints of parallel chords lie on a diameter. \nThe diameter and the parallel chords are orthogonal. An affine transformation in general does not preserve orthogonality but does preserve parallelism and midpoints of line segments. Hence: property (M) (which omits the term orthogonal) is true for any ellipse.\n;Definition:\nTwo diameters d_1 ,\\; d_2  of an ellipse are conjugate if the midpoints of chords parallel to d_1 lie on d_2\\ .\n\nFrom the diagram one finds:\n(T) Two diameters d_1: \\overline{P_1Q_1} \\; ,\\;d_2: \\overline{P_2Q_2}, of an ellipse are conjugate, if the tangents at  P_1 and  Q_1  are parallel to d_2 and visa versa.\n\nThe term conjugate diameters is a kind of generalization of orthogonal.\n\nConsidering the parametric equation\n\\vec x\\vec p(t) \n \\vec f_0 +\\vec f_1 \\cos t +\\vec f_2 \\sin t\nof an ellipse, any pair \\vec p(t),\\vec p(t+\\pi) of points belong to a diameter and the pair \\vec p(t+\\pi/2),\\vec p(t-\\pi/2) belongs to its conjugate diameter.\n\nOrthogonal tangents \n\nFor the ellipse \\tfrac{x^2}{a^2}+\\tfrac{y^2}{b^2}=1\nthe intersection points of orthogonal tangents lie on the circle  x^2+y^2=a^2+b^2.\n\nThis circle is called orthoptic of the given ellipse.\n\nTheorem of Apollonios on conjugate diameters \n\nFor an ellipse with semi-axes a,\\;b the following is true:\n* Let c_1  and   c_2 be halves of two conjugate diameters (see diagram) then \n(1)  c_1^2+c_2^2=a^2+b^2, \n(2) the triangle formed by c_1, \\; c_2 has the constant area A_\\Delta= \\frac{1}{2}ab\n(3) the parallelogram of tangents adjacent to the given conjugate diameters has the \\text{Area}_{12}=4ab\\ .\n;Proof: \nLet the ellipse be in the canonical form with parametric equation \n \\vec p(t)=(a \\cos t ,b\\sin t)^T.\nThe two points \\vec c_1\\vec p(t),\\ \\vec c_2\n \\vec p(t+\\pi/2) are on conjugate diameters (see previous section). From trigonometric formulae one gets \\vec c_2=(-a\\sin t,b\\cos t)^T and \n |\\vec c_1|^2 + |\\vec c_2|^2 \\cdots \n a^2+b^2 \\ . \nThe area of the triangle generated by   \\vec c_1 , \\vec c_2  is\n A_\\Delta\\tfrac{1}{2}\\det(\\vec c_1, \\vec c_2)\n\\cdots = \\tfrac{1}{2} ab   \nand from the diagram it can be seen that the area of the parallelogram is 8 times that of  A_\\Delta . Hence\n\\text{Area}_{12}=4ab\\ .\n\nDrawing ellipses\n\nEllipses appear in descriptive geometry as images (parallel or central projection) of circles (for details: see Ellipses in DG (German)). So it is essential to have tools to draw an ellipse. Nowadays the best tool is the computer. During the times before this tool was not available and one was restricted to compass and ruler for the construction of single points of an ellipse. But there are technical tools (ellipsographs) to draw an ellipse in a continuous way like a compass for drawing a circle, too. The principle of ellipsographs were known to Greek mathematicians (Archimedes, Proklos) already.\n\nIf there is no ellipsograph available, the best and quickest way to draw an ellipse is to draw an Approximation by the four osculating circles at the vertices.\n\nFor any method described below \n*the knowledge of the axes and the semi-axes is necessary (or equivalent: the foci and the semi-major axis). \nIf this presumption is not fulfilled one has to know at least two conjugate diameters. With help of Rytz's construction the axes and semi-axes can be retrieved.\n\nPins-and-string method\n\nThe characterization of an ellipse as the locus of points so that sum of the distances to the foci is constant leads to a method of drawing one using two drawing pins, a length of string, and a pencil. In this method, pins are pushed into the paper at two points, which become the ellipse's foci. A string tied at each end to the two pins and the tip of a pencil pulls the loop taut to form a triangle. The tip of the pencil then traces an ellipse if it is moved while keeping the string taut. Using two pegs and a rope, gardeners use this procedure to outline an elliptical flower bed—thus it is called the gardener's ellipse.\n\nA similar method for drawing confocal ellipses with a closed string is due to the Irish bishop Charles Graves.\n\nPaper strip methods \n\nThe two following methods rely on the parametric representation (see section parametric representation, above):\n(a\\cos t,\\;b\\sin t)\nThis representation can be modeled technically by two simple methods. In both cases center, the axes and semi axes  a,\\; b have to be known.\n;Method 1\nThe first method starts with \n*a strip of paper of length a+b. \nThe point, where the semi axes meet is marked by P. If the strip slides with both ends on the axes of the desired ellipse, then point P traces the ellipse. For the proof one shows that point P has the parametric representation  (a\\cos t,\\;b\\sin t), where parameter  t  is the angle of the slope of the paper strip.\n\nA technichal realization of the motion of the paper strip can be achieved by a Tusi couple (s. animation). The device is able to draw any ellipse with a fixed sum a+b, which is the radius of the large circle. This restriction may be a disadvantage in real life. More flexible is the second paper strip method.\n\nA nice application: If one stands somewhere in the middle of a ladder, which stands on a slippery ground and leans on a slippery wall, the ladder slides down and the persons feet trace an ellipse.\n\nElliko-pap1.svg|Ellipse construction: paper strip method 1\nTusi couple vs Paper strip plus Ellipses horizontal.gif|Ellipses with Tusi couple. Two examples: red and cyan.\n\nA variation of the paper strip method 1J. van Mannen: Seventeenth century instruments for drawing conic sections. In: The Mathematical Gazette. Vol. 76, 1992, p. 222–230. uses the observation, that the midpoint N of the paper strip is moving on the circle with center M (of the ellipse) and radius \\tfrac{a+b}{2}. Hence the paperstrip can be cut at point N into halves, connected again by a joint at N and the sliding end K fixed at the center M (see diagram). After this operation the movement of the unchanged half of the paperstrip is unchanged. The advantage of this variation is: Only one expensive sliding shoe is necessary.  \nOne should be aware that the end, which is sliding on the minor axis, has to be changed.\n\nEllipse-papsm-1a.svg|Variation of the paper strip method 1\nEllipses with SliderCrank inner Ellipses.gif|Animation of the variation of the paper strip method 1\n\n; Method 2:\nThe second method starts with \n*a strip of paper of length a. \nOne marks the point, which divides the strip into two substrips of length b and a-b. The strip is positioned onto the axes as described in the diagram. Then the free end of the strip traces an ellipse, while the strip is moved. For the proof, one recognizes that the tracing point can be described parametrically by (a\\cos t,\\;b\\sin t), where parameter t is the angle of slope of the paper strip.\n\nThis method is the base for several ellipsographs (see section below).\n\nRemark: Similar to the variation of the paper strip method 1 a variation of the paper strip method 2 can be established (see diagram) by cutting the part between the axes into halves.\n\nFile:Archimedes Trammel.gif|Trammel of Archimedes (principle)\nFile:L-Ellipsenzirkel.png|Ellipsograph due to Benjamin Bramer\nFile:Ellipses with SliderCrank Ellipses at Slider Side.gif|Variation of the paper strip method 2\n\nApproximation by osculating circles \n\nFrom section metric properties one gets:\n*The radius of curvature at the vertices V_1,V_2 is: \\tfrac{b^2}{a}\\ ,\nthe radius of curvature at the co-vertices V_3,V_4 is: \\tfrac{a^2}{b}\\ .\nThe diagram shows an easy way to find the centers C_1(a-\\tfrac{b^2}{a},0),\\; C_3\n(0,b-\\tfrac{a^2}{b}) of curvature at vertex V_1 and co-vertex V_3, resp.:\n(1) mark the auxiliary point H=(a,b) and draw the linesegment V_1V_3\\ ,\n(2) draw the line through H, which is perpendicular to the line V_1V_2\\ ,\n(3) the intersection points of this line with the axes are the centers of the oasculating circles. \n(proof: simple calculation.)\n\nThe centers for the remaining vertices are found by symmetry.\n\nWith help of a French curve one draws a curve, which has smooth contact to the osculating circles.\n\nSteiner generation of an ellipse \n\nThe following method to construct single points of an ellipse relies on the Steiner generation of a non degenerate conic section: \n*Given two pencils B(U),B(V) of lines at two points U,V (all lines containing U and  V, respectively) and a projective but not perspective mapping \\pi of B(U) onto B(V), then the intersection points of corresponding lines form a non-degenerate projective conic section.\n\nFor the generation of points of the ellipse \\tfrac{x^2}{a^2}+\\tfrac{y^2}{b^2}1 one uses the pencils at the vertices V_1,V_2. Let P\n(0,b) be an upper co-vertex of the ellipse and A(-a,2b), B\n(a,2b). \nP is the center of the rectangle V_1,V_2,B,A. The side  \\overline{AB} of the rectangle is divided into n equal spaced line segments and this division is projected parallel with the diagonal AV_2 as direction onto the line segment  \\overline{V_1B} and assign the division as shown in the diagram. The parallel projection together with the reverse of the orientation is part of the projective mapping between the pencils at V_1 and V_2 needed. The intersection points of any two related lines   V_1B_i and V_2A_i are points of the uniquely defined ellipse. With help of the points C_1,\\dotsc the points of the second quarter of the ellipse can be determined. Analogously one gets the points of the lower half of the ellipse.\n\nRemark:\n# The Steiner generation exists for hyperbolas and parabolas, too. \n# The Steiner generation is sometimes called a parallelogram method because one can use other points rather than the vertices, which starts with a parallelogram instead of a rectangle.\n\nEllipsographs \n\nMost technical instruments for drawing ellipses are based on the second paperstrip method. \n*[http://www.history.didaktik.mathematik.uni-wuerzburg.de/ausstell/ellipsenzirkel/index.html Ellipsenzirkel (German)]\n*[http://collectingme.com/drawing/ Drawing instruments]\nFor more principles of ellipsographs:\n*Ellipsographe (French)\n\nInscribed angles for ellipses and the 3-point-form \n\nCircles \n\nA circle with equation (x-c)^2+(y-d)^2=r^2,\\ r> 0\\ ,  is uniquely determined by three points (x_1,y_1),\\;(x_2,y_2),\\; (x_3,y_3) not on a line. A simple way to determine the parameters c,d,r uses the inscribed angle theorem for circles:\nFor four points  P_i(x_i,y_i),\\ i\n1,2,3,4, (see diagram) the following statement is true:\nThe four points are on a circle if and only if the angles at P_3 and P_4 are equal.\n\nUsually one measures inscribed angles by degree or radian . In order to get an equation of a circle determined by three points, the following measurement is more convenient: \n*In order to measure an angle between two lines with equations ym_1x+d_1, \\ y\nm_2x + d_2\\ ,m_1\\ne m_2  one uses the quotient\n:\\frac{1+m_1\\cdot m_2}{m_2-m_1}\\ .\nThis expression is the cotangent of the angle between the two lines.\n\nInscribed angle theorem for circles:\nFor four points  P_i(x_i,y_i),\\ i\n1,2,3,4,, no three of them on a line (see diagram), the following statement is true:\nThe four points are on a circle, if and only if the angles at P_3 and P_4 are equal. In the sense of the measurement above, that means, if\n:\\frac{(x_4-x_1)(x_4-x_2)+(y_4-y_1)(y_4-y_2)}\n             {(y_4-y_1)(x_4-x_2)-(y_4-y_2)(x_4-x_1)}=\n        \\frac{(x_3-x_1)(x_3-x_2)+(y_3-y_1)(y_3-y_2)}\n             {(y_3-y_1)(x_3-x_2)-(y_3-y_2)(x_3-x_1)} \nAt first the masure is available for chords, which are not parallel to the y-axis, only. But the final formula works for any chord.\n\nA consequence of the inscribed angle theorem for circles is the\n\n3-point-form of a circle's equation:\nOne gets the equation of the circle determined by 3 points P_i=(x_i,y_i) not on a line by a conversion of the equation \n:\\frac{({\\color{green}x}-x_1)({\\color{green}x}-x_2)+({\\color{red}y}-y_1)({\\color{red}y}-y_2)}\n             {({\\color{red}y}-y_1)({\\color{green}x}-x_2)-({\\color{red}y}-y_2)({\\color{green}x}-x_1)}=\n        \\frac{(x_3-x_1)(x_3-x_2)+(y_3-y_1)(y_3-y_2)}\n             {(y_3-y_1)(x_3-x_2)-(y_3-y_2)(x_3-x_1)} \\ .\n\nEllipses \n\nIn this section one considers ellipses with an equation\n \\frac{(x-c)^2}{a^2}+ \\frac{(y-d)^2}{b^2}1 \\quad \\leftrightarrow \\quad (x-c)^2+\\frac{a^2}{b^2}(y-d)^2\na^2, \\quad c,d,\\in \\R, \\ a > 0 \\ ,\nwhere the ratio \\frac{a^2}{b^2} is fixed.\nWith the abbreviation {\\color{blue}q}=\\frac{a^2}{b^2}\\  one gets the more convenient form\n*(x-c)^2+{\\color{blue}q}\\; (y-d)^2=a^2,\\quad c,d \\in \\R, a> 0  and q>0 fixed. \nSuch ellipses have their axes parallel to the coordinate axes and their eccentricity fixed. Their major axes are parallel to the x-axis if q>1 and parallel to the y-axis if q.\n\nLike a circle, such an ellipse is determined by three points not on a line.\n\nIn this more general case one introduces the following measurement of an angle,:[http://www.mathematik.tu-darmstadt.de/~ehartmann/circlegeom.pdf E. Hartmann: Lecture Note 'Planar Circle Geometries', an Introduction to Möbius-, Laguerre- and Minkowski Planes, p. 55]W. Benz, Vorlesungen über Geomerie der Algebren, Springer (1973)\n\n*In order to measure an angle between two lines with equations ym_1x+d_1, \\ y\nm_2x + d_2\\ ,m_1\\ne m_2  one uses the quotient\n:\\frac{1+{\\color{blue}q}\\; m_1\\cdot m_2}{m_2-m_1}\\ .\n\nInscribed angle theorem for ellipses\n\nFor four points  P_i(x_i,y_i),\\ i\n1,2,3,4,, no three of them on a line (see diagram), the following statement is true:\nThe four points are on an ellipse with equation (x-c)^2+q\\; (y-d)^2=a^2 , if and only if the angles at P_3 and P_4 are equal in the sense of the measurement above—that is, if\n:\\frac{(x_4-x_1)(x_4-x_2)+{\\color{blue}q}\\;(y_4-y_1)(y_4-y_2)}\n             {(y_4-y_1)(x_4-x_2)-(y_4-y_2)(x_4-x_1)}=\n        \\frac{(x_3-x_1)(x_3-x_2)+{\\color{blue}q}\\;(y_3-y_1)(y_3-y_2)}\n             {(y_3-y_1)(x_3-x_2)-(y_3-y_2)(x_3-x_1)} \\ .\nAt first the measure is available only for chords which are not parallel to the y-axis. But the final formula works for any chord. The proof follows from a straightforward calculation. For the direction of proof given that the points are on an ellipse, one can assume that the center of the ellipse is the origin.\n\nA consequence of the inscribed angle theorem for ellipses is the\n\n3-point-form of an ellipse's equation:\nOne gets the equation of the ellipse determined by 3 points P_i=(x_i,y_i) not on a line by a conversion of the equation \n: \\frac{({\\color{green}x}-x_1)({\\color{green}x}-x_2)+{\\color{blue}q}\\;({\\color{red}y}-y_1)({\\color{red}y}-y_2)}\n             {({\\color{red}y}-y_1)({\\color{green}x}-x_2)-({\\color{red}y}-y_2)({\\color{green}x}-x_1)}=\n        \\frac{(x_3-x_1)(x_3-x_2)+{\\color{blue}q}\\;(y_3-y_1)(y_3-y_2)}\n             {(y_3-y_1)(x_3-x_2)-(y_3-y_2)(x_3-x_1)}\\ . \n\nPole-polar relation for an ellipse \n\nAny ellipse can be described in a suitable coordinate system by an equation \\tfrac{x^2}{a^2}+\\tfrac{y^2}{b^2}1. The equation of the tangent at a point P_0\n(x_0,y_0) of the ellipse is \\tfrac{x_0x}{a^2}+\\tfrac{y_0y}{b^2}1. If one allows point P_0\n(x_0,y_0) to be an arbitrary point different from the origin, then \n* point P_0(x_0,y_0)\\ne(0,0) is mapped onto the line \\frac{x_0x}{a^2}+\\frac{y_0y}{b^2}\n1 , not through the center of the ellipse. \nThis relation between points and lines is a bijection.\n\nThe inverse function maps\n* line y=mx+d,\\ d\\ne 0 onto the point \\left(-\\frac{ma^2}{d},\\frac{b^2}{d}\\right) and\nline x=c,\\ c\\ne 0 onto the point \\left(\\frac{a^2}{c},0\\right)\\ .\n\nSuch a relation between points and lines generated by a conic is called pole-polar relation or just polarity. The pole is the point, the polar the line. See Pole and polar.\n\nBy calculation one checks the following properties of the pole-polar relation of the ellipse:\n* For a point (pole) on the ellipse the polar is the tangent at this point (see diagram: P_1,\\ p_1).\n* For a pole P outside the ellipse the intersection points of its polar with the ellipse are the tangency points of the two tangents passing P (see diagram: P_2,\\ p_2).\n* For a point within the ellipse the polar has no point with the ellipse in common.  (see diagram: F_1,\\ l_1).\n\nRemarks:\n# The intersection point of two polars is the pole of the line through their poles.\n# The foci (c,0), and  (-c,0) respectively and the directrices x\\tfrac{a^2}{c} and x\n-\\tfrac{a^2}{c} respectively belong to pairs of pole and polar.\nPole-polar relations exist for hyperbolas and parabolas, too.\n\nMetric properties \n\nAll metric properties given below refer to an ellipse with equation \\frac{x^2}{a^2}+\\frac{y^2}{b^2}= 1 .\n\nArea \n\nThe area A_\\text{ellipse} enclosed by an ellipse is:\n\n*A_\\text{ellipse} = \\pi ab\n\nwhere a and b are the lengths of the semi-major and semi-minor axes, respectively.  The area formula \\pi a b is intuitive: start with a circle of radius b (so its area is \\pi b^2) and stretch it by a factor a/b to make an ellipse. This scales the area by the same factor: \\pi b^2(a/b) \\pi a b.  It is also easy to rigorously prove the area formula using integration as follows.  Equation () can be rewritten as y(x)\n b \\sqrt{1 - x^2/a^2}.  For x\\in[-a,a], this curve is the top half of the ellipse.  So twice the integral of y(x) over the interval [-a,a] will be the area of the ellipse:\n\n\\begin{align}\nA_\\text{ellipse} &= \\int_{-a}^a 2b\\sqrt{1-x^2/a^2}\\,dx\\\\\n &= \\frac ba \\int_{-a}^a 2\\sqrt{a^2-x^2}\\,dx.\n\\end{align}\n\nThe second integral is the area of a circle of radius a, that is, \\pi a^2. So\n\nA_\\text{ellipse} \\frac{b}{a}\\pi a^2 \n \\pi ab.\nAn ellipse defined implicitly by Ax^2+ Bxy + Cy^2 = 1  has area 2\\pi / \\sqrt{4AC - B^2}.\n\nCircumference\n\nThe circumference C of an ellipse is:\n\nC = 4 a E(e)\nwhere again a is the length of the semi-major axis, e is the eccentricity \\sqrt{1 - b^2/a^2}, and the function E is the complete elliptic integral of the second kind,\n\nE(e) = \\int_0^{\\pi/2}\\sqrt {1 - e^2 \\sin^2\\theta}\\ d\\theta,\n\nwhich calculates the circumference of the ellipse in the first quadrant alone, and the formula for the circumference of an ellipse can thus be written\n\nThe arc length of an ellipse, in general, has no closed-form solution in terms of elementary functions. Elliptic integrals were motivated by this problem. Equation () may be evaluated directly using the Carlson symmetric form. This gives a succinct and quadratically converging iterative method for evaluating the circumference using the arithmetic-geometric mean.\n\nThe exact infinite series is:\n\nC = 2\\pi a \\left[{1 - \\left(\\frac{1}{2}\\right)^2e^2 - \\left(\\frac{1\\cdot 3}{2\\cdot 4}\\right)^2\\frac{e^4}{3} - \\left(\\frac{1\\cdot 3\\cdot 5}{2\\cdot 4\\cdot 6}\\right)^2\\frac{e^6}{5} - \\cdots}\\right]\n\n2\\pi a \\left[1 - \\sum_{n\n1}^\\infty \\left(\\frac{(2n-1)!!}{(2n)!!}\\right)^2 \\frac{e^{2n}}{2n-1}\\right],\nwhere n!! is the double factorial.  Unfortunately, this series converges rather slowly; however, by expanding in terms of h = (a-b)^2 / (a+b)^2, Ivory and Bessel Englisch translation of  derived an expression that converges much more rapidly,\nC \\pi (a+b) \\left[1 + \\sum_{n\n1}^\\infty \\left(\\frac{(2n-1)!!}{2^n n!}\\right)^2 \\frac{h^n}{(2n-1)^2}\\right].\n\nRamanujan gives two good approximations for the circumference in §16 of \"Modular Equations and Approximations to \\pi\"; they are\nC \\approx \\pi \\left[3(a+b) - \\sqrt{(3a+b)(a+3b)}\\right]= \\pi \\left[3(a+b)-\\sqrt{10ab+3(a^2+b^2)}\\right]\n\nand\n\nC\\approx\\pi\\left(a+b\\right)\\left(1+\\frac{3h}{10+\\sqrt{4-3h}}\\right).\n\nThe errors in these approximations, which were obtained empirically, are of order h^3 and h^5, respectively.\n\nMore generally, the arc length of a portion of the circumference, as a function of the angle subtended, is given by an incomplete elliptic integral.\n\nThe inverse function, the angle subtended as a function of the arc length, is given by the elliptic functions.\n\nSome lower and upper bounds on the circumference of the canonical ellipse x^2/a^2 + y^2/b^2 = 1 with a\\geq b are\n\n C\\le 2\\pi a,\n\n\\pi (a+b)\\le C\\le 4(a+b),\n\n4\\sqrt{a^2+b^2}\\le C\\le \\sqrt{2} \\pi \\sqrt{a^2+b^2} .\n\nHere the upper bound 2\\pi a is the circumference of a circumscribed concentric circle passing through the endpoints of the ellipse's major axis, and the lower bound 4\\sqrt{a^2+b^2} is the perimeter of an inscribed rhombus with vertices at the endpoints of the major and minor axes.\n\nCurvature \n\nThe curvature is given by \\kappa = \\frac{1}{a^2 b^2}\\left(\\frac{x^2}{a^4}+\\frac{y^2}{b^4}\\right)^{-\\frac{3}{2}}\\ ,\nradius of curvature at point (x,y):\n\\rho a^2 b^2 \\left(\\frac{x^{2}}{a^4} + \\frac{y^{2}}{b^4}\\right)^{3/2} \n \\frac{1}{a^4 b^4} \\sqrt{\\left(a^4 y^{2} + b^4 x^{2}\\right)^3} \\ .\n\nRadius of curvature at the two vertices (\\pm a,0) and the centers of curvature:\n\\rho_0 \\frac{b^2}{a}\np\\ , \\qquad \\left(\\pm\\frac{c^2}{a}\\,\\bigg|\\,0\\right)\\ .\nRadius of curvature at the two co-vertices (0,\\pm b) and the centers of curvature:\n\\rho_1 = \\frac{a^2}{b}\\ , \\qquad \\left(0\\,\\bigg|\\,\\pm\\frac{c^2}{b}\\right)\\ .\n\nEllipse as quadric \n\nGeneral ellipse\n\nIn analytic geometry, the ellipse is defined as a quadric: the set of points (X,Y) of the Cartesian plane that, in non-degenerate cases, satisfy the implicit equation\n\n~A X^2 + B X Y + C Y^2 + D X + E Y + F = 0\n\nprovided B^2 - 4AC \n\nTo distinguish the degenerate cases from the non-degenerate case, let ∆ be the determinant\n\\begin{vmatrix} A & B/2 & D/2\\\\B/2 & C & E/2\\\\D/2 & E/2 & F \\end{vmatrix}; \nthat is,\n\\Delta = \\left( AC - \\frac{B^2}{4} \\right) F + \\frac{BED}{4} - \\frac{CD^2}{4} - \\frac{AE^2}{4}.\nThen the ellipse is a non-degenerate real ellipse if and only if C∆  0, we have an imaginary ellipse, and if ∆ 0, we have a point ellipse.Lawrence, J. Dennis, A Catalog of Special Plane Curves, Dover Publ., 1972.\n\nThe general equation's coefficients can be obtained from known semi-major axis a, semi-minor axis b, center coordinates (x_c, y_c) and rotation angle \\Theta using the following formulae:\n\\begin{align}A &= a^2 (\\sin\\Theta)^2 + b^2 (\\cos\\Theta)^2\\\\\nB &= 2 (b^2-a^2) \\sin\\Theta \\cos\\Theta\\\\\nC &= a^2 (\\cos\\Theta)^2 + b^2 (\\sin\\Theta)^2\\\\\nD &= -2 A x_c - B y_c\\\\\nE &= -B x_c - 2 C y_c\\\\\nF &= A x_c^2 + B x_c y_c + C y_c^2 - a^2 b^2\\end{align}\nThese expressions can be derived from the canonical equation (see next section) by substituting the coordinates with expressions for rotation and translation of the coordinate system:\n\\frac{x_{can}^2}{a^2} + \\frac{y_{can}^2}{b^2} = 1\nx_{can} = (x-x_c) \\cos\\Theta + (y-y_c) \\sin\\Theta\ny_{can} = -(x-x_c) \\sin\\Theta + (y-y_c) \\cos\\Theta\n\nCanonical form\n\nLet a>b. Through change of coordinates (a rotation of axes and a translation of axes) the general ellipse can be described by the canonical implicit equation\n\n\\frac{x^2}{a^2}+\\frac{y^2}{b^2}=1\n\nHere (x,y) are the point coordinates in the canonical system, whose origin is the center (X_c,Y_c) of the ellipse, whose x-axis is the unit vector (X_a,Y_a) coinciding with the major axis, and whose y-axis is the perpendicular vector (-Y_a,X_a) coinciding with the minor axis. That is, x X_a(X - X_c) + Y_a(Y - Y_c) and y \n -Y_a(X - X_c) + X_a(Y - Y_c).\n\nIn this system, the center is the origin (0,0) and the foci are (-e a, 0) and (+e a, 0).\n\nAny ellipse can be obtained by rotation and translation of a canonical ellipse with the proper semi-diameters. The expression of an ellipse centered at (X_c,Y_c) is\n\n\\frac{(x - X_c)^2}{a^2}+\\frac{(y - Y_c)^2}{b^2}=1\n\nMoreover, any canonical ellipse can be obtained by scaling the unit circle of \\reals^2, defined by the equation\n\nX^2+Y^2=1\\,\n\nby factors a and b along the two axes.\n\nFor an ellipse in canonical form, we have\n\n Y \\pm b\\sqrt{1 - (X/a)^2} \n \\pm \\sqrt{(a^2-X^2)(1 - e^2)}\n\nThe distances from a point (X,Y) on the ellipse to the left and right foci are a + e X and a - e X, respectively.\n\nThe canonical form coefficients can be obtained from the general form coefficients using the following equations:\n\n\\begin{align}\na, b   &= \\frac{-\\sqrt{2 \\Big(A E^2 + C D^2 - B D E + (B^2 - 4 A C) F\\Big)\\left(A + C \\pm \\sqrt{(A - C)^2 + B^2}\\right)}}{B^2 - 4 A C} \\\\\nX_c    &= \\frac{2 C D - B E}{B^2 - 4 A C} \\\\\nY_c    &= \\frac{2 A E - B D}{B^2 - 4 A C} \\\\\n\\Theta &= \\begin{cases}\n  0 & \\text{for } B = 0, A  C\\\\\n  \\arctan\\frac{C - A - \\sqrt{(A - C)^2 + B^2}}{B} & \\text{for } B \\ne 0\n\\end{cases}\n\\end{align}\n\nwhere \\Theta is the angle from the positive horizontal axis to the ellipse's major axis.\n\nPolar forms \n\nPolar form relative to center \n\nIn polar coordinates, with the origin at the center of the ellipse and with the angular coordinate \\theta measured from the major axis, the ellipse's equation is\nr(\\theta)=\\frac{ab}{\\sqrt{(b \\cos \\theta)^2 + (a\\sin \\theta)^2}}\n\nPolar form relative to focus \n\nIf instead we use polar coordinates with the origin at one focus, with the angular coordinate \\theta = 0 still measured from the major axis, the ellipse's equation is\nr(\\theta)=\\frac{a (1-e^2)}{1 \\pm e\\cos\\theta}\nwhere the sign in the denominator is negative if the reference direction \\theta = 0 points towards the center (as illustrated on the right), and positive if that direction points away from the center.\n\nIn the slightly more general case of an ellipse with one focus at the origin and the other focus at angular coordinate \\phi, the polar form is\nr=\\frac{a (1-e^2)}{1 - e\\cos(\\theta - \\phi)}.\n\nThe angle \\theta in these formulas is called the true anomaly of the point. The numerator a (1-e^2) of these formulas is the semi-latus rectum of the ellipse, usually denoted l. It is the distance from a focus of the ellipse to the ellipse itself, measured along a line perpendicular to the major axis.\n\nEllipse as hypotrochoid\n\nThe ellipse is a special case of the hypotrochoid when R  2r, as shown in the adjacent image. The special case of a moving circle with radius r inside a circle with radius R\n2r is called a Tusi couple.\n\nEllipses as plane sections of quadrics \n\nEllipses appear as plane sections of the following quadrics:\n* Ellipsoid\n* Elliptic cone \n* Elliptic cylinder\n* Hyperboloid of one sheet\n* Hyperboloid of two sheets\n\nEllipsoid Quadric.png|Ellipsoid\nQuadric Cone.jpg|Elliptic cone\nElliptic Cylinder Quadric.png|Elliptic cylinder\nHyperboloid1.png|Hyperboloid of one sheet\nHyperboloid2.png|Hyperboloid of two sheets\n\nApplications \n\nPhysics\n\nElliptical reflectors and acoustics \n\nIf the water's surface is disturbed at one focus of an elliptical water tank, the circular waves of that disturbance, after reflecting off the walls, converge simultaneously to a single point: the second focus. This is a consequence of the total travel length being the same along any wall-bouncing path between the two foci.\n\nSimilarly, if a light source is placed at one focus of an elliptic mirror, all light rays on the plane of the ellipse are reflected to the second focus. Since no other smooth curve has such a property, it can be used as an alternative definition of an ellipse. (In the special case of a circle with a source at its center all light would be reflected back to the center.) If the ellipse is rotated along its major axis to produce an ellipsoidal mirror (specifically, a prolate spheroid), this property holds for all rays out of the source. Alternatively, a cylindrical mirror with elliptical cross-section can be used to focus light from a linear fluorescent lamp along a line of the paper; such mirrors are used in some document scanners.\n\nSound waves are reflected in a similar way, so in a large elliptical room a person standing at one focus can hear a person standing at the other focus remarkably well. The effect is even more evident under a vaulted roof shaped as a section of a prolate spheroid. Such a room is called a whisper chamber. The same effect can be demonstrated with two reflectors shaped like the end caps of such a spheroid, placed facing each other at the proper distance. Examples are the National Statuary Hall at the United States Capitol (where John Quincy Adams is said to have used this property for eavesdropping on political matters); the Mormon Tabernacle at Temple Square in Salt Lake City, Utah; at an exhibit on sound at the Museum of Science and Industry in Chicago; in front of the University of Illinois at Urbana-Champaign Foellinger Auditorium; and also at a side chamber of the Palace of Charles V, in the Alhambra.\n\nPlanetary orbits \n\nIn the 17th century, Johannes Kepler discovered that the orbits along which the planets travel around the Sun are ellipses with the Sun [approximately] at one focus, in his first law of planetary motion. Later, Isaac Newton explained this as a corollary of his law of universal gravitation.\n\nMore generally, in the gravitational two-body problem, if the two bodies are bound to each other (that is, the total energy is negative), their orbits are similar ellipses with the common barycenter being one of the foci of each ellipse. The other focus of either ellipse has no known physical significance. Interestingly, the orbit of either body in the reference frame of the other is also an ellipse, with the other body at the same focus.\n\nKeplerian elliptical orbits are the result of any radially directed attraction force whose strength is inversely proportional to the square of the distance. Thus, in principle, the motion of two oppositely charged particles in empty space would also be an ellipse. (However, this conclusion ignores losses due to electromagnetic radiation and quantum effects, which become significant when the particles are moving at high speed.)\n\nFor elliptical orbits, useful relations involving the eccentricity e are:\n\n\\begin{align}e &\\frac{r_{a}-r_{p}}{r_{a}+r_{p}}\n\\frac{r_{a}-r_{p}}{2a}\\\\\nr_{a} &= (1+e)a\\\\\nr_{p} &= (1-e)a\\end{align}\n\nwhere\n*r_{a} is the radius at apoapsis (the farthest distance)\n*r_{p} is the radius at periapsis (the closest distance)\n*a is the length of the semi-major axis\n\nAlso, in terms of r_{a} and r_{p}, the semi-major axis a is their arithmetic mean, the semi-minor axis b is their geometric mean, and the semi-latus rectum l is their harmonic mean. In other words,\n\n\\begin{align}a &= \\frac{r_{a}+r_{p}}{2}\\\\\nb &= \\sqrt{r_{a}\\cdot r_{p}}\\\\\nl &\\frac{2}{\\frac{1}{r_{a}}+\\frac{1}{r_{p}}}\n\\frac{2r_{a}r_{p}}{r_{a}+r_{p}}\\end{align}.\n\nHarmonic oscillators \n\nThe general solution for a harmonic oscillator in two or more dimensions is also an ellipse. Such is the case, for instance, of a long pendulum that is free to move in two dimensions; of a mass attached to a fixed point by a perfectly elastic spring; or of any object that moves under influence of an attractive force that is directly proportional to its distance from a fixed attractor. Unlike Keplerian orbits, however, these \"harmonic orbits\" have the center of attraction at the geometric center of the ellipse, and have fairly simple equations of motion.\n\nPhase visualization \n\nIn electronics, the relative phase of two sinusoidal signals can be compared by feeding them to the vertical and horizontal inputs of an oscilloscope. If the display is an ellipse, rather than a straight line, the two signals are out of phase.\n\nElliptical gears \n\nTwo non-circular gears with the same elliptical outline, each pivoting around one focus and positioned at the proper angle, turn smoothly while maintaining contact at all times. Alternatively, they can be connected by a link chain or timing belt, or in the case of a bicycle the main chainring may be elliptical, or an ovoid similar to an ellipse in form. Such elliptical gears may be used in mechanical equipment to produce variable angular speed or torque from a constant rotation of the driving axle, or in the case of a bicycle to allow a varying crank rotation speed with inversely varying mechanical advantage.\n\nElliptical bicycle gears make it easier for the chain to slide off the cog when changing gears.\nDavid Drew.\n\"Elliptical Gears\".\n[http://jwilson.coe.uga.edu/emt668/EMAT6680.2003.fall/Drew/Emat6890/Elliptical%20Gears.htm]\n\nAn example gear application would be a device that winds thread onto a conical bobbin on a spinning machine. The bobbin would need to wind faster when the thread is near the apex than when it is near the base.\n\nOptics \n\n* In a material that is optically anisotropic (birefringent), the refractive index depends on the direction of the light. The dependency can be described by an index ellipsoid. (If the material is optically isotropic, this ellipsoid is a sphere.)\n* In lamp-pumped solid-state lasers, elliptical cylinder-shaped reflectors have been used to direct light from the pump lamp (coaxial with one ellipse focal axis) to the active medium rod (coaxial with the second focal axis).[http://www.rp-photonics.com/lamp_pumped_lasers.html Encyclopedia of Laser Physics and Technology - lamp-pumped lasers, arc lamps, flash lamps, high-power, Nd:YAG laser]\n* In laser-plasma produced EUV light sources used in microchip lithography, EUV light is generated by plasma positioned in the primary focus of an ellipsoid mirror and is collected in the secondary focus at the input of the lithography machine.\n\nStatistics and finance\n\nIn statistics, a bivariate random vector (X, Y) is jointly elliptically distributed if its iso-density contours—loci of equal values of the density function—are ellipses. The concept extends to an arbitrary number of elements of the random vector, in which case in general the iso-density contours are ellipsoids. A special case is the multivariate normal distribution. The elliptical distributions are important in finance because if rates of return on assets are jointly elliptically distributed then all portfolios can be characterized completely by their mean and variance—that is, any two portfolios with identical mean and variance of portfolio return have identical distributions of portfolio return.\n\nComputer graphics \n\nDrawing an ellipse as a graphics primitive is common in standard display libraries, such as the MacIntosh QuickDraw API, and Direct2D on Windows. Jack Bresenham at IBM is most famous for the invention of 2D drawing primitives, including line and circle drawing, using only fast integer operations such as addition and branch on carry bit. M. L. V. Pitteway extended Bresenham's algorithm for lines to conics in 1967. Another efficient generalization to draw ellipses was invented in 1984 by Jerry Van Aken.\n\nIn 1970 Danny Cohen presented at the \"Computer Graphics 1970\" conference in England a linear algorithm for drawing ellipses and circles. In 1971, L. B. Smith published similar algorithms for all conic sections and proved them to have good properties. These algorithms need only a few multiplications and additions to calculate each vector.\n\nIt is beneficial to use a parametric formulation in computer graphics because the density of points is greatest where there is the most curvature. Thus, the change in slope between each successive point is small, reducing the apparent \"jaggedness\" of the approximation.\n\n;Drawing with Bézier paths:\nComposite Bézier curves may also be used to draw an ellipse to sufficient accuracy, since any ellipse may be construed as an affine transformation of a circle. The spline methods used to draw a circle may be used to draw an ellipse, since the constituent Bézier curves behave appropriately under such transformations.\n\nOptimization theory \n\nIt is sometimes useful to find the minimum bounding ellipse on a set of points. The ellipsoid method is quite useful for attacking this problem. Ellipse. http://en.wikipedia.org/?curid=9277."
  }
}
