{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7234",
  "eid" : "e088c970-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778456455,
  "textBody" : "Constantine II (;Jones, pg. 223 January/February 316 – 340) was Roman Emperor from 337 to 340. Son of Constantine the Great and co-emperor alongside his brothers, his attempt to exert his perceived rights of primogeniture led to his death in a failed invasion of Italy in 340.\n\nCareer\n\nThe eldest son of Constantine the Great and Fausta, after the death of his half-brother Crispus, Constantine II was born in Arles in February 316Victor, 41:4 and raised as a Christian. On 1 March 317, he was made Caesar.Victor, 41:6 In 323, at the age of seven, he took part in his father's campaign against the Sarmatians.DiMaio, Constantine II (337–340 A.D.)  At age ten, he became commander of Gaul, following the death of Crispus. An inscription dating to 330 records the title of Alamannicus, so it is probable that his generals won a victory over the Alamanni.  His military career continued when Constantine I made him field commander during the 332 campaign against the Goths.Canduci, pg. 129\n\nFollowing the death of his father in 337, Constantine II initially became emperor jointly with his brothers Constantius II and Constans,Eutropius, 10:9 with the Empire divided between them and their cousins, the Caesars Dalmatius and Hannibalianus.Victor, 41:20  This arrangement barely survived Constantine I’s death, as his sons arranged the slaughter of most of the rest of the family by the army.Gibbon, Ch. 18  As a result, the three brothers gathered together in Pannonia and there, on 9 September 337, divided the Roman world between themselves. Constantine, proclaimed Augustus by the troops received Gaul, Britannia and Hispania.\n\nHe was soon involved in the struggle between factions rupturing the unity of the Christian Church.  The Western portion of the Empire, under the influence of the Popes in Rome, favored Catholicism over Arianism, and through their intercession they convinced Constantine to free Athanasius, allowing him to return to Alexandria.A. H. M. Jones, \"The Later Roman Empire\" (Baltimore, 1986), pg. 114 This action aggravated Constantius II, who was a committed supporter of Arianism.\n\nConstantine was initially the guardian of his younger brother Constans, whose portion of the empire was Italia, Africa and Illyricum. Constantine soon complained that he had not received the amount of territory that was his due as the eldest son.  Annoyed that Constans had received Thrace and Macedonia after the death of Dalmatius, Constantine demanded that Constans hand over the African provinces, to which he agreed in order to maintain a fragile peace.Victor, 41:21  Soon, however, they began quarreling over which parts of the African provinces belonged to Carthage, and thus Constantine, and which belonged to Italy, and therefore Constans.Zosimus, 2:41–42\n\nFurther complications arose when Constans came of age and Constantine, who had grown accustomed to dominating his younger brother, would not relinquish the guardianship. In 340 Constantine marched into Italy at the head of his troops. Constans, at that time in Dacia, detached and sent a select and disciplined body of his Illyrian troops, stating that he would follow them in person with the remainder of his forces.  Constantine was engaged in military operations and was killed in an ambush outside Aquileia.  Constans then took control of his deceased brother's realm.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Constantine II (emperor)" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7234" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Constantine II (;Jones, pg. 223 January/February 316 – 340) was Roman Emperor from 337 to 340. Son of Constantine the Great and co-emperor alongside his brothers, his attempt to exert his perceived rights of primogeniture led to his death in a failed invasion of Italy in 340.\n\nCareer\n\nThe eldest son of Constantine the Great and Fausta, after the death of his half-brother Crispus, Constantine II was born in Arles in February 316Victor, 41:4 and raised as a Christian. On 1 March 317, he was made Caesar.Victor, 41:6 In 323, at the age of seven, he took part in his father's campaign against the Sarmatians.DiMaio, Constantine II (337–340 A.D.)  At age ten, he became commander of Gaul, following the death of Crispus. An inscription dating to 330 records the title of Alamannicus, so it is probable that his generals won a victory over the Alamanni.  His military career continued when Constantine I made him field commander during the 332 campaign against the Goths.Canduci, pg. 129\n\nFollowing the death of his father in 337, Constantine II initially became emperor jointly with his brothers Constantius II and Constans,Eutropius, 10:9 with the Empire divided between them and their cousins, the Caesars Dalmatius and Hannibalianus.Victor, 41:20  This arrangement barely survived Constantine I’s death, as his sons arranged the slaughter of most of the rest of the family by the army.Gibbon, Ch. 18  As a result, the three brothers gathered together in Pannonia and there, on 9 September 337, divided the Roman world between themselves. Constantine, proclaimed Augustus by the troops received Gaul, Britannia and Hispania.\n\nHe was soon involved in the struggle between factions rupturing the unity of the Christian Church.  The Western portion of the Empire, under the influence of the Popes in Rome, favored Catholicism over Arianism, and through their intercession they convinced Constantine to free Athanasius, allowing him to return to Alexandria.A. H. M. Jones, \"The Later Roman Empire\" (Baltimore, 1986), pg. 114 This action aggravated Constantius II, who was a committed supporter of Arianism.\n\nConstantine was initially the guardian of his younger brother Constans, whose portion of the empire was Italia, Africa and Illyricum. Constantine soon complained that he had not received the amount of territory that was his due as the eldest son.  Annoyed that Constans had received Thrace and Macedonia after the death of Dalmatius, Constantine demanded that Constans hand over the African provinces, to which he agreed in order to maintain a fragile peace.Victor, 41:21  Soon, however, they began quarreling over which parts of the African provinces belonged to Carthage, and thus Constantine, and which belonged to Italy, and therefore Constans.Zosimus, 2:41–42\n\nFurther complications arose when Constans came of age and Constantine, who had grown accustomed to dominating his younger brother, would not relinquish the guardianship. In 340 Constantine marched into Italy at the head of his troops. Constans, at that time in Dacia, detached and sent a select and disciplined body of his Illyrian troops, stating that he would follow them in person with the remainder of his forces.  Constantine was engaged in military operations and was killed in an ambush outside Aquileia.  Constans then took control of his deceased brother's realm. Constantine II (emperor). http://en.wikipedia.org/?curid=7234."
  }
}
