{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=4789",
  "eid" : "d068d3a0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778429402,
  "textBody" : "The Behistun Inscription (also Bisotun, Bistun or Bisutun; , Old Persian: Bagastana, meaning \"the place of god\") is a multilingual inscription and large rock relief on a cliff at Mount Behistun in the Kermanshah Province of Iran, near the city of Kermanshah in western Iran. It was crucial to the decipherment of cuneiform script.\n\nAuthored by Darius the Great sometime between his coronation as king of the Persian Empire in the summer of 522 BC and his death in autumn of 486 BC, the inscription begins with a brief autobiography of Darius, including his ancestry and lineage. Later in the inscription, Darius provides a lengthy sequence of events following the deaths of Cyrus the Great and Cambyses II in which he fought nineteen battles in a period of one year (ending in December 521 BC) to put down multiple rebellions throughout the Persian Empire.  The inscription states in detail that the rebellions, which had resulted from the deaths of Cyrus the Great and his son Cambyses II, were orchestrated by several impostors and their co-conspirators in various cities throughout the empire, each of whom falsely proclaimed kinghood during the upheaval following Cyrus's death.\n\nDarius the Great proclaimed himself victorious in all battles during the period of upheaval, attributing his success to the \"grace of Ahura Mazda\".\n\nThe inscription includes three versions of the same text, written in three different cuneiform script languages: Old Persian, Elamite, and Babylonian (a variety of Akkadian). The inscription is to cuneiform what the Rosetta Stone is to Egyptian hieroglyphs: the document most crucial in the decipherment of a previously lost script.\n\nThe inscription is approximately 15 metres high by 25 metres wide and 100 metres up a limestone cliff from an ancient road connecting the capitals of Babylonia and Media (Babylon and Ecbatana, respectively). The Old Persian text contains 414 lines in five columns; the Elamite text includes 593 lines in eight columns, and the Babylonian text is in 112 lines. The inscription was illustrated by a life-sized bas-relief of Darius I, the Great, holding a bow as a sign of kingship, with his left foot on the chest of a figure lying on his back before him.  The supine figure is reputed to be the pretender Gaumata.  Darius is attended to the left by two servants, and nine one-meter figures stand to the right, with hands tied and rope around their necks, representing conquered peoples. A  Faravahar floats above, giving its blessing to the king. One figure appears to have been added after the others were completed, as was Darius's beard, which is a separate block of stone attached with iron pins and lead.\n\nHistory\n\nAfter the fall of the Persian Empire's Achaemenid Dynasty and its successors, and the lapse of Old Persian cuneiform writing into disuse, the nature of the inscription was forgotten, and fanciful explanations became the norm. For centuries, instead of being attributed to Darius I, the Great, it was believed to be from the reign of Khosrau II of Persia—one of the last Sassanid kings, who lived over 1000 years after the time of Darius I.\n\nThe inscription is mentioned by Ctesias of Cnidus, who noted its existence some time around 400 BC and mentioned a well and a garden beneath the inscription. He incorrectly concluded that the inscription had been dedicated \"by Queen Semiramis of Babylon to Zeus\". Tacitus also mentions it and includes a description of some of the long-lost ancillary monuments at the base of the cliff, including an altar to \"Herakles\". What has been recovered of them, including a statue dedicated in 148 BC, is consistent with Tacitus's description. Diodorus also writes of \"Bagistanon\" and claims it was inscribed by Semiramis.\n\nA legend began around Mount Behistun (Bisotun), as written about by the Persian poet and writer Ferdowsi in his Shahnameh (Book of Kings) , about a man named Farhad, who was a lover of King Khosrow's wife, Shirin. The legend states that, exiled for his transgression, Farhad was given the task of cutting away the mountain to find water; if he succeeded, he would be given permission to marry Shirin. After many years and the removal of half the mountain, he did find water, but was informed by Khosrow that Shirin had died. He went mad, threw his axe down the hill, kissed the ground and died. It is told in the book of Khosrow and Shirin that his axe was made out of a pomegranate tree, and, where he threw the axe, a pomegranate tree grew with fruit that would cure the ill. Shirin was not dead, according to the story, and mourned upon hearing the news.\n\nIn 1598, the Englishman Robert Sherley saw the inscription during a diplomatic mission to Persia on behalf of Austria, and brought it to the attention of Western European scholars. His party incorrectly came to the conclusion that it was Christian in origin.E. Denison Ross, The Broadway Travellers: Sir Anthony Sherley and his Persian Adventure, Routledge, 2004,  French General Gardanne thought it showed \"Christ and his twelve apostles\", and Sir Robert Ker Porter thought it represented the Lost Tribes of Israel and Shalmaneser of Assyria.[https://archive.org/download/travelsingeorgia02port/travelsingeorgia02port.pdf] Robert Ker Porter, Travels in Georgia, Persia, Armenia, ancient Babylonia, &c. &c. : during the years 1817, 1818, 1819, and 1820, volume 2, Longman, 1821 Italian explorer Pietro della Valle visited the inscription in the course of a pilgrimage in around 1621.\n\nTranslation\n\nGerman surveyor Carsten Niebuhr visited in around 1764 for Frederick V of Denmark, publishing a copy of the inscription in the account of his journeys in 1778.Carsten Niebuhr, Reisebeschreibung von Arabien und anderen umliegenden Ländern, 2 volumes, 1774 and 1778 Niebuhr's transcriptions were used by Georg Friedrich Grotefend and others in their efforts to decipher the Old Persian cuneiform script. Grotefend had deciphered ten of the 37 symbols of Old Persian by 1802, after realizing that unlike the Semitic cuneiform scripts, Old Persian text is alphabetic and each word is separated by a vertical slanted symbol.\n\nThe Old Persian text was copied and deciphered before recovery and copying of the Elamite and Babylonian inscriptions had even been attempted, which proved to be a good deciphering strategy, since Old Persian script was easier to study due to its alphabetic nature and because the language it represents had naturally evolved via Middle Persian to the living modern Persian language dialects, and was also related to the Avestan language, used in the Zoroastrian book the Avesta.\n\nIn 1835, Sir Henry Rawlinson, an officer of the British East India Company army assigned to the forces of the Shah of Iran, began studying the inscription in earnest. As the town of Bisotun's name was anglicized as \"Behistun\" at this time, the monument became known as the \"Behistun Inscription\". Despite its relative inaccessibility, Rawlinson was able to scale the cliff with the help of a local boy and copy the Old Persian inscription. The Elamite was across a chasm, and the Babylonian four meters above; both were beyond easy reach and were left for later.\n\nWith the Persian text, and with about a third of the syllabary made available to him by the work of Georg Friedrich Grotefend, Rawlinson set to work on deciphering the text. Fortunately, the first section of this text contained a list of the same Persian kings found in Herodotus but in their original Persian forms as opposed to Herodotus's Greek transliterations; for example Darius is given as the original Dâryavuš instead of the Hellenized Δαρειος. By matching the names and the characters, Rawlinson deciphered the type of cuneiform used for Old Persian by 1838 and presented his results to the Royal Asiatic Society in London and the Société Asiatique in Paris.\n\nIn the interim, Rawlinson spent a brief tour of duty in Afghanistan, returning to the site in 1843. He first crossed a chasm between the Persian and Elamite scripts by bridging the gap with planks, subsequently copying the Elamite inscription. He found an enterprising local boy to climb up a crack in the cliff and suspend ropes across the Babylonian writing, so that papier-mâché casts of the inscriptions could be taken. Rawlinson, along with several other scholars, most notably Edward Hincks, Julius Oppert, William Henry Fox Talbot, and Edwin Norris, either working separately or in collaboration, eventually deciphered these inscriptions, leading eventually to the ability to read them completely.\n\nThe translation of the Old Persian sections of the Behistun Inscription paved the way to the subsequent ability to decipher the Elamite and Babylonian parts of the text, which greatly promoted the development of modern Assyriology.\n\nLater research and activity\n\nThe site was visited by A. V. Williams Jackson in 1903.A. V. Williams Jackson, \"The Great Behistun Rock and Some Results of a Re-Examination of the Old Persian Inscriptions on It\", Journal of the American Oriental Society, vol. 24, pp. 77–95, 1903 Later expeditions, in 1904 sponsored by the British Museum and led by Leonard William King and Reginald Campbell Thompson and in 1948 by George G. Cameron of the University of Michigan, obtained photographs, casts and more accurate transcriptions of the texts, including passages that were not copied by Rawlinson.[https://archive.org/download/sculpturesinscri00brituoft/sculpturesinscri00brituoft.pdf] W. King and R. C. Thompson, The sculptures and inscription of Darius the Great on the Rock of Behistûn in Persia: a new collation of the Persian, Susian and Babylonian texts, Longmans, 1907George G. Cameron, The Old Persian Text of the Bisitun Inscription, Journal of Cuneiform Studies, vol. 5, no. 2, pp. 47–54, 1951George G. Cameron, The Elamite Version of the Bisitun Inscriptions, Journal of Cuneiform Studies, vol. 14, no. 2, pp. 59–68, 1960W. C. Benedict and Elizabeth von Voigtlander, Darius' Bisitun Inscription, Babylonian Version, Lines 1–29, Journal of Cuneiform Studies, vol. 10, no. 1, pp. 1–10, 1956\nIt also became apparent that rainwater had dissolved some areas of the limestone in which the text was inscribed, while leaving new deposits of limestone over other areas, covering the text.\n\nIn 1938, the inscription became of interest to the Nazi German think tank Ahnenerbe, although research plans were cancelled due to the onset of World War II.\n\nThe monument later suffered some damage from Allied soldiers using it for target practice in World War II, and during the Anglo-Soviet invasion of Iran.http://ancientstandard.com/2011/03/30/the-behistun-inscription-the-iranian-rosetta-stone/http://atlantisonline.smfforfree2.com/index.php?topic=2799.5;wap2\n\nIn 1999, Iranian archeologists began the documentation and assessment of damages to the site incurred during the 20th century. Malieh Mehdiabadi, who was project manager for the effort, described a photogrammetric process by which two-dimensional photos were taken of the inscriptions using two cameras and later transmuted into 3-D images.\n\nIn recent years, Iranian archaeologists have been undertaking conservation works.  The site became a UNESCO World Heritage Site in 2006.\n\nIn 2012, the Bisotun Cultural Heritage Center organized an international effort to re-examine the inscription. Intl. experts to reread Bisotun inscriptions, Tehran Times, May 27, 2012\n\nOther historical monuments in the Behistun complex\n\nThe site covers an area of 116 hectares. Archeological evidence indicates that this region became a human shelter 40,000 years ago. There are 18 historical monuments other than the inscription of Darius the Great in the Behistun complex that have been registered in the Iranian national list of historical sites. Some of them are:\n\n* Hunters' cave\n* Farhād Tarāsh\n* Median fortress\n* Parthian town\n* Seleucid Statue of Hercules\n* Parthian site of worship\n\n* Behistun Palace (said to be Palace of Khosrau II)\n* Ilkhanid caravanserai\n* Median temple\n* Bas relief of Mithridates II of Parthia\n* Bas relief of Gotarzes II of Parthia\n\n* Sheikh Ali khan Zangeneh text endowment\n* Safavid caravanserai\n* Vologases's relief \n* Carved Sassanian stones\n* Royal Road\n\nImage:Seleucid statue of Hercules 2.jpg|Statue of Herakles in Behistun complex\nImage:Godarz.jpg|Bas relief of Mithridates II of Parthia and bas relief of Gotarzes II of Parthia and Sheikh Ali khan Zangeneh text endowment",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Behistun Inscription" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=4789" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Behistun Inscription (also Bisotun, Bistun or Bisutun; , Old Persian: Bagastana, meaning \"the place of god\") is a multilingual inscription and large rock relief on a cliff at Mount Behistun in the Kermanshah Province of Iran, near the city of Kermanshah in western Iran. It was crucial to the decipherment of cuneiform script.\n\nAuthored by Darius the Great sometime between his coronation as king of the Persian Empire in the summer of 522 BC and his death in autumn of 486 BC, the inscription begins with a brief autobiography of Darius, including his ancestry and lineage. Later in the inscription, Darius provides a lengthy sequence of events following the deaths of Cyrus the Great and Cambyses II in which he fought nineteen battles in a period of one year (ending in December 521 BC) to put down multiple rebellions throughout the Persian Empire.  The inscription states in detail that the rebellions, which had resulted from the deaths of Cyrus the Great and his son Cambyses II, were orchestrated by several impostors and their co-conspirators in various cities throughout the empire, each of whom falsely proclaimed kinghood during the upheaval following Cyrus's death.\n\nDarius the Great proclaimed himself victorious in all battles during the period of upheaval, attributing his success to the \"grace of Ahura Mazda\".\n\nThe inscription includes three versions of the same text, written in three different cuneiform script languages: Old Persian, Elamite, and Babylonian (a variety of Akkadian). The inscription is to cuneiform what the Rosetta Stone is to Egyptian hieroglyphs: the document most crucial in the decipherment of a previously lost script.\n\nThe inscription is approximately 15 metres high by 25 metres wide and 100 metres up a limestone cliff from an ancient road connecting the capitals of Babylonia and Media (Babylon and Ecbatana, respectively). The Old Persian text contains 414 lines in five columns; the Elamite text includes 593 lines in eight columns, and the Babylonian text is in 112 lines. The inscription was illustrated by a life-sized bas-relief of Darius I, the Great, holding a bow as a sign of kingship, with his left foot on the chest of a figure lying on his back before him.  The supine figure is reputed to be the pretender Gaumata.  Darius is attended to the left by two servants, and nine one-meter figures stand to the right, with hands tied and rope around their necks, representing conquered peoples. A  Faravahar floats above, giving its blessing to the king. One figure appears to have been added after the others were completed, as was Darius's beard, which is a separate block of stone attached with iron pins and lead.\n\nHistory\n\nAfter the fall of the Persian Empire's Achaemenid Dynasty and its successors, and the lapse of Old Persian cuneiform writing into disuse, the nature of the inscription was forgotten, and fanciful explanations became the norm. For centuries, instead of being attributed to Darius I, the Great, it was believed to be from the reign of Khosrau II of Persia—one of the last Sassanid kings, who lived over 1000 years after the time of Darius I.\n\nThe inscription is mentioned by Ctesias of Cnidus, who noted its existence some time around 400 BC and mentioned a well and a garden beneath the inscription. He incorrectly concluded that the inscription had been dedicated \"by Queen Semiramis of Babylon to Zeus\". Tacitus also mentions it and includes a description of some of the long-lost ancillary monuments at the base of the cliff, including an altar to \"Herakles\". What has been recovered of them, including a statue dedicated in 148 BC, is consistent with Tacitus's description. Diodorus also writes of \"Bagistanon\" and claims it was inscribed by Semiramis.\n\nA legend began around Mount Behistun (Bisotun), as written about by the Persian poet and writer Ferdowsi in his Shahnameh (Book of Kings) , about a man named Farhad, who was a lover of King Khosrow's wife, Shirin. The legend states that, exiled for his transgression, Farhad was given the task of cutting away the mountain to find water; if he succeeded, he would be given permission to marry Shirin. After many years and the removal of half the mountain, he did find water, but was informed by Khosrow that Shirin had died. He went mad, threw his axe down the hill, kissed the ground and died. It is told in the book of Khosrow and Shirin that his axe was made out of a pomegranate tree, and, where he threw the axe, a pomegranate tree grew with fruit that would cure the ill. Shirin was not dead, according to the story, and mourned upon hearing the news.\n\nIn 1598, the Englishman Robert Sherley saw the inscription during a diplomatic mission to Persia on behalf of Austria, and brought it to the attention of Western European scholars. His party incorrectly came to the conclusion that it was Christian in origin.E. Denison Ross, The Broadway Travellers: Sir Anthony Sherley and his Persian Adventure, Routledge, 2004,  French General Gardanne thought it showed \"Christ and his twelve apostles\", and Sir Robert Ker Porter thought it represented the Lost Tribes of Israel and Shalmaneser of Assyria.[https://archive.org/download/travelsingeorgia02port/travelsingeorgia02port.pdf] Robert Ker Porter, Travels in Georgia, Persia, Armenia, ancient Babylonia, &c. &c. : during the years 1817, 1818, 1819, and 1820, volume 2, Longman, 1821 Italian explorer Pietro della Valle visited the inscription in the course of a pilgrimage in around 1621.\n\nTranslation\n\nGerman surveyor Carsten Niebuhr visited in around 1764 for Frederick V of Denmark, publishing a copy of the inscription in the account of his journeys in 1778.Carsten Niebuhr, Reisebeschreibung von Arabien und anderen umliegenden Ländern, 2 volumes, 1774 and 1778 Niebuhr's transcriptions were used by Georg Friedrich Grotefend and others in their efforts to decipher the Old Persian cuneiform script. Grotefend had deciphered ten of the 37 symbols of Old Persian by 1802, after realizing that unlike the Semitic cuneiform scripts, Old Persian text is alphabetic and each word is separated by a vertical slanted symbol.\n\nThe Old Persian text was copied and deciphered before recovery and copying of the Elamite and Babylonian inscriptions had even been attempted, which proved to be a good deciphering strategy, since Old Persian script was easier to study due to its alphabetic nature and because the language it represents had naturally evolved via Middle Persian to the living modern Persian language dialects, and was also related to the Avestan language, used in the Zoroastrian book the Avesta.\n\nIn 1835, Sir Henry Rawlinson, an officer of the British East India Company army assigned to the forces of the Shah of Iran, began studying the inscription in earnest. As the town of Bisotun's name was anglicized as \"Behistun\" at this time, the monument became known as the \"Behistun Inscription\". Despite its relative inaccessibility, Rawlinson was able to scale the cliff with the help of a local boy and copy the Old Persian inscription. The Elamite was across a chasm, and the Babylonian four meters above; both were beyond easy reach and were left for later.\n\nWith the Persian text, and with about a third of the syllabary made available to him by the work of Georg Friedrich Grotefend, Rawlinson set to work on deciphering the text. Fortunately, the first section of this text contained a list of the same Persian kings found in Herodotus but in their original Persian forms as opposed to Herodotus's Greek transliterations; for example Darius is given as the original Dâryavuš instead of the Hellenized Δαρειος. By matching the names and the characters, Rawlinson deciphered the type of cuneiform used for Old Persian by 1838 and presented his results to the Royal Asiatic Society in London and the Société Asiatique in Paris.\n\nIn the interim, Rawlinson spent a brief tour of duty in Afghanistan, returning to the site in 1843. He first crossed a chasm between the Persian and Elamite scripts by bridging the gap with planks, subsequently copying the Elamite inscription. He found an enterprising local boy to climb up a crack in the cliff and suspend ropes across the Babylonian writing, so that papier-mâché casts of the inscriptions could be taken. Rawlinson, along with several other scholars, most notably Edward Hincks, Julius Oppert, William Henry Fox Talbot, and Edwin Norris, either working separately or in collaboration, eventually deciphered these inscriptions, leading eventually to the ability to read them completely.\n\nThe translation of the Old Persian sections of the Behistun Inscription paved the way to the subsequent ability to decipher the Elamite and Babylonian parts of the text, which greatly promoted the development of modern Assyriology.\n\nLater research and activity\n\nThe site was visited by A. V. Williams Jackson in 1903.A. V. Williams Jackson, \"The Great Behistun Rock and Some Results of a Re-Examination of the Old Persian Inscriptions on It\", Journal of the American Oriental Society, vol. 24, pp. 77–95, 1903 Later expeditions, in 1904 sponsored by the British Museum and led by Leonard William King and Reginald Campbell Thompson and in 1948 by George G. Cameron of the University of Michigan, obtained photographs, casts and more accurate transcriptions of the texts, including passages that were not copied by Rawlinson.[https://archive.org/download/sculpturesinscri00brituoft/sculpturesinscri00brituoft.pdf] W. King and R. C. Thompson, The sculptures and inscription of Darius the Great on the Rock of Behistûn in Persia: a new collation of the Persian, Susian and Babylonian texts, Longmans, 1907George G. Cameron, The Old Persian Text of the Bisitun Inscription, Journal of Cuneiform Studies, vol. 5, no. 2, pp. 47–54, 1951George G. Cameron, The Elamite Version of the Bisitun Inscriptions, Journal of Cuneiform Studies, vol. 14, no. 2, pp. 59–68, 1960W. C. Benedict and Elizabeth von Voigtlander, Darius' Bisitun Inscription, Babylonian Version, Lines 1–29, Journal of Cuneiform Studies, vol. 10, no. 1, pp. 1–10, 1956\nIt also became apparent that rainwater had dissolved some areas of the limestone in which the text was inscribed, while leaving new deposits of limestone over other areas, covering the text.\n\nIn 1938, the inscription became of interest to the Nazi German think tank Ahnenerbe, although research plans were cancelled due to the onset of World War II.\n\nThe monument later suffered some damage from Allied soldiers using it for target practice in World War II, and during the Anglo-Soviet invasion of Iran.http://ancientstandard.com/2011/03/30/the-behistun-inscription-the-iranian-rosetta-stone/http://atlantisonline.smfforfree2.com/index.php?topic=2799.5;wap2\n\nIn 1999, Iranian archeologists began the documentation and assessment of damages to the site incurred during the 20th century. Malieh Mehdiabadi, who was project manager for the effort, described a photogrammetric process by which two-dimensional photos were taken of the inscriptions using two cameras and later transmuted into 3-D images.\n\nIn recent years, Iranian archaeologists have been undertaking conservation works.  The site became a UNESCO World Heritage Site in 2006.\n\nIn 2012, the Bisotun Cultural Heritage Center organized an international effort to re-examine the inscription. Intl. experts to reread Bisotun inscriptions, Tehran Times, May 27, 2012\n\nOther historical monuments in the Behistun complex\n\nThe site covers an area of 116 hectares. Archeological evidence indicates that this region became a human shelter 40,000 years ago. There are 18 historical monuments other than the inscription of Darius the Great in the Behistun complex that have been registered in the Iranian national list of historical sites. Some of them are:\n\n* Hunters' cave\n* Farhād Tarāsh\n* Median fortress\n* Parthian town\n* Seleucid Statue of Hercules\n* Parthian site of worship\n\n* Behistun Palace (said to be Palace of Khosrau II)\n* Ilkhanid caravanserai\n* Median temple\n* Bas relief of Mithridates II of Parthia\n* Bas relief of Gotarzes II of Parthia\n\n* Sheikh Ali khan Zangeneh text endowment\n* Safavid caravanserai\n* Vologases's relief \n* Carved Sassanian stones\n* Royal Road\n\nImage:Seleucid statue of Hercules 2.jpg|Statue of Herakles in Behistun complex\nImage:Godarz.jpg|Bas relief of Mithridates II of Parthia and bas relief of Gotarzes II of Parthia and Sheikh Ali khan Zangeneh text endowment. Behistun Inscription. http://en.wikipedia.org/?curid=4789."
  }
}
