{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14682",
  "eid" : "17124610-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778547953,
  "textBody" : "The foreign relations of Ireland are substantially influenced by its membership of the European Union, although bilateral relations with the United States and United Kingdom are also important to the state. It is one of the group of smaller nations in the EU, and has traditionally followed a non-aligned foreign policy. Ireland has historically tended towards independence in foreign military policy, thus it is not a member of the North Atlantic Treaty Organisation and has a longstanding  policy of military neutrality. This policy has been moderated in recent years and the country is an important staging-post for US troops in Western Europe. According to the Irish Defence Forces, the neutrality policy has helped them to be successful in their contributions to United Nations peace-keeping missions since 1960 (in the Congo Crisis) and subsequently in Cyprus, Lebanon and Bosnia and Herzegovina.\n\nMain relationships\n\nChina\n\nIreland's official relationship with the People's Republic of China began on 22 June 1979.Centre for Asian Studies, University Collete Dublin, China the Emerging Power: Prospects for Sino-Irish Relations, By Keisha Carty, Asia Correspondent, The Irish Times Following his visit to China in 1999, former Tao Searcher Bertie Ahern authorised the establishment of an Asia Strategy.Irish Department of Foreign Affairs: a Decade of the Asia Strategy The aim of this Strategy was to ensure that the Irish Government and Irish enterprise work coherently to enhance the important relationships between Ireland and Asia. In recent years due to the rapid expansion of the Chinese economy, China is becoming a key trade partner of Ireland, with over $6bn worth of bilateral trade between the two countries in 2010. In July 2013, the Irish Tánaiste and Minister for Foreign Affairs and Trade were invited to China by the Chinese foreign minister Wang Yi on a trade mission to boost both investment and political ties between the two countries.\n\nIreland has raised its concerns in the area of human rights with China on a number of occasions. On 12 May 2007, during a visit to Beijing, former Taoiseach Brian Cowen (then Minister for Finance) discussed human rights issues with Chinese Foreign Minister Li Zhaoxing.Oireachtas: WRITTEN answer on Wednesday, 31 January 2007. Ref No: 43859/06 Former Tánaiste Mary Coughlan also raised human rights issues and concerns with visiting Chinese Vice-Premier Zeng Peiyan. Ireland also participates in the EU-China Human Rights Dialogue.\n\nConcerning the Taiwan issue, Ireland follows a One-China policy. In 2007, the former Irish Minister for Foreign Affairs, Dermot Ahern summarised the Irish position as follows:Oireachtas: ORAL answer on Thursday, 8 February 2007 by the former Minister for Foreign Affairs (Ref No: 3911/07)\n\nThe former Minister's emphasis on the One China policy and to the Taiwan issue being best settled through dialogue \"between the parties concerned\" was consistent with Beijing's wish that the Taiwan issue be regarded as a domestic one between Chinese on both sides of the Taiwan Straits.\n\nUnited Kingdom\n\nSince at least the 1600s Ireland has had political connections with the United Kingdom, with the whole island becoming a part of the United Kingdom of Great Britain and Ireland from 1801 to 1922. From the time of Ireland declaring itself independent from the United Kingdom in 1937, the two countries have been involved in a dispute over the status of Northern Ireland. Articles 2 and 3 of the Constitution of Ireland formerly claimed Northern Ireland as a part of the \"national territory\", though in practice the Irish government did recognise the UK's jurisdiction over the region.\nFrom the onset of the Troubles in 1969, the two governments sought to bring the violence to an end. The Sunningdale Agreement of 1973 and the Anglo-Irish Agreement of 1985 were important steps in this process. In 1998, both states signed the Good Friday Agreement and now co-operate closely to find a solution to the region's problems. Articles 2 and 3 of the Constitution of Ireland were amended as part of this agreement, the territorial claim being replaced with a statement of aspiration to unite the people of the island of Ireland. As part of the Good Friday Agreement, the states also ended their dispute over their respective names: Ireland and the United Kingdom of Great Britain and Northern Ireland. Each agreed to accept and use the others' correct name.\n\nWhen the Troubles were raging in Northern Ireland, the Irish Government sought, with mixed success, to prevent the import of weapons and ammunition through its territory by illegal paramilitary organisations for use in their conflict with the security forces in Northern Ireland. In 1973 three ships of the Irish Naval Service intercepted a ship carrying weapons from Libya which were probably destined for Irish Republican paramilitaries. Law enforcement acts such as these additionally improved relations with the government of the United Kingdom. However, the independent judiciary blocked a number of attempts to extradite suspects between 1970 and 1998 on the basis that their crime might have been 'political' and thus contrary to international law at the time.\n\nIreland is one of the parties to the Rockall continental shelf dispute that also involves Denmark, Iceland, and the United Kingdom. Ireland and the United Kingdom have signed a boundary agreement in the Rockall area. However, neither have concluded similar agreements with Iceland or Denmark (on behalf of the Faroe Islands) and the matter remains under negotiation. Iceland now claims a substantial area of the continental shelf to the west of Ireland, to a point 49°48'N 19°00'W, which is further south than Ireland.\n\nThe controversial Sellafield nuclear fuel reprocessing plant in north-western England has also been a contentious issue between the two governments. The Irish government has sought the closure of the plant, taking a case against the UK government under the United Nations Convention on the Law of the Sea. However, the European Court of Justice found that the case should have been dealt with under EU law.[http://www.europarl.europa.eu/news/expert/infopress_page/064-4617-023-01-04-911-20060123IPR04616-23-01-2006-2006-false/default_en.htm Irish Government must pursue Sellafield case via EU]  — European Parliament press release, 8 June 2006. In 2006, however, both countries came to a friendly agreement which enabled both the Radiological Protection Institute of Ireland and the Garda Síochána (Irish Police Force) access to the site to conduct investigations.\n\nUnited States\n\nThe United States recognised the Irish Free State on 28 June 1924 with diplomatic relations being established on 7 October 1924. In 1927, the United States opened an American Legation in Dublin. Due to the ancestral ties between the two countries, Ireland and the US have a strong relationship, both politically and economically, with the US being Ireland's biggest trading partner since 2000. Ireland also receives more foreign direct investment from the US than many larger nations, with investments in Ireland equal to France and Germany combined and, in 2012, more than all of developing Asia put together.\n\nThe use of Shannon Airport as a stop-over point for US forces en route to Iraq has caused domestic controversy in Ireland. Opponents of this policy brought an unsuccessful High Court case against the government in 2003, arguing that this use of Irish airspace violated Irish neutrality.[http://www.bailii.org/ie/cases/IEHC/2003/64.html Horgan v. An Taoiseach & others IEHC 64 (28 April 2003)] — High Court judgement in the unsuccessful case brought by Ed Horgan Restrictions such as carrying no arms, ammunition, or explosives, and that the flights in question did not form part of military exercises or operations were put in place to defend Irish neutrality, however allegations have been made against the Central Intelligence Agency that the airport has been used between 30 and 50 times for illegal extraordinary rendition flights to the U.S.\n\nIn 1995 a decision was made by the U.S. government to appoint a Special Envoy to Northern Ireland to help with the Northern Ireland peace process. During the 2008 presidential campaign in the United States, however, Democratic Party candidate Barack Obama was reported as having questioned the necessity to keep a US Special Envoy for Northern Ireland. His remarks caused uproar within the Republican Party, with Senator John McCain questioning his leadership abilities and his commitment to the ongoing peace process in Northern Ireland.\n\n, Daniel Mulhall is the Irish ambassador to the United States while the position of U.S. ambassador to Ireland is vacant.\n\nEurope\n\nIreland is consistently the most pro-European of EU member states, with 77% of the population approving of EU membership according to a Eurobarometer poll in 2006.[http://ec.europa.eu/public_opinion/archives/eb/eb65/eb65_en.htm Standard Eurobarometer 65] \"Question QA11a: Generally speaking, do you feel that (OUR COUNTRY'S) membership of the European Union is...? Answers: A good thing.\" Survey conducted May–July 2006, published July 2006. Ireland was a founding member of the euro single currency. In May 2004, Ireland was one of only three countries to open its borders to workers from the 10 new member states. EU issues important to Ireland include the Common Agricultural Policy, corporation tax harmonisation and the EU Constitution. The Irish electorate declined to ratify the Treaty of Lisbon in 2008. A second referendum in October 2009 passed the bill, allowing the treaty to be ratified before it was ratified legal guarantees on issues such as the right of Ireland to remain militarily neutral (and not engage in any kind of \"European army\"), the right of the state to maintain its low levels of corporation tax and that the treaty would not change the right to life article in the Irish constitution making abortion illegal and an act of murder under Irish constitutional law.\n\n, Paschal Donohoe is Minister of State for European Affairs at the Department of Foreign Affairs. Ireland has held the Presidency of the Council of the European Union on seven occasions (in 1975, 1979, 1984, 1990, 1996, 2004 and 2013).\n\nAmericas\n\nOceania\n\nAfrica\n\nAsia\n\nOverview\n\nAs of 2008 Ireland maintains diplomatic relations with 173 states (including the Republic of Kosovo), the Holy See and the European Union. \n\nIreland has not yet established diplomatic relations with:\n* Grenada, Saint Kitts and Nevis, Suriname;\n* Benin, Cape Verde, Central African Republic, Comoros, Equatorial Guinea, Madagascar, Mali, Mauritania, São Tomé and Príncipe, South Sudan, Swaziland, Togo;\n* Bhutan\n* Marshall Islands, Niue, Tonga;\n* Sovereign Military Order of Malta;[http://www.orderofmalta.int/diplomatic-relations/862/sovereign-order-of-malta-bilateral-relations/?lang=en Order of Malta diplomatic relations] \n* states with limited recognition except Kosovo.\n\nUnited Nations\n\nThe United Nations was founded in 1945, but Ireland's membership was blocked by the Soviet Union until 1955, \"partly because of Dublin's neutrality\" during the Second World War.[http://www.bbc.com/news/uk-29146042 \"What would Scottish independence mean at the UN?\"], BBC, 10 September 2014 Since 25 July 2007, the Irish ambassador to the UN Office at Geneva has been Dáithí Ó Ceallaigh.[http://www.unog.ch/80256EDD006B9C2E/(httpNewsByYear_en)/D14231BDBCF0FBF4C12573230034705F?OpenDocument United Nations Office at Geneva] — retrieved 7 January 2009   Ireland has been elected to the UN Security Council as a non-permanent member on three occasions — in 1962, in 1981–1982 and most recently in 2001–2002.[http://www.un.int/ireland/ie_un.htm Permanent Mission of Ireland to the United Nations] — retrieved 13 November 2006 \n\nIreland is a member state of the International Criminal Court, having signed the Rome Statute in 1998 and ratified it in 2002.[http://www.icc-cpi.int/asp/statesparties/country&id=70.html International Criminal Court: Ireland] — retrieved 13 November 2006  \n\nIrish Aid, the Government of Ireland’s programme of assistance to developing countries financed the redesign of the UNV Online Volunteering service website in 2008 and supported its operations from 2007 to 2010, which led to a significant growth in the number of online volunteers and the tasks they completed. \n\nPeacekeeping missions\n\nIreland has a long history of participation in UN peacekeeping efforts starting in 1958, just three years after joining the UN. , 85 members of the Irish Defence Forces had been killed on peacekeeping missions.[http://www.military.ie/overseas/irl_un.htm Overseas Service: Ireland and the United Nations]  — from the Irish Defence Forces website. Retrieved 13 November 2006.\n\nList of major peacekeeping operations:[http://www.military.ie/overseas/missions_list.htm Defence Forces Service Overseas: List of Missions]  — from the Irish Defence Forces website. Retrieved 13 November 2006.\n*June 1958 – December 1958: UNOGIL observer mission to Lebanon\n*1958–present: UNTSO mission to the Middle East\n*1960–1964: ONUC mission to Congo\n*1964–present: UNFICYP mission to Cyprus\n*1973–1974: UNEF II mission to Sinai after the Yom Kippur War\n*1978–present: UNIFIL mission to Lebanon\n*1988–1991: UNIIMOG mission to the Iran-Iraq border following the Iran–Iraq War\n*1993–1995: UNOSOM II \"peace enforcement\" mission to Somalia\n*1997–2004: SFOR mission to former Yugoslavia\n*1999–present: KFOR mission to Kosovo\n*1999–2000: INTERFET mission to East Timor\n*2003–present: UNMIL mission to Liberia\n*2008–present: EUFOR Chad/CAR mission to Chad and the Central African Republic\n\nAs well as these missions, Irish personnel have served as observers in Central America, Russia, Cambodia, Afghanistan, Namibia, Western Sahara, Kuwait and South Africa.\n\nIreland and the Commonwealth of Nations\n\nSee also: The Republic of Ireland and the Commonwealth of Nations.\n\nIreland was a member state of the British Commonwealth from 1922 until 1949, initially as a Dominion called the Irish Free State from 1922 until 1937, when Ireland adopted a new constitution and changed the name of the state to \"Ireland\". Although the king was removed from the Constitution in 1936, a republic was only formally declared from 18 April 1949. Under the rules at the time, a republic could not be a member state of the Commonwealth. This was changed a week later with the adoption of the London Declaration.\n\nSince 1998, some people in Ireland have advocated joining the Commonwealth of Nations, most notably Éamon Ó Cuív and Mary Kenny.\n\nInternational organisations\n\nIreland is a member of or otherwise participates in the following international organisations:[https://www.cia.gov/library/publications/the-world-factbook/geos/ei.html CIA – The World Factbook – Ireland] — CIA World Factbook entry . Retrieved 15 November 2006.\n\nForeign aid\n\nIreland's aid program was founded in 1974, and in 2006 its budget amounted to €734 million. The government has set a target of reaching the Millennium Development Goal of 0.7% of Gross National Product in aid by 2012, a target which is projected to amount to €1.5 billion based on current GNP growth.[http://www.irishaid.gov.ie/latest_news.asp?article\n710 Ireland’s Overseas Aid Increases by 11.4%] — Irish government press release, 4 April 2006. Irish development aid is concentrated on eight priority countries: Lesotho, Mozambique, Tanzania, Ethiopia, Zambia, Uganda, Vietnam and East Timor.[http://www.irishaid.gov.ie/about_faqs.asp Irish Aid: Frequently Asked Questions] — Irish government website. Retrieved 13 November 2006. In 2006, Malawi was announced as the ninth priority country, with a tenth country to follow.[http://www.irishaid.gov.ie/whitepaper/ Irish government white paper on aid] — Irish government white paper, 2006 Aid has had to be reduced because of the Irish financial crisis.\n\nHuman rights\n\nThere have been no serious civil, human or social rights abuses/problems in the State, according to Amnesty International and the U.S. State Department. The country consistently comes among the top nations in terms of freedom and rights ratings.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Foreign relations of the Republic of Ireland" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14682" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The foreign relations of Ireland are substantially influenced by its membership of the European Union, although bilateral relations with the United States and United Kingdom are also important to the state. It is one of the group of smaller nations in the EU, and has traditionally followed a non-aligned foreign policy. Ireland has historically tended towards independence in foreign military policy, thus it is not a member of the North Atlantic Treaty Organisation and has a longstanding  policy of military neutrality. This policy has been moderated in recent years and the country is an important staging-post for US troops in Western Europe. According to the Irish Defence Forces, the neutrality policy has helped them to be successful in their contributions to United Nations peace-keeping missions since 1960 (in the Congo Crisis) and subsequently in Cyprus, Lebanon and Bosnia and Herzegovina.\n\nMain relationships\n\nChina\n\nIreland's official relationship with the People's Republic of China began on 22 June 1979.Centre for Asian Studies, University Collete Dublin, China the Emerging Power: Prospects for Sino-Irish Relations, By Keisha Carty, Asia Correspondent, The Irish Times Following his visit to China in 1999, former Tao Searcher Bertie Ahern authorised the establishment of an Asia Strategy.Irish Department of Foreign Affairs: a Decade of the Asia Strategy The aim of this Strategy was to ensure that the Irish Government and Irish enterprise work coherently to enhance the important relationships between Ireland and Asia. In recent years due to the rapid expansion of the Chinese economy, China is becoming a key trade partner of Ireland, with over $6bn worth of bilateral trade between the two countries in 2010. In July 2013, the Irish Tánaiste and Minister for Foreign Affairs and Trade were invited to China by the Chinese foreign minister Wang Yi on a trade mission to boost both investment and political ties between the two countries.\n\nIreland has raised its concerns in the area of human rights with China on a number of occasions. On 12 May 2007, during a visit to Beijing, former Taoiseach Brian Cowen (then Minister for Finance) discussed human rights issues with Chinese Foreign Minister Li Zhaoxing.Oireachtas: WRITTEN answer on Wednesday, 31 January 2007. Ref No: 43859/06 Former Tánaiste Mary Coughlan also raised human rights issues and concerns with visiting Chinese Vice-Premier Zeng Peiyan. Ireland also participates in the EU-China Human Rights Dialogue.\n\nConcerning the Taiwan issue, Ireland follows a One-China policy. In 2007, the former Irish Minister for Foreign Affairs, Dermot Ahern summarised the Irish position as follows:Oireachtas: ORAL answer on Thursday, 8 February 2007 by the former Minister for Foreign Affairs (Ref No: 3911/07)\n\nThe former Minister's emphasis on the One China policy and to the Taiwan issue being best settled through dialogue \"between the parties concerned\" was consistent with Beijing's wish that the Taiwan issue be regarded as a domestic one between Chinese on both sides of the Taiwan Straits.\n\nUnited Kingdom\n\nSince at least the 1600s Ireland has had political connections with the United Kingdom, with the whole island becoming a part of the United Kingdom of Great Britain and Ireland from 1801 to 1922. From the time of Ireland declaring itself independent from the United Kingdom in 1937, the two countries have been involved in a dispute over the status of Northern Ireland. Articles 2 and 3 of the Constitution of Ireland formerly claimed Northern Ireland as a part of the \"national territory\", though in practice the Irish government did recognise the UK's jurisdiction over the region.\nFrom the onset of the Troubles in 1969, the two governments sought to bring the violence to an end. The Sunningdale Agreement of 1973 and the Anglo-Irish Agreement of 1985 were important steps in this process. In 1998, both states signed the Good Friday Agreement and now co-operate closely to find a solution to the region's problems. Articles 2 and 3 of the Constitution of Ireland were amended as part of this agreement, the territorial claim being replaced with a statement of aspiration to unite the people of the island of Ireland. As part of the Good Friday Agreement, the states also ended their dispute over their respective names: Ireland and the United Kingdom of Great Britain and Northern Ireland. Each agreed to accept and use the others' correct name.\n\nWhen the Troubles were raging in Northern Ireland, the Irish Government sought, with mixed success, to prevent the import of weapons and ammunition through its territory by illegal paramilitary organisations for use in their conflict with the security forces in Northern Ireland. In 1973 three ships of the Irish Naval Service intercepted a ship carrying weapons from Libya which were probably destined for Irish Republican paramilitaries. Law enforcement acts such as these additionally improved relations with the government of the United Kingdom. However, the independent judiciary blocked a number of attempts to extradite suspects between 1970 and 1998 on the basis that their crime might have been 'political' and thus contrary to international law at the time.\n\nIreland is one of the parties to the Rockall continental shelf dispute that also involves Denmark, Iceland, and the United Kingdom. Ireland and the United Kingdom have signed a boundary agreement in the Rockall area. However, neither have concluded similar agreements with Iceland or Denmark (on behalf of the Faroe Islands) and the matter remains under negotiation. Iceland now claims a substantial area of the continental shelf to the west of Ireland, to a point 49°48'N 19°00'W, which is further south than Ireland.\n\nThe controversial Sellafield nuclear fuel reprocessing plant in north-western England has also been a contentious issue between the two governments. The Irish government has sought the closure of the plant, taking a case against the UK government under the United Nations Convention on the Law of the Sea. However, the European Court of Justice found that the case should have been dealt with under EU law.[http://www.europarl.europa.eu/news/expert/infopress_page/064-4617-023-01-04-911-20060123IPR04616-23-01-2006-2006-false/default_en.htm Irish Government must pursue Sellafield case via EU]  — European Parliament press release, 8 June 2006. In 2006, however, both countries came to a friendly agreement which enabled both the Radiological Protection Institute of Ireland and the Garda Síochána (Irish Police Force) access to the site to conduct investigations.\n\nUnited States\n\nThe United States recognised the Irish Free State on 28 June 1924 with diplomatic relations being established on 7 October 1924. In 1927, the United States opened an American Legation in Dublin. Due to the ancestral ties between the two countries, Ireland and the US have a strong relationship, both politically and economically, with the US being Ireland's biggest trading partner since 2000. Ireland also receives more foreign direct investment from the US than many larger nations, with investments in Ireland equal to France and Germany combined and, in 2012, more than all of developing Asia put together.\n\nThe use of Shannon Airport as a stop-over point for US forces en route to Iraq has caused domestic controversy in Ireland. Opponents of this policy brought an unsuccessful High Court case against the government in 2003, arguing that this use of Irish airspace violated Irish neutrality.[http://www.bailii.org/ie/cases/IEHC/2003/64.html Horgan v. An Taoiseach & others IEHC 64 (28 April 2003)] — High Court judgement in the unsuccessful case brought by Ed Horgan Restrictions such as carrying no arms, ammunition, or explosives, and that the flights in question did not form part of military exercises or operations were put in place to defend Irish neutrality, however allegations have been made against the Central Intelligence Agency that the airport has been used between 30 and 50 times for illegal extraordinary rendition flights to the U.S.\n\nIn 1995 a decision was made by the U.S. government to appoint a Special Envoy to Northern Ireland to help with the Northern Ireland peace process. During the 2008 presidential campaign in the United States, however, Democratic Party candidate Barack Obama was reported as having questioned the necessity to keep a US Special Envoy for Northern Ireland. His remarks caused uproar within the Republican Party, with Senator John McCain questioning his leadership abilities and his commitment to the ongoing peace process in Northern Ireland.\n\n, Daniel Mulhall is the Irish ambassador to the United States while the position of U.S. ambassador to Ireland is vacant.\n\nEurope\n\nIreland is consistently the most pro-European of EU member states, with 77% of the population approving of EU membership according to a Eurobarometer poll in 2006.[http://ec.europa.eu/public_opinion/archives/eb/eb65/eb65_en.htm Standard Eurobarometer 65] \"Question QA11a: Generally speaking, do you feel that (OUR COUNTRY'S) membership of the European Union is...? Answers: A good thing.\" Survey conducted May–July 2006, published July 2006. Ireland was a founding member of the euro single currency. In May 2004, Ireland was one of only three countries to open its borders to workers from the 10 new member states. EU issues important to Ireland include the Common Agricultural Policy, corporation tax harmonisation and the EU Constitution. The Irish electorate declined to ratify the Treaty of Lisbon in 2008. A second referendum in October 2009 passed the bill, allowing the treaty to be ratified before it was ratified legal guarantees on issues such as the right of Ireland to remain militarily neutral (and not engage in any kind of \"European army\"), the right of the state to maintain its low levels of corporation tax and that the treaty would not change the right to life article in the Irish constitution making abortion illegal and an act of murder under Irish constitutional law.\n\n, Paschal Donohoe is Minister of State for European Affairs at the Department of Foreign Affairs. Ireland has held the Presidency of the Council of the European Union on seven occasions (in 1975, 1979, 1984, 1990, 1996, 2004 and 2013).\n\nAmericas\n\nOceania\n\nAfrica\n\nAsia\n\nOverview\n\nAs of 2008 Ireland maintains diplomatic relations with 173 states (including the Republic of Kosovo), the Holy See and the European Union. \n\nIreland has not yet established diplomatic relations with:\n* Grenada, Saint Kitts and Nevis, Suriname;\n* Benin, Cape Verde, Central African Republic, Comoros, Equatorial Guinea, Madagascar, Mali, Mauritania, São Tomé and Príncipe, South Sudan, Swaziland, Togo;\n* Bhutan\n* Marshall Islands, Niue, Tonga;\n* Sovereign Military Order of Malta;[http://www.orderofmalta.int/diplomatic-relations/862/sovereign-order-of-malta-bilateral-relations/?lang=en Order of Malta diplomatic relations] \n* states with limited recognition except Kosovo.\n\nUnited Nations\n\nThe United Nations was founded in 1945, but Ireland's membership was blocked by the Soviet Union until 1955, \"partly because of Dublin's neutrality\" during the Second World War.[http://www.bbc.com/news/uk-29146042 \"What would Scottish independence mean at the UN?\"], BBC, 10 September 2014 Since 25 July 2007, the Irish ambassador to the UN Office at Geneva has been Dáithí Ó Ceallaigh.[http://www.unog.ch/80256EDD006B9C2E/(httpNewsByYear_en)/D14231BDBCF0FBF4C12573230034705F?OpenDocument United Nations Office at Geneva] — retrieved 7 January 2009   Ireland has been elected to the UN Security Council as a non-permanent member on three occasions — in 1962, in 1981–1982 and most recently in 2001–2002.[http://www.un.int/ireland/ie_un.htm Permanent Mission of Ireland to the United Nations] — retrieved 13 November 2006 \n\nIreland is a member state of the International Criminal Court, having signed the Rome Statute in 1998 and ratified it in 2002.[http://www.icc-cpi.int/asp/statesparties/country&id=70.html International Criminal Court: Ireland] — retrieved 13 November 2006  \n\nIrish Aid, the Government of Ireland’s programme of assistance to developing countries financed the redesign of the UNV Online Volunteering service website in 2008 and supported its operations from 2007 to 2010, which led to a significant growth in the number of online volunteers and the tasks they completed. \n\nPeacekeeping missions\n\nIreland has a long history of participation in UN peacekeeping efforts starting in 1958, just three years after joining the UN. , 85 members of the Irish Defence Forces had been killed on peacekeeping missions.[http://www.military.ie/overseas/irl_un.htm Overseas Service: Ireland and the United Nations]  — from the Irish Defence Forces website. Retrieved 13 November 2006.\n\nList of major peacekeeping operations:[http://www.military.ie/overseas/missions_list.htm Defence Forces Service Overseas: List of Missions]  — from the Irish Defence Forces website. Retrieved 13 November 2006.\n*June 1958 – December 1958: UNOGIL observer mission to Lebanon\n*1958–present: UNTSO mission to the Middle East\n*1960–1964: ONUC mission to Congo\n*1964–present: UNFICYP mission to Cyprus\n*1973–1974: UNEF II mission to Sinai after the Yom Kippur War\n*1978–present: UNIFIL mission to Lebanon\n*1988–1991: UNIIMOG mission to the Iran-Iraq border following the Iran–Iraq War\n*1993–1995: UNOSOM II \"peace enforcement\" mission to Somalia\n*1997–2004: SFOR mission to former Yugoslavia\n*1999–present: KFOR mission to Kosovo\n*1999–2000: INTERFET mission to East Timor\n*2003–present: UNMIL mission to Liberia\n*2008–present: EUFOR Chad/CAR mission to Chad and the Central African Republic\n\nAs well as these missions, Irish personnel have served as observers in Central America, Russia, Cambodia, Afghanistan, Namibia, Western Sahara, Kuwait and South Africa.\n\nIreland and the Commonwealth of Nations\n\nSee also: The Republic of Ireland and the Commonwealth of Nations.\n\nIreland was a member state of the British Commonwealth from 1922 until 1949, initially as a Dominion called the Irish Free State from 1922 until 1937, when Ireland adopted a new constitution and changed the name of the state to \"Ireland\". Although the king was removed from the Constitution in 1936, a republic was only formally declared from 18 April 1949. Under the rules at the time, a republic could not be a member state of the Commonwealth. This was changed a week later with the adoption of the London Declaration.\n\nSince 1998, some people in Ireland have advocated joining the Commonwealth of Nations, most notably Éamon Ó Cuív and Mary Kenny.\n\nInternational organisations\n\nIreland is a member of or otherwise participates in the following international organisations:[https://www.cia.gov/library/publications/the-world-factbook/geos/ei.html CIA – The World Factbook – Ireland] — CIA World Factbook entry . Retrieved 15 November 2006.\n\nForeign aid\n\nIreland's aid program was founded in 1974, and in 2006 its budget amounted to €734 million. The government has set a target of reaching the Millennium Development Goal of 0.7% of Gross National Product in aid by 2012, a target which is projected to amount to €1.5 billion based on current GNP growth.[http://www.irishaid.gov.ie/latest_news.asp?article\n710 Ireland’s Overseas Aid Increases by 11.4%] — Irish government press release, 4 April 2006. Irish development aid is concentrated on eight priority countries: Lesotho, Mozambique, Tanzania, Ethiopia, Zambia, Uganda, Vietnam and East Timor.[http://www.irishaid.gov.ie/about_faqs.asp Irish Aid: Frequently Asked Questions] — Irish government website. Retrieved 13 November 2006. In 2006, Malawi was announced as the ninth priority country, with a tenth country to follow.[http://www.irishaid.gov.ie/whitepaper/ Irish government white paper on aid] — Irish government white paper, 2006 Aid has had to be reduced because of the Irish financial crisis.\n\nHuman rights\n\nThere have been no serious civil, human or social rights abuses/problems in the State, according to Amnesty International and the U.S. State Department. The country consistently comes among the top nations in terms of freedom and rights ratings. Foreign relations of the Republic of Ireland. http://en.wikipedia.org/?curid=14682."
  }
}
