{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15927",
  "eid" : "21b7f380-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778565816,
  "textBody" : "James Graham Ballard (15 November 193019 April 2009) was an English novelist, short story writer, and essayist. Born in an international settlement in Shanghai to British parents before his family emigrated to the UK, Ballard began writing in the 1950s, becoming associated with the New Wave of science fiction with post-apocalyptic novels such as The Wind from Nowhere (1961) and The Drowned World (1962). In the late 1960s, he produced a variety of experimental short stories (or \"condensed novels\"), such as those collected in the controversial  The Atrocity Exhibition (1970). In the mid 1970s, Ballard published several novels, among them the highly controversial Crash (1973), a story about symphorophilia and car crash fetishism, and High-Rise (1975), a depiction of a luxury apartment building's descent into violent chaos.\n\nWhile much of Ballard's fiction would prove thematically and stylistically provocative, he became best known for his relatively conventional war novel, Empire of the Sun (1984), a semi-autobiographical account of a young British boy's experiences in Shanghai during Japanese occupation. Described by The Guardian as \"the best British novel about the Second World War\", the story was adapted into a 1987 film by Steven Spielberg starring Christian Bale. In the following decades until his death in 2009, Ballard's work shifted toward the form of the traditional crime novel. Several of his earlier works have been adapted into films, including David Cronenberg's controversial 1996 adaptation of Crash and Ben Wheatley's 2015 adaptation of High-Rise.\n\nThe literary distinctiveness of Ballard's fiction has given rise to the adjective \"Ballardian\", defined by the Collins English Dictionary as \"resembling or suggestive of the conditions described in J. G. Ballard's novels and stories, especially dystopian modernity, bleak man-made landscapes and the psychological effects of technological, social or environmental developments\".  The Oxford Dictionary of National Biography entry describes Ballard's work as being occupied with \"eros, thanatos, mass media and emergent technologies\".Will Self, [http://www.oxforddnb.com/view/article/101436, ‘Ballard, James Graham (1930–2009)’], Oxford Dictionary of National Biography, Oxford University Press, Jan 2013, accessed 3 Jan 2013, \n\nLife \n\nShanghai\n\nBallard's father was a chemist at a Manchester-based textile firm, the Calico Printers' Association, and became chairman and managing director of its subsidiary in Shanghai, the China Printing and Finishing Company. His mother was Edna,  Johnstone. Ballard was born and raised in the Shanghai International Settlement, an area under foreign control where people \"lived an American style of life\".Pringle, D. (Ed.) and Ballard, J.G. (1982). \"From Shanghai to Shepperton\". Re/Search 8/9: J.G. Ballard: 112–124. .  He was sent to the Cathedral School, the Anglican Holy Trinity Church near the Bund,  Shanghai.[http://www.timeoutshanghai.com/features/Books__Film-Book_features/11260/JG-Ballard-in-Shanghai.html JG Ballard in Shanghai - Books & Film - Time Out Shanghai] After the outbreak of the Second Sino-Japanese War, Ballard's family were forced to evacuate their suburban home temporarily and rent a house in central Shanghai to avoid the shells fired by Chinese and Japanese forces.\n\nAfter the Japanese attack on Hong Kong, the Japanese occupied the International Settlement in Shanghai. In early 1943, they began to intern Allied civilians, and Ballard was sent to the Lunghua Civilian Assembly Center with his parents and younger sister. He spent over two years, the remainder of World War II, in the internment camp. His family lived in a small area in G block, a two-story residence for 40 families. He attended school in the camp, the teachers being camp inmates from a number of professions. These experiences formed the basis of Empire of the Sun, although Ballard exercised considerable artistic licence in writing the book, such as the removal of his parents from the bulk of the story.Ballard, J.G. (4 March 2006). \"[http://film.guardian.co.uk/features/featurepages/0,,1722984,00.html Look back at Empire]\". The Guardian. Retrieved on 25 April 2009.\n\nIt has been supposed that Ballard's exposure to the atrocities of war at an impressionable age explains the apocalyptic and violent nature of much of his fiction.Cowley, J. (4 November 2001). \"[http://books.guardian.co.uk/reviews/generalfiction/0,6121,587000,00.html The Ballard of Shanghai jail]\". The Observer. Retrieved on 25 April 2009.Hall, C. \"[http://www.spikemagazine.com/0697lard.php JG Ballard: Extreme Metaphor: A Crash Course in the Fiction Of JG Ballard]\". Retrieved on 25 April 2009.Livingstone, D.B. (1996?). \"[http://www.spikemagazine.com/0899ballard.php J.G. Ballard: Crash: Prophet with Honour]\". Retrieved 12 March 2006. Martin Amis wrote that Empire of the Sun \"gives shape to what shaped him.\" However, Ballard's own account of the experience was more nuanced: \"I don't think you can go through the experience of war without one's perceptions of the world being forever changed. The reassuring stage set that everyday reality in the suburban west presents to us is torn down; you see the ragged scaffolding, and then you see the truth beyond that, and it can be a frightening experience.\" But also: \"I have—I won't say happy—not unpleasant memories of the camp. [...] I remember a lot of the casual brutality and beatings-up that went on—but at the same time we children were playing a hundred and one games all the time!\" Ballard later became an atheist.Welch, Frances. \"All Praise and Glory to the Mind of Man\". Ballard confesses to being an atheist, but adds: \"that said, I'm extremely interested in religion... I see religion as a key to all sorts of mysteries that surround the human consciousness.\"\n\nBritain and Canada\n\nIn late 1945, after the end of the war, his mother returned to Britain with Ballard and his sister on the SS Arawa. They lived in the outskirts of Plymouth, and he attended The Leys School in Cambridge. He won an essay prize whilst at the school but did not contribute to the school magazine. After a couple of years his mother and sister returned to China, rejoining Ballard's father, leaving Ballard to live with his grandparents when not boarding at school. In 1949 he went on to study medicine at King's College, Cambridge, with the intention of becoming a psychiatrist.[http://www.theparisreview.org/interviews/2929/the-art-of-fiction-no-85-j-g-ballard Paris Review - J. G. Ballard, The Art of Fiction No. 85]\n\nAt university, Ballard was writing avant-garde fiction heavily influenced by psychoanalysis and surrealist painters. At this time, he wanted to become a writer as well as pursue a medical career. In May 1951, when Ballard was in his second year at Cambridge, his short story \"The Violent Noon\", a Hemingwayesque pastiche written to please the contest's jury, won a crime story competition and was published in the student newspaper Varsity.\n\nEncouraged by the publication of his story and realising that clinical medicine would not leave him time to write, Ballard abandoned his medical studies, and in October 1951 he enrolled at Queen Mary College to read English Literature. However, he was asked to leave at the end of the year. Ballard then worked as a copywriter for an advertising agency[http://www.lrb.co.uk/v30/n07/thomas-jones/whisky-and-soda-man Thomas Jones reviews ‘Miracles of Life’ by J.G. Ballard · LRB 10 April 2008] and as an encyclopaedia salesman. He kept writing short fiction but found it impossible to get published.\n\nIn spring 1954 Ballard joined the Royal Air Force and was sent to the Royal Canadian Air Force flight-training base in Moose Jaw, Saskatchewan, Canada.  There he discovered science fiction in American magazines. While in the RAF, he also wrote his first science fiction story, \"Passport to Eternity\", as a pastiche and summary of the American science fiction he had read.  The story did not see publication until 1962.\n\nBallard left the RAF in 1955 after thirteen months and returned to England.London Gazette, 1 July 1955. In 1955 he married Helen Mary Matthews and settled in Chiswick, the first of their three children being born the following year. He made his science fiction debut in 1956 with two short stories, \"Escapement\" and \"Prima Belladonna\", published in the December 1956 issues of New Worlds and Science Fantasy respectively.  The editor of New Worlds, Edward J. Carnell, would remain an important supporter of Ballard's writing and would publish nearly all of his early stories.\n\nFrom 1958 Ballard worked as assistant editor on the scientific journal Chemistry and Industry. His interest in art led to his involvement in the emerging Pop Art movement, and in the late fifties he exhibited a number of collages that represented his ideas for a new kind of novel. Ballard's avant-garde inclinations did not sit comfortably in the science fiction mainstream of that time, which held attitudes he considered philistine. Briefly attending the 1957 Science Fiction Convention in London, Ballard left disillusioned and demoralised and did not write another story for a year. By the late 1960s, however, he had become an editor of the avant-garde Ambit magazine, which was more in keeping with his aesthetic ideals.\n\nFull-time writing career\n\nIn 1960 Ballard moved with his family to the middle-class London suburb of Shepperton in Surrey, where he lived for the rest of his life and which would later give rise to his moniker as the \"Seer of Shepperton\". Finding that commuting to work did not leave him time to write, Ballard decided he had to make a break and become a full-time writer. He wrote his first novel, The Wind from Nowhere, over a two-week holiday simply to gain a foothold as a professional writer, not intending it as a \"serious novel\"; in books published later, it is omitted from the list of his works. When it was successfully published in January 1962, he resigned from his job at Chemistry and Industry, and from then on supported himself and his family as a writer.\n\nLater that year his second novel, The Drowned World, was published, establishing Ballard as a notable figure in the fledgling New Wave movement of science fiction. Collections of his stories started getting published, and he began a period of great literary productivity, while pushing to expand the scope of acceptable material for science fiction with such stories as \"The Terminal Beach\".\n\nIn 1964 Ballard's wife Mary died suddenly of pneumonia, leaving him to raise their three children – James, Fay and Bea Ballard – by himself.The autobiographical novel The Kindness of Women gives a different, fictionalised account of her death. Ballard never remarried; however, a few years later his friend and fellow author Michael Moorcock introduced him to Claire Walsh, who became his partner for the rest of his life (he died at her London residence),\"Author J. G. Ballard dies at 78\", Deseret News, 20 April 2009, p. A12 and is often referred to in his writings as \"Claire Churchill\". After the profound shock of his wife's death, Ballard began in 1965 to write the stories that became The Atrocity Exhibition, while continuing to produce stories within the science fiction genre.\n\nIn 1967 Algis Budrys listed Ballard, Brian W. Aldiss, Roger Zelazny, and Samuel R. Delany as \"an earthshaking new kind of\" writers, and leaders of the New Wave. The Atrocity Exhibition (1969) proved controversial – it was the subject of an obscenity trial, and in the United States, publisher Doubleday destroyed almost the entire print run before it was distributed – but it gained Ballard recognition as a literary writer. It remains one of his iconic works, and was filmed in 2001.\n\nA chapter of The Atrocity Exhibition is titled \"Crash!\", and in 1970 Ballard organised an exhibition of crashed cars at the New Arts Laboratory, simply called \"Crashed Cars\". The crashed vehicles were displayed without commentary, inspiring vitriolic responses and vandalism.Ballard, J.G. (1993). The Atrocity Exhibition (expanded and annotated edition). . In both the story and the art exhibition, Ballard dealt with the sexual potential of car crashes, a preoccupation he also explored in a short film in which he appeared with Gabrielle Drake in 1971. His fascination with the topic culminated in the novel Crash in 1973. The main character of Crash is called James Ballard and lives in Shepperton, though other biographical details do not match the writer, and curiosity about the relationship between the character and his author increased when Ballard suffered a serious automobile accident shortly after completing the novel. Regardless of real-life basis, Crash, like The Atrocity Exhibition, was also controversial upon publication. In 1996, the film adaptation by David Cronenberg was met by a tabloid uproar in the UK, with the Daily Mail campaigning actively for it to be banned. In the years following the initial publication of Crash, Ballard produced two further novels: 1974's Concrete Island, about a man who becomes stranded in the waste area of a high-speed motorway, and High-Rise, about a modern luxury high rise apartment building's descent into tribal warfare.\n\nAlthough Ballard published several novels and short story collections throughout the seventies and eighties, his breakthrough into the mainstream came only with Empire of the Sun in 1984, based on his years in Shanghai and the Lunghua internment camp. It became a best-seller,Collinson, G. \"[http://www.bbc.co.uk/bbcfour/cinema/features/empire-of-the-sun.shtml Empire of the Sun] \". BBC Four article on the film and novel. Retrieved on 25 April 2009. was shortlisted for the Booker Prize and awarded the Guardian Fiction Prize and James Tait Black Memorial Prize for fiction. It made Ballard known to a wider audience, although the books that followed failed to achieve the same degree of success. Empire of the Sun was filmed by Steven Spielberg in 1987, starring a young Christian Bale as Jim (Ballard). Ballard himself appears briefly in the film, and he has described the experience of seeing his childhood memories reenacted and reinterpreted as bizarre.\nBallard continued to write until the end of his life, and also contributed occasional journalism and criticism to the British press. Of his later novels, Super-Cannes (2000) was particularly well received, winning the regional Commonwealth Writers' Prize. These later novels often marked a move away from science fiction, instead engaging with elements of a traditional crime novel. Ballard was offered a CBE in 2003, but refused, calling it \"a Ruritanian charade that helps to prop up our top-heavy monarchy\". In June 2006, he was diagnosed with terminal prostate cancer, which metastasised to his spine and ribs. The last of his books published in his lifetime was the autobiography Miracles of Life, written after his diagnosis. His final published short story, \"The Dying Fall\", appeared in the 1996 issue 106 of Interzone, a British sci-fi magazine. It was reproduced in The Guardian on 25 April 2009.Ballard, JG. [https://www.theguardian.com/books/2009/apr/25/dying-fall-jg-ballard The Dying Fall], The Guardian, 25 April 2009.\n\nPosthumous publication\n\nIn October 2008, before his death, Ballard's literary agent Margaret Hanbury brought an outline for a book by Ballard with the working title Conversations with My Physician: The Meaning, if Any, of Life to the Frankfurt Book Fair. The physician in question is oncologist Professor Jonathan Waxman of Imperial College, London, who was treating Ballard for prostate cancer. While it was to be in part a book about cancer, and Ballard's struggle with it, it reportedly was to move on to broader themes. In April 2009 The Guardian reported that HarperCollins announced that Ballard's \"Conversations With My Physician\" could not be finished and plans to publish it were abandoned. In 2013, a 17-page untitled typescript listed as \"Vermilion Sands short story in draft\" in the British Library catalogue and edited into an 8,000-word text by Bernard Sigaud appeared in a short-lived French reissue of the collection () under the title \"Le labyrinthe Hardoon\" as the first story of the cycle, tentatively dated \"late 1955/early 1956\" by Sigaud and others.Horrocks, Chris, \"Disinterring the Present: Science Fiction, Media Technology and the Ends of the Archive\", 'Journal of Visual Culture, 2013 Vol 12(3): 414–430\n\nArchive\n\nIn June 2010 the British Library acquired Ballard's personal archives under the British government's acceptance in lieu scheme for death duties. The archive contains eighteen holograph manuscripts for Ballard's novels, including the 840-page manuscript for Empire of the Sun, plus correspondence, notebooks, and photographs from throughout his life. In addition, two typewritten manuscripts for The Unlimited Dream Company are held at the Harry Ransom Center at the University of Texas at Austin.\n\nDystopian fiction\n\nWith the exception of his autobiographical novels, Ballard most commonly wrote in the post-apocalyptic dystopia genre.\n\nHis most celebrated novel in this regard is Crash, in which cars symbolise the mechanisation of the world and man's capacity to destroy himself with the technology he creates. The characters (the protagonist, called Ballard, included) become increasingly obsessed with the violent psychosexuality of car crashes in general, and celebrity car crashes in particular. Ballard's disturbing novel was turned into a controversial—and likewise disturbing—cerebral film by David Cronenberg.\n\nParticularly revered among Ballard's admirers is his short story collection Vermilion Sands (1971), set in an eponymous desert resort town inhabited by forgotten starlets, insane heirs, very eccentric artists, and the merchants and bizarre servants who provide for them. Each story features peculiarly exotic technology such as cloud-carving sculptors performing for a party of eccentric onlookers, poetry-composing computers, orchids with operatic voices and egos to match, phototropic self-painting canvases, etc. In keeping with Ballard's central themes, most notably technologically mediated masochism, these tawdry and weird technologies service the dark and hidden desires and schemes of the human castaways who occupy Vermilion Sands, typically with psychologically grotesque and physically fatal results. In his introduction to Vermilion Sands, Ballard cites this as his favourite collection.\n\nIn a similar vein, his collection Memories of the Space Age explores many varieties of individual and collective psychological fallout from—and initial deep archetypal motivations for—the American space exploration boom of the 1960s and 1970s.\n\nCommentators such as Will Self have described much of his fiction as being concerned with 'idealised gated communities; the affluent, and the ennui of affluence [where] the virtualised world is concretised in the shape of these gated developments.' He added in these fictional settings 'there is no real pleasure to be gained; sex is commodified and devoid of feeling and there is no relationship with the natural world. These communities then implode into some form of violence.'[http://www.watershed.co.uk/audio-video/john-gray-and-will-self-jg-ballard Water Shed - John Gray and Will Self - JG Ballard] Budrys, however, mocked his fiction as \"call[ing] for people who don't think ... to be the protagonist of a J. G. Ballard novel, or anything more than a very minor character therein, you must have cut yourself off from the entire body of scientific education\".\n\nIn addition to his novels, Ballard made extensive use of the short story form. Many of his earliest published works in the 1950s and 1960s were short stories.  In an essay on Ballard, Will Wiles notes how his short stories 'have a lingering fascination with the domestic interior, with furnishing and appliances,' adding, 'it’s a landscape that he distorts until it shrieks with anxiety'. He concludes that 'what Ballard saw, and what he expressed in his novels, was nothing less than the effect that the technological world, including our built environment, was having upon our minds and bodies.' [https://placesjournal.org/article/the-corner-of-lovecraft-and-ballard/?gclid=EAIaIQobChMI_4S3pvrY1QIVw7ftCh0sBQ_kEAAYASAAEgJj2_D_BwE Places Journal - The Corner of Lovecraft and Ballard]\n\nTelevision\n\nOn 13 December 1965, BBC Two screened an adaptation of the short story \"Thirteen to Centaurus\" directed by Peter Potter. The one-hour drama formed part of the first season of Out of the Unknown and starred Donald Houston as Dr Francis and James Hunter as Abel Granger. In 2003, Ballard's short story \"The Enormous Space\" (first published in the Science fiction magazine Interzone in 1989, subsequently printed in the collection of Ballard's short stories War Fever) was adapted into an hour-long television film for the BBC entitled Home by Richard Curson Smith, who also directed it. The plot follows a middle class man who chooses to abandon the outside world and restrict himself to his house, becoming a hermit.\n\nInfluence\n\nBallard is cited as an important forebear of the cyberpunk movement by Bruce Sterling in his introduction to the seminal Mirrorshades anthology. Ballard's parody of American politics, the pamphlet \"Why I Want to Fuck Ronald Reagan\", which was subsequently included as a chapter in his experimental novel The Atrocity Exhibition, was photocopied and distributed by pranksters at the 1980 Republican National Convention. In the early 1970s, Bill Butler, a bookseller in Brighton, was prosecuted under UK obscenity laws for selling the pamphlet.\n\nIn his 2002 book Straw Dogs, the philosopher John Gray acknowledges Ballard as a major influence on his ideas. Ballard described the book as a \"clear-eyed assessment of human nature and our almost unlimited gift for self-delusion.\"\n\nAccording to literary theorist Brian McHale, The Atrocity Exhibition is a \"postmodernist text based on science fiction topoi.\"Brian McHale, Postmodernist Fiction Luckhurst, Roger. [https://web.archive.org/web/20020602193625/http://www.depauw.edu/sfs/backissues/55/luckhurst55art.htm \"Border Policing: Postmodernism and Science Fiction\"] Science Fiction Studies (November 1991)\n\nLee Killough directly cites Ballard's seminal Vermilion Sands short stories as the inspiration for her collection Aventine, also a backwater resort for celebrities and eccentrics where bizarre or frivolous novelty technology facilitates the expression of dark intents and drives. Terry Dowling's milieu of Twilight Beach is also influenced by the stories of Vermilion Sands and other Ballard works.\n\nIn Simulacra and Simulation, Jean Baudrillard hailed Crash as the \"first great novel of the universe of simulation.\"\n\nBallard also had an interest in the relationship between various media. In the early 1970s, he was one of the trustees of the Institute for Research in Art and Technology.[http://www.jgballard.ca/media/1971_april_books_and_bookmen_magazine.html JG Ballard Interviewed by Douglas Reed]\n\nIn popular music\n\nBallard has had a notable influence on popular music, where his work has been used as a basis for lyrical imagery, particularly amongst British post-punk and industrial groups. Examples include albums such as Metamatic by John Foxx, various songs by Joy Division (most famously \"Atrocity Exhibition\" from Closer), \"High Rise\" by Hawkwind, \"Miss the Girl\" by The Creatures (based on Crash), \"Down in the Park\" by Gary Numan, \"Chrome Injury\" by The Church, \"Drowned World\" by Madonnahttp://www.slantmagazine.com/features/article/madonna-new-york-ny-july-25-2001 and \"Warm Leatherette\" by The Normal. Songwriters Trevor Horn and Bruce Woolley credit Ballard's story \"The Sound-Sweep\" with inspiring The Buggles' hit \"Video Killed the Radio Star\", and the Buggles' second album included a song entitled \"Vermillion Sands.\" The 1978 post-punk band Comsat Angels took their name from one of Ballard's short stories. The Manic Street Preachers include a sample from an interview with Ballard in their song \"Mausoleum\". Klaxons named their debut album Myths of the Near Future after one of Ballard's short story collections. The Sound of Animals Fighting took the name of the song \"The Heraldic Beak of the Manufacturer's Medallion\" from Crash. The song \"Terminal Beach\" by the American band Yacht is a tribute to his short story collection that goes by the same name.\n\nAwards and honours\n\n* 1984 Guardian Fiction Prize for Empire of the Sunhttp://www.jgballard.ca/media/1984_nov29_guardian.html\n* 1984 James Tait Black Memorial Prize for fiction for Empire of the Sun\n* 1984  Empire of the Sun shortlisted for the Booker Prize for Fiction\n* 1997 De Montfort University Honorary doctorate.\n* 2001 Commonwealth Writers' Prize (Europe & South Asia region) for Super-Cannes[https://www.theglobeandmail.com/arts/jg-ballard-cops-commonwealth-prize/article25438402/ J.G. Ballard cops Commonwealth prize - The Globe and Mail]\n* 2008 Golden PEN Award\n* 2009 Royal Holloway University of London Posthumous honorary doctorate.\n\nWorks \n\nNovels \n\nShort story collections \n\nNon-fiction \n\n* A User's Guide to the Millennium: Essays and Reviews (1996)\n* Miracles of Life (autobiography; 2008)\n\nInterviews \n\n* Paris Review - J.G. Ballard  (1984)\n* Re/Search No. 8/9: J.G. Ballard (1985)\n* J.G. Ballard: Quotes (2004)\n* J.G. Ballard: Conversations (2005)\n* Extreme Metaphors (interviews; 2012)\n\nAdaptations \n\nFilms \n\n* When Dinosaurs Ruled the Earth (1970) dir. Val Guesthttp://www.jgballard.ca/media/1988_march17_guardian.html\n* Empire of the Sun (1987) dir. Steven Spielberg\n* Crash (1996) dir. David Cronenberg\n* The Atrocity Exhibition (2001) dir. Jonathan Weiss\n* Aparelho Voador a Baixa Altitude (2002), dir. Solveig Nordlund. (Portuguese adaptation of the short story \"Low Flying Aircraft\")\n* High-Rise (2015), dir. Ben Wheatley\n\nTelevision \n\n* \"Thirteen to Centaurus\" (1965) from the short story of the same name – dir. Peter Potter (BBC Two)\n* Crash! (1971) dir. Harley CoklissSellars, S. (10 August 2007). \"[http://www.ballardian.com/crash-full-tilt-autogeddon Crash! Full-Tilt Autogeddon]\". Ballardian.com. Retrieved on 25 April 2009.\n* \"Minus One\" (1991) from the story of the same name – short film dir. by Simon Brooks.\n* \"Home\" (2003) primarily based on \"The Enormous Space\" – dir. Richard Curson Smith (BBC Four)\n\nRadio \n\nIn June 2013, BBC Radio 4 broadcast adaptions of The Drowned World and Concrete Island as part of a season of dystopian fiction entitled Dangerous Visions.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "J. G. Ballard" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15927" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "James Graham Ballard (15 November 193019 April 2009) was an English novelist, short story writer, and essayist. Born in an international settlement in Shanghai to British parents before his family emigrated to the UK, Ballard began writing in the 1950s, becoming associated with the New Wave of science fiction with post-apocalyptic novels such as The Wind from Nowhere (1961) and The Drowned World (1962). In the late 1960s, he produced a variety of experimental short stories (or \"condensed novels\"), such as those collected in the controversial  The Atrocity Exhibition (1970). In the mid 1970s, Ballard published several novels, among them the highly controversial Crash (1973), a story about symphorophilia and car crash fetishism, and High-Rise (1975), a depiction of a luxury apartment building's descent into violent chaos.\n\nWhile much of Ballard's fiction would prove thematically and stylistically provocative, he became best known for his relatively conventional war novel, Empire of the Sun (1984), a semi-autobiographical account of a young British boy's experiences in Shanghai during Japanese occupation. Described by The Guardian as \"the best British novel about the Second World War\", the story was adapted into a 1987 film by Steven Spielberg starring Christian Bale. In the following decades until his death in 2009, Ballard's work shifted toward the form of the traditional crime novel. Several of his earlier works have been adapted into films, including David Cronenberg's controversial 1996 adaptation of Crash and Ben Wheatley's 2015 adaptation of High-Rise.\n\nThe literary distinctiveness of Ballard's fiction has given rise to the adjective \"Ballardian\", defined by the Collins English Dictionary as \"resembling or suggestive of the conditions described in J. G. Ballard's novels and stories, especially dystopian modernity, bleak man-made landscapes and the psychological effects of technological, social or environmental developments\".  The Oxford Dictionary of National Biography entry describes Ballard's work as being occupied with \"eros, thanatos, mass media and emergent technologies\".Will Self, [http://www.oxforddnb.com/view/article/101436, ‘Ballard, James Graham (1930–2009)’], Oxford Dictionary of National Biography, Oxford University Press, Jan 2013, accessed 3 Jan 2013, \n\nLife \n\nShanghai\n\nBallard's father was a chemist at a Manchester-based textile firm, the Calico Printers' Association, and became chairman and managing director of its subsidiary in Shanghai, the China Printing and Finishing Company. His mother was Edna,  Johnstone. Ballard was born and raised in the Shanghai International Settlement, an area under foreign control where people \"lived an American style of life\".Pringle, D. (Ed.) and Ballard, J.G. (1982). \"From Shanghai to Shepperton\". Re/Search 8/9: J.G. Ballard: 112–124. .  He was sent to the Cathedral School, the Anglican Holy Trinity Church near the Bund,  Shanghai.[http://www.timeoutshanghai.com/features/Books__Film-Book_features/11260/JG-Ballard-in-Shanghai.html JG Ballard in Shanghai - Books & Film - Time Out Shanghai] After the outbreak of the Second Sino-Japanese War, Ballard's family were forced to evacuate their suburban home temporarily and rent a house in central Shanghai to avoid the shells fired by Chinese and Japanese forces.\n\nAfter the Japanese attack on Hong Kong, the Japanese occupied the International Settlement in Shanghai. In early 1943, they began to intern Allied civilians, and Ballard was sent to the Lunghua Civilian Assembly Center with his parents and younger sister. He spent over two years, the remainder of World War II, in the internment camp. His family lived in a small area in G block, a two-story residence for 40 families. He attended school in the camp, the teachers being camp inmates from a number of professions. These experiences formed the basis of Empire of the Sun, although Ballard exercised considerable artistic licence in writing the book, such as the removal of his parents from the bulk of the story.Ballard, J.G. (4 March 2006). \"[http://film.guardian.co.uk/features/featurepages/0,,1722984,00.html Look back at Empire]\". The Guardian. Retrieved on 25 April 2009.\n\nIt has been supposed that Ballard's exposure to the atrocities of war at an impressionable age explains the apocalyptic and violent nature of much of his fiction.Cowley, J. (4 November 2001). \"[http://books.guardian.co.uk/reviews/generalfiction/0,6121,587000,00.html The Ballard of Shanghai jail]\". The Observer. Retrieved on 25 April 2009.Hall, C. \"[http://www.spikemagazine.com/0697lard.php JG Ballard: Extreme Metaphor: A Crash Course in the Fiction Of JG Ballard]\". Retrieved on 25 April 2009.Livingstone, D.B. (1996?). \"[http://www.spikemagazine.com/0899ballard.php J.G. Ballard: Crash: Prophet with Honour]\". Retrieved 12 March 2006. Martin Amis wrote that Empire of the Sun \"gives shape to what shaped him.\" However, Ballard's own account of the experience was more nuanced: \"I don't think you can go through the experience of war without one's perceptions of the world being forever changed. The reassuring stage set that everyday reality in the suburban west presents to us is torn down; you see the ragged scaffolding, and then you see the truth beyond that, and it can be a frightening experience.\" But also: \"I have—I won't say happy—not unpleasant memories of the camp. [...] I remember a lot of the casual brutality and beatings-up that went on—but at the same time we children were playing a hundred and one games all the time!\" Ballard later became an atheist.Welch, Frances. \"All Praise and Glory to the Mind of Man\". Ballard confesses to being an atheist, but adds: \"that said, I'm extremely interested in religion... I see religion as a key to all sorts of mysteries that surround the human consciousness.\"\n\nBritain and Canada\n\nIn late 1945, after the end of the war, his mother returned to Britain with Ballard and his sister on the SS Arawa. They lived in the outskirts of Plymouth, and he attended The Leys School in Cambridge. He won an essay prize whilst at the school but did not contribute to the school magazine. After a couple of years his mother and sister returned to China, rejoining Ballard's father, leaving Ballard to live with his grandparents when not boarding at school. In 1949 he went on to study medicine at King's College, Cambridge, with the intention of becoming a psychiatrist.[http://www.theparisreview.org/interviews/2929/the-art-of-fiction-no-85-j-g-ballard Paris Review - J. G. Ballard, The Art of Fiction No. 85]\n\nAt university, Ballard was writing avant-garde fiction heavily influenced by psychoanalysis and surrealist painters. At this time, he wanted to become a writer as well as pursue a medical career. In May 1951, when Ballard was in his second year at Cambridge, his short story \"The Violent Noon\", a Hemingwayesque pastiche written to please the contest's jury, won a crime story competition and was published in the student newspaper Varsity.\n\nEncouraged by the publication of his story and realising that clinical medicine would not leave him time to write, Ballard abandoned his medical studies, and in October 1951 he enrolled at Queen Mary College to read English Literature. However, he was asked to leave at the end of the year. Ballard then worked as a copywriter for an advertising agency[http://www.lrb.co.uk/v30/n07/thomas-jones/whisky-and-soda-man Thomas Jones reviews ‘Miracles of Life’ by J.G. Ballard · LRB 10 April 2008] and as an encyclopaedia salesman. He kept writing short fiction but found it impossible to get published.\n\nIn spring 1954 Ballard joined the Royal Air Force and was sent to the Royal Canadian Air Force flight-training base in Moose Jaw, Saskatchewan, Canada.  There he discovered science fiction in American magazines. While in the RAF, he also wrote his first science fiction story, \"Passport to Eternity\", as a pastiche and summary of the American science fiction he had read.  The story did not see publication until 1962.\n\nBallard left the RAF in 1955 after thirteen months and returned to England.London Gazette, 1 July 1955. In 1955 he married Helen Mary Matthews and settled in Chiswick, the first of their three children being born the following year. He made his science fiction debut in 1956 with two short stories, \"Escapement\" and \"Prima Belladonna\", published in the December 1956 issues of New Worlds and Science Fantasy respectively.  The editor of New Worlds, Edward J. Carnell, would remain an important supporter of Ballard's writing and would publish nearly all of his early stories.\n\nFrom 1958 Ballard worked as assistant editor on the scientific journal Chemistry and Industry. His interest in art led to his involvement in the emerging Pop Art movement, and in the late fifties he exhibited a number of collages that represented his ideas for a new kind of novel. Ballard's avant-garde inclinations did not sit comfortably in the science fiction mainstream of that time, which held attitudes he considered philistine. Briefly attending the 1957 Science Fiction Convention in London, Ballard left disillusioned and demoralised and did not write another story for a year. By the late 1960s, however, he had become an editor of the avant-garde Ambit magazine, which was more in keeping with his aesthetic ideals.\n\nFull-time writing career\n\nIn 1960 Ballard moved with his family to the middle-class London suburb of Shepperton in Surrey, where he lived for the rest of his life and which would later give rise to his moniker as the \"Seer of Shepperton\". Finding that commuting to work did not leave him time to write, Ballard decided he had to make a break and become a full-time writer. He wrote his first novel, The Wind from Nowhere, over a two-week holiday simply to gain a foothold as a professional writer, not intending it as a \"serious novel\"; in books published later, it is omitted from the list of his works. When it was successfully published in January 1962, he resigned from his job at Chemistry and Industry, and from then on supported himself and his family as a writer.\n\nLater that year his second novel, The Drowned World, was published, establishing Ballard as a notable figure in the fledgling New Wave movement of science fiction. Collections of his stories started getting published, and he began a period of great literary productivity, while pushing to expand the scope of acceptable material for science fiction with such stories as \"The Terminal Beach\".\n\nIn 1964 Ballard's wife Mary died suddenly of pneumonia, leaving him to raise their three children – James, Fay and Bea Ballard – by himself.The autobiographical novel The Kindness of Women gives a different, fictionalised account of her death. Ballard never remarried; however, a few years later his friend and fellow author Michael Moorcock introduced him to Claire Walsh, who became his partner for the rest of his life (he died at her London residence),\"Author J. G. Ballard dies at 78\", Deseret News, 20 April 2009, p. A12 and is often referred to in his writings as \"Claire Churchill\". After the profound shock of his wife's death, Ballard began in 1965 to write the stories that became The Atrocity Exhibition, while continuing to produce stories within the science fiction genre.\n\nIn 1967 Algis Budrys listed Ballard, Brian W. Aldiss, Roger Zelazny, and Samuel R. Delany as \"an earthshaking new kind of\" writers, and leaders of the New Wave. The Atrocity Exhibition (1969) proved controversial – it was the subject of an obscenity trial, and in the United States, publisher Doubleday destroyed almost the entire print run before it was distributed – but it gained Ballard recognition as a literary writer. It remains one of his iconic works, and was filmed in 2001.\n\nA chapter of The Atrocity Exhibition is titled \"Crash!\", and in 1970 Ballard organised an exhibition of crashed cars at the New Arts Laboratory, simply called \"Crashed Cars\". The crashed vehicles were displayed without commentary, inspiring vitriolic responses and vandalism.Ballard, J.G. (1993). The Atrocity Exhibition (expanded and annotated edition). . In both the story and the art exhibition, Ballard dealt with the sexual potential of car crashes, a preoccupation he also explored in a short film in which he appeared with Gabrielle Drake in 1971. His fascination with the topic culminated in the novel Crash in 1973. The main character of Crash is called James Ballard and lives in Shepperton, though other biographical details do not match the writer, and curiosity about the relationship between the character and his author increased when Ballard suffered a serious automobile accident shortly after completing the novel. Regardless of real-life basis, Crash, like The Atrocity Exhibition, was also controversial upon publication. In 1996, the film adaptation by David Cronenberg was met by a tabloid uproar in the UK, with the Daily Mail campaigning actively for it to be banned. In the years following the initial publication of Crash, Ballard produced two further novels: 1974's Concrete Island, about a man who becomes stranded in the waste area of a high-speed motorway, and High-Rise, about a modern luxury high rise apartment building's descent into tribal warfare.\n\nAlthough Ballard published several novels and short story collections throughout the seventies and eighties, his breakthrough into the mainstream came only with Empire of the Sun in 1984, based on his years in Shanghai and the Lunghua internment camp. It became a best-seller,Collinson, G. \"[http://www.bbc.co.uk/bbcfour/cinema/features/empire-of-the-sun.shtml Empire of the Sun] \". BBC Four article on the film and novel. Retrieved on 25 April 2009. was shortlisted for the Booker Prize and awarded the Guardian Fiction Prize and James Tait Black Memorial Prize for fiction. It made Ballard known to a wider audience, although the books that followed failed to achieve the same degree of success. Empire of the Sun was filmed by Steven Spielberg in 1987, starring a young Christian Bale as Jim (Ballard). Ballard himself appears briefly in the film, and he has described the experience of seeing his childhood memories reenacted and reinterpreted as bizarre.\nBallard continued to write until the end of his life, and also contributed occasional journalism and criticism to the British press. Of his later novels, Super-Cannes (2000) was particularly well received, winning the regional Commonwealth Writers' Prize. These later novels often marked a move away from science fiction, instead engaging with elements of a traditional crime novel. Ballard was offered a CBE in 2003, but refused, calling it \"a Ruritanian charade that helps to prop up our top-heavy monarchy\". In June 2006, he was diagnosed with terminal prostate cancer, which metastasised to his spine and ribs. The last of his books published in his lifetime was the autobiography Miracles of Life, written after his diagnosis. His final published short story, \"The Dying Fall\", appeared in the 1996 issue 106 of Interzone, a British sci-fi magazine. It was reproduced in The Guardian on 25 April 2009.Ballard, JG. [https://www.theguardian.com/books/2009/apr/25/dying-fall-jg-ballard The Dying Fall], The Guardian, 25 April 2009.\n\nPosthumous publication\n\nIn October 2008, before his death, Ballard's literary agent Margaret Hanbury brought an outline for a book by Ballard with the working title Conversations with My Physician: The Meaning, if Any, of Life to the Frankfurt Book Fair. The physician in question is oncologist Professor Jonathan Waxman of Imperial College, London, who was treating Ballard for prostate cancer. While it was to be in part a book about cancer, and Ballard's struggle with it, it reportedly was to move on to broader themes. In April 2009 The Guardian reported that HarperCollins announced that Ballard's \"Conversations With My Physician\" could not be finished and plans to publish it were abandoned. In 2013, a 17-page untitled typescript listed as \"Vermilion Sands short story in draft\" in the British Library catalogue and edited into an 8,000-word text by Bernard Sigaud appeared in a short-lived French reissue of the collection () under the title \"Le labyrinthe Hardoon\" as the first story of the cycle, tentatively dated \"late 1955/early 1956\" by Sigaud and others.Horrocks, Chris, \"Disinterring the Present: Science Fiction, Media Technology and the Ends of the Archive\", 'Journal of Visual Culture, 2013 Vol 12(3): 414–430\n\nArchive\n\nIn June 2010 the British Library acquired Ballard's personal archives under the British government's acceptance in lieu scheme for death duties. The archive contains eighteen holograph manuscripts for Ballard's novels, including the 840-page manuscript for Empire of the Sun, plus correspondence, notebooks, and photographs from throughout his life. In addition, two typewritten manuscripts for The Unlimited Dream Company are held at the Harry Ransom Center at the University of Texas at Austin.\n\nDystopian fiction\n\nWith the exception of his autobiographical novels, Ballard most commonly wrote in the post-apocalyptic dystopia genre.\n\nHis most celebrated novel in this regard is Crash, in which cars symbolise the mechanisation of the world and man's capacity to destroy himself with the technology he creates. The characters (the protagonist, called Ballard, included) become increasingly obsessed with the violent psychosexuality of car crashes in general, and celebrity car crashes in particular. Ballard's disturbing novel was turned into a controversial—and likewise disturbing—cerebral film by David Cronenberg.\n\nParticularly revered among Ballard's admirers is his short story collection Vermilion Sands (1971), set in an eponymous desert resort town inhabited by forgotten starlets, insane heirs, very eccentric artists, and the merchants and bizarre servants who provide for them. Each story features peculiarly exotic technology such as cloud-carving sculptors performing for a party of eccentric onlookers, poetry-composing computers, orchids with operatic voices and egos to match, phototropic self-painting canvases, etc. In keeping with Ballard's central themes, most notably technologically mediated masochism, these tawdry and weird technologies service the dark and hidden desires and schemes of the human castaways who occupy Vermilion Sands, typically with psychologically grotesque and physically fatal results. In his introduction to Vermilion Sands, Ballard cites this as his favourite collection.\n\nIn a similar vein, his collection Memories of the Space Age explores many varieties of individual and collective psychological fallout from—and initial deep archetypal motivations for—the American space exploration boom of the 1960s and 1970s.\n\nCommentators such as Will Self have described much of his fiction as being concerned with 'idealised gated communities; the affluent, and the ennui of affluence [where] the virtualised world is concretised in the shape of these gated developments.' He added in these fictional settings 'there is no real pleasure to be gained; sex is commodified and devoid of feeling and there is no relationship with the natural world. These communities then implode into some form of violence.'[http://www.watershed.co.uk/audio-video/john-gray-and-will-self-jg-ballard Water Shed - John Gray and Will Self - JG Ballard] Budrys, however, mocked his fiction as \"call[ing] for people who don't think ... to be the protagonist of a J. G. Ballard novel, or anything more than a very minor character therein, you must have cut yourself off from the entire body of scientific education\".\n\nIn addition to his novels, Ballard made extensive use of the short story form. Many of his earliest published works in the 1950s and 1960s were short stories.  In an essay on Ballard, Will Wiles notes how his short stories 'have a lingering fascination with the domestic interior, with furnishing and appliances,' adding, 'it’s a landscape that he distorts until it shrieks with anxiety'. He concludes that 'what Ballard saw, and what he expressed in his novels, was nothing less than the effect that the technological world, including our built environment, was having upon our minds and bodies.' [https://placesjournal.org/article/the-corner-of-lovecraft-and-ballard/?gclid=EAIaIQobChMI_4S3pvrY1QIVw7ftCh0sBQ_kEAAYASAAEgJj2_D_BwE Places Journal - The Corner of Lovecraft and Ballard]\n\nTelevision\n\nOn 13 December 1965, BBC Two screened an adaptation of the short story \"Thirteen to Centaurus\" directed by Peter Potter. The one-hour drama formed part of the first season of Out of the Unknown and starred Donald Houston as Dr Francis and James Hunter as Abel Granger. In 2003, Ballard's short story \"The Enormous Space\" (first published in the Science fiction magazine Interzone in 1989, subsequently printed in the collection of Ballard's short stories War Fever) was adapted into an hour-long television film for the BBC entitled Home by Richard Curson Smith, who also directed it. The plot follows a middle class man who chooses to abandon the outside world and restrict himself to his house, becoming a hermit.\n\nInfluence\n\nBallard is cited as an important forebear of the cyberpunk movement by Bruce Sterling in his introduction to the seminal Mirrorshades anthology. Ballard's parody of American politics, the pamphlet \"Why I Want to Fuck Ronald Reagan\", which was subsequently included as a chapter in his experimental novel The Atrocity Exhibition, was photocopied and distributed by pranksters at the 1980 Republican National Convention. In the early 1970s, Bill Butler, a bookseller in Brighton, was prosecuted under UK obscenity laws for selling the pamphlet.\n\nIn his 2002 book Straw Dogs, the philosopher John Gray acknowledges Ballard as a major influence on his ideas. Ballard described the book as a \"clear-eyed assessment of human nature and our almost unlimited gift for self-delusion.\"\n\nAccording to literary theorist Brian McHale, The Atrocity Exhibition is a \"postmodernist text based on science fiction topoi.\"Brian McHale, Postmodernist Fiction Luckhurst, Roger. [https://web.archive.org/web/20020602193625/http://www.depauw.edu/sfs/backissues/55/luckhurst55art.htm \"Border Policing: Postmodernism and Science Fiction\"] Science Fiction Studies (November 1991)\n\nLee Killough directly cites Ballard's seminal Vermilion Sands short stories as the inspiration for her collection Aventine, also a backwater resort for celebrities and eccentrics where bizarre or frivolous novelty technology facilitates the expression of dark intents and drives. Terry Dowling's milieu of Twilight Beach is also influenced by the stories of Vermilion Sands and other Ballard works.\n\nIn Simulacra and Simulation, Jean Baudrillard hailed Crash as the \"first great novel of the universe of simulation.\"\n\nBallard also had an interest in the relationship between various media. In the early 1970s, he was one of the trustees of the Institute for Research in Art and Technology.[http://www.jgballard.ca/media/1971_april_books_and_bookmen_magazine.html JG Ballard Interviewed by Douglas Reed]\n\nIn popular music\n\nBallard has had a notable influence on popular music, where his work has been used as a basis for lyrical imagery, particularly amongst British post-punk and industrial groups. Examples include albums such as Metamatic by John Foxx, various songs by Joy Division (most famously \"Atrocity Exhibition\" from Closer), \"High Rise\" by Hawkwind, \"Miss the Girl\" by The Creatures (based on Crash), \"Down in the Park\" by Gary Numan, \"Chrome Injury\" by The Church, \"Drowned World\" by Madonnahttp://www.slantmagazine.com/features/article/madonna-new-york-ny-july-25-2001 and \"Warm Leatherette\" by The Normal. Songwriters Trevor Horn and Bruce Woolley credit Ballard's story \"The Sound-Sweep\" with inspiring The Buggles' hit \"Video Killed the Radio Star\", and the Buggles' second album included a song entitled \"Vermillion Sands.\" The 1978 post-punk band Comsat Angels took their name from one of Ballard's short stories. The Manic Street Preachers include a sample from an interview with Ballard in their song \"Mausoleum\". Klaxons named their debut album Myths of the Near Future after one of Ballard's short story collections. The Sound of Animals Fighting took the name of the song \"The Heraldic Beak of the Manufacturer's Medallion\" from Crash. The song \"Terminal Beach\" by the American band Yacht is a tribute to his short story collection that goes by the same name.\n\nAwards and honours\n\n* 1984 Guardian Fiction Prize for Empire of the Sunhttp://www.jgballard.ca/media/1984_nov29_guardian.html\n* 1984 James Tait Black Memorial Prize for fiction for Empire of the Sun\n* 1984  Empire of the Sun shortlisted for the Booker Prize for Fiction\n* 1997 De Montfort University Honorary doctorate.\n* 2001 Commonwealth Writers' Prize (Europe & South Asia region) for Super-Cannes[https://www.theglobeandmail.com/arts/jg-ballard-cops-commonwealth-prize/article25438402/ J.G. Ballard cops Commonwealth prize - The Globe and Mail]\n* 2008 Golden PEN Award\n* 2009 Royal Holloway University of London Posthumous honorary doctorate.\n\nWorks \n\nNovels \n\nShort story collections \n\nNon-fiction \n\n* A User's Guide to the Millennium: Essays and Reviews (1996)\n* Miracles of Life (autobiography; 2008)\n\nInterviews \n\n* Paris Review - J.G. Ballard  (1984)\n* Re/Search No. 8/9: J.G. Ballard (1985)\n* J.G. Ballard: Quotes (2004)\n* J.G. Ballard: Conversations (2005)\n* Extreme Metaphors (interviews; 2012)\n\nAdaptations \n\nFilms \n\n* When Dinosaurs Ruled the Earth (1970) dir. Val Guesthttp://www.jgballard.ca/media/1988_march17_guardian.html\n* Empire of the Sun (1987) dir. Steven Spielberg\n* Crash (1996) dir. David Cronenberg\n* The Atrocity Exhibition (2001) dir. Jonathan Weiss\n* Aparelho Voador a Baixa Altitude (2002), dir. Solveig Nordlund. (Portuguese adaptation of the short story \"Low Flying Aircraft\")\n* High-Rise (2015), dir. Ben Wheatley\n\nTelevision \n\n* \"Thirteen to Centaurus\" (1965) from the short story of the same name – dir. Peter Potter (BBC Two)\n* Crash! (1971) dir. Harley CoklissSellars, S. (10 August 2007). \"[http://www.ballardian.com/crash-full-tilt-autogeddon Crash! Full-Tilt Autogeddon]\". Ballardian.com. Retrieved on 25 April 2009.\n* \"Minus One\" (1991) from the story of the same name – short film dir. by Simon Brooks.\n* \"Home\" (2003) primarily based on \"The Enormous Space\" – dir. Richard Curson Smith (BBC Four)\n\nRadio \n\nIn June 2013, BBC Radio 4 broadcast adaptions of The Drowned World and Concrete Island as part of a season of dystopian fiction entitled Dangerous Visions. J. G. Ballard. http://en.wikipedia.org/?curid=15927."
  }
}
