{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16480",
  "eid" : "264284b0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778573435,
  "textBody" : "Jay Scott Greenspan (born September 23, 1959), known by his stage name Jason Alexander, is an American actor, voice actor, comedian and director.\n\nAlexander is best known for his role as George Costanza in the television series Seinfeld. Other well-known roles include Phillip Stuckey in the film Pretty Woman (1990) and the title character in the animated series Duckman (1994–1997).\n\nAlexander has had an active career on stage, appearing in several Broadway musicals including Jerome Robbins' Broadway in 1989, for which he won the Tony Award as Best Leading Actor in a Musical. He appeared in the Los Angeles production of The Producers. He was the Artistic Director of \"Reprise! Broadway's Best in Los Angeles\", where he has directed several musicals.\n\nEarly life\n\nAlexander was born in Newark, New Jersey, the son of Jewish parents Ruth Minnie (née Simon), a nurse and health care administrator, and Alexander B. Greenspan, an accounting manager whose first name Jay later borrowed to create his stage name. He has a half-sister, Karen Van Horne, and a half-brother, Michael Greenspan. Alexander grew up in Livingston, New Jersey, and is a 1977 graduate of Livingston High School.Weinraub, Bernard. [https://query.nytimes.com/gst/fullpage.html?res=9A00E6D81039F931A15753C1A96F958260 \"At the Movies\"], The New York Times, October 22, 1999. Accessed February 24, 2011. \"I was born in 1959 and grew up in Livingston, New Jersey, but I felt I knew these people very well\"  He attended Boston University but left the summer before his senior year, after getting work in the city of New York. At Boston University, Alexander wanted to pursue classical acting, but a professor redirected him toward comedy after noticing his physique, remarking, \"I know your heart and soul are Hamlet, but you will never play Hamlet.\" He was later given an honorary degree in 1995. He is a practicing magician, and only switched to acting as a career when he realized that he was unlikely to succeed as a magician.\n\nActing career\n\nStage career\n\nAlexander began his acting career on the New York stage and is an accomplished singer and dancer. On Broadway he appeared in Stephen Sondheim's Merrily We Roll Along, Kander & Ebb's The Rink, Neil Simon's Broadway Bound, Accomplice, and Jerome Robbins' Broadway, for which he garnered the 1989 Tony Award for Best Leading Actor in a Musical. Returning to the stage in 2003, Alexander was cast in a successful run, opposite Martin Short, in the Los Angeles production of Mel Brooks' The Producers. Alexander also appeared with Kelsey Grammer in the 2004 musical adaptation of Charles Dickens' A Christmas Carol, playing Jacob Marley to Grammer's Ebenezer Scrooge. He continues to appear in live stage shows, including Barbra Streisand's memorable birthday party for Stephen Sondheim at the Hollywood Bowl, in which he appeared with Angela Lansbury, performing selections from Sweeney Todd. Alexander was recently named the Artistic Director of Reprise Theatre Company in Los Angeles, where he previously directed Sunday in the Park with George. He is scheduled to direct the upcoming revival of Damn Yankees at Reprise. In 2015, he replaced Larry David as the lead in David's Broadway play Fish in the Dark. Alexander co-starred opposite Sherie Rene Scott in the September 2017 world premiere of John Patrick Shanley's The Portuguese Kid at the Manhattan Theatre Club.\n\nTelevision\n\nAlexander is best known as one of the key cast members of the award-winning television sitcom Seinfeld (1989–1998), in which he played George Costanza (Seinfeld's character's best friend since childhood). Alexander was nominated for six (6) Primetime Emmy Awards and four (4) Golden Globe Awards for his performance as Costanza, but did not win any, mainly due to his co-star, Michael Richards being nominated and winning for his role as Cosmo Kramer. He did, however, win a Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Comedy Series for his work.\n\nBefore Seinfeld, he starred in a commercial for John Deere and in a short-lived CBS sitcom called Everything's Relative in 1987 which lasted six episodes. Concurrently with his Seinfeld role, Alexander provided the voice of the lead character in the cult animated series Duckman (1994–1997). Alexander voiced Catbert, the evil director of human resources, in the short-lived Dilbert animated series based on the popular comic strip.\n\nAlexander made cameo appearances in the second season of Curb Your Enthusiasm, playing himself and appeared in the seventh season of Curb Your Enthusiasm, along with the other three principal Seinfeld cast members. He had a part in the ABC sitcom Dinosaurs, as Al \"Sexual\" Harris (who frequently engaged in sexual harassment) as well as other voices. Despite a successful career in film and stage, Alexander never managed to repeat his Seinfeld-level of success in television. 2001 marked his first post-Seinfeld return to prime-time television: the heavily promoted but short-lived ABC sitcom Bob Patterson (which was canceled after five episodes). Alexander partially blames the lack of success on the mood of the country after 9/11.\n\nHis second chance as a TV series lead, the CBS sitcom Listen Up! (September 20, 2004 to April 25, 2005), also fell short of a second season. Alexander was the principal executive producer of the series, based very loosely on the life of the popular sports-media personality Tony Kornheiser. Alexander appeared on the Family Guy: Live in Vegas CD and sang a verse in a song. He was featured in the Friends episode \"The One Where Rosita Dies\" as a suicidal supply manager named Earl. Phoebe calls him trying to sell him toner and she learns about his problem and tries to persuade him not to commit suicide. This is referred to in an episode of Malcolm in the Middle where Alexander appears as a neurotic and critical loner called Leonard. He describes himself as free and mentions that he makes money with a job \"selling toner over the phone\". Later in the episode, he is repeatedly harassed by a man named George – his character's name on Seinfeld. Alexander appeared in the 1995 TV version of the Broadway musical Bye Bye Birdie, as Conrad Birdie's agent, Albert Peterson. He guest-starred in episode 8 of the 1996 variety show Muppets Tonight.\n\nAlexander appeared on Star Trek: Voyager on the episode \"Think Tank\" playing a genius alien named Kurros who was trying to get Seven of Nine to serve on his ship. He appeared in \"One Night at Mercy\", the first episode of the short-lived 2002 revival of The Twilight Zone, playing Death. He featured in the 2005 Monk episode \"Mr. Monk and the Other Detective\" as Monk's rival, Marty Eels. On the June 26, 2006 episode of the Jimmy Kimmel Live! talk show, Alexander demonstrated several self-defense techniques. He was the Host of the 230th July 4, 2006 of the PBS July 4 \"A Capitol Fourth\" Celebrations in Washington, D.C. in which he sang, danced, and played tuned drums. In 2006, Alexander signed on to feature as a regular cast member in the second season of Everybody Hates Chris. Alexander was the host of the Comedy Central Roast of actor William Shatner on August 13, 2006 (first airdate: August 20, 2006). In 2007, Alexander was a guest star in the third episode of the improv comedy series Thank God You're Here. He is a frequent guest and panelist on: Bill Maher's Politically Incorrect and Real Time shows; Hollywood Squares; the Late Late Show, with both Craig Kilborn and Craig Ferguson; and the Late Show with David Letterman.\n\nIn 2008, Alexander guest-starred on the CBS show Criminal Minds in the season four episode \"Masterpiece\" as Prof. Rothschild, a well-educated serial killer obsessed with the Fibonacci sequence who sends the team into a race against time to save his last victims. He returned in the same season to direct the episode \"Conflicted\", featuring the actor Jackson Rathbone. In 2011, Alexander was the guest star in an episode of Harry's Law, playing a high school teacher bringing a wrongful dismissal suit.\n\nMovies\n\nIn addition to his roles as an insensitive lawyer in Pretty Woman, co-starring with Richard Gere, and as inept womanizer Mauricio in Shallow Hal, with Jack Black, Alexander has appeared in Love! Valour! Compassion!, Dunston Checks In, Love and Action in Chicago, The Last Supper and the psychological horror film Jacob's Ladder. He voiced the gargoyle Hugo in Disney's 1996 animated film The Hunchback of Notre Dame and its direct-to-video sequel, The Hunchback of Notre Dame II. His other Disney voice work includes House of Mouse and the video game Kingdom Hearts 3D: Dream Drop Distance. He has dabbled in directing, starting with 1996's For Better or Worse and 1999's Just Looking. He also played the toymaker A.C. Gilbert in the 2002 movie The Man Who Saved Christmas. In 2009, Alexander had a small role in the movie Hachi: A Dog's Tale as a train station manager, alongside his Pretty Woman costar Richard Gere. Alexander starred in A Fairly Odd Movie: Grow Up, Timmy Turner! as Cosmo.\n\nOther work\n\nAlexander is featured in country music star Brad Paisley's music videos \"Celebrity\" and \"Online\", the latter of which he directed and won the 2007 Country Music Association's Video of the Year Award for. In August 2012, he co-starred in the music video \"Trying Not to Love You\" by Nickelback with former Baywatch star Brooke Burns. In January 1995, Alexander did a commercial for Rold Gold pretzels to be broadcast during the Super Bowl. The commercial depicts him with Frasier dog \"Eddie\" jumping out of an airplane with a parachute over the stadium. After the commercial, the audience is brought back to a supposedly \"live feed\" of the playing field hearing startled sports commentators as Alexander and the dog land in the field to wild applause. In the summer of 2005, he appeared with Lee Iacocca in ads for DaimlerChrysler. Iacocca did the ads as part of a way to raise money for Dr. Denise Faustman's research to cure autoimmunity. Both Lee Iacocca and Jason Alexander have had loved ones whose lives have been adversely affected by autoimmunity. One of Alexander's earliest television roles was in a McDonald's commercial advertising the McDLT, in which he sings. He has appeared in Kentucky Fried Chicken (KFC) commercials, including one with baseball superstar Barry Bonds of the San Francisco Giants and another one opposite Trista Rehn of The Bachelorette. It was rumored that he no longer appears in these commercials due to the alleged cruelty to animals by KFC suppliers and slaughterhouses, but he refuted that in the August 2, 2006 issue of Adweek. Alexander said, \"That's PETA bullcrap. I loved working for KFC. I was targeted by PETA to broker something between them. I think KFC really stepped up to the plate; unfortunately PETA did not.\"\n\nHe performed a mentalism and magic act at The Magic Castle in Hollywood, California from April 24 to 30, 2006, and was later named The Academy of Magical Arts Parlor Magician of the Year for this act. Alexander had previously been given the Academy's Junior Achievement Award in 1989. Alexander was the national spokesman for the Scleroderma Foundation, a leading organization dedicated to raising awareness of the disease and assisting those who are afflicted. Alexander voiced the character Abis Mal in The Return of Jafar and the television series based on Disney's 1992 animated film, Aladdin. Jason Alexander guest starred in Malcolm in the Middle as an intelligent but unpleasant individual (Lenard) who Malcolm meets in the park. He makes money as a telephone salesman and spends his time playing chess in the park. Malcolm, afraid of ending up like Lenard, tries to get him to change his ways and get a full-time job. In 2007, Alexander appeared in a commercial for the ASPCA, which has aired on cable TV stations. In 1987, Alexander appeared in a commercial for Miller Lite, with Yogi Berra as the celebrity, speaking about Miller Lite using his unique malapropism eloquence, sitting at a bar with many others including a young Jason Alexander standing behind Berra's left shoulder.\n\nIn 2009, Alexander lent his voice talents in the Thomas Nelson audio Bible production known as The Word of Promise. In this dramatized audio, Alexander played the character of Joseph. The project featured a large ensemble of well known Hollywood actors including Jim Caviezel, Lou Gossett Jr., John Rhys-Davies, Jon Voight, Gary Sinise, Christopher McDonald, Marissa Tomei and John Schneider.[http://wordofpromise.thomasnelson.com/cast.php]  \n\nPoker career\n\nIn recent years, Alexander has also competed on televised poker shows and in various tournaments. He has appeared twice on Bravo's Celebrity Poker Showdown, winning the final table of the 8th season. Alexander won the $500,000 prize for his charity, The United Way of America to help benefit the New Orleans Area. Alexander played in the 2007 World Series of Poker main event, but was eliminated on the second day. He returned to play in 2009. He made it to Day 3 of the event, finishing in the top 30% of the field. Alexander has appeared on NBC's Poker After Dark in the \"Celebrities and Mentors\" episode, finishing in 6th place after being eliminated by professional poker player Gavin Smith. Alexander signed with PokerStars where he plays under the screen name \"J. Alexander\".\n\nRecent appearances\n\nAlexander was host of the LOL Sudbury opening night gala in Sudbury, Ontario, Canada on May 29, 2008, which was simulcast throughout Canada at 60 Cineplex theaters, a first for any comedy festival. He has loaned his voice to several episodes of the Twilight Zone Radio Dramas.\n\nIn 2008 and again in 2009, Alexander fronted Jason Alexander's Comedy Spectacular, a routine exclusive to Australia. The show consists of stand-up and improvisation and incorporates Alexander's musical talent. He is backed up by a number of well-known Australian comedians. His first time performing a similar show of this nature was in 2006 for Jason Alexander's Comedy Christmas. In February/March 2010, Alexander starred in his own show, The Donny Clay Experience, at the Planet Hollywood Resort in Las Vegas, Nevada. The Donny Clay character, which he has performed in a tour of the United States, is a self-help guru in a similar mold to his Bob Patterson character.\n\nIt was announced in July 2010 that Alexander would be joining the cast of the Nickelodeon films based on their series The Fairly OddParents, A Fairly Odd Movie: Grow Up, Timmy Turner! and A Fairly Odd Christmas. He played Cosmo, one of Timmy Turner's fairies.\n\nOn January 6, 2010, it was announced that Alexander would be the new face of the weight loss company Jenny Craig.\n\nAlexander stars in the music video for Nickelback's \"Trying Not to Love You\" as a coffee foam artist.\n\nOn January 6, 2015, Alexander made an appearance in a YouTube video with one of his son's popular YouTuber friends.\n\nPersonal life\n\nAlexander has been married to Daena E. Title since May 31, 1982. They have two sons, Gabriel and Noah.\n\nAlexander has been a prominent public supporter of the OneVoice initiative, which seeks out opinions from moderate Israelis and Palestinians who want to achieve a mutual peace agreement between their societies. He explained on Real Time with Bill Maher (July 17, 2009) that he has visited Israel many times. On his appearance, he spoke about progress towards peace that he has recently observed.\n\nIn 2012, Alexander announced his support for the re-election of President Barack Obama.\n\nFilmography\n\nFilm\n\nTelevision\n\nAs actor\n\n2017\nI\"Narcos\"\nSeason 3\n\nAs director\n\nVideo game\n\nStage",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Jason Alexander" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16480" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Jay Scott Greenspan (born September 23, 1959), known by his stage name Jason Alexander, is an American actor, voice actor, comedian and director.\n\nAlexander is best known for his role as George Costanza in the television series Seinfeld. Other well-known roles include Phillip Stuckey in the film Pretty Woman (1990) and the title character in the animated series Duckman (1994–1997).\n\nAlexander has had an active career on stage, appearing in several Broadway musicals including Jerome Robbins' Broadway in 1989, for which he won the Tony Award as Best Leading Actor in a Musical. He appeared in the Los Angeles production of The Producers. He was the Artistic Director of \"Reprise! Broadway's Best in Los Angeles\", where he has directed several musicals.\n\nEarly life\n\nAlexander was born in Newark, New Jersey, the son of Jewish parents Ruth Minnie (née Simon), a nurse and health care administrator, and Alexander B. Greenspan, an accounting manager whose first name Jay later borrowed to create his stage name. He has a half-sister, Karen Van Horne, and a half-brother, Michael Greenspan. Alexander grew up in Livingston, New Jersey, and is a 1977 graduate of Livingston High School.Weinraub, Bernard. [https://query.nytimes.com/gst/fullpage.html?res=9A00E6D81039F931A15753C1A96F958260 \"At the Movies\"], The New York Times, October 22, 1999. Accessed February 24, 2011. \"I was born in 1959 and grew up in Livingston, New Jersey, but I felt I knew these people very well\"  He attended Boston University but left the summer before his senior year, after getting work in the city of New York. At Boston University, Alexander wanted to pursue classical acting, but a professor redirected him toward comedy after noticing his physique, remarking, \"I know your heart and soul are Hamlet, but you will never play Hamlet.\" He was later given an honorary degree in 1995. He is a practicing magician, and only switched to acting as a career when he realized that he was unlikely to succeed as a magician.\n\nActing career\n\nStage career\n\nAlexander began his acting career on the New York stage and is an accomplished singer and dancer. On Broadway he appeared in Stephen Sondheim's Merrily We Roll Along, Kander & Ebb's The Rink, Neil Simon's Broadway Bound, Accomplice, and Jerome Robbins' Broadway, for which he garnered the 1989 Tony Award for Best Leading Actor in a Musical. Returning to the stage in 2003, Alexander was cast in a successful run, opposite Martin Short, in the Los Angeles production of Mel Brooks' The Producers. Alexander also appeared with Kelsey Grammer in the 2004 musical adaptation of Charles Dickens' A Christmas Carol, playing Jacob Marley to Grammer's Ebenezer Scrooge. He continues to appear in live stage shows, including Barbra Streisand's memorable birthday party for Stephen Sondheim at the Hollywood Bowl, in which he appeared with Angela Lansbury, performing selections from Sweeney Todd. Alexander was recently named the Artistic Director of Reprise Theatre Company in Los Angeles, where he previously directed Sunday in the Park with George. He is scheduled to direct the upcoming revival of Damn Yankees at Reprise. In 2015, he replaced Larry David as the lead in David's Broadway play Fish in the Dark. Alexander co-starred opposite Sherie Rene Scott in the September 2017 world premiere of John Patrick Shanley's The Portuguese Kid at the Manhattan Theatre Club.\n\nTelevision\n\nAlexander is best known as one of the key cast members of the award-winning television sitcom Seinfeld (1989–1998), in which he played George Costanza (Seinfeld's character's best friend since childhood). Alexander was nominated for six (6) Primetime Emmy Awards and four (4) Golden Globe Awards for his performance as Costanza, but did not win any, mainly due to his co-star, Michael Richards being nominated and winning for his role as Cosmo Kramer. He did, however, win a Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Comedy Series for his work.\n\nBefore Seinfeld, he starred in a commercial for John Deere and in a short-lived CBS sitcom called Everything's Relative in 1987 which lasted six episodes. Concurrently with his Seinfeld role, Alexander provided the voice of the lead character in the cult animated series Duckman (1994–1997). Alexander voiced Catbert, the evil director of human resources, in the short-lived Dilbert animated series based on the popular comic strip.\n\nAlexander made cameo appearances in the second season of Curb Your Enthusiasm, playing himself and appeared in the seventh season of Curb Your Enthusiasm, along with the other three principal Seinfeld cast members. He had a part in the ABC sitcom Dinosaurs, as Al \"Sexual\" Harris (who frequently engaged in sexual harassment) as well as other voices. Despite a successful career in film and stage, Alexander never managed to repeat his Seinfeld-level of success in television. 2001 marked his first post-Seinfeld return to prime-time television: the heavily promoted but short-lived ABC sitcom Bob Patterson (which was canceled after five episodes). Alexander partially blames the lack of success on the mood of the country after 9/11.\n\nHis second chance as a TV series lead, the CBS sitcom Listen Up! (September 20, 2004 to April 25, 2005), also fell short of a second season. Alexander was the principal executive producer of the series, based very loosely on the life of the popular sports-media personality Tony Kornheiser. Alexander appeared on the Family Guy: Live in Vegas CD and sang a verse in a song. He was featured in the Friends episode \"The One Where Rosita Dies\" as a suicidal supply manager named Earl. Phoebe calls him trying to sell him toner and she learns about his problem and tries to persuade him not to commit suicide. This is referred to in an episode of Malcolm in the Middle where Alexander appears as a neurotic and critical loner called Leonard. He describes himself as free and mentions that he makes money with a job \"selling toner over the phone\". Later in the episode, he is repeatedly harassed by a man named George – his character's name on Seinfeld. Alexander appeared in the 1995 TV version of the Broadway musical Bye Bye Birdie, as Conrad Birdie's agent, Albert Peterson. He guest-starred in episode 8 of the 1996 variety show Muppets Tonight.\n\nAlexander appeared on Star Trek: Voyager on the episode \"Think Tank\" playing a genius alien named Kurros who was trying to get Seven of Nine to serve on his ship. He appeared in \"One Night at Mercy\", the first episode of the short-lived 2002 revival of The Twilight Zone, playing Death. He featured in the 2005 Monk episode \"Mr. Monk and the Other Detective\" as Monk's rival, Marty Eels. On the June 26, 2006 episode of the Jimmy Kimmel Live! talk show, Alexander demonstrated several self-defense techniques. He was the Host of the 230th July 4, 2006 of the PBS July 4 \"A Capitol Fourth\" Celebrations in Washington, D.C. in which he sang, danced, and played tuned drums. In 2006, Alexander signed on to feature as a regular cast member in the second season of Everybody Hates Chris. Alexander was the host of the Comedy Central Roast of actor William Shatner on August 13, 2006 (first airdate: August 20, 2006). In 2007, Alexander was a guest star in the third episode of the improv comedy series Thank God You're Here. He is a frequent guest and panelist on: Bill Maher's Politically Incorrect and Real Time shows; Hollywood Squares; the Late Late Show, with both Craig Kilborn and Craig Ferguson; and the Late Show with David Letterman.\n\nIn 2008, Alexander guest-starred on the CBS show Criminal Minds in the season four episode \"Masterpiece\" as Prof. Rothschild, a well-educated serial killer obsessed with the Fibonacci sequence who sends the team into a race against time to save his last victims. He returned in the same season to direct the episode \"Conflicted\", featuring the actor Jackson Rathbone. In 2011, Alexander was the guest star in an episode of Harry's Law, playing a high school teacher bringing a wrongful dismissal suit.\n\nMovies\n\nIn addition to his roles as an insensitive lawyer in Pretty Woman, co-starring with Richard Gere, and as inept womanizer Mauricio in Shallow Hal, with Jack Black, Alexander has appeared in Love! Valour! Compassion!, Dunston Checks In, Love and Action in Chicago, The Last Supper and the psychological horror film Jacob's Ladder. He voiced the gargoyle Hugo in Disney's 1996 animated film The Hunchback of Notre Dame and its direct-to-video sequel, The Hunchback of Notre Dame II. His other Disney voice work includes House of Mouse and the video game Kingdom Hearts 3D: Dream Drop Distance. He has dabbled in directing, starting with 1996's For Better or Worse and 1999's Just Looking. He also played the toymaker A.C. Gilbert in the 2002 movie The Man Who Saved Christmas. In 2009, Alexander had a small role in the movie Hachi: A Dog's Tale as a train station manager, alongside his Pretty Woman costar Richard Gere. Alexander starred in A Fairly Odd Movie: Grow Up, Timmy Turner! as Cosmo.\n\nOther work\n\nAlexander is featured in country music star Brad Paisley's music videos \"Celebrity\" and \"Online\", the latter of which he directed and won the 2007 Country Music Association's Video of the Year Award for. In August 2012, he co-starred in the music video \"Trying Not to Love You\" by Nickelback with former Baywatch star Brooke Burns. In January 1995, Alexander did a commercial for Rold Gold pretzels to be broadcast during the Super Bowl. The commercial depicts him with Frasier dog \"Eddie\" jumping out of an airplane with a parachute over the stadium. After the commercial, the audience is brought back to a supposedly \"live feed\" of the playing field hearing startled sports commentators as Alexander and the dog land in the field to wild applause. In the summer of 2005, he appeared with Lee Iacocca in ads for DaimlerChrysler. Iacocca did the ads as part of a way to raise money for Dr. Denise Faustman's research to cure autoimmunity. Both Lee Iacocca and Jason Alexander have had loved ones whose lives have been adversely affected by autoimmunity. One of Alexander's earliest television roles was in a McDonald's commercial advertising the McDLT, in which he sings. He has appeared in Kentucky Fried Chicken (KFC) commercials, including one with baseball superstar Barry Bonds of the San Francisco Giants and another one opposite Trista Rehn of The Bachelorette. It was rumored that he no longer appears in these commercials due to the alleged cruelty to animals by KFC suppliers and slaughterhouses, but he refuted that in the August 2, 2006 issue of Adweek. Alexander said, \"That's PETA bullcrap. I loved working for KFC. I was targeted by PETA to broker something between them. I think KFC really stepped up to the plate; unfortunately PETA did not.\"\n\nHe performed a mentalism and magic act at The Magic Castle in Hollywood, California from April 24 to 30, 2006, and was later named The Academy of Magical Arts Parlor Magician of the Year for this act. Alexander had previously been given the Academy's Junior Achievement Award in 1989. Alexander was the national spokesman for the Scleroderma Foundation, a leading organization dedicated to raising awareness of the disease and assisting those who are afflicted. Alexander voiced the character Abis Mal in The Return of Jafar and the television series based on Disney's 1992 animated film, Aladdin. Jason Alexander guest starred in Malcolm in the Middle as an intelligent but unpleasant individual (Lenard) who Malcolm meets in the park. He makes money as a telephone salesman and spends his time playing chess in the park. Malcolm, afraid of ending up like Lenard, tries to get him to change his ways and get a full-time job. In 2007, Alexander appeared in a commercial for the ASPCA, which has aired on cable TV stations. In 1987, Alexander appeared in a commercial for Miller Lite, with Yogi Berra as the celebrity, speaking about Miller Lite using his unique malapropism eloquence, sitting at a bar with many others including a young Jason Alexander standing behind Berra's left shoulder.\n\nIn 2009, Alexander lent his voice talents in the Thomas Nelson audio Bible production known as The Word of Promise. In this dramatized audio, Alexander played the character of Joseph. The project featured a large ensemble of well known Hollywood actors including Jim Caviezel, Lou Gossett Jr., John Rhys-Davies, Jon Voight, Gary Sinise, Christopher McDonald, Marissa Tomei and John Schneider.[http://wordofpromise.thomasnelson.com/cast.php]  \n\nPoker career\n\nIn recent years, Alexander has also competed on televised poker shows and in various tournaments. He has appeared twice on Bravo's Celebrity Poker Showdown, winning the final table of the 8th season. Alexander won the $500,000 prize for his charity, The United Way of America to help benefit the New Orleans Area. Alexander played in the 2007 World Series of Poker main event, but was eliminated on the second day. He returned to play in 2009. He made it to Day 3 of the event, finishing in the top 30% of the field. Alexander has appeared on NBC's Poker After Dark in the \"Celebrities and Mentors\" episode, finishing in 6th place after being eliminated by professional poker player Gavin Smith. Alexander signed with PokerStars where he plays under the screen name \"J. Alexander\".\n\nRecent appearances\n\nAlexander was host of the LOL Sudbury opening night gala in Sudbury, Ontario, Canada on May 29, 2008, which was simulcast throughout Canada at 60 Cineplex theaters, a first for any comedy festival. He has loaned his voice to several episodes of the Twilight Zone Radio Dramas.\n\nIn 2008 and again in 2009, Alexander fronted Jason Alexander's Comedy Spectacular, a routine exclusive to Australia. The show consists of stand-up and improvisation and incorporates Alexander's musical talent. He is backed up by a number of well-known Australian comedians. His first time performing a similar show of this nature was in 2006 for Jason Alexander's Comedy Christmas. In February/March 2010, Alexander starred in his own show, The Donny Clay Experience, at the Planet Hollywood Resort in Las Vegas, Nevada. The Donny Clay character, which he has performed in a tour of the United States, is a self-help guru in a similar mold to his Bob Patterson character.\n\nIt was announced in July 2010 that Alexander would be joining the cast of the Nickelodeon films based on their series The Fairly OddParents, A Fairly Odd Movie: Grow Up, Timmy Turner! and A Fairly Odd Christmas. He played Cosmo, one of Timmy Turner's fairies.\n\nOn January 6, 2010, it was announced that Alexander would be the new face of the weight loss company Jenny Craig.\n\nAlexander stars in the music video for Nickelback's \"Trying Not to Love You\" as a coffee foam artist.\n\nOn January 6, 2015, Alexander made an appearance in a YouTube video with one of his son's popular YouTuber friends.\n\nPersonal life\n\nAlexander has been married to Daena E. Title since May 31, 1982. They have two sons, Gabriel and Noah.\n\nAlexander has been a prominent public supporter of the OneVoice initiative, which seeks out opinions from moderate Israelis and Palestinians who want to achieve a mutual peace agreement between their societies. He explained on Real Time with Bill Maher (July 17, 2009) that he has visited Israel many times. On his appearance, he spoke about progress towards peace that he has recently observed.\n\nIn 2012, Alexander announced his support for the re-election of President Barack Obama.\n\nFilmography\n\nFilm\n\nTelevision\n\nAs actor\n\n2017\nI\"Narcos\"\nSeason 3\n\nAs director\n\nVideo game\n\nStage. Jason Alexander. http://en.wikipedia.org/?curid=16480."
  }
}
