{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18422",
  "eid" : "32d84250-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778594549,
  "textBody" : "Linear algebra is the branch of mathematics concerning linear equations such as \na_1x_1+\\cdots +a_nx_n=b,\nlinear functions such as\n(x_1, \\ldots, x_n) \\mapsto a_1x_1+\\ldots +a_nx_n,\nand their representations through matrices and vector spaces.\n\nLinear algebra is central to almost all areas of mathematics. For instance, linear algebra is fundamental in modern presentations of geometry, including for defining basic objects such as lines, planes and rotations. Also, functional analysis may be basically viewed as the application of linear algebra to spaces of functions. Linear algebra is also used in most sciences and engineering areas, because it allows modeling many natural phenomena, and efficiently computing with such models. For nonlinear systems, which cannot be modeled with linear algebra, linear algebra is often used as a first approximation.\n\nHistory\n\nFrom the study of determinants and matrices to modern linear algebra\n\nThe study of linear algebra first emerged from the introduction of determinants, for solving systems of linear equations. Determinants were considered by Leibniz in 1693, and subsequently, in 1750, Gabriel Cramer used them for giving explicit solutions of linear system, now called Cramer's Rule. Later, Gauss further developed the theory of solving linear systems by using Gaussian elimination, which was initially listed as an advancement in geodesy.\n\nThe study of matrix algebra first emerged in England in the mid-1800s. In 1844 Hermann Grassmann published his \"Theory of Extension\" which included foundational new topics of what is today called linear algebra. In 1848, James Joseph Sylvester introduced the term matrix, which is Latin for \"womb\". While studying compositions of linear transformations, Arthur Cayley was led to define matrix multiplication and inverses. Crucially, Cayley used a single letter to denote a matrix, thus treating a matrix as an aggregate object. He also realized the connection between matrices and determinants, and wrote \"There would be many things to say about this theory of matrices which should, it seems to me, precede the theory of determinants\".\n\nIn 1882, Hüseyin Tevfik Pasha wrote the book titled \"Linear Algebra\".http://www.journals.istanbul.edu.tr/tr/index.php/oba/article/download/9103/8452https://archive.org/details/linearalgebra00tevfgoog The first modern and more precise definition of a vector space was introduced by Peano in 1888; by 1900, a theory of linear transformations of finite-dimensional vector spaces had emerged. Linear algebra took its modern form in the first half of the twentieth century, when many ideas and methods of previous centuries were generalized as abstract algebra. The use of matrices in quantum mechanics, special relativity, and statistics helped spread the subject of linear algebra beyond pure mathematics. The development of computers led to increased research in efficient algorithms for Gaussian elimination and matrix decompositions, and linear algebra became an essential tool for modelling and simulations.\n\nThe origin of many of these ideas is discussed in the articles on determinants and Gaussian elimination.\n\nEducational history\n\nLinear algebra first appeared in American graduate textbooks in the 1940s and in undergraduate textbooks in the 1950s. Following work by the School Mathematics Study Group, U.S. high schools asked 12th grade students to do \"matrix algebra, formerly reserved for college\" in the 1960s.  In France during the 1960s, educators attempted to teach linear algebra through finite-dimensional vector spaces in the first year of secondary school. This was met with a backlash in the 1980s that removed linear algebra from the curriculum. In 1993, the U.S.-based Linear Algebra Curriculum Study Group recommended that undergraduate linear algebra courses be given an application-based \"matrix orientation\" as opposed to a theoretical orientation.\nReviews of the teaching of linear algebra call for stress on visualization and geometric interpretation of theoretical ideas,Carol S. Schumacher, Martha J. Siegel, and Paul Zorn (2015) 2015 CUPM Curriculum Guide to Majors in the Mathematical Sciences. The Mathematical Association of America. [http://www.maa.org/programs/faculty-and-departments/curriculum- department-guidelines-recommendations/cupm] and to include the jewel in the crown of linear algebra, the singular value decomposition (SVD), as 'so many other disciplines use it'.Peter R. Turner et al. (2015) Modeling across the Curriculum II. Report on the second SIAM-NSF Workshop, Alexandria, VA. [http://www.siam.org/reports/modeling_14.pdf]  To better suit 21st century applications, such as data mining and uncertainty analysis, linear algebra can be based upon the SVD instead of Gaussian Elimination.[http://au.mathworks.com/company/newsletters/articles/professor-svd.html Cleve Moler, (2006) Mathworks]A. J. Roberts (2017) Linear Algebra Reformed for 21st-C Application. [https://raw.github.com/uoa1184615/LinearAlgebraGit/master/larxxia-newest.pdf]\n\nScope of study\n\nVector spaces\n\nThe main structures of linear algebra are vector spaces. A vector space over a field F (often the field of the real numbers) is a set V equipped with two binary operations satisfying the following axioms.  \nElements of V are called vectors, and elements of F are called scalars. The first operation, vector addition, takes any two vectors v and w and outputs a third vector . The second operation, scalar multiplication, takes any scalar a and any vector v and outputs a new . The operations of addition and multiplication in a vector space must satisfy the following axioms. In the list below, let u, v and w be arbitrary vectors in V, and a and b scalars in F.\n\nThe first four axioms are those of V being an abelian group under vector addition. Elements of a vector space may have various nature; for example, they can be sequences, functions, polynomials or matrices. Linear algebra is concerned with properties common to all vector spaces.\n\nLinear transformations\n\nSimilarly as in the theory of other algebraic structures, linear algebra studies mappings between vector spaces that preserve the vector-space structure. Given two vector spaces V and W over a field F, a linear transformation (also called linear map, linear mapping or linear operator) is a map\n\n T:V\\to W \n\nthat is compatible with addition and scalar multiplication:\n\n T(u+v)T(u)+T(v), \\quad T(av)\naT(v) \n\nfor any vectors u,v ∈ V and a scalar a ∈ F.\n\nAdditionally for any vectors u, v ∈ V and scalars a, b ∈ F:\n\n \\quad T(au+bv)T(au)+T(bv)\naT(u)+bT(v) \n\nWhen a bijective linear mapping exists between two vector spaces (that is, every vector from the second space is associated with exactly one in the first), we say that the two spaces are isomorphic. Because an isomorphism preserves linear structure, two isomorphic vector spaces are \"essentially the same\" from the linear algebra point of view. One essential question in linear algebra is whether a mapping is an isomorphism or not, and this question can be answered by checking if the determinant is nonzero. If a mapping is not an isomorphism, linear algebra is interested in finding its range (or image) and the set of elements that get mapped to zero, called the kernel of the mapping.\n\nLinear transformations have geometric significance. For example, 2 × 2 real matrices denote standard planar mappings that preserve the origin.\n\nSubspaces, span, and basis\n\nAgain, in analogue with theories of other algebraic objects, linear algebra is interested in subsets of vector spaces that are themselves vector spaces; these subsets are called linear subspaces. For example, both the range and kernel of a linear mapping are subspaces, and are thus often called the range space and the nullspace; these are important examples of subspaces. Another important way of forming a subspace is to take a linear combination of a set of vectors v1, v2, ..., vk:\n\n a_1 v_1 + a_2 v_2 + \\cdots + a_k v_k,\n\nwhere a1, a2, ..., ak are scalars. The set of all linear combinations of vectors v1, v2, ..., vk is called their span, which forms a subspace.\n\nA linear combination of any system of vectors with all zero coefficients is the zero vector of V. If this is the only way to express the zero vector as a linear combination of v1, v2, ..., vk then these vectors are linearly independent. Given a set of vectors that span a space, if any vector w is a linear combination of other vectors (and so the set is not linearly independent), then the span would remain the same if we remove w from the set. Thus, a set of linearly dependent vectors is redundant in the sense that there will be a linearly independent subset which will span the same subspace. Therefore, we are mostly interested in a linearly independent set of vectors that spans a vector space V, which we call a basis of V. Any set of vectors that spans V contains a basis, and any linearly independent set of vectors in V can be extended to a basis.Axler (2004), pp. 28–29 It turns out that if we accept the axiom of choice, every vector space has a basis;The existence of a basis is straightforward for countably generated vector spaces, and for well-ordered vector spaces, but in full generality it is logically equivalent to the axiom of choice. nevertheless, this basis may be unnatural, and indeed, may not even be constructible. For instance, there exists a basis for the real numbers, considered as a vector space over the rationals, but no explicit basis has been constructed.\n\nAny two bases of a vector space V have the same cardinality, which is called the dimension of V. The dimension of a vector space is well-defined by the dimension theorem for vector spaces. If a basis of V has finite number of elements, V is called a finite-dimensional vector space. If V is finite-dimensional and U is a subspace of V, then dim U ≤ dim V. If U1 and U2 are subspaces of V, then\n\n\\dim(U_1 + U_2) = \\dim U_1 + \\dim U_2 - \\dim(U_1 \\cap U_2).Axler (2204), p. 33\n\nOne often restricts consideration to finite-dimensional vector spaces. A fundamental theorem of linear algebra states that all vector spaces of the same dimension are isomorphic,Axler (2004), p. 55 giving an easy way of characterizing isomorphism.\n\nMatrix theory\n\nA particular basis {v1, v2, ..., vn} of V allows one to construct a coordinate system in V: the vector with coordinates (a1, a2, ..., an) is the linear combination\n\n a_1 v_1 + a_2 v_2 + \\cdots + a_n v_n. \\, \n\nThe condition that v1, v2, ..., vn span V guarantees that each vector v can be assigned coordinates, whereas the linear independence of v1, v2, ..., vn assures that these coordinates are unique (i.e. there is only one linear combination of the basis vectors that is equal to v). In this way, once a basis of a vector space V over F has been chosen, V may be identified with the coordinate n-space Fn. Under this identification, addition and scalar multiplication of vectors in V correspond to addition and scalar multiplication of their coordinate vectors in Fn. Furthermore, if V and W are an n-dimensional and m-dimensional vector space over F, and a basis of V and a basis of W have been fixed, then any linear transformation T: V → W may be encoded by an m × n matrix A with entries in the field F, called the matrix of T with respect to these bases. Two matrices that encode the same linear transformation in different bases are called similar. Matrix theory replaces the study of linear transformations, which were defined axiomatically, by the study of matrices, which are concrete objects. This major technique distinguishes linear algebra from theories of other algebraic structures, which usually cannot be parameterized so concretely.\n\nThere is an important distinction between the coordinate n-space Rn and a general finite-dimensional vector space V. While Rn has a standard basis {e1, e2, ..., en}, a vector space V typically does not come equipped with such a basis and many different bases exist (although they all consist of the same number of elements equal to the dimension of V).\n\nOne major application of the matrix theory is calculation of determinants, a central concept in linear algebra. While determinants could be defined in a basis-free manner, they are usually introduced via a specific representation of the mapping; the value of the determinant does not depend on the specific basis. It turns out that a mapping has an inverse if and only if the determinant has an inverse (every non-zero real or complex number has an inverseIf we restrict to integers, then only 1 and -1 have an inverse. Consequently, the inverse of an integer matrix is an integer matrix if and only if the determinant is 1 or -1.). If the determinant is zero, then the nullspace is nontrivial. Determinants have other applications, including a systematic way of seeing if a set of vectors is linearly independent (we write the vectors as the columns of a matrix, and if the determinant of that matrix is zero, the vectors are linearly dependent). Determinants could also be used to solve systems of linear equations (see Cramer's rule), but in real applications, Gaussian elimination is a faster method.\n\nEigenvalues and eigenvectors\n\nIn general, the action of a linear transformation may be quite complex. Attention to low-dimensional examples gives an indication of the variety of their types. One strategy for a general n-dimensional transformation T is to find \"characteristic lines\" that are invariant sets under T. If v is a non-zero vector such that Tv is a scalar multiple of v, then the line through 0 and v is an invariant set under T and v is called a characteristic vector or eigenvector. The scalar λ such that Tv = λv is called a characteristic value or eigenvalue of T.\n\nTo find an eigenvector or an eigenvalue, we note that\n\nTv-\\lambda v(T-\\lambda \\, \\text{I})v\n0,\n\nwhere I is the identity matrix. For there to be nontrivial solutions to that equation, det(T − λ I) 0. The determinant is a polynomial, and so the eigenvalues are not guaranteed to exist if the field is R. Thus, we often work with an algebraically closed field such as the complex numbers when dealing with eigenvectors and eigenvalues so that an eigenvalue will always exist. It would be particularly nice if given a transformation T taking a vector space V into itself we can find a basis for V consisting of eigenvectors. If such a basis exists, we can easily compute the action of the transformation on any vector: if v1, v2, ..., vn are linearly independent eigenvectors of a mapping of n-dimensional spaces T with (not necessarily distinct) eigenvalues λ1, λ2, ..., λn, and if v \n a1v1 + ... + an vn, then,\n\nT(v)T(a_1 v_1)+\\cdots+T(a_n v_n)\na_1 T(v_1)+\\cdots+a_n T(v_n)=a_1 \\lambda_1 v_1 + \\cdots +a_n \\lambda_n v_n.\n\nSuch a transformation is called a diagonalizable matrix since in the eigenbasis, the transformation is represented by a diagonal matrix. Because operations like matrix multiplication, matrix inversion, and determinant calculation are simple on diagonal matrices, computations involving matrices are much simpler if we can bring the matrix to a diagonal form. Not all matrices are diagonalizable (even over an algebraically closed field).\n\nInner-product spaces\n\nBesides these basic concepts, linear algebra also studies vector spaces with additional structure, such as an inner product. The inner product is an example of a bilinear form, and it gives the vector space a geometric structure by allowing for the definition of length and angles. Formally, an inner product is a map\n\n \\langle \\cdot, \\cdot \\rangle : V \\times V \\rightarrow F \n\nthat satisfies the following three axioms for all vectors u, v, w in V and all scalars a in F:\n* Conjugate symmetry:\n\n:\\langle u,v\\rangle =\\overline{\\langle v,u\\rangle}.\nNote that in R, it is symmetric.\n* Linearity in the first argument:\n\n:\\langle au,v\\rangle= a \\langle u,v\\rangle.\n:\\langle u+v,w\\rangle= \\langle u,w\\rangle+ \\langle v,w\\rangle.\n* Positive-definiteness:\n\n:\\langle v,v\\rangle \\geq 0 with equality only for v = 0.\n\nWe can define the length of a vector v in V by\n\\|v\\|^2=\\langle v,v\\rangle,\nand we can prove the Cauchy–Schwarz inequality:\n|\\langle u,v\\rangle| \\leq \\|u\\| \\cdot \\|v\\|.\n\nIn particular, the quantity\n\\frac{\\|u\\| \\cdot \\|v\\|} \\leq 1,\nand so we can call this quantity the cosine of the angle between the two vectors.\n\nTwo vectors are orthogonal if \\langle u, v\\rangle 0. An orthonormal basis is a basis where all basis vectors have length 1 and are orthogonal to each other. Given any finite-dimensional vector space, an orthonormal basis could be found by the Gram–Schmidt procedure. Orthonormal bases are particularly nice to deal with, since if v \n a1 v1 + ... + an vn, then a_i = \\langle v,v_i \\rangle.\n\nThe inner product facilitates the construction of many useful concepts. For instance, given a transform T, we can define its Hermitian conjugate T* as the linear transform satisfying\n \\langle T u, v \\rangle = \\langle u, T^* v\\rangle.\nIf T satisfies TT* = T*T, we call T normal. It turns out that normal matrices are precisely the matrices that have an orthonormal system of eigenvectors that span V.\n\nSome main useful theorems\n\n* A matrix is invertible, or non-singular, if and only if the linear map represented by the matrix is an isomorphism.\n* Any vector space over a field F of dimension n is isomorphic to Fn as a vector space over F.\n* Corollary: Any two vector spaces over F of the same finite dimension are isomorphic to each other.\n* A linear map is an isomorphism if and only if the determinant is nonzero.\n\nApplications\n\nBecause of the ubiquity of vector spaces, linear algebra is used in many fields of mathematics, natural sciences, computer science, and social science. Below are just some examples of applications of linear algebra.\n\nSolution of linear systems\n\nLinear algebra provides the formal setting for the linear combination of equations used in the Gaussian method. Suppose the goal is to find and describe the solution(s), if any, of the following system of linear equations:\n\\begin{alignat}{7}\n2x &&\\; + \\;&& y             &&\\; - \\;&& z  &&\\; = \\;&& 8 & \\qquad (L_1) \\\\\n-3x &&\\; - \\;&& y             &&\\; + \\;&& 2z &&\\; = \\;&& -11 & \\qquad (L_2) \\\\\n-2x &&\\; + \\;&& y &&\\; +\\;&& 2z  &&\\; = \\;&& -3 &  \\qquad (L_3)\n\\end{alignat}\n\nThe Gaussian-elimination algorithm is as follows: eliminate x from all equations below L1, and then eliminate y from all equations below L2. This will put the system into triangular form. Then, using back-substitution, each unknown can be solved for.\n\nIn the example, x is eliminated from L2 by adding (3/2)L1 to L2. x is then eliminated from L3 by adding L1 to L3. Formally:\n\nL_2 + \\tfrac{3}{2}L_1 \\rightarrow L_2\nL_3 + L_1 \\rightarrow L_3\n\nThe result is:\n\\begin{alignat}{7}\n2x &&\\; + && y &&\\; - &&\\; z &&\\; = \\;&& 8 & \\\\\n&& && \\frac{1}{2}y &&\\; + &&\\; \\frac{1}{2}z &&\\; = \\;&& 1 & \\\\\n&& && 2y &&\\; + &&\\; z &&\\; = \\;&& 5 &\n\\end{alignat}\n\nNow y is eliminated from L3 by adding −4L2 to L3:\n\nL_3 + -4L_2 \\rightarrow L_3\n\nThe result is:\n\\begin{alignat}{7}\n2x &&\\; + && y \\;&& - &&\\; z \\;&& = \\;&& 8 & \\\\\n&& && \\frac{1}{2}y \\;&& + &&\\; \\frac{1}{2}z \\;&& = \\;&& 1 & \\\\\n&& && && &&\\; -z \\;&&\\; = \\;&& 1 &\n\\end{alignat}\n\nThis result is a system of linear equations in triangular form, and so the first part of the algorithm is complete.\n\nThe last part, back-substitution, consists of solving for the known in reverse order. It can thus be seen that\n\nz = -1 \\quad (L_3)\n\nThen, z can be substituted into L2, which can then be solved to obtain\n\ny = 3 \\quad (L_2)\n\nNext, z and y can be substituted into L1, which can be solved to obtain\n\nx = 2 \\quad (L_1)\n\nThe system is solved.\n\nWe can, in general, write any system of linear equations as a matrix equation:\nAx=b.\nThe solution of this system is characterized as follows: first, we find a particular solution x0 of this equation using Gaussian elimination. Then, we compute the solutions of Ax 0; that is, we find the null space N of A. The solution set of this equation is given by x_0+N\n\\{x_0+n: n\\in N \\}. If the number of variables is equal to the number of equations, then we can characterize when the system has a unique solution: since N is trivial if and only if det A ≠ 0, the equation has a unique solution if and only if det A ≠ 0.\n\nLeast-squares best-fit line\n\nThe least squares method is used to determine the best-fit line for a set of data. This line will minimize the sum of the squares of the residuals.\n\nFourier series expansion\n\nFourier series are a representation of a function f: [−π, π] → R as a trigonometric series:\n\nf(x)\\frac{a_0}{2} + \\sum_{n\n1}^\\infty \\, [a_n \\cos(nx) + b_n \\sin(nx)].\n\nThis series expansion is extremely useful in solving partial differential equations. In this article, we will not be concerned with convergence issues; it is nice to note that all Lipschitz-continuous functions have a converging Fourier series expansion, and nice enough discontinuous functions have a Fourier series that converges to the function value at most points.\n\nThe space of all functions that can be represented by a Fourier series form a vector space (technically speaking, we call functions that have the same Fourier series expansion the \"same\" function, since two different discontinuous functions might have the same Fourier series). Moreover, this space is also an inner product space with the inner product\n\n\\langle f,g \\rangle= \\frac{1}{\\pi} \\int_{-\\pi}^\\pi f(x) g(x) \\, dx.\n\nThe functions gn(x) sin(nx)  for n > 0 and hn(x) \n cos(nx) for n ≥ 0 are an orthonormal basis for the space of Fourier-expandable functions. We can thus use the tools of linear algebra to find the expansion of any function in this space in terms of these basis functions. For instance, to find the coefficient ak, we take the inner product with hk:\n\\langle f,h_k \\rangle\\frac{a_0}{2}\\langle h_0,h_k \\rangle + \\sum_{n\n1}^\\infty \\, [a_n \\langle h_n,h_k\\rangle + b_n \\langle\\ g_n,h_k \\rangle],\nand by orthonormality,  \\langle f,h_k\\rangle=a_k; that is,\n a_k = \\frac{1}{\\pi} \\int_{-\\pi}^\\pi f(x) \\cos(kx) \\, dx.\n\nQuantum mechanics\n\nQuantum mechanics is highly inspired by notions in linear algebra. In quantum mechanics, the physical state of a particle is represented by a vector, and observables (such as momentum, energy, and angular momentum) are represented by linear operators on the underlying vector space. More concretely, the wave function of a particle describes its physical state and lies in the vector space L2 (the functions φ: R3 → C such that \\int_{-\\infty}^\\infty \\int_{-\\infty}^\\infty \\int_{-\\infty}^{\\infty} |\\phi|^2 dxdydz is finite), and it evolves according to the Schrödinger equation. Energy is represented as the operator H=-\\frac{\\hbar^2}{2m} \\nabla^2 + V(x,y,z), where V is the potential energy. H is also known as the Hamiltonian operator. The eigenvalues of H represent the possible energies that can be observed. Given a particle in some state φ, we can expand φ into a linear combination of eigenstates of H. The component of φ in each eigenstate determines the probability of measuring the corresponding eigenvalue, and the measurement forces the particle to assume that eigenstate (wave function collapse).\n\nGeometric introduction\n\nMany of the principles and techniques of linear algebra can be seen in the geometry of lines in a real two-dimensional plane E.  When formulated using vectors and matrices the geometry of points and lines in the plane can be extended to the geometry of points and hyperplanes in high-dimensional spaces.\n\nPoint coordinates in the plane E are ordered pairs of real numbers, (x,y), and a line is defined as the set of points (x,y) that satisfy the linear equation,\n \\lambda: ax+by + c =0, \nwhere a, b and c are not all zero.\nThen,\n \\lambda: \\begin{bmatrix} a & b & c\\end{bmatrix} \\begin{Bmatrix} x\\\\ y \\\\1\\end{Bmatrix} = 0, \nor\n A\\mathbf{x}=0,\nwhere x (x, y, 1) is the 3 × 1 set of homogeneous coordinates associated with the point (x, y).J. G. Semple and G. T. Kneebone, Algebraic Projective Geometry, Clarendon Press, London, 1952.\n\nHomogeneous coordinates identify the plane E with the z 1 plane in three-dimensional space.  The x−y coordinates in E are obtained from homogeneous coordinates y \n (y1, y2, y3) by dividing by the third component (if it is nonzero) to obtain y = (y1/y3, y2/y3, 1).\n\nThe linear equation, λ, has the important property, that if x1 and x2 are homogeneous coordinates of points on the line, then the point αx1 + βx2 is also on the line, for any real α and β.\n\nNow consider the equations of the two lines λ1 and λ2,\n\\lambda_1: a_1 x+b_1 y + c_1 0,\\quad   \\lambda_2: a_2 x+b_2 y + c_2 \n0, \nwhich forms a system of linear equations.  The intersection of these two lines is defined by x = (x, y, 1) that satisfy the matrix equation,\n\\lambda_{1,2}: \\begin{bmatrix} a_1 & b_1 & c_1\\\\ a_2 & b_2 & c_2 \\end{bmatrix} \\begin{Bmatrix} x\\\\ y \\\\1\\end{Bmatrix} = \\begin{Bmatrix}0\\\\0 \\end{Bmatrix},\nor using homogeneous coordinates,\n B\\mathbf{x}=0.\nThe point of intersection of these two lines is the unique non-zero solution of these equations.  In homogeneous coordinates,\nthe solutions are multiples of the following solution:\n x_1 \\begin{vmatrix} b_1 & c_1\\\\ b_2 & c_2\\end{vmatrix}, x_2 \n -\\begin{vmatrix} a_1 & c_1\\\\ a_2 & c_2\\end{vmatrix}, x_3 = \\begin{vmatrix} a_1 & b_1\\\\ a_2 & b_2\\end{vmatrix}\nif the rows of B are linearly independent (i.e., λ1 and λ2 represent distinct lines).\nDivide through by x3 to get Cramer's rule for the solution of a set of two linear equations in two unknowns.E. D. Nering, Linear Algebra and Matrix Theory, John-Wiley, New York, NY, 1963   Notice that this yields a point in the z \n 1 plane only when the 2 × 2 submatrix associated with x3 has a non-zero determinant.\n\nIt is interesting to consider the case of three lines, λ1, λ2 and λ3, which yield the matrix equation,\n\\lambda_{1,2,3}: \\begin{bmatrix} a_1 & b_1 & c_1\\\\ a_2 & b_2 & c_2 \\\\ a_3 & b_3 & c_3\\end{bmatrix} \\begin{Bmatrix} x\\\\ y \\\\1\\end{Bmatrix} = \\begin{Bmatrix}0\\\\0 \\\\0\\end{Bmatrix}.\nwhich in homogeneous form yields,\n C\\mathbf{x}=0.\nClearly, this equation has the solution x (0,0,0), which is not a point on the z \n 1 plane E.  For a solution to exist in the plane E, the coefficient matrix C must have rank 2, which means its determinant must be zero.  Another way to say this is that the columns of the matrix must be linearly dependent.\n\nIntroduction to linear transformations\n\nAnother way to approach linear algebra is to consider linear functions on the two-dimensional real plane ER2.  Here R denotes the set of real numbers.   Let x\n(x, y) be an arbitrary vector in E and consider the linear function λ: E→R, given by\n \\lambda: \\begin{bmatrix}a & b\\end{bmatrix}\\begin{Bmatrix} x\\\\y\\end{Bmatrix} = c,\nor\nA\\mathbf{x}=c.\nThis transformation has the important property that if Ay=d, then\n A(\\alpha\\mathbf{x}+\\beta \\mathbf{y}) \\alpha A \\mathbf{x} + \\beta A\\mathbf{y} \n \\alpha c + \\beta d.\nThis shows that the sum of vectors in E map to the sum of their images in R.  This is the defining characteristic of a linear map, or linear transformation.  For this case, where the image space is a real number the map is called a linear functional.\n\nConsider the linear functional a little more carefully.  Let i(1,0) and j \n(0,1) be the natural basis vectors on E, so that x=xi+yj.  It is now possible to see that\n A\\mathbf{x} A(x\\mathbf{i}+y\\mathbf{j})\nx A\\mathbf{i} + y A\\mathbf{j} \\begin{bmatrix}A\\mathbf{i} & A\\mathbf{j}\\end{bmatrix}\\begin{Bmatrix} x\\\\y\\end{Bmatrix} \n \\begin{bmatrix}a & b\\end{bmatrix}\\begin{Bmatrix} x\\\\y\\end{Bmatrix} = c.\nThus, the columns of the matrix A are the image of the basis vectors of E in R.\n\nThis is true for any pair of vectors used to define coordinates in E.   Suppose we select a non-orthogonal non-unit vector basis v and w to define coordinates of vectors in E.  This means a vector x has coordinates (α,β), such that x=αv+βw.  Then, we have the linear functional\n \\lambda: A\\mathbf{x} \\begin{bmatrix} A\\mathbf{v} & A\\mathbf{w} \\end{bmatrix}\\begin{Bmatrix} \\alpha \\\\ \\beta \\end{Bmatrix}  \n \\begin{bmatrix} d & e \\end{bmatrix}\\begin{Bmatrix} \\alpha \\\\ \\beta \\end{Bmatrix}  =c,\nwhere Avd and Aw\ne are the images of the basis vectors  v and w.   This is written in matrix form as\n \\begin{bmatrix}a & b\\end{bmatrix} \\begin{bmatrix} v_1 & w_1 \\\\ v_2 & w_2 \\end{bmatrix}  =\\begin{bmatrix} d & e \\end{bmatrix}.\n\nCoordinates relative to a basis\n\nThis leads to the question of how to determine the coordinates of a vector x relative to a general basis v and w in E.  Assume that we know the coordinates of the vectors, x, v and w  in the natural basis i(1,0) and j \n(0,1).  Our goal is to find the real numbers α, β, so that x=αv+βw, that is\n \\begin{Bmatrix} x \\\\ y \\end{Bmatrix} = \\begin{bmatrix} v_1 & w_1 \\\\ v_2 & w_2 \\end{bmatrix} \\begin{Bmatrix} \\alpha \\\\ \\beta\\end{Bmatrix}.\n\nTo solve this equation for α, β, we compute the linear coordinate functionals σ and τ for the basis v, w, which are given by,\n \\sigma \\begin{bmatrix}\\sigma_1 &\\sigma_2\\end{bmatrix}\n\\frac{1}{v_1 w_2- v_2w_1}\\begin{bmatrix} w_2 & - w_1\\end{bmatrix},  \\tau \\begin{bmatrix}\\tau_1 &\\tau_2\\end{bmatrix}\n\\frac{1}{v_1 w_2- v_2w_1}\\begin{bmatrix}  -v_2  & v_1\\end{bmatrix}, \nThe functionals σ and τ compute the components of x along the basis vectors v and w, respectively, that is,\n\\sigma \\mathbf{x}\\alpha, \\tau\\mathbf{x}\n\\beta,\nwhich can be written in matrix form as\n \\begin{bmatrix} \\sigma_1 & \\sigma_2 \\\\ \\tau_1 &\\tau_2 \\end{bmatrix} \\begin{Bmatrix} x \\\\ y \\end{Bmatrix} =\\begin{Bmatrix} \\alpha \\\\ \\beta\\end{Bmatrix}.\n\nThese coordinate functionals have the properties,\n \\sigma\\mathbf{v}1, \\sigma\\mathbf{w}\n0, \\tau\\mathbf{w}1, \\tau\\mathbf{v}\n0.\nThese equations can be assembled into the single matrix equation,\n \\begin{bmatrix} \\sigma_1 & \\sigma_2 \\\\ \\tau_1 &\\tau_2 \\end{bmatrix} \\begin{bmatrix} v_1 & w_1 \\\\ v_2 &w_2 \\end{bmatrix} = \\begin{bmatrix} 1& 0\\\\0 & 1\\end{bmatrix}.\nThus, the matrix formed by the coordinate linear functionals is the inverse of the matrix formed by the basis vectors.\n\nInverse image\n\nThe set of points in the plane E that map to the same image in R under the linear functional λ define a line in E. This line is the image of the inverse map, λ−1: R→E.  This inverse image is the set of  the points x=(x, y) that solve the equation,\n A\\mathbf{x}\\begin{bmatrix}a & b\\end{bmatrix}\\begin{Bmatrix} x\\\\y\\end{Bmatrix} \n c.\nNotice that a linear functional operates on known values for x(x, y) to compute a value c in R, while the inverse image seeks the values for x\n(x, y) that yield a specific value c.\n\nIn order to solve the equation, we first recognize that only one of the two unknowns (x,y) can be determined, so we select y to be determined, and rearrange the equation\n by = c - ax.\nSolve for y and obtain the inverse image as the set of points,\n \\mathbf{x}(t) \\begin{Bmatrix} 0\\\\ c/b\\end{Bmatrix} + t\\begin{Bmatrix} 1\\\\ -a/b\\end{Bmatrix}\n\\mathbf{p} + t\\mathbf{h}  .\nFor convenience the free parameter x has been relabeled t.\n\nThe vector p defines the intersection of the line with the y-axis, known as the y-intercept.  The vector h satisfies the homogeneous equation,\nA\\mathbf{h}\\begin{bmatrix}a & b\\end{bmatrix} \\begin{Bmatrix} 1\\\\ -a/b\\end{Bmatrix}\n 0.\nNotice that if h is a solution to this homogeneous equation, then t h is also a solution.\n\nThe set of points of a linear functional that map to zero define the kernel of the linear functional.  The line can be considered to be the set of points h in the kernel translated by the vector p.\n\nGeneralizations and related topics\n\nSince linear algebra is a successful theory, its methods have been developed and generalized in other parts of mathematics. In module theory, one replaces the field of scalars by a ring. The concepts of linear independence, span, basis, and dimension (which is called rank in module theory) still make sense. Nevertheless, many theorems from linear algebra become false in module theory. For instance, not all modules have a basis (those that do are called free modules), the rank of a free module is not necessarily unique, not every linearly independent subset of a module can be extended to form a basis, and not every subset of a module that spans the space contains a basis.\n\nIn multilinear algebra, one considers multivariable linear transformations, that is, mappings that are linear in each of a number of different variables. This line of inquiry naturally leads to the idea of the dual space, the vector space V∗ consisting of linear maps  where F is the field of scalars. Multilinear maps  can be described via tensor products of elements of V∗.\n\nIf, in addition to vector addition and scalar multiplication, there is a bilinear vector product , the vector space is called an algebra; for instance, associative algebras are algebras with an associate vector product (like the algebra of square matrices, or the algebra of polynomials).\n\nFunctional analysis mixes the methods of linear algebra with those of mathematical analysis and studies various function spaces, such as Lp spaces.\n\nRepresentation theory studies the actions of algebraic objects on vector spaces by representing these objects as matrices. It is interested in all the ways that this is possible, and it does so by finding subspaces invariant under all transformations of the algebra. The concept of eigenvalues and eigenvectors is especially important.\n\nAlgebraic geometry considers the solutions of systems of polynomial equations.\n\nThere are several related topics in the field of computer programming that utilize much of the techniques and theorems linear algebra encompasses and refers to.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Linear algebra" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18422" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Linear algebra is the branch of mathematics concerning linear equations such as \na_1x_1+\\cdots +a_nx_n=b,\nlinear functions such as\n(x_1, \\ldots, x_n) \\mapsto a_1x_1+\\ldots +a_nx_n,\nand their representations through matrices and vector spaces.\n\nLinear algebra is central to almost all areas of mathematics. For instance, linear algebra is fundamental in modern presentations of geometry, including for defining basic objects such as lines, planes and rotations. Also, functional analysis may be basically viewed as the application of linear algebra to spaces of functions. Linear algebra is also used in most sciences and engineering areas, because it allows modeling many natural phenomena, and efficiently computing with such models. For nonlinear systems, which cannot be modeled with linear algebra, linear algebra is often used as a first approximation.\n\nHistory\n\nFrom the study of determinants and matrices to modern linear algebra\n\nThe study of linear algebra first emerged from the introduction of determinants, for solving systems of linear equations. Determinants were considered by Leibniz in 1693, and subsequently, in 1750, Gabriel Cramer used them for giving explicit solutions of linear system, now called Cramer's Rule. Later, Gauss further developed the theory of solving linear systems by using Gaussian elimination, which was initially listed as an advancement in geodesy.\n\nThe study of matrix algebra first emerged in England in the mid-1800s. In 1844 Hermann Grassmann published his \"Theory of Extension\" which included foundational new topics of what is today called linear algebra. In 1848, James Joseph Sylvester introduced the term matrix, which is Latin for \"womb\". While studying compositions of linear transformations, Arthur Cayley was led to define matrix multiplication and inverses. Crucially, Cayley used a single letter to denote a matrix, thus treating a matrix as an aggregate object. He also realized the connection between matrices and determinants, and wrote \"There would be many things to say about this theory of matrices which should, it seems to me, precede the theory of determinants\".\n\nIn 1882, Hüseyin Tevfik Pasha wrote the book titled \"Linear Algebra\".http://www.journals.istanbul.edu.tr/tr/index.php/oba/article/download/9103/8452https://archive.org/details/linearalgebra00tevfgoog The first modern and more precise definition of a vector space was introduced by Peano in 1888; by 1900, a theory of linear transformations of finite-dimensional vector spaces had emerged. Linear algebra took its modern form in the first half of the twentieth century, when many ideas and methods of previous centuries were generalized as abstract algebra. The use of matrices in quantum mechanics, special relativity, and statistics helped spread the subject of linear algebra beyond pure mathematics. The development of computers led to increased research in efficient algorithms for Gaussian elimination and matrix decompositions, and linear algebra became an essential tool for modelling and simulations.\n\nThe origin of many of these ideas is discussed in the articles on determinants and Gaussian elimination.\n\nEducational history\n\nLinear algebra first appeared in American graduate textbooks in the 1940s and in undergraduate textbooks in the 1950s. Following work by the School Mathematics Study Group, U.S. high schools asked 12th grade students to do \"matrix algebra, formerly reserved for college\" in the 1960s.  In France during the 1960s, educators attempted to teach linear algebra through finite-dimensional vector spaces in the first year of secondary school. This was met with a backlash in the 1980s that removed linear algebra from the curriculum. In 1993, the U.S.-based Linear Algebra Curriculum Study Group recommended that undergraduate linear algebra courses be given an application-based \"matrix orientation\" as opposed to a theoretical orientation.\nReviews of the teaching of linear algebra call for stress on visualization and geometric interpretation of theoretical ideas,Carol S. Schumacher, Martha J. Siegel, and Paul Zorn (2015) 2015 CUPM Curriculum Guide to Majors in the Mathematical Sciences. The Mathematical Association of America. [http://www.maa.org/programs/faculty-and-departments/curriculum- department-guidelines-recommendations/cupm] and to include the jewel in the crown of linear algebra, the singular value decomposition (SVD), as 'so many other disciplines use it'.Peter R. Turner et al. (2015) Modeling across the Curriculum II. Report on the second SIAM-NSF Workshop, Alexandria, VA. [http://www.siam.org/reports/modeling_14.pdf]  To better suit 21st century applications, such as data mining and uncertainty analysis, linear algebra can be based upon the SVD instead of Gaussian Elimination.[http://au.mathworks.com/company/newsletters/articles/professor-svd.html Cleve Moler, (2006) Mathworks]A. J. Roberts (2017) Linear Algebra Reformed for 21st-C Application. [https://raw.github.com/uoa1184615/LinearAlgebraGit/master/larxxia-newest.pdf]\n\nScope of study\n\nVector spaces\n\nThe main structures of linear algebra are vector spaces. A vector space over a field F (often the field of the real numbers) is a set V equipped with two binary operations satisfying the following axioms.  \nElements of V are called vectors, and elements of F are called scalars. The first operation, vector addition, takes any two vectors v and w and outputs a third vector . The second operation, scalar multiplication, takes any scalar a and any vector v and outputs a new . The operations of addition and multiplication in a vector space must satisfy the following axioms. In the list below, let u, v and w be arbitrary vectors in V, and a and b scalars in F.\n\nThe first four axioms are those of V being an abelian group under vector addition. Elements of a vector space may have various nature; for example, they can be sequences, functions, polynomials or matrices. Linear algebra is concerned with properties common to all vector spaces.\n\nLinear transformations\n\nSimilarly as in the theory of other algebraic structures, linear algebra studies mappings between vector spaces that preserve the vector-space structure. Given two vector spaces V and W over a field F, a linear transformation (also called linear map, linear mapping or linear operator) is a map\n\n T:V\\to W \n\nthat is compatible with addition and scalar multiplication:\n\n T(u+v)T(u)+T(v), \\quad T(av)\naT(v) \n\nfor any vectors u,v ∈ V and a scalar a ∈ F.\n\nAdditionally for any vectors u, v ∈ V and scalars a, b ∈ F:\n\n \\quad T(au+bv)T(au)+T(bv)\naT(u)+bT(v) \n\nWhen a bijective linear mapping exists between two vector spaces (that is, every vector from the second space is associated with exactly one in the first), we say that the two spaces are isomorphic. Because an isomorphism preserves linear structure, two isomorphic vector spaces are \"essentially the same\" from the linear algebra point of view. One essential question in linear algebra is whether a mapping is an isomorphism or not, and this question can be answered by checking if the determinant is nonzero. If a mapping is not an isomorphism, linear algebra is interested in finding its range (or image) and the set of elements that get mapped to zero, called the kernel of the mapping.\n\nLinear transformations have geometric significance. For example, 2 × 2 real matrices denote standard planar mappings that preserve the origin.\n\nSubspaces, span, and basis\n\nAgain, in analogue with theories of other algebraic objects, linear algebra is interested in subsets of vector spaces that are themselves vector spaces; these subsets are called linear subspaces. For example, both the range and kernel of a linear mapping are subspaces, and are thus often called the range space and the nullspace; these are important examples of subspaces. Another important way of forming a subspace is to take a linear combination of a set of vectors v1, v2, ..., vk:\n\n a_1 v_1 + a_2 v_2 + \\cdots + a_k v_k,\n\nwhere a1, a2, ..., ak are scalars. The set of all linear combinations of vectors v1, v2, ..., vk is called their span, which forms a subspace.\n\nA linear combination of any system of vectors with all zero coefficients is the zero vector of V. If this is the only way to express the zero vector as a linear combination of v1, v2, ..., vk then these vectors are linearly independent. Given a set of vectors that span a space, if any vector w is a linear combination of other vectors (and so the set is not linearly independent), then the span would remain the same if we remove w from the set. Thus, a set of linearly dependent vectors is redundant in the sense that there will be a linearly independent subset which will span the same subspace. Therefore, we are mostly interested in a linearly independent set of vectors that spans a vector space V, which we call a basis of V. Any set of vectors that spans V contains a basis, and any linearly independent set of vectors in V can be extended to a basis.Axler (2004), pp. 28–29 It turns out that if we accept the axiom of choice, every vector space has a basis;The existence of a basis is straightforward for countably generated vector spaces, and for well-ordered vector spaces, but in full generality it is logically equivalent to the axiom of choice. nevertheless, this basis may be unnatural, and indeed, may not even be constructible. For instance, there exists a basis for the real numbers, considered as a vector space over the rationals, but no explicit basis has been constructed.\n\nAny two bases of a vector space V have the same cardinality, which is called the dimension of V. The dimension of a vector space is well-defined by the dimension theorem for vector spaces. If a basis of V has finite number of elements, V is called a finite-dimensional vector space. If V is finite-dimensional and U is a subspace of V, then dim U ≤ dim V. If U1 and U2 are subspaces of V, then\n\n\\dim(U_1 + U_2) = \\dim U_1 + \\dim U_2 - \\dim(U_1 \\cap U_2).Axler (2204), p. 33\n\nOne often restricts consideration to finite-dimensional vector spaces. A fundamental theorem of linear algebra states that all vector spaces of the same dimension are isomorphic,Axler (2004), p. 55 giving an easy way of characterizing isomorphism.\n\nMatrix theory\n\nA particular basis {v1, v2, ..., vn} of V allows one to construct a coordinate system in V: the vector with coordinates (a1, a2, ..., an) is the linear combination\n\n a_1 v_1 + a_2 v_2 + \\cdots + a_n v_n. \\, \n\nThe condition that v1, v2, ..., vn span V guarantees that each vector v can be assigned coordinates, whereas the linear independence of v1, v2, ..., vn assures that these coordinates are unique (i.e. there is only one linear combination of the basis vectors that is equal to v). In this way, once a basis of a vector space V over F has been chosen, V may be identified with the coordinate n-space Fn. Under this identification, addition and scalar multiplication of vectors in V correspond to addition and scalar multiplication of their coordinate vectors in Fn. Furthermore, if V and W are an n-dimensional and m-dimensional vector space over F, and a basis of V and a basis of W have been fixed, then any linear transformation T: V → W may be encoded by an m × n matrix A with entries in the field F, called the matrix of T with respect to these bases. Two matrices that encode the same linear transformation in different bases are called similar. Matrix theory replaces the study of linear transformations, which were defined axiomatically, by the study of matrices, which are concrete objects. This major technique distinguishes linear algebra from theories of other algebraic structures, which usually cannot be parameterized so concretely.\n\nThere is an important distinction between the coordinate n-space Rn and a general finite-dimensional vector space V. While Rn has a standard basis {e1, e2, ..., en}, a vector space V typically does not come equipped with such a basis and many different bases exist (although they all consist of the same number of elements equal to the dimension of V).\n\nOne major application of the matrix theory is calculation of determinants, a central concept in linear algebra. While determinants could be defined in a basis-free manner, they are usually introduced via a specific representation of the mapping; the value of the determinant does not depend on the specific basis. It turns out that a mapping has an inverse if and only if the determinant has an inverse (every non-zero real or complex number has an inverseIf we restrict to integers, then only 1 and -1 have an inverse. Consequently, the inverse of an integer matrix is an integer matrix if and only if the determinant is 1 or -1.). If the determinant is zero, then the nullspace is nontrivial. Determinants have other applications, including a systematic way of seeing if a set of vectors is linearly independent (we write the vectors as the columns of a matrix, and if the determinant of that matrix is zero, the vectors are linearly dependent). Determinants could also be used to solve systems of linear equations (see Cramer's rule), but in real applications, Gaussian elimination is a faster method.\n\nEigenvalues and eigenvectors\n\nIn general, the action of a linear transformation may be quite complex. Attention to low-dimensional examples gives an indication of the variety of their types. One strategy for a general n-dimensional transformation T is to find \"characteristic lines\" that are invariant sets under T. If v is a non-zero vector such that Tv is a scalar multiple of v, then the line through 0 and v is an invariant set under T and v is called a characteristic vector or eigenvector. The scalar λ such that Tv = λv is called a characteristic value or eigenvalue of T.\n\nTo find an eigenvector or an eigenvalue, we note that\n\nTv-\\lambda v(T-\\lambda \\, \\text{I})v\n0,\n\nwhere I is the identity matrix. For there to be nontrivial solutions to that equation, det(T − λ I) 0. The determinant is a polynomial, and so the eigenvalues are not guaranteed to exist if the field is R. Thus, we often work with an algebraically closed field such as the complex numbers when dealing with eigenvectors and eigenvalues so that an eigenvalue will always exist. It would be particularly nice if given a transformation T taking a vector space V into itself we can find a basis for V consisting of eigenvectors. If such a basis exists, we can easily compute the action of the transformation on any vector: if v1, v2, ..., vn are linearly independent eigenvectors of a mapping of n-dimensional spaces T with (not necessarily distinct) eigenvalues λ1, λ2, ..., λn, and if v \n a1v1 + ... + an vn, then,\n\nT(v)T(a_1 v_1)+\\cdots+T(a_n v_n)\na_1 T(v_1)+\\cdots+a_n T(v_n)=a_1 \\lambda_1 v_1 + \\cdots +a_n \\lambda_n v_n.\n\nSuch a transformation is called a diagonalizable matrix since in the eigenbasis, the transformation is represented by a diagonal matrix. Because operations like matrix multiplication, matrix inversion, and determinant calculation are simple on diagonal matrices, computations involving matrices are much simpler if we can bring the matrix to a diagonal form. Not all matrices are diagonalizable (even over an algebraically closed field).\n\nInner-product spaces\n\nBesides these basic concepts, linear algebra also studies vector spaces with additional structure, such as an inner product. The inner product is an example of a bilinear form, and it gives the vector space a geometric structure by allowing for the definition of length and angles. Formally, an inner product is a map\n\n \\langle \\cdot, \\cdot \\rangle : V \\times V \\rightarrow F \n\nthat satisfies the following three axioms for all vectors u, v, w in V and all scalars a in F:\n* Conjugate symmetry:\n\n:\\langle u,v\\rangle =\\overline{\\langle v,u\\rangle}.\nNote that in R, it is symmetric.\n* Linearity in the first argument:\n\n:\\langle au,v\\rangle= a \\langle u,v\\rangle.\n:\\langle u+v,w\\rangle= \\langle u,w\\rangle+ \\langle v,w\\rangle.\n* Positive-definiteness:\n\n:\\langle v,v\\rangle \\geq 0 with equality only for v = 0.\n\nWe can define the length of a vector v in V by\n\\|v\\|^2=\\langle v,v\\rangle,\nand we can prove the Cauchy–Schwarz inequality:\n|\\langle u,v\\rangle| \\leq \\|u\\| \\cdot \\|v\\|.\n\nIn particular, the quantity\n\\frac{\\|u\\| \\cdot \\|v\\|} \\leq 1,\nand so we can call this quantity the cosine of the angle between the two vectors.\n\nTwo vectors are orthogonal if \\langle u, v\\rangle 0. An orthonormal basis is a basis where all basis vectors have length 1 and are orthogonal to each other. Given any finite-dimensional vector space, an orthonormal basis could be found by the Gram–Schmidt procedure. Orthonormal bases are particularly nice to deal with, since if v \n a1 v1 + ... + an vn, then a_i = \\langle v,v_i \\rangle.\n\nThe inner product facilitates the construction of many useful concepts. For instance, given a transform T, we can define its Hermitian conjugate T* as the linear transform satisfying\n \\langle T u, v \\rangle = \\langle u, T^* v\\rangle.\nIf T satisfies TT* = T*T, we call T normal. It turns out that normal matrices are precisely the matrices that have an orthonormal system of eigenvectors that span V.\n\nSome main useful theorems\n\n* A matrix is invertible, or non-singular, if and only if the linear map represented by the matrix is an isomorphism.\n* Any vector space over a field F of dimension n is isomorphic to Fn as a vector space over F.\n* Corollary: Any two vector spaces over F of the same finite dimension are isomorphic to each other.\n* A linear map is an isomorphism if and only if the determinant is nonzero.\n\nApplications\n\nBecause of the ubiquity of vector spaces, linear algebra is used in many fields of mathematics, natural sciences, computer science, and social science. Below are just some examples of applications of linear algebra.\n\nSolution of linear systems\n\nLinear algebra provides the formal setting for the linear combination of equations used in the Gaussian method. Suppose the goal is to find and describe the solution(s), if any, of the following system of linear equations:\n\\begin{alignat}{7}\n2x &&\\; + \\;&& y             &&\\; - \\;&& z  &&\\; = \\;&& 8 & \\qquad (L_1) \\\\\n-3x &&\\; - \\;&& y             &&\\; + \\;&& 2z &&\\; = \\;&& -11 & \\qquad (L_2) \\\\\n-2x &&\\; + \\;&& y &&\\; +\\;&& 2z  &&\\; = \\;&& -3 &  \\qquad (L_3)\n\\end{alignat}\n\nThe Gaussian-elimination algorithm is as follows: eliminate x from all equations below L1, and then eliminate y from all equations below L2. This will put the system into triangular form. Then, using back-substitution, each unknown can be solved for.\n\nIn the example, x is eliminated from L2 by adding (3/2)L1 to L2. x is then eliminated from L3 by adding L1 to L3. Formally:\n\nL_2 + \\tfrac{3}{2}L_1 \\rightarrow L_2\nL_3 + L_1 \\rightarrow L_3\n\nThe result is:\n\\begin{alignat}{7}\n2x &&\\; + && y &&\\; - &&\\; z &&\\; = \\;&& 8 & \\\\\n&& && \\frac{1}{2}y &&\\; + &&\\; \\frac{1}{2}z &&\\; = \\;&& 1 & \\\\\n&& && 2y &&\\; + &&\\; z &&\\; = \\;&& 5 &\n\\end{alignat}\n\nNow y is eliminated from L3 by adding −4L2 to L3:\n\nL_3 + -4L_2 \\rightarrow L_3\n\nThe result is:\n\\begin{alignat}{7}\n2x &&\\; + && y \\;&& - &&\\; z \\;&& = \\;&& 8 & \\\\\n&& && \\frac{1}{2}y \\;&& + &&\\; \\frac{1}{2}z \\;&& = \\;&& 1 & \\\\\n&& && && &&\\; -z \\;&&\\; = \\;&& 1 &\n\\end{alignat}\n\nThis result is a system of linear equations in triangular form, and so the first part of the algorithm is complete.\n\nThe last part, back-substitution, consists of solving for the known in reverse order. It can thus be seen that\n\nz = -1 \\quad (L_3)\n\nThen, z can be substituted into L2, which can then be solved to obtain\n\ny = 3 \\quad (L_2)\n\nNext, z and y can be substituted into L1, which can be solved to obtain\n\nx = 2 \\quad (L_1)\n\nThe system is solved.\n\nWe can, in general, write any system of linear equations as a matrix equation:\nAx=b.\nThe solution of this system is characterized as follows: first, we find a particular solution x0 of this equation using Gaussian elimination. Then, we compute the solutions of Ax 0; that is, we find the null space N of A. The solution set of this equation is given by x_0+N\n\\{x_0+n: n\\in N \\}. If the number of variables is equal to the number of equations, then we can characterize when the system has a unique solution: since N is trivial if and only if det A ≠ 0, the equation has a unique solution if and only if det A ≠ 0.\n\nLeast-squares best-fit line\n\nThe least squares method is used to determine the best-fit line for a set of data. This line will minimize the sum of the squares of the residuals.\n\nFourier series expansion\n\nFourier series are a representation of a function f: [−π, π] → R as a trigonometric series:\n\nf(x)\\frac{a_0}{2} + \\sum_{n\n1}^\\infty \\, [a_n \\cos(nx) + b_n \\sin(nx)].\n\nThis series expansion is extremely useful in solving partial differential equations. In this article, we will not be concerned with convergence issues; it is nice to note that all Lipschitz-continuous functions have a converging Fourier series expansion, and nice enough discontinuous functions have a Fourier series that converges to the function value at most points.\n\nThe space of all functions that can be represented by a Fourier series form a vector space (technically speaking, we call functions that have the same Fourier series expansion the \"same\" function, since two different discontinuous functions might have the same Fourier series). Moreover, this space is also an inner product space with the inner product\n\n\\langle f,g \\rangle= \\frac{1}{\\pi} \\int_{-\\pi}^\\pi f(x) g(x) \\, dx.\n\nThe functions gn(x) sin(nx)  for n > 0 and hn(x) \n cos(nx) for n ≥ 0 are an orthonormal basis for the space of Fourier-expandable functions. We can thus use the tools of linear algebra to find the expansion of any function in this space in terms of these basis functions. For instance, to find the coefficient ak, we take the inner product with hk:\n\\langle f,h_k \\rangle\\frac{a_0}{2}\\langle h_0,h_k \\rangle + \\sum_{n\n1}^\\infty \\, [a_n \\langle h_n,h_k\\rangle + b_n \\langle\\ g_n,h_k \\rangle],\nand by orthonormality,  \\langle f,h_k\\rangle=a_k; that is,\n a_k = \\frac{1}{\\pi} \\int_{-\\pi}^\\pi f(x) \\cos(kx) \\, dx.\n\nQuantum mechanics\n\nQuantum mechanics is highly inspired by notions in linear algebra. In quantum mechanics, the physical state of a particle is represented by a vector, and observables (such as momentum, energy, and angular momentum) are represented by linear operators on the underlying vector space. More concretely, the wave function of a particle describes its physical state and lies in the vector space L2 (the functions φ: R3 → C such that \\int_{-\\infty}^\\infty \\int_{-\\infty}^\\infty \\int_{-\\infty}^{\\infty} |\\phi|^2 dxdydz is finite), and it evolves according to the Schrödinger equation. Energy is represented as the operator H=-\\frac{\\hbar^2}{2m} \\nabla^2 + V(x,y,z), where V is the potential energy. H is also known as the Hamiltonian operator. The eigenvalues of H represent the possible energies that can be observed. Given a particle in some state φ, we can expand φ into a linear combination of eigenstates of H. The component of φ in each eigenstate determines the probability of measuring the corresponding eigenvalue, and the measurement forces the particle to assume that eigenstate (wave function collapse).\n\nGeometric introduction\n\nMany of the principles and techniques of linear algebra can be seen in the geometry of lines in a real two-dimensional plane E.  When formulated using vectors and matrices the geometry of points and lines in the plane can be extended to the geometry of points and hyperplanes in high-dimensional spaces.\n\nPoint coordinates in the plane E are ordered pairs of real numbers, (x,y), and a line is defined as the set of points (x,y) that satisfy the linear equation,\n \\lambda: ax+by + c =0, \nwhere a, b and c are not all zero.\nThen,\n \\lambda: \\begin{bmatrix} a & b & c\\end{bmatrix} \\begin{Bmatrix} x\\\\ y \\\\1\\end{Bmatrix} = 0, \nor\n A\\mathbf{x}=0,\nwhere x (x, y, 1) is the 3 × 1 set of homogeneous coordinates associated with the point (x, y).J. G. Semple and G. T. Kneebone, Algebraic Projective Geometry, Clarendon Press, London, 1952.\n\nHomogeneous coordinates identify the plane E with the z 1 plane in three-dimensional space.  The x−y coordinates in E are obtained from homogeneous coordinates y \n (y1, y2, y3) by dividing by the third component (if it is nonzero) to obtain y = (y1/y3, y2/y3, 1).\n\nThe linear equation, λ, has the important property, that if x1 and x2 are homogeneous coordinates of points on the line, then the point αx1 + βx2 is also on the line, for any real α and β.\n\nNow consider the equations of the two lines λ1 and λ2,\n\\lambda_1: a_1 x+b_1 y + c_1 0,\\quad   \\lambda_2: a_2 x+b_2 y + c_2 \n0, \nwhich forms a system of linear equations.  The intersection of these two lines is defined by x = (x, y, 1) that satisfy the matrix equation,\n\\lambda_{1,2}: \\begin{bmatrix} a_1 & b_1 & c_1\\\\ a_2 & b_2 & c_2 \\end{bmatrix} \\begin{Bmatrix} x\\\\ y \\\\1\\end{Bmatrix} = \\begin{Bmatrix}0\\\\0 \\end{Bmatrix},\nor using homogeneous coordinates,\n B\\mathbf{x}=0.\nThe point of intersection of these two lines is the unique non-zero solution of these equations.  In homogeneous coordinates,\nthe solutions are multiples of the following solution:\n x_1 \\begin{vmatrix} b_1 & c_1\\\\ b_2 & c_2\\end{vmatrix}, x_2 \n -\\begin{vmatrix} a_1 & c_1\\\\ a_2 & c_2\\end{vmatrix}, x_3 = \\begin{vmatrix} a_1 & b_1\\\\ a_2 & b_2\\end{vmatrix}\nif the rows of B are linearly independent (i.e., λ1 and λ2 represent distinct lines).\nDivide through by x3 to get Cramer's rule for the solution of a set of two linear equations in two unknowns.E. D. Nering, Linear Algebra and Matrix Theory, John-Wiley, New York, NY, 1963   Notice that this yields a point in the z \n 1 plane only when the 2 × 2 submatrix associated with x3 has a non-zero determinant.\n\nIt is interesting to consider the case of three lines, λ1, λ2 and λ3, which yield the matrix equation,\n\\lambda_{1,2,3}: \\begin{bmatrix} a_1 & b_1 & c_1\\\\ a_2 & b_2 & c_2 \\\\ a_3 & b_3 & c_3\\end{bmatrix} \\begin{Bmatrix} x\\\\ y \\\\1\\end{Bmatrix} = \\begin{Bmatrix}0\\\\0 \\\\0\\end{Bmatrix}.\nwhich in homogeneous form yields,\n C\\mathbf{x}=0.\nClearly, this equation has the solution x (0,0,0), which is not a point on the z \n 1 plane E.  For a solution to exist in the plane E, the coefficient matrix C must have rank 2, which means its determinant must be zero.  Another way to say this is that the columns of the matrix must be linearly dependent.\n\nIntroduction to linear transformations\n\nAnother way to approach linear algebra is to consider linear functions on the two-dimensional real plane ER2.  Here R denotes the set of real numbers.   Let x\n(x, y) be an arbitrary vector in E and consider the linear function λ: E→R, given by\n \\lambda: \\begin{bmatrix}a & b\\end{bmatrix}\\begin{Bmatrix} x\\\\y\\end{Bmatrix} = c,\nor\nA\\mathbf{x}=c.\nThis transformation has the important property that if Ay=d, then\n A(\\alpha\\mathbf{x}+\\beta \\mathbf{y}) \\alpha A \\mathbf{x} + \\beta A\\mathbf{y} \n \\alpha c + \\beta d.\nThis shows that the sum of vectors in E map to the sum of their images in R.  This is the defining characteristic of a linear map, or linear transformation.  For this case, where the image space is a real number the map is called a linear functional.\n\nConsider the linear functional a little more carefully.  Let i(1,0) and j \n(0,1) be the natural basis vectors on E, so that x=xi+yj.  It is now possible to see that\n A\\mathbf{x} A(x\\mathbf{i}+y\\mathbf{j})\nx A\\mathbf{i} + y A\\mathbf{j} \\begin{bmatrix}A\\mathbf{i} & A\\mathbf{j}\\end{bmatrix}\\begin{Bmatrix} x\\\\y\\end{Bmatrix} \n \\begin{bmatrix}a & b\\end{bmatrix}\\begin{Bmatrix} x\\\\y\\end{Bmatrix} = c.\nThus, the columns of the matrix A are the image of the basis vectors of E in R.\n\nThis is true for any pair of vectors used to define coordinates in E.   Suppose we select a non-orthogonal non-unit vector basis v and w to define coordinates of vectors in E.  This means a vector x has coordinates (α,β), such that x=αv+βw.  Then, we have the linear functional\n \\lambda: A\\mathbf{x} \\begin{bmatrix} A\\mathbf{v} & A\\mathbf{w} \\end{bmatrix}\\begin{Bmatrix} \\alpha \\\\ \\beta \\end{Bmatrix}  \n \\begin{bmatrix} d & e \\end{bmatrix}\\begin{Bmatrix} \\alpha \\\\ \\beta \\end{Bmatrix}  =c,\nwhere Avd and Aw\ne are the images of the basis vectors  v and w.   This is written in matrix form as\n \\begin{bmatrix}a & b\\end{bmatrix} \\begin{bmatrix} v_1 & w_1 \\\\ v_2 & w_2 \\end{bmatrix}  =\\begin{bmatrix} d & e \\end{bmatrix}.\n\nCoordinates relative to a basis\n\nThis leads to the question of how to determine the coordinates of a vector x relative to a general basis v and w in E.  Assume that we know the coordinates of the vectors, x, v and w  in the natural basis i(1,0) and j \n(0,1).  Our goal is to find the real numbers α, β, so that x=αv+βw, that is\n \\begin{Bmatrix} x \\\\ y \\end{Bmatrix} = \\begin{bmatrix} v_1 & w_1 \\\\ v_2 & w_2 \\end{bmatrix} \\begin{Bmatrix} \\alpha \\\\ \\beta\\end{Bmatrix}.\n\nTo solve this equation for α, β, we compute the linear coordinate functionals σ and τ for the basis v, w, which are given by,\n \\sigma \\begin{bmatrix}\\sigma_1 &\\sigma_2\\end{bmatrix}\n\\frac{1}{v_1 w_2- v_2w_1}\\begin{bmatrix} w_2 & - w_1\\end{bmatrix},  \\tau \\begin{bmatrix}\\tau_1 &\\tau_2\\end{bmatrix}\n\\frac{1}{v_1 w_2- v_2w_1}\\begin{bmatrix}  -v_2  & v_1\\end{bmatrix}, \nThe functionals σ and τ compute the components of x along the basis vectors v and w, respectively, that is,\n\\sigma \\mathbf{x}\\alpha, \\tau\\mathbf{x}\n\\beta,\nwhich can be written in matrix form as\n \\begin{bmatrix} \\sigma_1 & \\sigma_2 \\\\ \\tau_1 &\\tau_2 \\end{bmatrix} \\begin{Bmatrix} x \\\\ y \\end{Bmatrix} =\\begin{Bmatrix} \\alpha \\\\ \\beta\\end{Bmatrix}.\n\nThese coordinate functionals have the properties,\n \\sigma\\mathbf{v}1, \\sigma\\mathbf{w}\n0, \\tau\\mathbf{w}1, \\tau\\mathbf{v}\n0.\nThese equations can be assembled into the single matrix equation,\n \\begin{bmatrix} \\sigma_1 & \\sigma_2 \\\\ \\tau_1 &\\tau_2 \\end{bmatrix} \\begin{bmatrix} v_1 & w_1 \\\\ v_2 &w_2 \\end{bmatrix} = \\begin{bmatrix} 1& 0\\\\0 & 1\\end{bmatrix}.\nThus, the matrix formed by the coordinate linear functionals is the inverse of the matrix formed by the basis vectors.\n\nInverse image\n\nThe set of points in the plane E that map to the same image in R under the linear functional λ define a line in E. This line is the image of the inverse map, λ−1: R→E.  This inverse image is the set of  the points x=(x, y) that solve the equation,\n A\\mathbf{x}\\begin{bmatrix}a & b\\end{bmatrix}\\begin{Bmatrix} x\\\\y\\end{Bmatrix} \n c.\nNotice that a linear functional operates on known values for x(x, y) to compute a value c in R, while the inverse image seeks the values for x\n(x, y) that yield a specific value c.\n\nIn order to solve the equation, we first recognize that only one of the two unknowns (x,y) can be determined, so we select y to be determined, and rearrange the equation\n by = c - ax.\nSolve for y and obtain the inverse image as the set of points,\n \\mathbf{x}(t) \\begin{Bmatrix} 0\\\\ c/b\\end{Bmatrix} + t\\begin{Bmatrix} 1\\\\ -a/b\\end{Bmatrix}\n\\mathbf{p} + t\\mathbf{h}  .\nFor convenience the free parameter x has been relabeled t.\n\nThe vector p defines the intersection of the line with the y-axis, known as the y-intercept.  The vector h satisfies the homogeneous equation,\nA\\mathbf{h}\\begin{bmatrix}a & b\\end{bmatrix} \\begin{Bmatrix} 1\\\\ -a/b\\end{Bmatrix}\n 0.\nNotice that if h is a solution to this homogeneous equation, then t h is also a solution.\n\nThe set of points of a linear functional that map to zero define the kernel of the linear functional.  The line can be considered to be the set of points h in the kernel translated by the vector p.\n\nGeneralizations and related topics\n\nSince linear algebra is a successful theory, its methods have been developed and generalized in other parts of mathematics. In module theory, one replaces the field of scalars by a ring. The concepts of linear independence, span, basis, and dimension (which is called rank in module theory) still make sense. Nevertheless, many theorems from linear algebra become false in module theory. For instance, not all modules have a basis (those that do are called free modules), the rank of a free module is not necessarily unique, not every linearly independent subset of a module can be extended to form a basis, and not every subset of a module that spans the space contains a basis.\n\nIn multilinear algebra, one considers multivariable linear transformations, that is, mappings that are linear in each of a number of different variables. This line of inquiry naturally leads to the idea of the dual space, the vector space V∗ consisting of linear maps  where F is the field of scalars. Multilinear maps  can be described via tensor products of elements of V∗.\n\nIf, in addition to vector addition and scalar multiplication, there is a bilinear vector product , the vector space is called an algebra; for instance, associative algebras are algebras with an associate vector product (like the algebra of square matrices, or the algebra of polynomials).\n\nFunctional analysis mixes the methods of linear algebra with those of mathematical analysis and studies various function spaces, such as Lp spaces.\n\nRepresentation theory studies the actions of algebraic objects on vector spaces by representing these objects as matrices. It is interested in all the ways that this is possible, and it does so by finding subspaces invariant under all transformations of the algebra. The concept of eigenvalues and eigenvectors is especially important.\n\nAlgebraic geometry considers the solutions of systems of polynomial equations.\n\nThere are several related topics in the field of computer programming that utilize much of the techniques and theorems linear algebra encompasses and refers to. Linear algebra. http://en.wikipedia.org/?curid=18422."
  }
}
