{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18285",
  "eid" : "31ef68f0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778593023,
  "textBody" : "In celestial mechanics, the Lagrangian points (; also Lagrange points, L-points, or libration points) are positions in an orbital configuration of two large bodies where a small object affected only by gravity can maintain its position relative to the two large bodies. The Lagrange points mark positions where the combined gravitational pull of the two large masses provides precisely the centripetal force required to orbit with them. There are five such points, labeled L1 to L5, all in the orbital plane of the two large bodies. The first three are on the line connecting the two large bodies; the last two, L4 and L5, each form an equilateral triangle with the two large bodies. The two latter points are stable, which implies that objects can orbit around them in a rotating coordinate system tied to the two large bodies.\n\nSeveral planets have satellites near their L4 and L5 points (trojans) with respect to the Sun, with Jupiter in particular having more than a million of these. Artificial satellites have been placed at L1 and L2 with respect to the Sun and Earth, and Earth and the Moon, for various purposes, and the Lagrangian points have been proposed for a variety of future uses in space exploration.\n\nHistory\n\nThe three collinear Lagrange points (L1, L2, L3) were discovered by Leonhard Euler a few years before Lagrange discovered the remaining two. (16MB)\n\nIn 1772, Joseph-Louis Lagrange published an \"Essay on the three-body problem\". In the first chapter he considered the general three-body problem. From that, in the second chapter, he demonstrated two special constant-pattern solutions, the collinear and the equilateral, for any three masses, with circular orbits.\n\nLagrange points\n\nThe five Lagrangian points are labeled and defined as follows:\n\nThe  point lies on the line defined by the two large masses M1 and M2, and between them.  It is the most intuitively understood of the Lagrangian points: the one where the gravitational attraction of M2 partially cancels M1's gravitational attraction.\n\n;Explanation : An object that orbits the Sun more closely than Earth would normally have a shorter orbital period than Earth, but that ignores the effect of Earth's own gravitational pull. If the object is directly between Earth and the Sun, then Earth's gravity counteracts some of the Sun's pull on the object, and therefore increases the orbital period of the object. The closer to Earth the object is, the greater this effect is. At the  point, the orbital period of the object becomes exactly equal to Earth's orbital period.  is about 1.5 million kilometers from Earth.\n\nThe  point lies on the line through the two large masses, beyond the smaller of the two. Here, the gravitational forces of the two large masses balance the centrifugal effect on a body at .\n\n;Explanation : On the opposite side of Earth from the Sun, the orbital period of an object would normally be greater than that of Earth. The extra pull of Earth's gravity decreases the orbital period of the object, and at the  point that orbital period becomes equal to Earth's. Like L1, L2 is about 1.5 million kilometers from Earth.\n\nThe  point lies on the line defined by the two large masses, beyond the larger of the two.\n\n;Explanation :  in the Sun–Earth system exists on the opposite side of the Sun, a little outside Earth's orbit but slightly closer to the Sun than Earth is. (This apparent contradiction is because the Sun is also affected by Earth's gravity, and so orbits around the two bodies' barycenter, which is, however, well inside the body of the Sun.) At the  point, the combined pull of Earth and Sun again causes the object to orbit with the same period as Earth.\n\nThe  and  points lie at the third corners of the two equilateral triangles in the plane of orbit whose common base is the line between the centers of the two masses, such that the point lies behind () or ahead () of the smaller mass with regard to its orbit around the larger mass.\n\nThe triangular points ( and ) are stable equilibria, provided that the ratio of  is greater than 24.96.Actually  ≈ , Neil J. Cornish with input from Jeremy Goodman This is the case for the Sun–Earth system, the Sun–Jupiter system, and, by a smaller margin, the Earth–Moon system. When a body at these points is perturbed, it moves away from the point, but the factor opposite of that which is increased or decreased by the perturbation (either gravity or angular momentum-induced speed) will also increase or decrease, bending the object's path into a stable, kidney bean-shaped orbit around the point (as seen in the corotating frame of reference).\n\nIn contrast to  and , where stable equilibrium exists, the points , , and  are positions of unstable equilibrium. Any object orbiting at , , or  will tend to fall out of orbit; it is therefore rare to find natural objects there, and spacecraft inhabiting these areas must employ station keeping in order to maintain their position.\n\nNatural objects at Lagrangian points\n\nIt is common to find objects at or orbiting the  and  points of natural orbital systems. These are commonly called \"trojans\"; in the 20th century, asteroids discovered orbiting at the Sun–Jupiter  and  points were named after characters from Homer's Iliad. Asteroids at the  point, which leads Jupiter, are referred to as the \"Greek camp\", whereas those at the  point are referred to as the \"Trojan camp\". See also Trojan (astronomy).\n\nOther examples of natural objects orbiting at Lagrange points:\n* The Sun–Earth  and  points contain interplanetary dust and at least one asteroid, , detected in October 2010 by Wide-field Infrared Survey Explorer (WISE) and announced during July 2011.[http://www.space.com/12443-earth-asteroid-companion-discovered-2010-tk7.html Space.com: First Asteroid Companion of Earth Discovered at Last]\n* The Earth–Moon  and  points may contain interplanetary dust in what are called Kordylewski clouds; however, the Hiten spacecraft's Munich Dust Counter (MDC) detected no increase in dust during its passes through these points. Stability at these specific points is greatly complicated by solar gravitational influence.\n* Recent observations suggest that the Sun–Neptune  and  points, known as the Neptune trojans, may be very thickly populated, containing large bodies an order of magnitude more numerous than the Jupiter trojans.\n* Several asteroids also orbit near the Sun-Jupiter  point, called the Hilda family.\n* The Saturnian moon Tethys has two smaller moons in its  and  points, Telesto and Calypso. The Saturnian moon Dione also has two Lagrangian co-orbitals, Helene at its  point and Polydeuces at . The moons wander azimuthally about the Lagrangian points, with Polydeuces describing the largest deviations, moving up to 32° away from the Saturn–Dione  point. Tethys and Dione are hundreds of times more massive than their \"escorts\" (see the moons' articles for exact diameter figures; masses are not known in several cases), and Saturn is far more massive still, which makes the overall system stable.\n* One version of the giant impact hypothesis suggests that an object named Theia formed at the Sun–Earth  or  points and crashed into Earth after its orbit destabilized, forming the Moon.\n* Mars has four known co-orbital asteroids (5261 Eureka, ,  and ), all at its Lagrangian points.\n* Earth's companion object 3753 Cruithne is in a relationship with Earth that is somewhat trojan-like, but that is different from a true trojan. Cruithne occupies one of two regular solar orbits, one of them slightly smaller and faster than Earth's, and the other slightly larger and slower. It periodically alternates between these two orbits due to close encounters with Earth. When it is in the smaller, faster orbit and approaches Earth, it gains orbital energy from Earth and moves up into the larger, slower orbit. It then falls farther and farther behind Earth, and eventually Earth approaches it from the other direction. Then Cruithne gives up orbital energy to Earth, and drops back into the smaller orbit, thus beginning the cycle anew. The cycle has no noticeable impact on the length of the year, because Earth's mass is over 20 billion () times more than that of 3753 Cruithne.\n* Epimetheus and Janus, satellites of Saturn, have a similar relationship, though they are of similar masses and so actually exchange orbits with each other periodically. (Janus is roughly 4 times more massive but still light enough for its orbit to be altered.) Another similar configuration is known as orbital resonance, in which orbiting bodies tend to have periods of a simple integer ratio, due to their interaction.\n* In a binary star system, the Roche lobe has its apex located at ; if a star overflows its Roche lobe, then it will lose matter to its companion star.\n\nMathematical details\n\nLagrangian points are the constant-pattern solutions of the restricted three-body problem. For example, given two massive bodies in orbits around their common barycenter, there are five positions in space where a third body, of comparatively negligible mass, could be placed so as to maintain its position relative to the two massive bodies. As seen in a rotating reference frame that matches the angular velocity of the two co-orbiting bodies, the gravitational fields of two massive bodies combined with the minor body's centrifugal force are in balance at the Lagrangian points, allowing the smaller third body to be relatively stationary with respect to the first two.\"[http://demonstrations.wolfram.com/LagrangePoints/ Lagrange Points]\" by Enrique Zeleny, Wolfram Demonstrations Project.\n\nThe location of L1 is the solution to the following equation, balancing gravitation and the centrifugal force:\n\n\\frac{M_1}{(R-r)^2}=\\frac{M_2}{r^2}+\\frac{M_1}{R^2}-\\frac{r\\left(M_1+M_2\\right)}{R^3}\n\nwhere r is the distance of the L1 point from the smaller object, R is the distance between the two main objects, and M1 and M2 are the masses of the large and small object, respectively. Solving this for r involves solving a quintic function, but if the mass of the smaller object (M2) is much smaller than the mass of the larger object (M1) then  and  are at approximately equal distances r from the smaller object, equal to the radius of the Hill sphere, given by:\n\nr \\approx R \\sqrt[3]{\\frac{M_2}{3 M_1}}\n\nThis distance can be described as being such that the orbital period, corresponding to a circular orbit with this distance as radius around M2 in the absence of M1, is that of M2 around M1, divided by  ≈ 1.73:\n\nT_{s,M_2}(r) = \\frac{T_{M_2,M_1}(R)}{\\sqrt{3}}.\n\nThe location of L2 is the solution to the following equation, balancing gravitation and inertia:\n\n\\frac{M_1}{(R+r)^2}+\\frac{M_2}{r^2}=\\frac{M_1}{R^2}+\\frac{r\\left(M_1+M_2\\right)}{R^3}\n\nwith parameters defined as for the L1 case. Again, if the mass of the smaller object (M2) is much smaller than the mass of the larger object (M1) then L2 is at approximately the radius of the Hill sphere, given by:\n\nr \\approx R \\sqrt[3]{\\frac{M_2}{3 M_1}}\n\nL3\n\nThe location of L3 is the solution to the following equation, balancing gravitation and the centrifugal force:\n\n\\frac{M_1}{(R-r)^2}+\\frac{M_2}{(2R-r)^2}=\\left(\\frac{M_2}{M_1+M_2}R+R-r\\right)\\frac{M_1+M_2}{R^3}\n\nwith parameters defined as for the L1 and L2 cases except that r now indicates how much closer L3 is to the more massive object than the smaller object. If the mass of the smaller object (M2) is much smaller than the mass of the larger object (M1) then:\n\nr \\approx R \\frac{7M_2}{12 M_1}\n\nand \n\nThe reason these points are in balance is that, at  and , the distances to the two masses are equal. Accordingly, the gravitational forces from the two massive bodies are in the same ratio as the masses of the two bodies, and so the resultant force acts through the barycenter of the system; additionally, the geometry of the triangle ensures that the resultant acceleration is to the distance from the barycenter in the same ratio as for the two massive bodies. The barycenter being both the center of mass and center of rotation of the three-body system, this resultant force is exactly that required to keep the smaller body at the Lagrange point in orbital equilibrium with the other two larger bodies of system. (Indeed, the third body need not have negligible mass.) The general triangular configuration was discovered by Lagrange in work on the three-body problem.\n\nRadial acceleration\n\nThe radial acceleration a of an object in orbit at a point along the line passing through both bodies is given by:\n\na=-\\frac{G M_1}{r^2}\\sgn(r)+\\frac{G M_2}{(R-r)^2}\\sgn(R-r)+\\frac{G((M_1+M_2) r-M_2 R)}{R^3}\n\nWhere r is the distance from the large body M1 and sgn(x) is the sign function of x. The terms in this function represent respectively: force from M1; force from M2; and centrifugal force. The points L3, L1, L2 occur where the acceleration is zero — see chart at right.\n\nStability \n\nAlthough the , , and  points are nominally unstable, there are (unstable) periodic orbits called \"halo\" orbits around these points in a three-body system. A full n-body dynamical system such as the Solar System does not contain these periodic orbits, but does contain quasi-periodic (i.e. bounded but not precisely repeating) orbits following Lissajous-curve trajectories. These quasi-periodic Lissajous orbits are what most of Lagrangian-point space missions have used until now. Although they are not perfectly stable, a modest effort of station keeping keeps a spacecraft in a desired Lissajous orbit for a long time. Also, for Sun–Earth- missions, it is preferable for the spacecraft to be in a large-amplitude (100000 –) Lissajous orbit around  than to stay at , because the line between Sun and Earth has increased solar interference on Earth–spacecraft communications. Similarly, a large-amplitude Lissajous orbit around  keeps a probe out of Earth's shadow and therefore ensure a better illumination of its solar panels.\n\nSolar System values \n\nThis table lists sample values of L1, L2, and L3 within the solar system. Calculations assume the two bodies orbit in a perfect circle with separation equal to the semimajor axis and no other bodies are nearby. Distances are measured from the larger body's center of mass with L3 showing a negative location. The percentage columns show how the distances compare to the semimajor axis. E.g. for the Moon, L1 is located  from Earth's center, which is 84.9% of the Earth-Moon distance or 15.1% in front of the Moon; L2 is located  from Earth's center, which is 116.8% of the Earth-Moon distance or 16.8% beyond the Moon; and L3 is located  from Earth's center, which is 99.3% of the Earth-Moon distance or 0.7084% in front of the Moon's 'negative' position. The L3 percent value has been magnified by 100.\n\nSpaceflight applications\n\nSun–Earth\n\nSun–Earth  is suited for making observations of the Sun–Earth system. Objects here are never shadowed by Earth or the Moon and, if observing Earth, always view the sunlit hemisphere. The first mission of this type was the International Sun Earth Explorer 3 (ISEE-3) mission used as an interplanetary early warning storm monitor for solar disturbances.  Since June 2015, DSCOVR has orbited the L1 point. Conversely it is also useful for space-based solar telescopes, because it provides an uninterrupted view of the Sun and any space weather (including the solar wind and coronal mass ejections) reaches L1 a few hours before Earth. Solar telescopes currently located around L1 include the Solar and Heliospheric Observatory and Advanced Composition Explorer.\n\nSun–Earth  is a good spot for space-based observatories. Because an object around  will maintain the same relative position with respect to the Sun and Earth, shielding and calibration are much simpler. It is, however, slightly beyond the reach of Earth's umbra,Angular size of the Sun at 1 AU + 930000 miles: 31.6′, angular size of Earth at 930000 miles: 29.3′ so solar radiation is not completely blocked at L2. (Real spacecraft generally orbit around L2, avoiding partial eclipses of the Sun to maintain a constant temperature). From locations near L2, the Sun, Earth and Moon are relatively close together in the sky; this means that a large sunshade with the telescope on the dark-side can allow the telescope to cool passively to around 50 K – this is especially helpful for infrared astronomy and observations of the cosmic microwave background. The James Webb Space Telescope is due to be positioned at L2.\n\nSun–Earth  was a popular place to put a \"Counter-Earth\" in pulp science fiction and comic books. Once space-based observation became possible via satellitesSTEREO mission description by NASA, http://www.nasa.gov/mission_pages/stereo/main/index.html#.UuG0NxDb-kk and probes, it was shown to hold no such object. The Sun–Earth  is unstable and could not contain a natural object, large or small, for very long. This is because the gravitational forces of the other planets are stronger than that of Earth (Venus, for example, comes within 0.3 AU of this  every 20 months).\n\nA spacecraft orbiting near Sun–Earth  would be able to closely monitor the evolution of active sunspot regions before they rotate into a geoeffective position, so that a 7-day early warning could be issued by the NOAA Space Weather Prediction Center. Moreover, a satellite near Sun–Earth  would provide very important observations not only for Earth forecasts, but also for deep space support (Mars predictions and for manned mission to near-Earth asteroids). In 2010, spacecraft transfer trajectories to Sun–Earth  were studied and several designs were considered.\n\nMissions to Lagrangian points generally orbit the points rather than occupy them directly.\n\nAnother interesting and useful property of the collinear Lagrangian points and their associated Lissajous orbits is that they serve as \"gateways\" to control the chaotic trajectories of the Interplanetary Transport Network.\n\nEarth–Moon\n\nEarth–Moon  allows comparatively easy access to Lunar and Earth orbits with minimal change in velocity and this has as an advantage to position a half-way manned space station intended to help transport cargo and personnel to the Moon and back.\n\nEarth–Moon  would be a good location for a communications satellite covering the Moon's far side and would be \"an ideal location\" for a propellant depot as part of the proposed depot-based space transportation architecture.\n\nSun–Venus\n\nScientists at the B612 Foundation are planning to use Venus's L3 point to position their planned Sentinel telescope, which aims to look back towards Earth's orbit and compile a catalogue of near-Earth asteroids.\n\nLagrangian spacecraft and missions\n\nSpacecraft at Sun–Earth L1\n\nInternational Sun Earth Explorer 3 (ISEE-3) began its mission at the Sun–Earth L1 before leaving to intercept a comet in 1982. The Sun–Earth L1 is also the point to which the Reboot ISEE-3 mission was attempting to return the craft as the first phase of a recovery mission (as of September 25, 2014 all efforts have failed and contact was lost).\"ISEE-3 is in Safe Mode\". Space College. 25 September 2014. \"The ground stations listening to ISEE-3 have not been able to obtain a signal since Tuesday the 16th\"\n\nSolar and Heliospheric Observatory (SOHO) is stationed in a halo orbit at , and the Advanced Composition Explorer (ACE) in a Lissajous orbit. WIND is also at .\n\nDeep Space Climate Observatory (DSCOVR), launched on 11 February 2015, began orbiting L1 on 8 June 2015 to study the solar wind and its effects on Earth. DSCOVR is unofficially known as GORESAT, because it carries a camera always oriented to Earth and capturing full-frame photos of the planet similar to the Blue Marble. This concept was proposed by then-Vice President of the United States Al Gore in 1998 and was a centerpiece in his film An Inconvenient Truth.Mellow, Craig (August 2014). \"Al Gore's Satellite\". Air & Space/Smithsonian. Retrieved December 12, 2014.\n\nLISA Pathfinder (LPF) was launched on 3 December 2015, and arrived at  on 22 January 2016, where, among other experiments, it will test the technology needed by (e)LISA to detect gravitational waves. LISA Pathfinder uses an instrument consisting of two small gold alloy cubes.\n\nSpacecraft at Sun–Earth L2\n\nSpacecraft at the Sun–Earth L2 point are in a Lissajous orbit until decommissioned, when they are sent into a heliocentric graveyard orbit.\n\n* 1 October 2001 – October 2010: Wilkinson Microwave Anisotropy Probe\n* November 2003 – April 2004: WIND, then it returned to Earth orbit before going to L1 where it still remains\n* July 2009 – 29 April 2013: Herschel Space Telescope\n* 3 July 2009 – 21 October 2013: Planck Space Observatory\n* 25 August 2011 – April 2012: Chang'e 2, from where it travelled to 4179 Toutatis and then into deep space\n* January 2014 – 2018: Gaia Space Observatory\n* 2019: James Webb Space Telescope will use a halo orbit\n* 2020: Euclid Space Telescope\n* 2024: Wide Field Infrared Survey Telescope (WFIRST) will use a halo orbit\n* 2028: Advanced Telescope for High Energy Astrophysics (ATHENA) will use a halo orbit\n\nPast and planned missions\n\n \n\nFuture and proposed missions",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Lagrangian point" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18285" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In celestial mechanics, the Lagrangian points (; also Lagrange points, L-points, or libration points) are positions in an orbital configuration of two large bodies where a small object affected only by gravity can maintain its position relative to the two large bodies. The Lagrange points mark positions where the combined gravitational pull of the two large masses provides precisely the centripetal force required to orbit with them. There are five such points, labeled L1 to L5, all in the orbital plane of the two large bodies. The first three are on the line connecting the two large bodies; the last two, L4 and L5, each form an equilateral triangle with the two large bodies. The two latter points are stable, which implies that objects can orbit around them in a rotating coordinate system tied to the two large bodies.\n\nSeveral planets have satellites near their L4 and L5 points (trojans) with respect to the Sun, with Jupiter in particular having more than a million of these. Artificial satellites have been placed at L1 and L2 with respect to the Sun and Earth, and Earth and the Moon, for various purposes, and the Lagrangian points have been proposed for a variety of future uses in space exploration.\n\nHistory\n\nThe three collinear Lagrange points (L1, L2, L3) were discovered by Leonhard Euler a few years before Lagrange discovered the remaining two. (16MB)\n\nIn 1772, Joseph-Louis Lagrange published an \"Essay on the three-body problem\". In the first chapter he considered the general three-body problem. From that, in the second chapter, he demonstrated two special constant-pattern solutions, the collinear and the equilateral, for any three masses, with circular orbits.\n\nLagrange points\n\nThe five Lagrangian points are labeled and defined as follows:\n\nThe  point lies on the line defined by the two large masses M1 and M2, and between them.  It is the most intuitively understood of the Lagrangian points: the one where the gravitational attraction of M2 partially cancels M1's gravitational attraction.\n\n;Explanation : An object that orbits the Sun more closely than Earth would normally have a shorter orbital period than Earth, but that ignores the effect of Earth's own gravitational pull. If the object is directly between Earth and the Sun, then Earth's gravity counteracts some of the Sun's pull on the object, and therefore increases the orbital period of the object. The closer to Earth the object is, the greater this effect is. At the  point, the orbital period of the object becomes exactly equal to Earth's orbital period.  is about 1.5 million kilometers from Earth.\n\nThe  point lies on the line through the two large masses, beyond the smaller of the two. Here, the gravitational forces of the two large masses balance the centrifugal effect on a body at .\n\n;Explanation : On the opposite side of Earth from the Sun, the orbital period of an object would normally be greater than that of Earth. The extra pull of Earth's gravity decreases the orbital period of the object, and at the  point that orbital period becomes equal to Earth's. Like L1, L2 is about 1.5 million kilometers from Earth.\n\nThe  point lies on the line defined by the two large masses, beyond the larger of the two.\n\n;Explanation :  in the Sun–Earth system exists on the opposite side of the Sun, a little outside Earth's orbit but slightly closer to the Sun than Earth is. (This apparent contradiction is because the Sun is also affected by Earth's gravity, and so orbits around the two bodies' barycenter, which is, however, well inside the body of the Sun.) At the  point, the combined pull of Earth and Sun again causes the object to orbit with the same period as Earth.\n\nThe  and  points lie at the third corners of the two equilateral triangles in the plane of orbit whose common base is the line between the centers of the two masses, such that the point lies behind () or ahead () of the smaller mass with regard to its orbit around the larger mass.\n\nThe triangular points ( and ) are stable equilibria, provided that the ratio of  is greater than 24.96.Actually  ≈ , Neil J. Cornish with input from Jeremy Goodman This is the case for the Sun–Earth system, the Sun–Jupiter system, and, by a smaller margin, the Earth–Moon system. When a body at these points is perturbed, it moves away from the point, but the factor opposite of that which is increased or decreased by the perturbation (either gravity or angular momentum-induced speed) will also increase or decrease, bending the object's path into a stable, kidney bean-shaped orbit around the point (as seen in the corotating frame of reference).\n\nIn contrast to  and , where stable equilibrium exists, the points , , and  are positions of unstable equilibrium. Any object orbiting at , , or  will tend to fall out of orbit; it is therefore rare to find natural objects there, and spacecraft inhabiting these areas must employ station keeping in order to maintain their position.\n\nNatural objects at Lagrangian points\n\nIt is common to find objects at or orbiting the  and  points of natural orbital systems. These are commonly called \"trojans\"; in the 20th century, asteroids discovered orbiting at the Sun–Jupiter  and  points were named after characters from Homer's Iliad. Asteroids at the  point, which leads Jupiter, are referred to as the \"Greek camp\", whereas those at the  point are referred to as the \"Trojan camp\". See also Trojan (astronomy).\n\nOther examples of natural objects orbiting at Lagrange points:\n* The Sun–Earth  and  points contain interplanetary dust and at least one asteroid, , detected in October 2010 by Wide-field Infrared Survey Explorer (WISE) and announced during July 2011.[http://www.space.com/12443-earth-asteroid-companion-discovered-2010-tk7.html Space.com: First Asteroid Companion of Earth Discovered at Last]\n* The Earth–Moon  and  points may contain interplanetary dust in what are called Kordylewski clouds; however, the Hiten spacecraft's Munich Dust Counter (MDC) detected no increase in dust during its passes through these points. Stability at these specific points is greatly complicated by solar gravitational influence.\n* Recent observations suggest that the Sun–Neptune  and  points, known as the Neptune trojans, may be very thickly populated, containing large bodies an order of magnitude more numerous than the Jupiter trojans.\n* Several asteroids also orbit near the Sun-Jupiter  point, called the Hilda family.\n* The Saturnian moon Tethys has two smaller moons in its  and  points, Telesto and Calypso. The Saturnian moon Dione also has two Lagrangian co-orbitals, Helene at its  point and Polydeuces at . The moons wander azimuthally about the Lagrangian points, with Polydeuces describing the largest deviations, moving up to 32° away from the Saturn–Dione  point. Tethys and Dione are hundreds of times more massive than their \"escorts\" (see the moons' articles for exact diameter figures; masses are not known in several cases), and Saturn is far more massive still, which makes the overall system stable.\n* One version of the giant impact hypothesis suggests that an object named Theia formed at the Sun–Earth  or  points and crashed into Earth after its orbit destabilized, forming the Moon.\n* Mars has four known co-orbital asteroids (5261 Eureka, ,  and ), all at its Lagrangian points.\n* Earth's companion object 3753 Cruithne is in a relationship with Earth that is somewhat trojan-like, but that is different from a true trojan. Cruithne occupies one of two regular solar orbits, one of them slightly smaller and faster than Earth's, and the other slightly larger and slower. It periodically alternates between these two orbits due to close encounters with Earth. When it is in the smaller, faster orbit and approaches Earth, it gains orbital energy from Earth and moves up into the larger, slower orbit. It then falls farther and farther behind Earth, and eventually Earth approaches it from the other direction. Then Cruithne gives up orbital energy to Earth, and drops back into the smaller orbit, thus beginning the cycle anew. The cycle has no noticeable impact on the length of the year, because Earth's mass is over 20 billion () times more than that of 3753 Cruithne.\n* Epimetheus and Janus, satellites of Saturn, have a similar relationship, though they are of similar masses and so actually exchange orbits with each other periodically. (Janus is roughly 4 times more massive but still light enough for its orbit to be altered.) Another similar configuration is known as orbital resonance, in which orbiting bodies tend to have periods of a simple integer ratio, due to their interaction.\n* In a binary star system, the Roche lobe has its apex located at ; if a star overflows its Roche lobe, then it will lose matter to its companion star.\n\nMathematical details\n\nLagrangian points are the constant-pattern solutions of the restricted three-body problem. For example, given two massive bodies in orbits around their common barycenter, there are five positions in space where a third body, of comparatively negligible mass, could be placed so as to maintain its position relative to the two massive bodies. As seen in a rotating reference frame that matches the angular velocity of the two co-orbiting bodies, the gravitational fields of two massive bodies combined with the minor body's centrifugal force are in balance at the Lagrangian points, allowing the smaller third body to be relatively stationary with respect to the first two.\"[http://demonstrations.wolfram.com/LagrangePoints/ Lagrange Points]\" by Enrique Zeleny, Wolfram Demonstrations Project.\n\nThe location of L1 is the solution to the following equation, balancing gravitation and the centrifugal force:\n\n\\frac{M_1}{(R-r)^2}=\\frac{M_2}{r^2}+\\frac{M_1}{R^2}-\\frac{r\\left(M_1+M_2\\right)}{R^3}\n\nwhere r is the distance of the L1 point from the smaller object, R is the distance between the two main objects, and M1 and M2 are the masses of the large and small object, respectively. Solving this for r involves solving a quintic function, but if the mass of the smaller object (M2) is much smaller than the mass of the larger object (M1) then  and  are at approximately equal distances r from the smaller object, equal to the radius of the Hill sphere, given by:\n\nr \\approx R \\sqrt[3]{\\frac{M_2}{3 M_1}}\n\nThis distance can be described as being such that the orbital period, corresponding to a circular orbit with this distance as radius around M2 in the absence of M1, is that of M2 around M1, divided by  ≈ 1.73:\n\nT_{s,M_2}(r) = \\frac{T_{M_2,M_1}(R)}{\\sqrt{3}}.\n\nThe location of L2 is the solution to the following equation, balancing gravitation and inertia:\n\n\\frac{M_1}{(R+r)^2}+\\frac{M_2}{r^2}=\\frac{M_1}{R^2}+\\frac{r\\left(M_1+M_2\\right)}{R^3}\n\nwith parameters defined as for the L1 case. Again, if the mass of the smaller object (M2) is much smaller than the mass of the larger object (M1) then L2 is at approximately the radius of the Hill sphere, given by:\n\nr \\approx R \\sqrt[3]{\\frac{M_2}{3 M_1}}\n\nL3\n\nThe location of L3 is the solution to the following equation, balancing gravitation and the centrifugal force:\n\n\\frac{M_1}{(R-r)^2}+\\frac{M_2}{(2R-r)^2}=\\left(\\frac{M_2}{M_1+M_2}R+R-r\\right)\\frac{M_1+M_2}{R^3}\n\nwith parameters defined as for the L1 and L2 cases except that r now indicates how much closer L3 is to the more massive object than the smaller object. If the mass of the smaller object (M2) is much smaller than the mass of the larger object (M1) then:\n\nr \\approx R \\frac{7M_2}{12 M_1}\n\nand \n\nThe reason these points are in balance is that, at  and , the distances to the two masses are equal. Accordingly, the gravitational forces from the two massive bodies are in the same ratio as the masses of the two bodies, and so the resultant force acts through the barycenter of the system; additionally, the geometry of the triangle ensures that the resultant acceleration is to the distance from the barycenter in the same ratio as for the two massive bodies. The barycenter being both the center of mass and center of rotation of the three-body system, this resultant force is exactly that required to keep the smaller body at the Lagrange point in orbital equilibrium with the other two larger bodies of system. (Indeed, the third body need not have negligible mass.) The general triangular configuration was discovered by Lagrange in work on the three-body problem.\n\nRadial acceleration\n\nThe radial acceleration a of an object in orbit at a point along the line passing through both bodies is given by:\n\na=-\\frac{G M_1}{r^2}\\sgn(r)+\\frac{G M_2}{(R-r)^2}\\sgn(R-r)+\\frac{G((M_1+M_2) r-M_2 R)}{R^3}\n\nWhere r is the distance from the large body M1 and sgn(x) is the sign function of x. The terms in this function represent respectively: force from M1; force from M2; and centrifugal force. The points L3, L1, L2 occur where the acceleration is zero — see chart at right.\n\nStability \n\nAlthough the , , and  points are nominally unstable, there are (unstable) periodic orbits called \"halo\" orbits around these points in a three-body system. A full n-body dynamical system such as the Solar System does not contain these periodic orbits, but does contain quasi-periodic (i.e. bounded but not precisely repeating) orbits following Lissajous-curve trajectories. These quasi-periodic Lissajous orbits are what most of Lagrangian-point space missions have used until now. Although they are not perfectly stable, a modest effort of station keeping keeps a spacecraft in a desired Lissajous orbit for a long time. Also, for Sun–Earth- missions, it is preferable for the spacecraft to be in a large-amplitude (100000 –) Lissajous orbit around  than to stay at , because the line between Sun and Earth has increased solar interference on Earth–spacecraft communications. Similarly, a large-amplitude Lissajous orbit around  keeps a probe out of Earth's shadow and therefore ensure a better illumination of its solar panels.\n\nSolar System values \n\nThis table lists sample values of L1, L2, and L3 within the solar system. Calculations assume the two bodies orbit in a perfect circle with separation equal to the semimajor axis and no other bodies are nearby. Distances are measured from the larger body's center of mass with L3 showing a negative location. The percentage columns show how the distances compare to the semimajor axis. E.g. for the Moon, L1 is located  from Earth's center, which is 84.9% of the Earth-Moon distance or 15.1% in front of the Moon; L2 is located  from Earth's center, which is 116.8% of the Earth-Moon distance or 16.8% beyond the Moon; and L3 is located  from Earth's center, which is 99.3% of the Earth-Moon distance or 0.7084% in front of the Moon's 'negative' position. The L3 percent value has been magnified by 100.\n\nSpaceflight applications\n\nSun–Earth\n\nSun–Earth  is suited for making observations of the Sun–Earth system. Objects here are never shadowed by Earth or the Moon and, if observing Earth, always view the sunlit hemisphere. The first mission of this type was the International Sun Earth Explorer 3 (ISEE-3) mission used as an interplanetary early warning storm monitor for solar disturbances.  Since June 2015, DSCOVR has orbited the L1 point. Conversely it is also useful for space-based solar telescopes, because it provides an uninterrupted view of the Sun and any space weather (including the solar wind and coronal mass ejections) reaches L1 a few hours before Earth. Solar telescopes currently located around L1 include the Solar and Heliospheric Observatory and Advanced Composition Explorer.\n\nSun–Earth  is a good spot for space-based observatories. Because an object around  will maintain the same relative position with respect to the Sun and Earth, shielding and calibration are much simpler. It is, however, slightly beyond the reach of Earth's umbra,Angular size of the Sun at 1 AU + 930000 miles: 31.6′, angular size of Earth at 930000 miles: 29.3′ so solar radiation is not completely blocked at L2. (Real spacecraft generally orbit around L2, avoiding partial eclipses of the Sun to maintain a constant temperature). From locations near L2, the Sun, Earth and Moon are relatively close together in the sky; this means that a large sunshade with the telescope on the dark-side can allow the telescope to cool passively to around 50 K – this is especially helpful for infrared astronomy and observations of the cosmic microwave background. The James Webb Space Telescope is due to be positioned at L2.\n\nSun–Earth  was a popular place to put a \"Counter-Earth\" in pulp science fiction and comic books. Once space-based observation became possible via satellitesSTEREO mission description by NASA, http://www.nasa.gov/mission_pages/stereo/main/index.html#.UuG0NxDb-kk and probes, it was shown to hold no such object. The Sun–Earth  is unstable and could not contain a natural object, large or small, for very long. This is because the gravitational forces of the other planets are stronger than that of Earth (Venus, for example, comes within 0.3 AU of this  every 20 months).\n\nA spacecraft orbiting near Sun–Earth  would be able to closely monitor the evolution of active sunspot regions before they rotate into a geoeffective position, so that a 7-day early warning could be issued by the NOAA Space Weather Prediction Center. Moreover, a satellite near Sun–Earth  would provide very important observations not only for Earth forecasts, but also for deep space support (Mars predictions and for manned mission to near-Earth asteroids). In 2010, spacecraft transfer trajectories to Sun–Earth  were studied and several designs were considered.\n\nMissions to Lagrangian points generally orbit the points rather than occupy them directly.\n\nAnother interesting and useful property of the collinear Lagrangian points and their associated Lissajous orbits is that they serve as \"gateways\" to control the chaotic trajectories of the Interplanetary Transport Network.\n\nEarth–Moon\n\nEarth–Moon  allows comparatively easy access to Lunar and Earth orbits with minimal change in velocity and this has as an advantage to position a half-way manned space station intended to help transport cargo and personnel to the Moon and back.\n\nEarth–Moon  would be a good location for a communications satellite covering the Moon's far side and would be \"an ideal location\" for a propellant depot as part of the proposed depot-based space transportation architecture.\n\nSun–Venus\n\nScientists at the B612 Foundation are planning to use Venus's L3 point to position their planned Sentinel telescope, which aims to look back towards Earth's orbit and compile a catalogue of near-Earth asteroids.\n\nLagrangian spacecraft and missions\n\nSpacecraft at Sun–Earth L1\n\nInternational Sun Earth Explorer 3 (ISEE-3) began its mission at the Sun–Earth L1 before leaving to intercept a comet in 1982. The Sun–Earth L1 is also the point to which the Reboot ISEE-3 mission was attempting to return the craft as the first phase of a recovery mission (as of September 25, 2014 all efforts have failed and contact was lost).\"ISEE-3 is in Safe Mode\". Space College. 25 September 2014. \"The ground stations listening to ISEE-3 have not been able to obtain a signal since Tuesday the 16th\"\n\nSolar and Heliospheric Observatory (SOHO) is stationed in a halo orbit at , and the Advanced Composition Explorer (ACE) in a Lissajous orbit. WIND is also at .\n\nDeep Space Climate Observatory (DSCOVR), launched on 11 February 2015, began orbiting L1 on 8 June 2015 to study the solar wind and its effects on Earth. DSCOVR is unofficially known as GORESAT, because it carries a camera always oriented to Earth and capturing full-frame photos of the planet similar to the Blue Marble. This concept was proposed by then-Vice President of the United States Al Gore in 1998 and was a centerpiece in his film An Inconvenient Truth.Mellow, Craig (August 2014). \"Al Gore's Satellite\". Air & Space/Smithsonian. Retrieved December 12, 2014.\n\nLISA Pathfinder (LPF) was launched on 3 December 2015, and arrived at  on 22 January 2016, where, among other experiments, it will test the technology needed by (e)LISA to detect gravitational waves. LISA Pathfinder uses an instrument consisting of two small gold alloy cubes.\n\nSpacecraft at Sun–Earth L2\n\nSpacecraft at the Sun–Earth L2 point are in a Lissajous orbit until decommissioned, when they are sent into a heliocentric graveyard orbit.\n\n* 1 October 2001 – October 2010: Wilkinson Microwave Anisotropy Probe\n* November 2003 – April 2004: WIND, then it returned to Earth orbit before going to L1 where it still remains\n* July 2009 – 29 April 2013: Herschel Space Telescope\n* 3 July 2009 – 21 October 2013: Planck Space Observatory\n* 25 August 2011 – April 2012: Chang'e 2, from where it travelled to 4179 Toutatis and then into deep space\n* January 2014 – 2018: Gaia Space Observatory\n* 2019: James Webb Space Telescope will use a halo orbit\n* 2020: Euclid Space Telescope\n* 2024: Wide Field Infrared Survey Telescope (WFIRST) will use a halo orbit\n* 2028: Advanced Telescope for High Energy Astrophysics (ATHENA) will use a halo orbit\n\nPast and planned missions\n\n \n\nFuture and proposed missions. Lagrangian point. http://en.wikipedia.org/?curid=18285."
  }
}
