{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19685",
  "eid" : "3d0c9050-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778611669,
  "textBody" : "Mythology refers variously to the collected myths of a group of peopleOxford English Dictionary,  \"myth, n. Oxford University Press (Oxford), 2003. or to the study of such myths.\n\nA folklore genre, myth is a feature of every culture. Many sources for myths have been proposed, ranging from personification of nature or personification of natural phenomena, to truthful or hyperbolic accounts of historical events to explanations of existing rituals. A culture's collective mythology helps convey belonging, shared and religious experiences, behavioral models, and moral and practical lessons.\n\nThe study of myth began in ancient history. Rival classes of the Greek myths by Euhemerus, Plato and Sallustius were developed by the Neoplatonists and later revived by Renaissance mythographers. The nineteenth-century comparative mythology reinterpreted myth as a primitive and failed counterpart of science (Tylor), a \"disease of language\" (Müller), or a misinterpretation of magical ritual (Frazer).\n\nRecent approaches often view myths as manifestations of psychological, cultural, or societal truths, rather than as inaccurate historical accounts.\n\nEtymology\n\nThe term mythology predates the word myth by centuries. It first appeared in the fifteenth century, borrowed from the Middle French term mythologie. The word mythology, (\"exposition of myths\"), comes from Middle French mythologie, from Late Latin mythologia, from Greek μυθολογία mythología (\"legendary lore, a telling of mythic legends; a legend, story, tale\") from μῦθος mythos (\"myth\") and -λογία -logia (\"study\").[http://www.etymonline.com/index.php?termmythology \"mythology\"]. Online Etymology DictionaryOxford English Dictionary, 3rd ed. \"mythology, n.\" 2003. Accessed 20 Aug 2014. Both terms translated the subject of Latin author Fulgentius' fifth-century Mythologiæ, which was concerned with the explication of Greek and Roman stories about their gods, commonly referred to as classical mythology. Although Fulgentius' conflation with the contemporary African Saint Fulgentius is now questioned,Hays, Gregory. \"The date and identity of the mythographer Fulgentius\" in Journal of Medieval Latin, ,  2003. the Mythologiæ explicitly treated its subject matter as allegories requiring interpretation and not as true events.\n\nThe word mythología [] appears in Plato, but was used as a general term for \"fiction\" or \"story-telling\" of any kind, combining mỹthos [, \"narrative, fiction\"] and -logía [, \"discourse, able to speak about\"].Oxford English Dictionary,  \"-logy, comb. form\". Oxford University Press (Oxford), 1903. From Lydgate until the seventeenth or eighteenth-century, mythology was similarly used to mean a moral, fable, allegory or a parable. From its earliest use in reference to a collection of traditional stories or beliefs, mythology implied the falsehood of the stories being described. It came to be applied by analogy with similar bodies of traditional stories among other polytheistic cultures around the world. The Greek loanword mythos (pl. mythoi) and Latinate mythus (pl. mythi) both appeared in English before the first example of myth in 1830.\n\nTerminology\n\nIn present use, mythology usually refers to the collected myths of a group of people, but may also mean the study of such myths. For example, Greek mythology, Roman mythology and Hittite mythology all describe the body of myths retold among those cultures. Dundes defined myth as a sacred narrative that explains how the world and humanity evolved into their present form. Dundes classified a sacred narrative as \"a story that serves to define the fundamental worldview of a culture by explaining aspects of the natural world and delineating the psychological and social practices and ideals of a society\". Lincoln defined myth as \"ideology in narrative form.\" Scholars in other fields use the term myth in varied ways. In a broad sense, the word can refer to any traditional story, popular misconception or imaginary entity. Due to this pejorative sense, some scholars opted for the term mythos. Its use was similarly pejorative and now more commonly refers to its Aristotelian sense as a \"plot point\" or to a collective mythology,Oxford English Dictionary,  \"mythos, n.\" Oxford University Press (Oxford), 2003. as in the world building of H.P. Lovecraft.\n\nThe term is often distinguished from didactic literature such as fables, but its relationship with other traditional stories, such as legends and folktales, is more nebulous. Main characters in myths are usually gods, demigods or supernatural humans,\"myths\", A Dictionary of English FolkloreO'Flaherty, p. 78: \"I think it can be well argued as a matter of principle that, just as 'biography is about chaps', so mythology is about gods.\" while legends generally feature humans as their main characters. However, many exceptions or combinations exist, as in the Iliad, Odyssey and Aeneid. Myths are often endorsed by rulers and priests and are closely linked to religion or spirituality. In fact, many societies group their myths, legends and history together, considering myths to be true accounts of their remote past. Creation myths particularly, take place in a primordial age when the world had not achieved its later form. Other myths explain how a society's customs, institutions and taboos were established and sanctified. A separate space is created for folktales, which are not considered true by anyone. As stories spread to other cultures or as faiths change, myths can come to be considered folktales. Its divine characters are recast as either as humans or demihumans such as giants, elves and faeries.\n\nOrigins\n\nEuhemerism\n\nOne theory claims that myths are distorted accounts of historical events. According to this theory, storytellers repeatedly elaborate upon historical accounts until the figures in those accounts gain the status of gods. For example, the myth of the wind-god Aeolus may have evolved from a historical account of a king who taught his people to use sails and interpret the winds. Herodotus (fifth-century BC) and Prodicus made claims of this kind. This theory is named euhemerism after mythologist Euhemerus (c. 320 BC), who suggested that Greek gods developed from legends about human beings.\"Euhemerism\", The Concise Oxford Dictionary of World Religions\n\nAllegory\n\nSome theories propose that myths began as allegories for natural phenomena: Apollo represents the sun, Poseidon represents water, and so on. According to another theory, myths began as allegories for philosophical or spiritual concepts: Athena represents wise judgment, Aphrodite desire, and so on. Müller supported an allegorical theory of myth. He believed myths began as allegorical descriptions of nature and gradually came to be interpreted literally. For example, a poetic description of the sea as \"raging\" was eventually taken literally and the sea was then thought of as a raging god.\n\nPersonification\n\nSome thinkers claimed that myths result from the personification of objects and forces. According to these thinkers, the ancients worshiped natural phenomena, such as fire and air, gradually deifying them. For example, according to this theory, ancients tended to view things as gods, not as mere objects. Thus, they described natural events as acts of personal gods, giving rise to myths.\n\nMyth-ritual theory\n\nAccording to the myth-ritual theory, myth is tied to ritual. In its most extreme form, this theory claims myths arose to explain rituals. This claim was first put forward by Smith, who claimed that people begin performing rituals for reasons not related to myth. Forgetting the original reason for a ritual, they account for it by inventing a myth and claiming the ritual commemorates the events described in that myth. Frazer claimed that humans started out with a belief in magical rituals; later, they began to lose faith in magic and invented myths about gods, reinterpreting their rituals as religious rituals intended to appease the gods.\n\nFunctions\n\nEliade argued that one of the foremost functions of myth is to establish models for behavior and that myths may provide a religious experience. By telling or reenacting myths, members of traditional societies detach themselves from the present, returning to the mythical age, thereby coming closer to the divine.\n\nHonko asserted that, in some cases, a society reenacts a myth in an attempt to reproduce the conditions of the mythical age. For example, it might reenact the healing performed by a god at the beginning of time in order to heal someone in the present. Similarly, Barthes argued that modern culture explores religious experience. Since it is not the job of science to define human morality, a religious experience is an attempt to connect with a perceived moral past, which is in contrast with the technological present.\n\nPattanaik defines mythology as \"a subjective truth of people that is communicated through stories, symbols and rituals\". He adds, \"unlike fantasy that is nobody’s truth, and history that seeks to be everybody’s truth, mythology is somebody’s truth.\"\n\nHistory of the academic discipline\n\nHistorically, the important approaches to the study of mythology have been those of Vico, Schelling, Schiller, Jung, Freud, Lévy-Bruhl, Lévi-Strauss, Frye, the Soviet school, and the Myth and Ritual School.Guy Lanoue, Foreword to Meletinsky, p. viii\n\nPre-modern\n\nThe critical interpretation of myth began with the Presocratics. Euhemerus was one of the most important pre-modern mythologists. He interpreted myths as accounts of actual historical events - distorted over many retellings. SallustiusOn the Gods and the World, ch. 5, See Collected Writings on the Gods and the World, The Prometheus Trust, Frome, 1995 divided myths into five categories – theological, physical (or concerning natural laws), animistic (or concerning soul), material, and mixed. Mixed concerns myths that show the interaction between two or more of the previous categories and are particularly used in initiations.\n\nPlato famously condemned poetic myth when discussing education in the Republic. His critique was primarily on the grounds that the uneducated might take the stories of gods and heroes literally. Nevertheless, he constantly referred to myths throughout his writings. As Platonism developed in the phases commonly called Middle Platonism and neoplatonism, writers such as Plutarch, Porphyry, Proclus, Olympiodorus, and Damascius wrote explicitly about the symbolic interpretation of traditional and Orphic myths.Perhaps the most extended passage of philosophic interpretation of myth is to be found in the fifth and sixth essays of Proclus’ Commentary on the Republic (to be found in The Works of Plato I, trans. Thomas Taylor, The Prometheus Trust, Frome, 1996); Porphyry’s analysis of the Homeric Cave of the Nymphs is another important work in this area (Select Works of Porphyry, Thomas Taylor The Prometheus Trust, Frome, 1994). See the external links below for a full English translation.\n\nInterest in polytheistic mythology revived during the Renaissance, with early works on mythography appearing in the sixteenth-century, such as the Theologia Mythologica (1532). While myths are not the same as fables, legends, folktales, fairy tales, anecdotes, or fiction, the concepts may overlap. Notably, during the nineteenth century period of Romanticism, folktales and fairy tales were perceived as eroded fragments of earlier mythology (famously by the Brothers Grimm and Elias Lönnrot).\n\nMythological themes were consciously employed in literature, beginning with Homer. The resulting work may expressly refer to a mythological background without itself becoming part of a body of myths (Cupid and Psyche). Medieval romance in particular plays with this process of turning myth into literature. Euhemerism, as stated earlier, refers to the rationalization of myths, putting themes formerly imbued with mythological qualities into pragmatic contexts. An example of this would be following a cultural or religious paradigm shift (notably the re-interpretation of pagan mythology following Christianization).\n\nConversely, historical and literary material may acquire mythological qualities over time. For example, the Matter of Britain (the legendary history of Great Britain, especially those focused on King Arthur and the knights of the Round Table) and the Matter of France, based on historical events of the fifth and eighth-centuries respectively, were first made into epic poetry and became partly mythological over the following centuries. \"Conscious generation\" of mythology was termed mythopoeia by Tolkien and was notoriously also suggested, separately, by Nazi ideologist Alfred Rosenberg.\n\nNineteenth-century\n\nThe first scholarly theories of myth appeared during the second half of the nineteenth-century. In general, these nineteenth-century theories framed myth as a failed or obsolete mode of thought, often by interpreting myth as the primitive counterpart of modern science.\n\nFor example, Tylor interpreted myth as an attempt at a literal explanation for natural phenomena. Unable to conceive impersonal natural laws, early humans tried to explain natural phenomena by attributing souls to inanimate objects, giving rise to animism. According to Tylor, human thought evolved through stages, starting with mythological ideas and gradually progressing to scientific ideas. Not all scholars, not even all nineteenth-century scholars, accepted this view. Lévy-Bruhl claimed \"the primitive mentality is a condition of the human mind, and not a stage in its historical development.\"\n\nMüller called myth a \"disease of language\". He speculated that myths arose due to the lack of abstract nouns and neuter gender in ancient languages. Anthropomorphic figures of speech, necessary in such languages, were eventually taken literally, leading to the idea that natural phenomena were in actuality conscious beings or gods.\n\nFrazer saw myths as a misinterpretation of magical rituals, which were themselves based on a mistaken idea of natural law. According to Frazer, humans begin with an unfounded belief in impersonal magical laws. When they realize applications of these laws do not work, they give up their belief in natural law in favor of a belief in personal gods controlling nature, thus giving rise to religious myths. Meanwhile, humans continue practicing formerly magical rituals through force of habit, reinterpreting them as reenactments of mythical events. Finally humans come to realize nature follows natural laws, and they discover their true nature through science. Here again, science makes myth obsolete as humans progress \"from magic through religion to science.\"\n\nSegal asserted that by pitting mythical thought against modern scientific thought, such theories imply modern humans must abandon myth.\n\nTwentieth-century\n\nMany twentieth-century theories rejected the nineteenth-century theories' opposition of myth and science. In general, \"twentieth-century theories have tended to see myth as almost anything but an outdated counterpart to science […]. Consequently, modern individuals are not obliged to abandon myth for science.\"\n\nJung tried to understand the psychology behind world myths. Jung asserted that all humans share certain innate unconscious psychological forces, which he called archetypes. He believed similarities between the myths of different cultures reveals the existence of these universal archetypes.Boeree\n\nLévi-Strauss believed myths reflect patterns in the mind and interpreted those patterns more as fixed mental structures, specifically pairs of opposites (good/evil, compassionate/callous), rather than unconscious feelings or urges.\n\nIn his appendix to Myths, Dreams and Mysteries, and in The Myth of the Eternal Return, Eliade attributed modern humans’ anxieties to their rejection of myths and the sense of the sacred.\n\nIn the 1950s, Barthes published a series of essays examining modern myths and the process of their creation in his book Mythologies.https://books.google.co.cr/books?idtlpHad1I-xkC&pg\nPA189&lpgPA189&dq\nIn+the+1950s,+Barthes+published+a+series+of+essays+examining+modern+myths+and+the+process+of+their+creation+in+his+book+Mythologies.&sourcebl&ots\nEXDTKC9Jru&sigfWmHMZVDcQnmJMN-GOvw-HVNBJU&hl\nen&saX&ved\n0ahUKEwi2-afhlpvZAhUlrVkKHV7RAlkQ6AEIJzAA#vonepage&q\nIn%20the%201950s%2C%20Barthes%20published%20a%20series%20of%20essays%20examining%20modern%20myths%20and%20the%20process%20of%20their%20creation%20in%20his%20book%20Mythologies.&f=false\n\nFollowing the Structuralist Era (roughly the 1960s to 1980s), the predominant anthropological and sociological approaches to myth increasingly treated myth as a form of narrative that can be studied, interpreted and analyzed like ideology, history and culture. In other words, myth is a form of understanding and telling stories that is connected to power, political structures, and political and economic interests. These approaches contrast with approaches such as those of Campbell and Eliade that hold that myth has some type of essential connection to ultimate sacred meanings that transcend cultural specifics. In particular, myth was studied in relation to history from diverse social sciences. Most of these studies share the assumption that history and myth are not distinct in the sense that history is factual, real, accurate, and truth, while myth is the opposite.\n\nChristian theologian Conrad Hyers wrote that\n\nComparative mythology\n\nComparative mythology is the systematic comparison of myths from different cultures. It seeks to discover underlying themes that are common to the myths of multiple cultures. In some cases, comparative mythologists use the similarities between separate mythologies to argue that those mythologies have a common source. This source may inspire myths or provide a common \"protomythology\" that diverged into the mythologies of each culture.\n\nNineteenth-century interpretations of myth were often comparative, seeking a common origin for all myths. Later scholars tend to avoid universal statements about mythology. One exception to this modern trend is Campbell's The Hero with a Thousand Faces (1949), which claims that all hero myths follow the same underlying pattern. This theory of a monomyth later fell out of favor.\n\nModern mythology\n\nIn modern society, myth is often regarded as a collection of stories. Scholars in the field of cultural studies research how myth has worked itself into modern discourses. Mythological discourse can reach greater audiences than ever before via digital media. Various mythic elements appear in television, cinema and video games.\n\nAlthough myth was traditionally transmitted through the oral tradition on a small scale, the film industry has enabled filmmakers to transmit myths to large audiences via film. In Jungian psychology myths are the expression of a culture or society’s goals, fears, ambitions and dreams. Film is an expression of the society in which it was produced and reflects the culture of its era and location.\n\nThe basis of modern visual storytelling is rooted in the mythological tradition. Many contemporary films rely on ancient myths to construct narratives. Disney Corporation is well-known among cultural study scholars for \"reinventing\" traditional childhood myths. While many films are not as obvious as Disney fairy tales, the plots of many films are based on the rough structure of myths. Mythological archetypes, such as the cautionary tale regarding the abuse of technology, battles between gods and creation stories, are often the subject of major film productions. These films are often created under the guise of cyberpunk action films, fantasy, dramas and apocalyptic tales.\n\n21st century films such as Clash of the Titans, Immortals and Thor continue the trend of mining traditional mythology to frame modern plots. Authors use mythology as a basis for their books, such as Rick Riordan, whose Percy Jackson and the Olympians series is situated in a modern-day world where the Greek deities are manifest, as well as his Kane Chronicles with the Egyptian pantheon and Magnus Chase with the Norse gods.\n\nModern myths such as urban legends shows that myth-making continues. Myth-making is not a collection of stories fixed to a remote time and place, but an ongoing social practice within every society.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Mythology" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19685" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Mythology refers variously to the collected myths of a group of peopleOxford English Dictionary,  \"myth, n. Oxford University Press (Oxford), 2003. or to the study of such myths.\n\nA folklore genre, myth is a feature of every culture. Many sources for myths have been proposed, ranging from personification of nature or personification of natural phenomena, to truthful or hyperbolic accounts of historical events to explanations of existing rituals. A culture's collective mythology helps convey belonging, shared and religious experiences, behavioral models, and moral and practical lessons.\n\nThe study of myth began in ancient history. Rival classes of the Greek myths by Euhemerus, Plato and Sallustius were developed by the Neoplatonists and later revived by Renaissance mythographers. The nineteenth-century comparative mythology reinterpreted myth as a primitive and failed counterpart of science (Tylor), a \"disease of language\" (Müller), or a misinterpretation of magical ritual (Frazer).\n\nRecent approaches often view myths as manifestations of psychological, cultural, or societal truths, rather than as inaccurate historical accounts.\n\nEtymology\n\nThe term mythology predates the word myth by centuries. It first appeared in the fifteenth century, borrowed from the Middle French term mythologie. The word mythology, (\"exposition of myths\"), comes from Middle French mythologie, from Late Latin mythologia, from Greek μυθολογία mythología (\"legendary lore, a telling of mythic legends; a legend, story, tale\") from μῦθος mythos (\"myth\") and -λογία -logia (\"study\").[http://www.etymonline.com/index.php?termmythology \"mythology\"]. Online Etymology DictionaryOxford English Dictionary, 3rd ed. \"mythology, n.\" 2003. Accessed 20 Aug 2014. Both terms translated the subject of Latin author Fulgentius' fifth-century Mythologiæ, which was concerned with the explication of Greek and Roman stories about their gods, commonly referred to as classical mythology. Although Fulgentius' conflation with the contemporary African Saint Fulgentius is now questioned,Hays, Gregory. \"The date and identity of the mythographer Fulgentius\" in Journal of Medieval Latin, ,  2003. the Mythologiæ explicitly treated its subject matter as allegories requiring interpretation and not as true events.\n\nThe word mythología [] appears in Plato, but was used as a general term for \"fiction\" or \"story-telling\" of any kind, combining mỹthos [, \"narrative, fiction\"] and -logía [, \"discourse, able to speak about\"].Oxford English Dictionary,  \"-logy, comb. form\". Oxford University Press (Oxford), 1903. From Lydgate until the seventeenth or eighteenth-century, mythology was similarly used to mean a moral, fable, allegory or a parable. From its earliest use in reference to a collection of traditional stories or beliefs, mythology implied the falsehood of the stories being described. It came to be applied by analogy with similar bodies of traditional stories among other polytheistic cultures around the world. The Greek loanword mythos (pl. mythoi) and Latinate mythus (pl. mythi) both appeared in English before the first example of myth in 1830.\n\nTerminology\n\nIn present use, mythology usually refers to the collected myths of a group of people, but may also mean the study of such myths. For example, Greek mythology, Roman mythology and Hittite mythology all describe the body of myths retold among those cultures. Dundes defined myth as a sacred narrative that explains how the world and humanity evolved into their present form. Dundes classified a sacred narrative as \"a story that serves to define the fundamental worldview of a culture by explaining aspects of the natural world and delineating the psychological and social practices and ideals of a society\". Lincoln defined myth as \"ideology in narrative form.\" Scholars in other fields use the term myth in varied ways. In a broad sense, the word can refer to any traditional story, popular misconception or imaginary entity. Due to this pejorative sense, some scholars opted for the term mythos. Its use was similarly pejorative and now more commonly refers to its Aristotelian sense as a \"plot point\" or to a collective mythology,Oxford English Dictionary,  \"mythos, n.\" Oxford University Press (Oxford), 2003. as in the world building of H.P. Lovecraft.\n\nThe term is often distinguished from didactic literature such as fables, but its relationship with other traditional stories, such as legends and folktales, is more nebulous. Main characters in myths are usually gods, demigods or supernatural humans,\"myths\", A Dictionary of English FolkloreO'Flaherty, p. 78: \"I think it can be well argued as a matter of principle that, just as 'biography is about chaps', so mythology is about gods.\" while legends generally feature humans as their main characters. However, many exceptions or combinations exist, as in the Iliad, Odyssey and Aeneid. Myths are often endorsed by rulers and priests and are closely linked to religion or spirituality. In fact, many societies group their myths, legends and history together, considering myths to be true accounts of their remote past. Creation myths particularly, take place in a primordial age when the world had not achieved its later form. Other myths explain how a society's customs, institutions and taboos were established and sanctified. A separate space is created for folktales, which are not considered true by anyone. As stories spread to other cultures or as faiths change, myths can come to be considered folktales. Its divine characters are recast as either as humans or demihumans such as giants, elves and faeries.\n\nOrigins\n\nEuhemerism\n\nOne theory claims that myths are distorted accounts of historical events. According to this theory, storytellers repeatedly elaborate upon historical accounts until the figures in those accounts gain the status of gods. For example, the myth of the wind-god Aeolus may have evolved from a historical account of a king who taught his people to use sails and interpret the winds. Herodotus (fifth-century BC) and Prodicus made claims of this kind. This theory is named euhemerism after mythologist Euhemerus (c. 320 BC), who suggested that Greek gods developed from legends about human beings.\"Euhemerism\", The Concise Oxford Dictionary of World Religions\n\nAllegory\n\nSome theories propose that myths began as allegories for natural phenomena: Apollo represents the sun, Poseidon represents water, and so on. According to another theory, myths began as allegories for philosophical or spiritual concepts: Athena represents wise judgment, Aphrodite desire, and so on. Müller supported an allegorical theory of myth. He believed myths began as allegorical descriptions of nature and gradually came to be interpreted literally. For example, a poetic description of the sea as \"raging\" was eventually taken literally and the sea was then thought of as a raging god.\n\nPersonification\n\nSome thinkers claimed that myths result from the personification of objects and forces. According to these thinkers, the ancients worshiped natural phenomena, such as fire and air, gradually deifying them. For example, according to this theory, ancients tended to view things as gods, not as mere objects. Thus, they described natural events as acts of personal gods, giving rise to myths.\n\nMyth-ritual theory\n\nAccording to the myth-ritual theory, myth is tied to ritual. In its most extreme form, this theory claims myths arose to explain rituals. This claim was first put forward by Smith, who claimed that people begin performing rituals for reasons not related to myth. Forgetting the original reason for a ritual, they account for it by inventing a myth and claiming the ritual commemorates the events described in that myth. Frazer claimed that humans started out with a belief in magical rituals; later, they began to lose faith in magic and invented myths about gods, reinterpreting their rituals as religious rituals intended to appease the gods.\n\nFunctions\n\nEliade argued that one of the foremost functions of myth is to establish models for behavior and that myths may provide a religious experience. By telling or reenacting myths, members of traditional societies detach themselves from the present, returning to the mythical age, thereby coming closer to the divine.\n\nHonko asserted that, in some cases, a society reenacts a myth in an attempt to reproduce the conditions of the mythical age. For example, it might reenact the healing performed by a god at the beginning of time in order to heal someone in the present. Similarly, Barthes argued that modern culture explores religious experience. Since it is not the job of science to define human morality, a religious experience is an attempt to connect with a perceived moral past, which is in contrast with the technological present.\n\nPattanaik defines mythology as \"a subjective truth of people that is communicated through stories, symbols and rituals\". He adds, \"unlike fantasy that is nobody’s truth, and history that seeks to be everybody’s truth, mythology is somebody’s truth.\"\n\nHistory of the academic discipline\n\nHistorically, the important approaches to the study of mythology have been those of Vico, Schelling, Schiller, Jung, Freud, Lévy-Bruhl, Lévi-Strauss, Frye, the Soviet school, and the Myth and Ritual School.Guy Lanoue, Foreword to Meletinsky, p. viii\n\nPre-modern\n\nThe critical interpretation of myth began with the Presocratics. Euhemerus was one of the most important pre-modern mythologists. He interpreted myths as accounts of actual historical events - distorted over many retellings. SallustiusOn the Gods and the World, ch. 5, See Collected Writings on the Gods and the World, The Prometheus Trust, Frome, 1995 divided myths into five categories – theological, physical (or concerning natural laws), animistic (or concerning soul), material, and mixed. Mixed concerns myths that show the interaction between two or more of the previous categories and are particularly used in initiations.\n\nPlato famously condemned poetic myth when discussing education in the Republic. His critique was primarily on the grounds that the uneducated might take the stories of gods and heroes literally. Nevertheless, he constantly referred to myths throughout his writings. As Platonism developed in the phases commonly called Middle Platonism and neoplatonism, writers such as Plutarch, Porphyry, Proclus, Olympiodorus, and Damascius wrote explicitly about the symbolic interpretation of traditional and Orphic myths.Perhaps the most extended passage of philosophic interpretation of myth is to be found in the fifth and sixth essays of Proclus’ Commentary on the Republic (to be found in The Works of Plato I, trans. Thomas Taylor, The Prometheus Trust, Frome, 1996); Porphyry’s analysis of the Homeric Cave of the Nymphs is another important work in this area (Select Works of Porphyry, Thomas Taylor The Prometheus Trust, Frome, 1994). See the external links below for a full English translation.\n\nInterest in polytheistic mythology revived during the Renaissance, with early works on mythography appearing in the sixteenth-century, such as the Theologia Mythologica (1532). While myths are not the same as fables, legends, folktales, fairy tales, anecdotes, or fiction, the concepts may overlap. Notably, during the nineteenth century period of Romanticism, folktales and fairy tales were perceived as eroded fragments of earlier mythology (famously by the Brothers Grimm and Elias Lönnrot).\n\nMythological themes were consciously employed in literature, beginning with Homer. The resulting work may expressly refer to a mythological background without itself becoming part of a body of myths (Cupid and Psyche). Medieval romance in particular plays with this process of turning myth into literature. Euhemerism, as stated earlier, refers to the rationalization of myths, putting themes formerly imbued with mythological qualities into pragmatic contexts. An example of this would be following a cultural or religious paradigm shift (notably the re-interpretation of pagan mythology following Christianization).\n\nConversely, historical and literary material may acquire mythological qualities over time. For example, the Matter of Britain (the legendary history of Great Britain, especially those focused on King Arthur and the knights of the Round Table) and the Matter of France, based on historical events of the fifth and eighth-centuries respectively, were first made into epic poetry and became partly mythological over the following centuries. \"Conscious generation\" of mythology was termed mythopoeia by Tolkien and was notoriously also suggested, separately, by Nazi ideologist Alfred Rosenberg.\n\nNineteenth-century\n\nThe first scholarly theories of myth appeared during the second half of the nineteenth-century. In general, these nineteenth-century theories framed myth as a failed or obsolete mode of thought, often by interpreting myth as the primitive counterpart of modern science.\n\nFor example, Tylor interpreted myth as an attempt at a literal explanation for natural phenomena. Unable to conceive impersonal natural laws, early humans tried to explain natural phenomena by attributing souls to inanimate objects, giving rise to animism. According to Tylor, human thought evolved through stages, starting with mythological ideas and gradually progressing to scientific ideas. Not all scholars, not even all nineteenth-century scholars, accepted this view. Lévy-Bruhl claimed \"the primitive mentality is a condition of the human mind, and not a stage in its historical development.\"\n\nMüller called myth a \"disease of language\". He speculated that myths arose due to the lack of abstract nouns and neuter gender in ancient languages. Anthropomorphic figures of speech, necessary in such languages, were eventually taken literally, leading to the idea that natural phenomena were in actuality conscious beings or gods.\n\nFrazer saw myths as a misinterpretation of magical rituals, which were themselves based on a mistaken idea of natural law. According to Frazer, humans begin with an unfounded belief in impersonal magical laws. When they realize applications of these laws do not work, they give up their belief in natural law in favor of a belief in personal gods controlling nature, thus giving rise to religious myths. Meanwhile, humans continue practicing formerly magical rituals through force of habit, reinterpreting them as reenactments of mythical events. Finally humans come to realize nature follows natural laws, and they discover their true nature through science. Here again, science makes myth obsolete as humans progress \"from magic through religion to science.\"\n\nSegal asserted that by pitting mythical thought against modern scientific thought, such theories imply modern humans must abandon myth.\n\nTwentieth-century\n\nMany twentieth-century theories rejected the nineteenth-century theories' opposition of myth and science. In general, \"twentieth-century theories have tended to see myth as almost anything but an outdated counterpart to science […]. Consequently, modern individuals are not obliged to abandon myth for science.\"\n\nJung tried to understand the psychology behind world myths. Jung asserted that all humans share certain innate unconscious psychological forces, which he called archetypes. He believed similarities between the myths of different cultures reveals the existence of these universal archetypes.Boeree\n\nLévi-Strauss believed myths reflect patterns in the mind and interpreted those patterns more as fixed mental structures, specifically pairs of opposites (good/evil, compassionate/callous), rather than unconscious feelings or urges.\n\nIn his appendix to Myths, Dreams and Mysteries, and in The Myth of the Eternal Return, Eliade attributed modern humans’ anxieties to their rejection of myths and the sense of the sacred.\n\nIn the 1950s, Barthes published a series of essays examining modern myths and the process of their creation in his book Mythologies.https://books.google.co.cr/books?idtlpHad1I-xkC&pg\nPA189&lpgPA189&dq\nIn+the+1950s,+Barthes+published+a+series+of+essays+examining+modern+myths+and+the+process+of+their+creation+in+his+book+Mythologies.&sourcebl&ots\nEXDTKC9Jru&sigfWmHMZVDcQnmJMN-GOvw-HVNBJU&hl\nen&saX&ved\n0ahUKEwi2-afhlpvZAhUlrVkKHV7RAlkQ6AEIJzAA#vonepage&q\nIn%20the%201950s%2C%20Barthes%20published%20a%20series%20of%20essays%20examining%20modern%20myths%20and%20the%20process%20of%20their%20creation%20in%20his%20book%20Mythologies.&f=false\n\nFollowing the Structuralist Era (roughly the 1960s to 1980s), the predominant anthropological and sociological approaches to myth increasingly treated myth as a form of narrative that can be studied, interpreted and analyzed like ideology, history and culture. In other words, myth is a form of understanding and telling stories that is connected to power, political structures, and political and economic interests. These approaches contrast with approaches such as those of Campbell and Eliade that hold that myth has some type of essential connection to ultimate sacred meanings that transcend cultural specifics. In particular, myth was studied in relation to history from diverse social sciences. Most of these studies share the assumption that history and myth are not distinct in the sense that history is factual, real, accurate, and truth, while myth is the opposite.\n\nChristian theologian Conrad Hyers wrote that\n\nComparative mythology\n\nComparative mythology is the systematic comparison of myths from different cultures. It seeks to discover underlying themes that are common to the myths of multiple cultures. In some cases, comparative mythologists use the similarities between separate mythologies to argue that those mythologies have a common source. This source may inspire myths or provide a common \"protomythology\" that diverged into the mythologies of each culture.\n\nNineteenth-century interpretations of myth were often comparative, seeking a common origin for all myths. Later scholars tend to avoid universal statements about mythology. One exception to this modern trend is Campbell's The Hero with a Thousand Faces (1949), which claims that all hero myths follow the same underlying pattern. This theory of a monomyth later fell out of favor.\n\nModern mythology\n\nIn modern society, myth is often regarded as a collection of stories. Scholars in the field of cultural studies research how myth has worked itself into modern discourses. Mythological discourse can reach greater audiences than ever before via digital media. Various mythic elements appear in television, cinema and video games.\n\nAlthough myth was traditionally transmitted through the oral tradition on a small scale, the film industry has enabled filmmakers to transmit myths to large audiences via film. In Jungian psychology myths are the expression of a culture or society’s goals, fears, ambitions and dreams. Film is an expression of the society in which it was produced and reflects the culture of its era and location.\n\nThe basis of modern visual storytelling is rooted in the mythological tradition. Many contemporary films rely on ancient myths to construct narratives. Disney Corporation is well-known among cultural study scholars for \"reinventing\" traditional childhood myths. While many films are not as obvious as Disney fairy tales, the plots of many films are based on the rough structure of myths. Mythological archetypes, such as the cautionary tale regarding the abuse of technology, battles between gods and creation stories, are often the subject of major film productions. These films are often created under the guise of cyberpunk action films, fantasy, dramas and apocalyptic tales.\n\n21st century films such as Clash of the Titans, Immortals and Thor continue the trend of mining traditional mythology to frame modern plots. Authors use mythology as a basis for their books, such as Rick Riordan, whose Percy Jackson and the Olympians series is situated in a modern-day world where the Greek deities are manifest, as well as his Kane Chronicles with the Egyptian pantheon and Magnus Chase with the Norse gods.\n\nModern myths such as urban legends shows that myth-making continues. Myth-making is not a collection of stories fixed to a remote time and place, but an ongoing social practice within every society. Mythology. http://en.wikipedia.org/?curid=19685."
  }
}
