{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13015",
  "eid" : "0609c500-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778519376,
  "textBody" : "George Simon Kaufman (November 16, 1889 – June 2, 1961) was an American playwright, theatre director and producer, humorist, and drama critic. In addition to comedies and political satire, he wrote several musicals, notably for the Marx Brothers. One play and one musical that he wrote won the Pulitzer Prize for Drama: You Can't Take It with You (1937, with Moss Hart), and Of Thee I Sing (1932, with Morrie Ryskind and Ira Gershwin). He also won the Tony Award as a Director, for the musical Guys and Dolls.\n\nBiography\n\nEarly years\n\nBorn to Joseph S. Kaufman, a hatband manufacturer,1910 United States Federal Census and Nettie MeyersU.S., Social Security Applications and Claims Index, 1936-2007 in Pittsburgh, Pennsylvania. He had a younger sister, Ruth.1910 United States Federal Census He graduated from high school in 1907 and \"tried law school for three months\" but grew disenchanted and took on a series of odd jobs, including \"selling hatbands\".Wallace, Irving, Amy Wallace, David Wallechinsky and Sylvia Wallace (2008). [https://books.google.com/books?id\nFNTFJ1aqXcwC&pgPA172 The Intimate Sex Lives of Famous People]. Feral House, , p. 173. As a young man, he sold silk.1910 United States Federal Census Kaufman then began his career as a journalist and drama critic; he was the drama editor for The New York Times from 1917 through 1930.  Kaufman took his editorial responsibilities very seriously. According to legend, on one occasion a press agent asked: \"How do I get our leading lady's name in the Times?\" Kaufman: \"Shoot her.\"\n\nCareer\n\nHe worked with Moss Hart in 1930 on the Broadway hit \"Once in a Lifetime\" and also with Hart, wrote \"You Can't Take it With You\" and \"The Man Who Came to Dinner\".\n\nTheatre\n\nKaufman's Broadway debut was September 4, 1918 at the Knickerbocker Theatre,  with the premiere of the melodrama Someone in the House. (abstract)  He coauthored the play with Walter C. Percival, based on a magazine story written by Larry Evans. The play opened on Broadway (running for only 32 performances) during  that year's serious flu epidemic, when people were being advised to avoid crowds.  With \"dour glee\", Kaufman suggested that the best way to avoid crowds in New York City was to attend his play.\n\nIn every Broadway season from 1921 through 1958, there was a play written or directed by Kaufman. Since Kaufman's death in 1961, there have been revivals of his work on Broadway in the 1960s, the 1970s, the 1980s, the 2000s and the 2010s.[http://www.ibdb.com/person.php?id5827 \"George S. Kaufman\"]. Internet Broadway Database (ibdb.com). Retrieved 2010-11-13.  Kaufman wrote only one play alone, The Butter and Egg Man in 1925.Londré, Felicia Hardison (2005). [https://books.google.com/books?id\nJldiza39QrcC&pgPA47 Words at Play:Creative Writing and Dramaturgy]. SIU Press, , p. 47.  With Marc Connelly, he wrote Merton of the Movies, Dulcy, and Beggar on Horseback; with Ring Lardner he wrote June Moon; with Edna Ferber he wrote The Royal Family, Dinner at Eight, and Stage Door; with John P. Marquand he wrote a stage adaptation of Marquand's novel The Late George Apley; and with Howard Teichmann he wrote The Solid Gold Cadillac.  According to his biography on PBS, \"he wrote some of the American theater's most enduring comedies\" with Moss Hart.Larkin, Colin, ed. (2004). [https://www.pbs.org/wnet/broadway/stars/kaufman_g.html \"Stars Over Broadway: Biography, Excerpted from the Encyclopedia of Popular Music\"]. pbs.org. Retrieved 2010-11-13. Their work includes Once in a Lifetime (in which he also performed), Merrily We Roll Along, The Man Who Came to Dinner and You Can't Take It with You, which won the Pulitzer Prize in 1937.[http://www.pulitzer.org/bycat/Drama \"The Pulitzer Prizes, Drama\"]. pulitzer.org. Retrieved 2011-03-06.\n\nFor a period, Kaufman lived at 158 West 58th Street in New York City. The building later would be the setting for Stage Door. It is now the Park Savoy Hotel and for many years was considered a single room occupancy hotel. (abstract) \n\n;Musical theatre\nDespite his claim that he knew nothing about music and hated it in the theatre, Kaufman collaborated on many musical theatre projects. His most successful of such efforts include two Broadway shows crafted for the Marx Brothers, The Cocoanuts, written with Irving Berlin, and Animal Crackers, written with Morrie Ryskind, Bert Kalmar, and Harry Ruby. According to Charlotte Chandler, \"By the time Animal Crackers opened ... the Marx Brothers were becoming famous enough to interest Hollywood. Paramount signed them to a contract\".Chandler, Charlotte (2007). Hello, I Must Be Going: Groucho and His Friends, Simon and Schuster, .  Kaufman was one of the writers who excelled in writing intelligent nonsense for Groucho Marx, a process that was collaborative, given Groucho's skills at expanding upon the scripted material. Though the Marx Brothers were notoriously critical of their writers, Groucho and Harpo Marx expressed admiration and gratitude towards Kaufman. Dick Cavett, introducing Groucho onstage at Carnegie Hall in 1972, told the audience that Groucho considered Kaufman to be \"his god\".\n\nWhile The Cocoanuts was being developed in Atlantic City, Irving Berlin was hugely enthusiastic about a song he had written for the show. Kaufman was less enthusiastic, and refused to rework the libretto to include this number. The discarded song was \"Always\", ultimately a huge hit for Berlin, recorded by many popular performers. According to Laurence Bergreen, \"Kaufman's lack of enthusiasm caused Irving to lose confidence in the song, and 'Always' was deleted from the score of The Cocoanuts – though not from its creators memory. ... Kaufman, a confirmed misogynist, had had no use for the song in The Cocoanuts but his disapproval did not deter Berlin from saving it for a more important occasion.\"Bergreen, Laurence  (1996). As Thousands Cheer: The Life of Irving Berlin, Da Capo Press, , pp. 249, 264. The Cocoanuts would remain Irving Berlin's only Broadway musical – until his last one, Mr. President – that did not include at least one eventual hit song.\n\nHumor derived from political situations was of particular interest to Kaufman. He collaborated on the hit musical Of Thee I Sing, which won the 1932 Pulitzer Prize, the first musical so honored, and its sequel Let 'Em Eat Cake, as well as one troubled but eventually successful satire that had several incarnations, Strike Up the Band. Working with Kaufman on these ventures were Ryskind, George Gershwin, and Ira Gershwin. Also, Kaufman, with Moss Hart, wrote the book to I'd Rather Be Right, a musical starring George M. Cohan as Franklin Delano Roosevelt (the U.S. President at the time), with songs by Richard Rodgers and Lorenz Hart. He also co-wrote the 1935 comedy-drama First Lady.  In 1945, Kaufman adapted H.M.S. Pinafore into Hollywood Pinafore.\n\nKaufman also contributed to major New York revues, including The Band Wagon (which shared songs but not plot with the 1953 film version) with Arthur Schwartz and Howard Dietz. His often anthologized sketch \"The Still Alarm\" from the revue The Little Show lasted long after the show closed. Another well-known sketch of his is \"If Men Played Cards As Women Do.\" There have also been musicals based on Kaufman properties, such as the 1981 musical version of Merrily We Roll Along, adapted by George Furth and Stephen Sondheim.Rich, Frank (November 17, 1981). [http://theater2.nytimes.com/mem/theater/treview.html?res9805E6D91F39F934A25752C1A967948260 \"Stage: A New Sondheim, Merrily We Roll Along\"]. The New York Times. The musical Sherry! (1967) was based on his play The Man Who Came to Dinner.[http://www.ibdb.com/production.php?id\n3073 \"Sherry!\"]. Internet Broadway Database (ibdb.com). Retrieved 2010-11-13.\n\n;Directing and producing\nKaufman directed the original or revival stage productions of many plays and musicals, including:The Front Page by Charles MacArthur and Ben Hecht (1928), Of Thee I Sing (1931 and 1952), Of Mice and Men by John Steinbeck (1937), My Sister Eileen by Joseph Fields and Jerome Chodorov (1940), Hollywood Pinafore (1945), The Next Half Hour (1945), Park Avenue (1946, also co-wrote the book), Town House (1948), Bravo! (1948, also co-wrote the script), Metropole (1949), the Frank Loesser musical Guys and Dolls, for which he won the 1951 Best Director Tony Award, The Enchanted (1950), The Small Hours (1951, also co-wrote the script), Fancy Meeting You Again (1952, also co-wrote the script), The Solid Gold Cadillac (1953, also co-wrote the script), and Romanoff and Juliet by Peter Ustinov (1957).\n\nKaufman produced many of his own plays as well as those of other writers. For a short time, approximately from 1940 to circa 1946, Kaufman, with Moss Hart and Max Gordon, owned and operated the Lyceum Theatre.Bloom, Ken (2007). [https://books.google.com/books?idzd15GW0ruWUC&pg\nPA158 \"Lyceum Theatre\"]. The Routledge Guide To Broadway, CRC Press, , p. 158.\n\nHollywood and television\n\nMany of Kaufman's plays were adapted into Hollywood films.  Among the more well-received were Dinner At Eight, Stage Door (almost completely rewritten by others for the film version) and You Can't Take It with You (changed significantly by others for the film version), which won the Best Picture Oscar in 1938. He also occasionally wrote directly for the movies, most significantly the screenplay for A Night at the Opera for the Marx Brothers. His only credit as a film director was The Senator Was Indiscreet (1947) starring William Powell.\n\nFrom 1949 until midway through the 1952–1953 season, he appeared as a panelist on the CBS television series This Is Show Business.McNeil, Alex. Total Television: Revised Edition. Penguin Books (1996), pp. 830-1. [http://www.time.com/time/magazine/article/0,9171,817722,00.html \"Radio: The Troubled Air\"]. TIME, January 12, 1953. On the December 21, 1952 episode of the show—telecast live—Kaufman made an offhand remark about the excessive airing of \"Silent Night\" during the Christmas season. \"Let's make this one program,\" he said, \"on which no one sings 'Silent Night'.\"  The resulting public outcry prompted his dismissal by CBS.McNeil, Alex. Total Television: Revised Edition. Penguin Books (1996), p. 832.   In response, Fred Allen said, \"There were only two wits on television: Groucho Marx and George S. Kaufman.  Without Kaufman, television has reverted to being half-witted.\"Kaufman, GS. By George: A Kaufman Collection. St. Martins Press (1979), pp. ix-x.   It would be more than a year before Kaufman appeared on TV again.\n\nBridge\n\nKaufman was a prominent player of bridge, probably both auction bridge and contract bridge. The New Yorker published many of his humorous items about the card game; at least some have been reprinted more than once, including:\n*\"Kibitzers' Revolt\"  and the suggestion that bridge clubs should post notice whether the North–South or the East–West pairs are holding good cards.[http://acblstory.wordpress.com/2012/11/05/acbl-bridge-beat-121-george-kaufman \"ACBL Bridge Beat #121: George Kaufman\"]. Not Just the ACBL Story – but History. November 5, 2012. American Contract Bridge League (75th Anniversary contributions by anonymous members?). Retrieved 2014-06-13.\n*Kaufman was notoriously impatient with poor players. One such partner asked permission to use the men's room, according to legend, and Kaufman replied: \"Gladly. For the first time today I'll know what you have in your hand.\"\n*On sitting South: (1) \"No matter who writes the books or articles, South holds the most terrific cards I ever saw. There is a lucky fellow if ever I saw one.\"  (2) Oswald Jacoby reported a deal that Kaufman played marvelously in 1952, after which he cracked, \"I'd rather sit South than be the President.\"\n*On , \"I'd like a review of the bidding with all the original inflections.\"\n\nHis first wife Beatrice Bakrow Kaufman was also an avid bridge player, and an occasional poker player with Algonquin men, who wrote at least one New Yorker article on bridge herself, in 1928.Galchinsky, Michael (March 1, 2009). \"Beatrice Kaufman 1895–1945\". Jewish Women: A Comprehensive Historical Encyclopedia. Jewish Women's Archive (jwa.org). Retrieved 2014-06-13.\n\nPersonal life\n\nIn the 1920s, Kaufman was a member of the Algonquin Round Table, a circle of writers and show business people. From the 1920s through the 1950s, Kaufman was as well known for his personality as he was for his writing. In the Moss Hart autobiography Act One, Hart portrayed Kaufman as a morose and intimidating figure, uncomfortable with any expressions of affection between human beings—in life or on the page. Hart writes that Max Siegel said: \"Maybe I should have warned you. Mr Kaufman hates any kind of sentimentality--can't stand it!\"Hart, Moss (1989). Act one: an autobiography. Macmillan, , p. 274. \n\nThis perspective, along with a number of taciturn observations made by Kaufman himself, led to a simplistic but commonly held belief that Hart was the emotional soul of the creative team while Kaufman was a misanthropic writer of punchlines.  Kaufman preferred never to leave Manhattan. He once said: \"I never want to go any place where I can't get back to Broadway and 44th by midnight.\"\n\nCalled \"Public Lover Number One\", he \"dated some of the most beautiful women on Broadway\".Wallace 2008, p. 174. Kaufman found himself in the center of a scandal in 1936 when, in the midst of a child custody suit, the former husband of actress Mary Astor threatened to publish one of Astor's diaries purportedly containing extremely explicit details of an affair between Kaufman and the actress. The diary was eventually destroyed unread by the courts in 1952, but details of the supposed contents were published in Confidential magazine, Hollywood Babylon by Kenneth Anger, and various other scandal sheets. Some of the sexually explicit portion, involving Kaufman, were reprinted in New York magazine in 2012 and Vanity Fair magazine in 2016. Kaufman had an affair with actress Natalie Schafer during the 1940s.Brozan, Nadine (February 13, 1995). [https://www.nytimes.com/1995/02/13/nyregion/chronicle-058495.html \"Chronicle\"]. The New York Times. (Schafer played \"Mrs. Lovey Howell\" on the TV sitcom Gilligan's Island.) \n\nKaufman joined the famous theater club, The Lambs, in 1944http://www.the-lambs.org\n\nKaufman was married to his first wife Beatrice from 1917 until her death in 1945.\"Beatrice Kaufman, Story Editor, Dies\". The New York Times, October 7, 1945, p. 44.[https://select.nytimes.com/gst/abstract.html?res\nF00E17FF3D5B127A93C5A9178BD95F418485F9&scp1&sq\n%22George+S.+Kaufman%22&stp \"BEATRICE KAUFMAN, STORY EDITOR, DIES; Wife of Noted Playwright Did Much Literary Work Herself – Wrote for Magazines\"]. The New York Times, October 7, 1945. (abstract)  They had one daughter, Anne Kaufman (Booth). Four years later, he married actress Leueen MacGrath on May 26, 1949,\"George S. Kaufman Weds\". The New York Times, May 27, 1949, p. 25. Quote: \"George S. Kaufman and Leueen MacGrath, English actress, were married today at the playwright's Bucks County home, Barley Sheaf Farm\".[https://select.nytimes.com/gst/abstract.html?resFB0E1EF63B5F177B93C5AB178ED85F4D8485F9&scp\n1&sq%22George+S.+Kaufman%22&st\np \"GEORGE S. KAUFMAN WEDS; Playwright and Leueen M Grath, Actress, Marry at His Farm\"]. The New York Times, May 27, 1949. (abstract)  with whom he collaborated on a number of plays before their divorce in August 1957.\"George S. Kaufman Dies at 71; Shared 2 Pulitzers for Drama; Cited for Of Thee I Sing and You Can't Take It With You – Also Top Director George S. Kaufman Dies at 71; Shared 2 Pulitzers for Drama\", The New York Times, June 3, 1961, p. 1. (abstract)  Kaufman died in New York City on June 2, 1961, at the age of 71. His granddaughter, Beatrice Colen, was an actress who had recurring appearances on both Happy Days and Wonder Woman.[http://www.wonderland-site.com/html/miscel/bios/bios5.htm Beatrice Colen profile]. Wonderland: The Ultimate Lynda Carter Site; retrieved June 13, 2014.\n\nIn 1979, Donald Oliver compiled and edited a collection of Kaufman's humorous pieces, with a foreword by Dick Cavett.Kaufman, George S. (Donald Oliver, compiler/editor) (1979). By George: A Kaufman Collection. New York: St. Martin's Press, .\n\nPortrayals\n\nKaufman was portrayed by the actor David Thornton in the 1994 film Mrs. Parker and the Vicious Circle[http://www.imdb.com/title/tt0110588 \"Mrs. Parker and the Vicious Circle\"]. Internet Movie Database (imdb.com). and by Jason Robards in the 1963 film Act One. In the 2014 Broadway adaptation of the latter by James Lapine, he was played by Tony Shalhoub.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "George S. Kaufman" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13015" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "George Simon Kaufman (November 16, 1889 – June 2, 1961) was an American playwright, theatre director and producer, humorist, and drama critic. In addition to comedies and political satire, he wrote several musicals, notably for the Marx Brothers. One play and one musical that he wrote won the Pulitzer Prize for Drama: You Can't Take It with You (1937, with Moss Hart), and Of Thee I Sing (1932, with Morrie Ryskind and Ira Gershwin). He also won the Tony Award as a Director, for the musical Guys and Dolls.\n\nBiography\n\nEarly years\n\nBorn to Joseph S. Kaufman, a hatband manufacturer,1910 United States Federal Census and Nettie MeyersU.S., Social Security Applications and Claims Index, 1936-2007 in Pittsburgh, Pennsylvania. He had a younger sister, Ruth.1910 United States Federal Census He graduated from high school in 1907 and \"tried law school for three months\" but grew disenchanted and took on a series of odd jobs, including \"selling hatbands\".Wallace, Irving, Amy Wallace, David Wallechinsky and Sylvia Wallace (2008). [https://books.google.com/books?id\nFNTFJ1aqXcwC&pgPA172 The Intimate Sex Lives of Famous People]. Feral House, , p. 173. As a young man, he sold silk.1910 United States Federal Census Kaufman then began his career as a journalist and drama critic; he was the drama editor for The New York Times from 1917 through 1930.  Kaufman took his editorial responsibilities very seriously. According to legend, on one occasion a press agent asked: \"How do I get our leading lady's name in the Times?\" Kaufman: \"Shoot her.\"\n\nCareer\n\nHe worked with Moss Hart in 1930 on the Broadway hit \"Once in a Lifetime\" and also with Hart, wrote \"You Can't Take it With You\" and \"The Man Who Came to Dinner\".\n\nTheatre\n\nKaufman's Broadway debut was September 4, 1918 at the Knickerbocker Theatre,  with the premiere of the melodrama Someone in the House. (abstract)  He coauthored the play with Walter C. Percival, based on a magazine story written by Larry Evans. The play opened on Broadway (running for only 32 performances) during  that year's serious flu epidemic, when people were being advised to avoid crowds.  With \"dour glee\", Kaufman suggested that the best way to avoid crowds in New York City was to attend his play.\n\nIn every Broadway season from 1921 through 1958, there was a play written or directed by Kaufman. Since Kaufman's death in 1961, there have been revivals of his work on Broadway in the 1960s, the 1970s, the 1980s, the 2000s and the 2010s.[http://www.ibdb.com/person.php?id5827 \"George S. Kaufman\"]. Internet Broadway Database (ibdb.com). Retrieved 2010-11-13.  Kaufman wrote only one play alone, The Butter and Egg Man in 1925.Londré, Felicia Hardison (2005). [https://books.google.com/books?id\nJldiza39QrcC&pgPA47 Words at Play:Creative Writing and Dramaturgy]. SIU Press, , p. 47.  With Marc Connelly, he wrote Merton of the Movies, Dulcy, and Beggar on Horseback; with Ring Lardner he wrote June Moon; with Edna Ferber he wrote The Royal Family, Dinner at Eight, and Stage Door; with John P. Marquand he wrote a stage adaptation of Marquand's novel The Late George Apley; and with Howard Teichmann he wrote The Solid Gold Cadillac.  According to his biography on PBS, \"he wrote some of the American theater's most enduring comedies\" with Moss Hart.Larkin, Colin, ed. (2004). [https://www.pbs.org/wnet/broadway/stars/kaufman_g.html \"Stars Over Broadway: Biography, Excerpted from the Encyclopedia of Popular Music\"]. pbs.org. Retrieved 2010-11-13. Their work includes Once in a Lifetime (in which he also performed), Merrily We Roll Along, The Man Who Came to Dinner and You Can't Take It with You, which won the Pulitzer Prize in 1937.[http://www.pulitzer.org/bycat/Drama \"The Pulitzer Prizes, Drama\"]. pulitzer.org. Retrieved 2011-03-06.\n\nFor a period, Kaufman lived at 158 West 58th Street in New York City. The building later would be the setting for Stage Door. It is now the Park Savoy Hotel and for many years was considered a single room occupancy hotel. (abstract) \n\n;Musical theatre\nDespite his claim that he knew nothing about music and hated it in the theatre, Kaufman collaborated on many musical theatre projects. His most successful of such efforts include two Broadway shows crafted for the Marx Brothers, The Cocoanuts, written with Irving Berlin, and Animal Crackers, written with Morrie Ryskind, Bert Kalmar, and Harry Ruby. According to Charlotte Chandler, \"By the time Animal Crackers opened ... the Marx Brothers were becoming famous enough to interest Hollywood. Paramount signed them to a contract\".Chandler, Charlotte (2007). Hello, I Must Be Going: Groucho and His Friends, Simon and Schuster, .  Kaufman was one of the writers who excelled in writing intelligent nonsense for Groucho Marx, a process that was collaborative, given Groucho's skills at expanding upon the scripted material. Though the Marx Brothers were notoriously critical of their writers, Groucho and Harpo Marx expressed admiration and gratitude towards Kaufman. Dick Cavett, introducing Groucho onstage at Carnegie Hall in 1972, told the audience that Groucho considered Kaufman to be \"his god\".\n\nWhile The Cocoanuts was being developed in Atlantic City, Irving Berlin was hugely enthusiastic about a song he had written for the show. Kaufman was less enthusiastic, and refused to rework the libretto to include this number. The discarded song was \"Always\", ultimately a huge hit for Berlin, recorded by many popular performers. According to Laurence Bergreen, \"Kaufman's lack of enthusiasm caused Irving to lose confidence in the song, and 'Always' was deleted from the score of The Cocoanuts – though not from its creators memory. ... Kaufman, a confirmed misogynist, had had no use for the song in The Cocoanuts but his disapproval did not deter Berlin from saving it for a more important occasion.\"Bergreen, Laurence  (1996). As Thousands Cheer: The Life of Irving Berlin, Da Capo Press, , pp. 249, 264. The Cocoanuts would remain Irving Berlin's only Broadway musical – until his last one, Mr. President – that did not include at least one eventual hit song.\n\nHumor derived from political situations was of particular interest to Kaufman. He collaborated on the hit musical Of Thee I Sing, which won the 1932 Pulitzer Prize, the first musical so honored, and its sequel Let 'Em Eat Cake, as well as one troubled but eventually successful satire that had several incarnations, Strike Up the Band. Working with Kaufman on these ventures were Ryskind, George Gershwin, and Ira Gershwin. Also, Kaufman, with Moss Hart, wrote the book to I'd Rather Be Right, a musical starring George M. Cohan as Franklin Delano Roosevelt (the U.S. President at the time), with songs by Richard Rodgers and Lorenz Hart. He also co-wrote the 1935 comedy-drama First Lady.  In 1945, Kaufman adapted H.M.S. Pinafore into Hollywood Pinafore.\n\nKaufman also contributed to major New York revues, including The Band Wagon (which shared songs but not plot with the 1953 film version) with Arthur Schwartz and Howard Dietz. His often anthologized sketch \"The Still Alarm\" from the revue The Little Show lasted long after the show closed. Another well-known sketch of his is \"If Men Played Cards As Women Do.\" There have also been musicals based on Kaufman properties, such as the 1981 musical version of Merrily We Roll Along, adapted by George Furth and Stephen Sondheim.Rich, Frank (November 17, 1981). [http://theater2.nytimes.com/mem/theater/treview.html?res9805E6D91F39F934A25752C1A967948260 \"Stage: A New Sondheim, Merrily We Roll Along\"]. The New York Times. The musical Sherry! (1967) was based on his play The Man Who Came to Dinner.[http://www.ibdb.com/production.php?id\n3073 \"Sherry!\"]. Internet Broadway Database (ibdb.com). Retrieved 2010-11-13.\n\n;Directing and producing\nKaufman directed the original or revival stage productions of many plays and musicals, including:The Front Page by Charles MacArthur and Ben Hecht (1928), Of Thee I Sing (1931 and 1952), Of Mice and Men by John Steinbeck (1937), My Sister Eileen by Joseph Fields and Jerome Chodorov (1940), Hollywood Pinafore (1945), The Next Half Hour (1945), Park Avenue (1946, also co-wrote the book), Town House (1948), Bravo! (1948, also co-wrote the script), Metropole (1949), the Frank Loesser musical Guys and Dolls, for which he won the 1951 Best Director Tony Award, The Enchanted (1950), The Small Hours (1951, also co-wrote the script), Fancy Meeting You Again (1952, also co-wrote the script), The Solid Gold Cadillac (1953, also co-wrote the script), and Romanoff and Juliet by Peter Ustinov (1957).\n\nKaufman produced many of his own plays as well as those of other writers. For a short time, approximately from 1940 to circa 1946, Kaufman, with Moss Hart and Max Gordon, owned and operated the Lyceum Theatre.Bloom, Ken (2007). [https://books.google.com/books?idzd15GW0ruWUC&pg\nPA158 \"Lyceum Theatre\"]. The Routledge Guide To Broadway, CRC Press, , p. 158.\n\nHollywood and television\n\nMany of Kaufman's plays were adapted into Hollywood films.  Among the more well-received were Dinner At Eight, Stage Door (almost completely rewritten by others for the film version) and You Can't Take It with You (changed significantly by others for the film version), which won the Best Picture Oscar in 1938. He also occasionally wrote directly for the movies, most significantly the screenplay for A Night at the Opera for the Marx Brothers. His only credit as a film director was The Senator Was Indiscreet (1947) starring William Powell.\n\nFrom 1949 until midway through the 1952–1953 season, he appeared as a panelist on the CBS television series This Is Show Business.McNeil, Alex. Total Television: Revised Edition. Penguin Books (1996), pp. 830-1. [http://www.time.com/time/magazine/article/0,9171,817722,00.html \"Radio: The Troubled Air\"]. TIME, January 12, 1953. On the December 21, 1952 episode of the show—telecast live—Kaufman made an offhand remark about the excessive airing of \"Silent Night\" during the Christmas season. \"Let's make this one program,\" he said, \"on which no one sings 'Silent Night'.\"  The resulting public outcry prompted his dismissal by CBS.McNeil, Alex. Total Television: Revised Edition. Penguin Books (1996), p. 832.   In response, Fred Allen said, \"There were only two wits on television: Groucho Marx and George S. Kaufman.  Without Kaufman, television has reverted to being half-witted.\"Kaufman, GS. By George: A Kaufman Collection. St. Martins Press (1979), pp. ix-x.   It would be more than a year before Kaufman appeared on TV again.\n\nBridge\n\nKaufman was a prominent player of bridge, probably both auction bridge and contract bridge. The New Yorker published many of his humorous items about the card game; at least some have been reprinted more than once, including:\n*\"Kibitzers' Revolt\"  and the suggestion that bridge clubs should post notice whether the North–South or the East–West pairs are holding good cards.[http://acblstory.wordpress.com/2012/11/05/acbl-bridge-beat-121-george-kaufman \"ACBL Bridge Beat #121: George Kaufman\"]. Not Just the ACBL Story – but History. November 5, 2012. American Contract Bridge League (75th Anniversary contributions by anonymous members?). Retrieved 2014-06-13.\n*Kaufman was notoriously impatient with poor players. One such partner asked permission to use the men's room, according to legend, and Kaufman replied: \"Gladly. For the first time today I'll know what you have in your hand.\"\n*On sitting South: (1) \"No matter who writes the books or articles, South holds the most terrific cards I ever saw. There is a lucky fellow if ever I saw one.\"  (2) Oswald Jacoby reported a deal that Kaufman played marvelously in 1952, after which he cracked, \"I'd rather sit South than be the President.\"\n*On , \"I'd like a review of the bidding with all the original inflections.\"\n\nHis first wife Beatrice Bakrow Kaufman was also an avid bridge player, and an occasional poker player with Algonquin men, who wrote at least one New Yorker article on bridge herself, in 1928.Galchinsky, Michael (March 1, 2009). \"Beatrice Kaufman 1895–1945\". Jewish Women: A Comprehensive Historical Encyclopedia. Jewish Women's Archive (jwa.org). Retrieved 2014-06-13.\n\nPersonal life\n\nIn the 1920s, Kaufman was a member of the Algonquin Round Table, a circle of writers and show business people. From the 1920s through the 1950s, Kaufman was as well known for his personality as he was for his writing. In the Moss Hart autobiography Act One, Hart portrayed Kaufman as a morose and intimidating figure, uncomfortable with any expressions of affection between human beings—in life or on the page. Hart writes that Max Siegel said: \"Maybe I should have warned you. Mr Kaufman hates any kind of sentimentality--can't stand it!\"Hart, Moss (1989). Act one: an autobiography. Macmillan, , p. 274. \n\nThis perspective, along with a number of taciturn observations made by Kaufman himself, led to a simplistic but commonly held belief that Hart was the emotional soul of the creative team while Kaufman was a misanthropic writer of punchlines.  Kaufman preferred never to leave Manhattan. He once said: \"I never want to go any place where I can't get back to Broadway and 44th by midnight.\"\n\nCalled \"Public Lover Number One\", he \"dated some of the most beautiful women on Broadway\".Wallace 2008, p. 174. Kaufman found himself in the center of a scandal in 1936 when, in the midst of a child custody suit, the former husband of actress Mary Astor threatened to publish one of Astor's diaries purportedly containing extremely explicit details of an affair between Kaufman and the actress. The diary was eventually destroyed unread by the courts in 1952, but details of the supposed contents were published in Confidential magazine, Hollywood Babylon by Kenneth Anger, and various other scandal sheets. Some of the sexually explicit portion, involving Kaufman, were reprinted in New York magazine in 2012 and Vanity Fair magazine in 2016. Kaufman had an affair with actress Natalie Schafer during the 1940s.Brozan, Nadine (February 13, 1995). [https://www.nytimes.com/1995/02/13/nyregion/chronicle-058495.html \"Chronicle\"]. The New York Times. (Schafer played \"Mrs. Lovey Howell\" on the TV sitcom Gilligan's Island.) \n\nKaufman joined the famous theater club, The Lambs, in 1944http://www.the-lambs.org\n\nKaufman was married to his first wife Beatrice from 1917 until her death in 1945.\"Beatrice Kaufman, Story Editor, Dies\". The New York Times, October 7, 1945, p. 44.[https://select.nytimes.com/gst/abstract.html?res\nF00E17FF3D5B127A93C5A9178BD95F418485F9&scp1&sq\n%22George+S.+Kaufman%22&stp \"BEATRICE KAUFMAN, STORY EDITOR, DIES; Wife of Noted Playwright Did Much Literary Work Herself – Wrote for Magazines\"]. The New York Times, October 7, 1945. (abstract)  They had one daughter, Anne Kaufman (Booth). Four years later, he married actress Leueen MacGrath on May 26, 1949,\"George S. Kaufman Weds\". The New York Times, May 27, 1949, p. 25. Quote: \"George S. Kaufman and Leueen MacGrath, English actress, were married today at the playwright's Bucks County home, Barley Sheaf Farm\".[https://select.nytimes.com/gst/abstract.html?resFB0E1EF63B5F177B93C5AB178ED85F4D8485F9&scp\n1&sq%22George+S.+Kaufman%22&st\np \"GEORGE S. KAUFMAN WEDS; Playwright and Leueen M Grath, Actress, Marry at His Farm\"]. The New York Times, May 27, 1949. (abstract)  with whom he collaborated on a number of plays before their divorce in August 1957.\"George S. Kaufman Dies at 71; Shared 2 Pulitzers for Drama; Cited for Of Thee I Sing and You Can't Take It With You – Also Top Director George S. Kaufman Dies at 71; Shared 2 Pulitzers for Drama\", The New York Times, June 3, 1961, p. 1. (abstract)  Kaufman died in New York City on June 2, 1961, at the age of 71. His granddaughter, Beatrice Colen, was an actress who had recurring appearances on both Happy Days and Wonder Woman.[http://www.wonderland-site.com/html/miscel/bios/bios5.htm Beatrice Colen profile]. Wonderland: The Ultimate Lynda Carter Site; retrieved June 13, 2014.\n\nIn 1979, Donald Oliver compiled and edited a collection of Kaufman's humorous pieces, with a foreword by Dick Cavett.Kaufman, George S. (Donald Oliver, compiler/editor) (1979). By George: A Kaufman Collection. New York: St. Martin's Press, .\n\nPortrayals\n\nKaufman was portrayed by the actor David Thornton in the 1994 film Mrs. Parker and the Vicious Circle[http://www.imdb.com/title/tt0110588 \"Mrs. Parker and the Vicious Circle\"]. Internet Movie Database (imdb.com). and by Jason Robards in the 1963 film Act One. In the 2014 Broadway adaptation of the latter by James Lapine, he was played by Tony Shalhoub. George S. Kaufman. http://en.wikipedia.org/?curid=13015."
  }
}
