{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11020",
  "eid" : "f930bcd0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778497821,
  "textBody" : "Events\n\n* 590 – Khosrau II is crowned king of Persia.\n* 706 – Byzantine emperor Justinian II has his predecessors Leontios and Tiberios III publicly executed in the Hippodrome of Constantinople.\n*1113 – Pope Paschal II issues Pie Postulatio Voluntatis, recognizing the Order of Hospitallers.\n*1214 – During the Anglo-French War (1213–1214), an English invasion force lands at La Rochelle in France.\n*1493 – While on board the Niña, Christopher Columbus writes an open letter (widely distributed upon his return to Portugal) describing his discoveries and the unexpected items he came across in the New World.\n*1637 – Ferdinand III becomes Holy Roman Emperor.\n*1690 – Constantin Cantemir, Prince of Moldavia, and the Holy Roman Empire sign a secret treaty in Sibiu, stipulating that Moldavia would support the actions led by the House of Habsburg against the Ottoman Empire.\n*1764 – The city of St. Louis is established in Spanish Louisiana (now in Missouri, USA).\n*1798 – The Roman Republic is proclaimed after Louis-Alexandre Berthier, a general of Napoleon, had invaded the city of Rome five days earlier.\n*1835 – The first constitutional law in modern Serbia is adopted.\n*1862 – American Civil War: General Ulysses S. Grant attacks Fort Donelson, Tennessee.\n*1870 – Stevens Institute of Technology is founded in New Jersey, USA and offers the first Bachelor of Engineering degree in Mechanical Engineering.\n*1879 – Women's rights: US President Rutherford B. Hayes signs a bill allowing female attorneys to argue cases before the Supreme Court of the United States.\n*1891 – Allmänna Idrottsklubben (AIK) (Swedish Sports Club) is founded.\n*1898 – The battleship  explodes and sinks in Havana harbor in Cuba, killing 274. This event leads the United States to declare war on Spain.\n*1901 – The association football club Alianza Lima is founded in Lima, Peru, under the name Sport Alianza.\n*1909 – The Flores Theater fire in Acapulco, Mexico kills 250.\n*1921 – Kingdom of Romania establishes its legation in Helsinki.\n*1923 – Greece becomes the last European country to adopt the Gregorian calendar.\n*1925 – The 1925 serum run to Nome: The second delivery of serum arrives in Nome, Alaska.\n*1933 – In Miami, Giuseppe Zangara attempts to assassinate US President-elect Franklin D. Roosevelt, but instead shoots Chicago mayor Anton J. Cermak, who dies of his wounds on March 6, 1933.\n*1942 – World War II: Fall of Singapore. Following an assault by Japanese forces, the British General Arthur Percival surrenders. About 80,000 Indian, United Kingdom and Australian soldiers become prisoners of war, the largest surrender of British-led military personnel in history.\n*1944 – World War II: The assault on Monte Cassino, Italy begins.\n*  1944   – World War II: The Narva Offensive begins.\n*1945 – World War II: Third day of bombing in Dresden.\n*1946 – ENIAC, the first electronic general-purpose computer, is formally dedicated at the University of Pennsylvania in Philadelphia.\n*1949 – Gerald Lankester Harding and Roland de Vaux begin excavations at Cave 1 of the Qumran Caves, where they will eventually discover the first seven Dead Sea Scrolls.\n*1952 – King George VI of the United Kingdom is buried in St George's Chapel, Windsor Castle.\n*1954 – Canada and the United States agree to construct the Distant Early Warning Line, a system of radar stations in the far northern Arctic regions of Canada and Alaska.\n*1961 – Sabena Flight 548 crashes in Belgium, killing 73, including the entire United States figure skating team along with several of their coaches and family members.\n*1965 – A new red-and-white maple leaf design is adopted as the flag of Canada, replacing the old Canadian Red Ensign banner.\n*1971 – The decimalisation of British coinage is completed on Decimal Day.\n*1972 – Sound recordings are granted U.S. federal copyright protection for the first time.\n*  1972   – José María Velasco Ibarra, serving as President of Ecuador for the fifth time, is overthrown by the military for the fourth time.\n*1982 – The drilling rig Ocean Ranger sinks during a storm off the coast of Newfoundland, killing 84 workers.\n*1989 – Soviet–Afghan War: The Soviet Union officially announces that all of its troops have left Afghanistan.\n*1991 – The Visegrád Agreement, establishing cooperation to move toward free-market systems, is signed by the leaders of Czechoslovakia, Hungary and Poland.\n*1992 – Serial killer Jeffrey Dahmer is sentenced in Milwaukee to life in prison.\n*1996 – At the Xichang Satellite Launch Center in China, a Long March 3 rocket, carrying an Intelsat 708, crashes into a rural village after liftoff, killing many people.\n*2001 – The first draft of the complete human genome is published in Nature.\n*2003 – Protests against the Iraq war take place in over 600 cities worldwide. It is estimated that between eight million to 30 million people participate, making this the largest peace demonstration in history.\n*2012 – Three hundred sixty people die in a fire at a Honduran prison in the city of Comayagua.\n*2013 – A meteor explodes over Russia, injuring 1,500 people as a shock wave blows out windows and rocks buildings. This happens unexpectedly only hours before the expected closest ever approach of the larger and unrelated asteroid 2012 DA14.\n\nBirths\n\n*1377 – Ladislaus of Naples (d. 1414)\n*1458 – Ivan the Young, son of Ivan III of Russia (d. 1490)\n*1471 – Piero the Unfortunate, Italian ruler (d. 1503)\n*1506 – Juliana of Stolberg, German countess (d. 1580)\n*1519 – Pedro Menéndez de Avilés, first Spanish Governor of Florida (d. 1574)\n*1557 – Alfonso Fontanelli, Italian composer (d. 1622)\n*1564 – Galileo Galilei, Italian astronomer, physicist, and mathematician (d. 1642)\n*1571 – Michael Praetorius, German organist and composer (d. 1621)\n*1612 – Paul de Chomedey, Sieur de Maisonneuve, French soldier, founded Montreal (d. 1676)\n*1627 – Charles Morton, Cornish nonconformist minister (d. 1698)\n*1638 – Zeb-un-Nissa, Mughal princess and poet (d. 1702)\n*1705 – Charles-André van Loo, French painter (d. 1765)\n*1710 – Louis XV of France (d. 1774)\n*1725 – Abraham Clark, American surveyor, lawyer, and politician (d. 1794)\n*1734 – William Stacy, American colonel (d. 1802)\n*1739 – Alexandre-Théodore Brongniart, French architect, designed the Paris Bourse (d. 1813)\n*1748 – Jeremy Bentham, English jurist and philosopher (d. 1832)\n*1759 – Friedrich August Wolf, German philologist and critic (d. 1824)\n*1760 – Jean-François Le Sueur, French composer and educator (d. 1837)\n*1797 – Henry E. Steinway, German-American businessman, founded Steinway & Sons (d. 1871)\n*1809 – André Dumont, Belgian geologist and academic (d. 1857)\n*  1809   – Cyrus McCormick, American journalist and businessman, co-founded International Harvester (d. 1884)\n*1811 – Domingo Faustino Sarmiento, Argentinian journalist and politician, 7th President of Argentina (d. 1888)\n*1812 – Charles Lewis Tiffany, American businessman, founded Tiffany & Co. (d. 1902)\n*1820 – Susan B. Anthony, American suffragist and activist (d. 1906)\n*1825 – Carter Harrison, Sr., American lawyer and politician, 29th Mayor of Chicago (d. 1893)\n*1834 – V. A. Urechia, Moldavian-Romanian historian, author, and playwright (d. 1901)\n*1835 – Demetrius Vikelas, Greek businessman and philanthropist (d. 1908)\n*1840 – Titu Maiorescu, Romanian philosopher, academic, and politician, 23rd Prime Minister of Romania (d. 1917)\n*1841 – Manuel Ferraz de Campos Sales, Brazilian lawyer and politician, 4th President of Brazil (d. 1913)\n*1845 – Elihu Root, American lawyer and politician, 38th United States Secretary of State, Nobel Prize laureate (d. 1937)\n*1847 – Robert Fuchs, Austrian composer and educator (d. 1927)\n*1849 – Rickman Godlee, English surgeon and academic (d. 1925)\n*1850 – Sophie Bryant, Irish mathematician, academic and activist (d. 1922)\n*1851 – Spiru Haret, Romanian mathematician, astronomer, and politician, 55th Romanian Minister of Internal Affairs (d. 1912)\n*1856 – Emil Kraepelin, German psychiatrist and academic (d. 1926)\n*1861 – Martin Burns, American wrestler and coach (d. 1937)\n*  1861   – Charles Édouard Guillaume, Swiss-French physicist and academic, Nobel Prize laureate (d. 1938)\n*  1861   – Alfred North Whitehead, English mathematician and philosopher (d. 1947)\n*1873 – Hans von Euler-Chelpin, German-Swiss biochemist and academic, Nobel Prize laureate (d. 1964)\n*1874 – Ernest Shackleton, Anglo-Irish captain and explorer (d. 1922)\n*1883 – Sax Rohmer, English-American author (d. 1959)\n*1890 – Robert Ley, German politician (d. 1945)\n*1892 – James Forrestal, American lieutenant and politician, 1st United States Secretary of Defense (d. 1949)\n*  1892   – Roy Rene, Australian comedian (d. 1954)\n*1893 – Roman Najuch, Polish professional tennis player (d. 1967)\n*1896 – Arthur Shields, Irish republican and actor (d. 1970)\n*1897 – Gerrit Kleerekoper, Jewish-Dutch gymnast and coach (d. 1943)\n*1898 – Totò, Italian actor, singer, and screenwriter (d. 1967)\n*1899 – Georges Auric, French composer (d. 1983)\n*  1899   – Gale Sondergaard, Danish-American actress (d. 1985)\n*1904 – Antonin Magne, French cyclist and manager (d. 1983)\n*1905 – Harold Arlen, Jewish-American composer (d. 1986)\n*1907 – Jean Langlais, French organist and composer (d. 1991)\n*  1907   – Cesar Romero, American actor (d. 1994)\n*1908 – Sarto Fournier, Canadian lawyer and politician, 38th Mayor of Montreal (d. 1980)\n*1909 – Miep Gies, Austrian-Dutch humanitarian, helped hide Anne Frank and her family (d. 2010)\n*1910 – Irena Sendler, Polish nurse and humanitarian, Righteous Gentile (d. 2008)\n*1912 – George Mikes, Jewish Hungarian-English journalist and author (d. 1987)\n*1913 – Erich Eliskases, Austrian chess player (d. 1997)\n*1914 – Hale Boggs, American lawyer and politician (d. 1972)\n*  1914   – Kevin McCarthy, Jewish-Irish American actor (d. 2010)\n*1916 – Mary Jane Croft, American actress (d. 1999)\n*1918 – Allan Arbus, Jewish-American actor and photographer (d. 2013)\n*  1918   – Hank Locklin, American singer-songwriter and guitarist (d. 2009)\n*1919 – Ducky Detweiler, American baseball player and manager (d. 2013)\n*1920 – Endicott Peabody, American soldier, lawyer, and politician, 62nd Governor of Massachusetts (d. 1997)\n*  1920   – Eio Sakata, Japanese Go player (d. 2010)\n*1922 – John B. Anderson, Swedish-American lawyer and politician (d. 2017)\n*1923 – Yelena Bonner, Jewish Soviet-Russian activist (d. 2011)\n*1924 – Robert Drew, American director and producer (d. 2014)\n*1925 – Angella D. Ferguson, American pediatrician\n*1927 – Frank Dunlop, English actor and director\n*  1927   – Harvey Korman, American actor and comedian (d. 2008)\n*  1927   – Yehoshua Neuwirth, Israeli rabbi and scholar (d. 2013)\n*1928 – Norman Bridwell, American author and illustrator, created Clifford the Big Red Dog (d. 2014)\n*  1928   – Joseph Willcox Jenkins, American composer, conductor, and educator (d. 2014)\n*1929 – Graham Hill, English race car driver and businessman (d. 1975)\n*  1929   – James R. Schlesinger, American economist and politician, 12th United States Secretary of Defense (d. 2014)\n*1930 – Bruce Dawe, Australian poet and academic\n*1931 – Claire Bloom, English actress\n*  1931   – Jonathan Steele, English journalist and author\n*1934 – Jimmy Bloomfield,  English footballer and manager (d. 1983)\n*  1934   – Graham Kennedy, Australian television host and actor (d. 2005)\n*  1934   – Niklaus Wirth, Swiss computer scientist, created the Pascal programming language\n*  1934   – Abe Woodson, American football player and minister (d. 2014)\n*1935 – Susan Brownmiller, American journalist and author\n*  1935   – Roger B. Chaffee, American lieutenant, engineer, and astronaut (d. 1967)\n*  1935   – Gene Hickerson, American football player (d. 2008)\n*1937 – Gregory Mcdonald, American author (d. 2008)\n*  1937   – Coen Moulijn, Dutch footballer (d. 2011)\n*1940 – İsmail Cem İpekçi, Turkish journalist and politician, 45th Turkish Minister of Foreign Affairs (d. 2007)\n*  1940   – John Hadl, American football player and coach\n*  1940   – Hamzah Haz, Indonesian journalist and politician, 9th Vice President of Indonesia\n*  1940   – Vaino Vahing, Estonian psychiatrist, author, and playwright (d. 2008)\n*1941 – Florinda Bolkan, Brazilian actress\n*  1941   – Brian Holland, American songwriter and producer\n*1944 – Mick Avory, English drummer \n*1945 – Jack Dann, American-Australian author and poet\n*  1945   – John Helliwell, English saxophonist and keyboard player \n*  1945   – Douglas Hofstadter, American author and academic\n*1946 – Clare Short, English civil servant and politician, Secretary of State for International Development\n*1947 – John Adams, American composer\n*  1947   – Marisa Berenson, American model and actress\n*1948 – Art Spiegelman, Swedish-American cartoonist and critic\n*1949 – Ken Anderson, American football quarterback and coach\n*1951 – Markku Alén, Finnish race car driver\n*  1951   – Melissa Manchester, American singer-songwriter and actress \n*  1951   – Jane Seymour, English-American actress, producer, and jewelry designer\n*1952 – Tomislav Nikolić, Serbian politician, 4th President of Serbia\n*  1952   – Nikolai Sorokin, Russian actor and director (d. 2013)\n*1953 – Tony Adams, Irish-American screenwriter and producer (d. 2005)\n*1954 – Matt Groening, American animator, producer, and screenwriter\n*1955 – Janice Dickinson, American model, agent, and author\n*  1955   – Christopher McDonald, American actor\n*1956 – Desmond Haynes, Barbadian cricketer and coach\n*  1956   – Ann Westin, Swedish comedian\n*1957 – Jake E. Lee, American guitarist and songwriter \n*  1957   – Jimmy Spencer, American race car driver and sportscaster\n*1958 – Chrystine Brouillet, Canadian author\n*  1958   – Tony McKegney, Canadian ice hockey player\n*  1958   – Matthew Ward, American singer-songwriter \n*1959 – Adam Boulton, English journalist\n*  1959   – Ali Campbell, English singer-songwriter and guitarist \n*  1959   – Brian Propp, Canadian ice hockey player and sportscaster\n*  1959   – Martin Rowson, English author and illustrator\n*  1959   – Hugo Savinovich, Ecuadorian wrestler and sportscaster\n*1960 – Darrell Green, American football player\n*  1960   – Jock Hobbs, New Zealand rugby player\n*1962 – Milo Đukanović, Montenegrin politician, 29th Prime Minister of Montenegro\n*1964 – Chris Farley, American comedian and actor (d. 1997)\n*  1964   – Leland D. Melvin, American engineer and astronaut\n*  1964   – Mark Price, American basketball player and coach\n*1965 – Craig Matthews, South African cricketer\n*1967 – Jane Child, Canadian singer-songwriter and producer\n*  1967   – Syed Kamall, English academic and politician\n*  1967   – Craig Simpson, Canadian ice hockey player and sportscaster\n*1969 – Birdman, American rapper and producer\n*1970 – Shepard Fairey, American artist and activist\n*1971 – Alex Borstein, American actress, voice artist, producer, and screenwriter\n*  1971   – Renee O'Connor, American actress, director, and producer\n*1972 – Jaromír Jágr, Czech ice hockey player\n*1973 – Kateřina Neumannová, Czech skier\n*  1973   – Amy van Dyken, American swimmer\n*1974 – Miranda July, American actress, director, and screenwriter\n*  1974   – Ugueth Urbina, Venezuelan baseball player\n*  1974   – Alexander Wurz, Austrian race car driver and businessman\n*1975 – Serge Aubin, Canadian ice hockey player and coach\n*  1975   – Annemarie Kramer, Dutch sprinter\n*  1975   – Brendon Small, American animator, producer, screenwriter, and actor\n*1976 – Brandon Boyd, American singer-songwriter \n*  1976   – Óscar Freire, Spanish cyclist\n*1979 – Josh Low, English footballer\n*  1979   – Hamish Marshall, New Zealand cricketer\n*  1979   – James Marshall, New Zealand cricketer\n*  1979   – Scott Severin, Scottish footballer\n*  1979   – Gordon Shedden, Scottish race car driver\n*1980 – Conor Oberst, American singer-songwriter \n*1981 – Heurelho Gomes, Brazilian footballer\n*  1981   – Matt Hoopes, American singer-songwriter and guitarist \n*  1981   – Rita Jeptoo, Kenyan runner\n*  1981   – Diego Martínez, Mexican footballer\n*  1981   – Vivek Shraya, Canadian singer and songwriter\n*1982 – Shameka Christon, American basketball player\n*  1982   – James Yap, Filipino basketball player\n*1983 – Don Cowie, Scottish footballer\n*  1983   – David Degen, Swiss footballer\n*  1983   – Philipp Degen, Swiss footballer\n*  1983   – Alan Didak, Australian footballer\n*  1983   – Russell Martin, Canadian baseball player\n*1985 – Serkan Kırıntılı, Turkish footballer\n*1986 – Valeri Bojinov, Bulgarian footballer\n*  1986   – Johnny Cueto, Dominican baseball player\n*1987 – Jarrod Sammut, Australian rugby league player\n*1988 – Jarryd Hayne, Australian rugby league player and football player\n*  1988   – Hironori Kusano, Japanese singer and actor\n*  1988   – Tim Mannah, Australian rugby league player\n*  1988   – Rui Patrício, Portuguese footballer\n*1990 – Charles Pic, French race car driver\n*1991 – Ángel Sepúlveda, Mexican footballer\n*1992 – Johanna Hyoty, Finnish tennis player\n*1993 – Ravi (rapper), South Korean rapper\n\nDeaths\n\n* 670 – Oswiu, king of Northumbria (b. c. 612)\n* 706 – Leontios, Byzantine emperor\n*   706   – Tiberios III, Byzantine emperor\n* 956 – Su Yugui, Chinese chancellor (b. 895)\n*1145 – Lucius II, pope of the Catholic Church\n*1152 – Conrad III, king of Germany (b. 1093)\n*1382 – William de Ufford, 2nd Earl of Suffolk (b. c. 1339)\n*1417 – Richard de Vere, 11th Earl of Oxford, English commander (b. 1385)\n*1508 – Giovanni II Bentivoglio, tyrant of Bologna (b. 1443)\n*1600 – José de Acosta, Spanish Jesuit missionary and naturalist (b. 1540)\n*1621 – Michael Praetorius, German organist and composer (b. 1571)\n*1637 – Ferdinand II, Holy Roman Emperor (b. 1578)\n*1738 – Matthias Braun, Czech sculptor (b. 1684)\n*1781 – Gotthold Ephraim Lessing, German philosopher, author, and critic (b. 1729)\n*1818 – Frederick Louis, Prince of Hohenlohe-Ingelfingen (b. 1746)\n*1835 – Henry Hunt, English farmer and politician (b. 1773)\n*1839 – François-Marie-Thomas Chevalier de Lorimier, Canadian rebel (b. 1803)\n*1842 – Archibald Menzies, Scottish surgeon and botanist (b. 1754)\n*1844 – Henry Addington, 1st Viscount Sidmouth, English politician, Prime Minister of the United Kingdom (b. 1757)\n*1847 – Germinal Pierre Dandelin, Belgian mathematician and engineer (b. 1794)\n*1848 – Hermann von Boyen, Prussian general and politician, Prussian Minister of War (b. 1771)\n*1849 – Pierre François Verhulst, Belgian mathematician and theorist (b. 1804)\n*1857 – Mikhail Glinka, Russian composer (b. 1804)\n*1869 – Ghalib, Indian poet and educator (b. 1796)\n*1885 – Gregor von Helmersen, Estonian-Russian geologist and engineer (b. 1803)\n*1897 – Dimitrie Ghica, Romanian lawyer and politician, 10th Prime Minister of Romania (b. 1816)\n*1905 – Lew Wallace, American general and politician, 11th Governor of New Mexico Territory (b. 1827)\n*1911 – Theodor Escherich, German-Austrian pediatrician and academic (b. 1859)\n*1924 – Lionel Monckton, English composer (b. 1861)\n*1928 – H. H. Asquith, English lawyer and politician, Prime Minister of the United Kingdom (b. 1852)\n*1932 – Minnie Maddern Fiske, American actress and playwright (b. 1865)\n*1933 – Pat Sullivan, Australian animator and producer, co-created Felix the Cat (b. 1887)\n*1935 – Basil Hall Chamberlain, English-Swiss historian, author, and academic (b. 1850)\n*1939 – Kuzma Petrov-Vodkin, Russian painter and author (b. 1878)\n*1956 – Vincent de Moro-Giafferi, French lawyer and politician (b. 1878)\n*1959 – Owen Willans Richardson, English physicist and academic, Nobel Prize laureate (b. 1879)\n*1961 – Laurence Owen, American figure skater (b. 1944)\n*1965 – Nat King Cole, American singer and pianist (b. 1919)\n*1966 – Gerard Antoni Ciołek, Polish architect and historian (b. 1909)\n*  1966   – Camilo Torres Restrepo, Colombian priest and theologian (b. 1929)\n*1967 – Antonio Moreno, Spanish-American actor and director (b. 1887)\n*1970 – Hugh Dowding, 1st Baron Dowding, Scottish air marshal (b. 1882)\n*1973 – Wally Cox, American actor (b. 1924)\n*  1973   – Tim Holt, American actor (b. 1919)\n*1974 – Kurt Atterberg, Swedish composer and engineer (b. 1887)\n*1981 – Mike Bloomfield, American guitarist and songwriter (b. 1943)\n*  1981   – Karl Richter, German organist and conductor (b. 1926)\n*1984 – Avon Long, American actor and singer (b. 1910)\n*  1984   – Ethel Merman, American actress and singer (b. 1908)\n*1988 – Richard Feynman, American physicist and academic, Nobel Prize laureate (b. 1918)\n*1992 – María Elena Moyano, Peruvian activist (b. 1960)\n*  1992   – William Schuman, American composer and academic (b. 1910)\n*1996 – McLean Stevenson, American actor (b. 1929)\n*1998 – Martha Gellhorn, American journalist and author (b. 1908)\n*1999 – Henry Way Kendall, American physicist and mountaineer, Nobel Prize laureate (b. 1926)\n*  1999   – Big L, American rapper (b. 1974)\n*2000 – Angus MacLean, Canadian commander and politician, 25th Premier of Prince Edward Island (b. 1914)\n*2002 – Howard K. Smith, American journalist and actor (b. 1914)\n*  2002   – Kevin Smith, New Zealand actor (b. 1963)\n*2004 – Jens Evensen, Norwegian lawyer, judge, and politician, Norwegian Minister of Trade (b. 1917)\n*2005 – Pierre Bachelet, French singer-songwriter (b. 1944)\n*  2005   – Samuel T. Francis, American historian and journalist (b. 1947)\n*2007 – Walker Edmiston, American actor (b. 1925)\n*  2007   – Ray Evans, American songwriter (b. 1915)\n*2008 – Johnny Weaver, American wrestler and sportscaster (b. 1935)\n*2010 – Jeanne M. Holm, American general (b. 1921)\n*2012 – Cyril Domb, English-Israel physicist and academic (b. 1920)\n*2013 – Sanan Kachornprasart, Thai general and politician (b. 1935)\n*2013   – Ahmed Rajib Haider, Bangladeshi atheist blogger\n*2014 – Thelma Estrin, American computer scientist and engineer (b. 1924)\n*  2014   – Christopher Malcolm, Scottish-Canadian actor, director, and producer (b. 1946)\n*2015 – Haron Amin, Afghan diplomat, Afghan Ambassador to Japan \n*  2015   – Arnaud de Borchgrave, American journalist and author (b. 1926)\n*  2015   – Steve Montador, Canadian ice hockey player (b. 1979)\n*2016 – George Gaynes, Finnish-American actor (b. 1917)\n*  2016   – Vanity, Canadian-American singer-songwriter, dancer, and actress (b. 1959)\n*2017 – Stuart McLean, Canadian radio broadcaster (b. 1948)\n\nHolidays and observances\n\n* Christian feast day:\n** Blessed Michał Sopoćko\n** Claude de la Colombière\n** Faustinus and Jovita\n** Quinidius\n** Sigfrid of Sweden\n** Thomas Bray (Episcopal Church)\n** February 15 (Eastern Orthodox liturgics)\n*Earliest day on which Family Day can fall, while February 21 is the latest; celebrated on the third Monday in February. (parts of Canada)\n*Earliest day on which Washington's Birthday can fall, while February 21 is the latest; celebrated on the third Monday in February. (United States)\n* Candlemas (Eastern Orthodox Church)\n* International Duties Memorial Day (Russia, regional)\n* John Frum Day (Vanuatu)\n* Liberation Day (Afghanistan)\n* National Flag of Canada Day (Canada)\n* Parinirvana Day, also celebrated on February 8. (Mahayana Buddhism)\n* Statehood Day (Serbia)\n* Susan B. Anthony Day (Florida, United States)\n* The ENIAC Day (Philadelphia, United States)\n* Total Defence Day (Singapore)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "February 15" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11020" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* 590 – Khosrau II is crowned king of Persia.\n* 706 – Byzantine emperor Justinian II has his predecessors Leontios and Tiberios III publicly executed in the Hippodrome of Constantinople.\n*1113 – Pope Paschal II issues Pie Postulatio Voluntatis, recognizing the Order of Hospitallers.\n*1214 – During the Anglo-French War (1213–1214), an English invasion force lands at La Rochelle in France.\n*1493 – While on board the Niña, Christopher Columbus writes an open letter (widely distributed upon his return to Portugal) describing his discoveries and the unexpected items he came across in the New World.\n*1637 – Ferdinand III becomes Holy Roman Emperor.\n*1690 – Constantin Cantemir, Prince of Moldavia, and the Holy Roman Empire sign a secret treaty in Sibiu, stipulating that Moldavia would support the actions led by the House of Habsburg against the Ottoman Empire.\n*1764 – The city of St. Louis is established in Spanish Louisiana (now in Missouri, USA).\n*1798 – The Roman Republic is proclaimed after Louis-Alexandre Berthier, a general of Napoleon, had invaded the city of Rome five days earlier.\n*1835 – The first constitutional law in modern Serbia is adopted.\n*1862 – American Civil War: General Ulysses S. Grant attacks Fort Donelson, Tennessee.\n*1870 – Stevens Institute of Technology is founded in New Jersey, USA and offers the first Bachelor of Engineering degree in Mechanical Engineering.\n*1879 – Women's rights: US President Rutherford B. Hayes signs a bill allowing female attorneys to argue cases before the Supreme Court of the United States.\n*1891 – Allmänna Idrottsklubben (AIK) (Swedish Sports Club) is founded.\n*1898 – The battleship  explodes and sinks in Havana harbor in Cuba, killing 274. This event leads the United States to declare war on Spain.\n*1901 – The association football club Alianza Lima is founded in Lima, Peru, under the name Sport Alianza.\n*1909 – The Flores Theater fire in Acapulco, Mexico kills 250.\n*1921 – Kingdom of Romania establishes its legation in Helsinki.\n*1923 – Greece becomes the last European country to adopt the Gregorian calendar.\n*1925 – The 1925 serum run to Nome: The second delivery of serum arrives in Nome, Alaska.\n*1933 – In Miami, Giuseppe Zangara attempts to assassinate US President-elect Franklin D. Roosevelt, but instead shoots Chicago mayor Anton J. Cermak, who dies of his wounds on March 6, 1933.\n*1942 – World War II: Fall of Singapore. Following an assault by Japanese forces, the British General Arthur Percival surrenders. About 80,000 Indian, United Kingdom and Australian soldiers become prisoners of war, the largest surrender of British-led military personnel in history.\n*1944 – World War II: The assault on Monte Cassino, Italy begins.\n*  1944   – World War II: The Narva Offensive begins.\n*1945 – World War II: Third day of bombing in Dresden.\n*1946 – ENIAC, the first electronic general-purpose computer, is formally dedicated at the University of Pennsylvania in Philadelphia.\n*1949 – Gerald Lankester Harding and Roland de Vaux begin excavations at Cave 1 of the Qumran Caves, where they will eventually discover the first seven Dead Sea Scrolls.\n*1952 – King George VI of the United Kingdom is buried in St George's Chapel, Windsor Castle.\n*1954 – Canada and the United States agree to construct the Distant Early Warning Line, a system of radar stations in the far northern Arctic regions of Canada and Alaska.\n*1961 – Sabena Flight 548 crashes in Belgium, killing 73, including the entire United States figure skating team along with several of their coaches and family members.\n*1965 – A new red-and-white maple leaf design is adopted as the flag of Canada, replacing the old Canadian Red Ensign banner.\n*1971 – The decimalisation of British coinage is completed on Decimal Day.\n*1972 – Sound recordings are granted U.S. federal copyright protection for the first time.\n*  1972   – José María Velasco Ibarra, serving as President of Ecuador for the fifth time, is overthrown by the military for the fourth time.\n*1982 – The drilling rig Ocean Ranger sinks during a storm off the coast of Newfoundland, killing 84 workers.\n*1989 – Soviet–Afghan War: The Soviet Union officially announces that all of its troops have left Afghanistan.\n*1991 – The Visegrád Agreement, establishing cooperation to move toward free-market systems, is signed by the leaders of Czechoslovakia, Hungary and Poland.\n*1992 – Serial killer Jeffrey Dahmer is sentenced in Milwaukee to life in prison.\n*1996 – At the Xichang Satellite Launch Center in China, a Long March 3 rocket, carrying an Intelsat 708, crashes into a rural village after liftoff, killing many people.\n*2001 – The first draft of the complete human genome is published in Nature.\n*2003 – Protests against the Iraq war take place in over 600 cities worldwide. It is estimated that between eight million to 30 million people participate, making this the largest peace demonstration in history.\n*2012 – Three hundred sixty people die in a fire at a Honduran prison in the city of Comayagua.\n*2013 – A meteor explodes over Russia, injuring 1,500 people as a shock wave blows out windows and rocks buildings. This happens unexpectedly only hours before the expected closest ever approach of the larger and unrelated asteroid 2012 DA14.\n\nBirths\n\n*1377 – Ladislaus of Naples (d. 1414)\n*1458 – Ivan the Young, son of Ivan III of Russia (d. 1490)\n*1471 – Piero the Unfortunate, Italian ruler (d. 1503)\n*1506 – Juliana of Stolberg, German countess (d. 1580)\n*1519 – Pedro Menéndez de Avilés, first Spanish Governor of Florida (d. 1574)\n*1557 – Alfonso Fontanelli, Italian composer (d. 1622)\n*1564 – Galileo Galilei, Italian astronomer, physicist, and mathematician (d. 1642)\n*1571 – Michael Praetorius, German organist and composer (d. 1621)\n*1612 – Paul de Chomedey, Sieur de Maisonneuve, French soldier, founded Montreal (d. 1676)\n*1627 – Charles Morton, Cornish nonconformist minister (d. 1698)\n*1638 – Zeb-un-Nissa, Mughal princess and poet (d. 1702)\n*1705 – Charles-André van Loo, French painter (d. 1765)\n*1710 – Louis XV of France (d. 1774)\n*1725 – Abraham Clark, American surveyor, lawyer, and politician (d. 1794)\n*1734 – William Stacy, American colonel (d. 1802)\n*1739 – Alexandre-Théodore Brongniart, French architect, designed the Paris Bourse (d. 1813)\n*1748 – Jeremy Bentham, English jurist and philosopher (d. 1832)\n*1759 – Friedrich August Wolf, German philologist and critic (d. 1824)\n*1760 – Jean-François Le Sueur, French composer and educator (d. 1837)\n*1797 – Henry E. Steinway, German-American businessman, founded Steinway & Sons (d. 1871)\n*1809 – André Dumont, Belgian geologist and academic (d. 1857)\n*  1809   – Cyrus McCormick, American journalist and businessman, co-founded International Harvester (d. 1884)\n*1811 – Domingo Faustino Sarmiento, Argentinian journalist and politician, 7th President of Argentina (d. 1888)\n*1812 – Charles Lewis Tiffany, American businessman, founded Tiffany & Co. (d. 1902)\n*1820 – Susan B. Anthony, American suffragist and activist (d. 1906)\n*1825 – Carter Harrison, Sr., American lawyer and politician, 29th Mayor of Chicago (d. 1893)\n*1834 – V. A. Urechia, Moldavian-Romanian historian, author, and playwright (d. 1901)\n*1835 – Demetrius Vikelas, Greek businessman and philanthropist (d. 1908)\n*1840 – Titu Maiorescu, Romanian philosopher, academic, and politician, 23rd Prime Minister of Romania (d. 1917)\n*1841 – Manuel Ferraz de Campos Sales, Brazilian lawyer and politician, 4th President of Brazil (d. 1913)\n*1845 – Elihu Root, American lawyer and politician, 38th United States Secretary of State, Nobel Prize laureate (d. 1937)\n*1847 – Robert Fuchs, Austrian composer and educator (d. 1927)\n*1849 – Rickman Godlee, English surgeon and academic (d. 1925)\n*1850 – Sophie Bryant, Irish mathematician, academic and activist (d. 1922)\n*1851 – Spiru Haret, Romanian mathematician, astronomer, and politician, 55th Romanian Minister of Internal Affairs (d. 1912)\n*1856 – Emil Kraepelin, German psychiatrist and academic (d. 1926)\n*1861 – Martin Burns, American wrestler and coach (d. 1937)\n*  1861   – Charles Édouard Guillaume, Swiss-French physicist and academic, Nobel Prize laureate (d. 1938)\n*  1861   – Alfred North Whitehead, English mathematician and philosopher (d. 1947)\n*1873 – Hans von Euler-Chelpin, German-Swiss biochemist and academic, Nobel Prize laureate (d. 1964)\n*1874 – Ernest Shackleton, Anglo-Irish captain and explorer (d. 1922)\n*1883 – Sax Rohmer, English-American author (d. 1959)\n*1890 – Robert Ley, German politician (d. 1945)\n*1892 – James Forrestal, American lieutenant and politician, 1st United States Secretary of Defense (d. 1949)\n*  1892   – Roy Rene, Australian comedian (d. 1954)\n*1893 – Roman Najuch, Polish professional tennis player (d. 1967)\n*1896 – Arthur Shields, Irish republican and actor (d. 1970)\n*1897 – Gerrit Kleerekoper, Jewish-Dutch gymnast and coach (d. 1943)\n*1898 – Totò, Italian actor, singer, and screenwriter (d. 1967)\n*1899 – Georges Auric, French composer (d. 1983)\n*  1899   – Gale Sondergaard, Danish-American actress (d. 1985)\n*1904 – Antonin Magne, French cyclist and manager (d. 1983)\n*1905 – Harold Arlen, Jewish-American composer (d. 1986)\n*1907 – Jean Langlais, French organist and composer (d. 1991)\n*  1907   – Cesar Romero, American actor (d. 1994)\n*1908 – Sarto Fournier, Canadian lawyer and politician, 38th Mayor of Montreal (d. 1980)\n*1909 – Miep Gies, Austrian-Dutch humanitarian, helped hide Anne Frank and her family (d. 2010)\n*1910 – Irena Sendler, Polish nurse and humanitarian, Righteous Gentile (d. 2008)\n*1912 – George Mikes, Jewish Hungarian-English journalist and author (d. 1987)\n*1913 – Erich Eliskases, Austrian chess player (d. 1997)\n*1914 – Hale Boggs, American lawyer and politician (d. 1972)\n*  1914   – Kevin McCarthy, Jewish-Irish American actor (d. 2010)\n*1916 – Mary Jane Croft, American actress (d. 1999)\n*1918 – Allan Arbus, Jewish-American actor and photographer (d. 2013)\n*  1918   – Hank Locklin, American singer-songwriter and guitarist (d. 2009)\n*1919 – Ducky Detweiler, American baseball player and manager (d. 2013)\n*1920 – Endicott Peabody, American soldier, lawyer, and politician, 62nd Governor of Massachusetts (d. 1997)\n*  1920   – Eio Sakata, Japanese Go player (d. 2010)\n*1922 – John B. Anderson, Swedish-American lawyer and politician (d. 2017)\n*1923 – Yelena Bonner, Jewish Soviet-Russian activist (d. 2011)\n*1924 – Robert Drew, American director and producer (d. 2014)\n*1925 – Angella D. Ferguson, American pediatrician\n*1927 – Frank Dunlop, English actor and director\n*  1927   – Harvey Korman, American actor and comedian (d. 2008)\n*  1927   – Yehoshua Neuwirth, Israeli rabbi and scholar (d. 2013)\n*1928 – Norman Bridwell, American author and illustrator, created Clifford the Big Red Dog (d. 2014)\n*  1928   – Joseph Willcox Jenkins, American composer, conductor, and educator (d. 2014)\n*1929 – Graham Hill, English race car driver and businessman (d. 1975)\n*  1929   – James R. Schlesinger, American economist and politician, 12th United States Secretary of Defense (d. 2014)\n*1930 – Bruce Dawe, Australian poet and academic\n*1931 – Claire Bloom, English actress\n*  1931   – Jonathan Steele, English journalist and author\n*1934 – Jimmy Bloomfield,  English footballer and manager (d. 1983)\n*  1934   – Graham Kennedy, Australian television host and actor (d. 2005)\n*  1934   – Niklaus Wirth, Swiss computer scientist, created the Pascal programming language\n*  1934   – Abe Woodson, American football player and minister (d. 2014)\n*1935 – Susan Brownmiller, American journalist and author\n*  1935   – Roger B. Chaffee, American lieutenant, engineer, and astronaut (d. 1967)\n*  1935   – Gene Hickerson, American football player (d. 2008)\n*1937 – Gregory Mcdonald, American author (d. 2008)\n*  1937   – Coen Moulijn, Dutch footballer (d. 2011)\n*1940 – İsmail Cem İpekçi, Turkish journalist and politician, 45th Turkish Minister of Foreign Affairs (d. 2007)\n*  1940   – John Hadl, American football player and coach\n*  1940   – Hamzah Haz, Indonesian journalist and politician, 9th Vice President of Indonesia\n*  1940   – Vaino Vahing, Estonian psychiatrist, author, and playwright (d. 2008)\n*1941 – Florinda Bolkan, Brazilian actress\n*  1941   – Brian Holland, American songwriter and producer\n*1944 – Mick Avory, English drummer \n*1945 – Jack Dann, American-Australian author and poet\n*  1945   – John Helliwell, English saxophonist and keyboard player \n*  1945   – Douglas Hofstadter, American author and academic\n*1946 – Clare Short, English civil servant and politician, Secretary of State for International Development\n*1947 – John Adams, American composer\n*  1947   – Marisa Berenson, American model and actress\n*1948 – Art Spiegelman, Swedish-American cartoonist and critic\n*1949 – Ken Anderson, American football quarterback and coach\n*1951 – Markku Alén, Finnish race car driver\n*  1951   – Melissa Manchester, American singer-songwriter and actress \n*  1951   – Jane Seymour, English-American actress, producer, and jewelry designer\n*1952 – Tomislav Nikolić, Serbian politician, 4th President of Serbia\n*  1952   – Nikolai Sorokin, Russian actor and director (d. 2013)\n*1953 – Tony Adams, Irish-American screenwriter and producer (d. 2005)\n*1954 – Matt Groening, American animator, producer, and screenwriter\n*1955 – Janice Dickinson, American model, agent, and author\n*  1955   – Christopher McDonald, American actor\n*1956 – Desmond Haynes, Barbadian cricketer and coach\n*  1956   – Ann Westin, Swedish comedian\n*1957 – Jake E. Lee, American guitarist and songwriter \n*  1957   – Jimmy Spencer, American race car driver and sportscaster\n*1958 – Chrystine Brouillet, Canadian author\n*  1958   – Tony McKegney, Canadian ice hockey player\n*  1958   – Matthew Ward, American singer-songwriter \n*1959 – Adam Boulton, English journalist\n*  1959   – Ali Campbell, English singer-songwriter and guitarist \n*  1959   – Brian Propp, Canadian ice hockey player and sportscaster\n*  1959   – Martin Rowson, English author and illustrator\n*  1959   – Hugo Savinovich, Ecuadorian wrestler and sportscaster\n*1960 – Darrell Green, American football player\n*  1960   – Jock Hobbs, New Zealand rugby player\n*1962 – Milo Đukanović, Montenegrin politician, 29th Prime Minister of Montenegro\n*1964 – Chris Farley, American comedian and actor (d. 1997)\n*  1964   – Leland D. Melvin, American engineer and astronaut\n*  1964   – Mark Price, American basketball player and coach\n*1965 – Craig Matthews, South African cricketer\n*1967 – Jane Child, Canadian singer-songwriter and producer\n*  1967   – Syed Kamall, English academic and politician\n*  1967   – Craig Simpson, Canadian ice hockey player and sportscaster\n*1969 – Birdman, American rapper and producer\n*1970 – Shepard Fairey, American artist and activist\n*1971 – Alex Borstein, American actress, voice artist, producer, and screenwriter\n*  1971   – Renee O'Connor, American actress, director, and producer\n*1972 – Jaromír Jágr, Czech ice hockey player\n*1973 – Kateřina Neumannová, Czech skier\n*  1973   – Amy van Dyken, American swimmer\n*1974 – Miranda July, American actress, director, and screenwriter\n*  1974   – Ugueth Urbina, Venezuelan baseball player\n*  1974   – Alexander Wurz, Austrian race car driver and businessman\n*1975 – Serge Aubin, Canadian ice hockey player and coach\n*  1975   – Annemarie Kramer, Dutch sprinter\n*  1975   – Brendon Small, American animator, producer, screenwriter, and actor\n*1976 – Brandon Boyd, American singer-songwriter \n*  1976   – Óscar Freire, Spanish cyclist\n*1979 – Josh Low, English footballer\n*  1979   – Hamish Marshall, New Zealand cricketer\n*  1979   – James Marshall, New Zealand cricketer\n*  1979   – Scott Severin, Scottish footballer\n*  1979   – Gordon Shedden, Scottish race car driver\n*1980 – Conor Oberst, American singer-songwriter \n*1981 – Heurelho Gomes, Brazilian footballer\n*  1981   – Matt Hoopes, American singer-songwriter and guitarist \n*  1981   – Rita Jeptoo, Kenyan runner\n*  1981   – Diego Martínez, Mexican footballer\n*  1981   – Vivek Shraya, Canadian singer and songwriter\n*1982 – Shameka Christon, American basketball player\n*  1982   – James Yap, Filipino basketball player\n*1983 – Don Cowie, Scottish footballer\n*  1983   – David Degen, Swiss footballer\n*  1983   – Philipp Degen, Swiss footballer\n*  1983   – Alan Didak, Australian footballer\n*  1983   – Russell Martin, Canadian baseball player\n*1985 – Serkan Kırıntılı, Turkish footballer\n*1986 – Valeri Bojinov, Bulgarian footballer\n*  1986   – Johnny Cueto, Dominican baseball player\n*1987 – Jarrod Sammut, Australian rugby league player\n*1988 – Jarryd Hayne, Australian rugby league player and football player\n*  1988   – Hironori Kusano, Japanese singer and actor\n*  1988   – Tim Mannah, Australian rugby league player\n*  1988   – Rui Patrício, Portuguese footballer\n*1990 – Charles Pic, French race car driver\n*1991 – Ángel Sepúlveda, Mexican footballer\n*1992 – Johanna Hyoty, Finnish tennis player\n*1993 – Ravi (rapper), South Korean rapper\n\nDeaths\n\n* 670 – Oswiu, king of Northumbria (b. c. 612)\n* 706 – Leontios, Byzantine emperor\n*   706   – Tiberios III, Byzantine emperor\n* 956 – Su Yugui, Chinese chancellor (b. 895)\n*1145 – Lucius II, pope of the Catholic Church\n*1152 – Conrad III, king of Germany (b. 1093)\n*1382 – William de Ufford, 2nd Earl of Suffolk (b. c. 1339)\n*1417 – Richard de Vere, 11th Earl of Oxford, English commander (b. 1385)\n*1508 – Giovanni II Bentivoglio, tyrant of Bologna (b. 1443)\n*1600 – José de Acosta, Spanish Jesuit missionary and naturalist (b. 1540)\n*1621 – Michael Praetorius, German organist and composer (b. 1571)\n*1637 – Ferdinand II, Holy Roman Emperor (b. 1578)\n*1738 – Matthias Braun, Czech sculptor (b. 1684)\n*1781 – Gotthold Ephraim Lessing, German philosopher, author, and critic (b. 1729)\n*1818 – Frederick Louis, Prince of Hohenlohe-Ingelfingen (b. 1746)\n*1835 – Henry Hunt, English farmer and politician (b. 1773)\n*1839 – François-Marie-Thomas Chevalier de Lorimier, Canadian rebel (b. 1803)\n*1842 – Archibald Menzies, Scottish surgeon and botanist (b. 1754)\n*1844 – Henry Addington, 1st Viscount Sidmouth, English politician, Prime Minister of the United Kingdom (b. 1757)\n*1847 – Germinal Pierre Dandelin, Belgian mathematician and engineer (b. 1794)\n*1848 – Hermann von Boyen, Prussian general and politician, Prussian Minister of War (b. 1771)\n*1849 – Pierre François Verhulst, Belgian mathematician and theorist (b. 1804)\n*1857 – Mikhail Glinka, Russian composer (b. 1804)\n*1869 – Ghalib, Indian poet and educator (b. 1796)\n*1885 – Gregor von Helmersen, Estonian-Russian geologist and engineer (b. 1803)\n*1897 – Dimitrie Ghica, Romanian lawyer and politician, 10th Prime Minister of Romania (b. 1816)\n*1905 – Lew Wallace, American general and politician, 11th Governor of New Mexico Territory (b. 1827)\n*1911 – Theodor Escherich, German-Austrian pediatrician and academic (b. 1859)\n*1924 – Lionel Monckton, English composer (b. 1861)\n*1928 – H. H. Asquith, English lawyer and politician, Prime Minister of the United Kingdom (b. 1852)\n*1932 – Minnie Maddern Fiske, American actress and playwright (b. 1865)\n*1933 – Pat Sullivan, Australian animator and producer, co-created Felix the Cat (b. 1887)\n*1935 – Basil Hall Chamberlain, English-Swiss historian, author, and academic (b. 1850)\n*1939 – Kuzma Petrov-Vodkin, Russian painter and author (b. 1878)\n*1956 – Vincent de Moro-Giafferi, French lawyer and politician (b. 1878)\n*1959 – Owen Willans Richardson, English physicist and academic, Nobel Prize laureate (b. 1879)\n*1961 – Laurence Owen, American figure skater (b. 1944)\n*1965 – Nat King Cole, American singer and pianist (b. 1919)\n*1966 – Gerard Antoni Ciołek, Polish architect and historian (b. 1909)\n*  1966   – Camilo Torres Restrepo, Colombian priest and theologian (b. 1929)\n*1967 – Antonio Moreno, Spanish-American actor and director (b. 1887)\n*1970 – Hugh Dowding, 1st Baron Dowding, Scottish air marshal (b. 1882)\n*1973 – Wally Cox, American actor (b. 1924)\n*  1973   – Tim Holt, American actor (b. 1919)\n*1974 – Kurt Atterberg, Swedish composer and engineer (b. 1887)\n*1981 – Mike Bloomfield, American guitarist and songwriter (b. 1943)\n*  1981   – Karl Richter, German organist and conductor (b. 1926)\n*1984 – Avon Long, American actor and singer (b. 1910)\n*  1984   – Ethel Merman, American actress and singer (b. 1908)\n*1988 – Richard Feynman, American physicist and academic, Nobel Prize laureate (b. 1918)\n*1992 – María Elena Moyano, Peruvian activist (b. 1960)\n*  1992   – William Schuman, American composer and academic (b. 1910)\n*1996 – McLean Stevenson, American actor (b. 1929)\n*1998 – Martha Gellhorn, American journalist and author (b. 1908)\n*1999 – Henry Way Kendall, American physicist and mountaineer, Nobel Prize laureate (b. 1926)\n*  1999   – Big L, American rapper (b. 1974)\n*2000 – Angus MacLean, Canadian commander and politician, 25th Premier of Prince Edward Island (b. 1914)\n*2002 – Howard K. Smith, American journalist and actor (b. 1914)\n*  2002   – Kevin Smith, New Zealand actor (b. 1963)\n*2004 – Jens Evensen, Norwegian lawyer, judge, and politician, Norwegian Minister of Trade (b. 1917)\n*2005 – Pierre Bachelet, French singer-songwriter (b. 1944)\n*  2005   – Samuel T. Francis, American historian and journalist (b. 1947)\n*2007 – Walker Edmiston, American actor (b. 1925)\n*  2007   – Ray Evans, American songwriter (b. 1915)\n*2008 – Johnny Weaver, American wrestler and sportscaster (b. 1935)\n*2010 – Jeanne M. Holm, American general (b. 1921)\n*2012 – Cyril Domb, English-Israel physicist and academic (b. 1920)\n*2013 – Sanan Kachornprasart, Thai general and politician (b. 1935)\n*2013   – Ahmed Rajib Haider, Bangladeshi atheist blogger\n*2014 – Thelma Estrin, American computer scientist and engineer (b. 1924)\n*  2014   – Christopher Malcolm, Scottish-Canadian actor, director, and producer (b. 1946)\n*2015 – Haron Amin, Afghan diplomat, Afghan Ambassador to Japan \n*  2015   – Arnaud de Borchgrave, American journalist and author (b. 1926)\n*  2015   – Steve Montador, Canadian ice hockey player (b. 1979)\n*2016 – George Gaynes, Finnish-American actor (b. 1917)\n*  2016   – Vanity, Canadian-American singer-songwriter, dancer, and actress (b. 1959)\n*2017 – Stuart McLean, Canadian radio broadcaster (b. 1948)\n\nHolidays and observances\n\n* Christian feast day:\n** Blessed Michał Sopoćko\n** Claude de la Colombière\n** Faustinus and Jovita\n** Quinidius\n** Sigfrid of Sweden\n** Thomas Bray (Episcopal Church)\n** February 15 (Eastern Orthodox liturgics)\n*Earliest day on which Family Day can fall, while February 21 is the latest; celebrated on the third Monday in February. (parts of Canada)\n*Earliest day on which Washington's Birthday can fall, while February 21 is the latest; celebrated on the third Monday in February. (United States)\n* Candlemas (Eastern Orthodox Church)\n* International Duties Memorial Day (Russia, regional)\n* John Frum Day (Vanuatu)\n* Liberation Day (Afghanistan)\n* National Flag of Canada Day (Canada)\n* Parinirvana Day, also celebrated on February 8. (Mahayana Buddhism)\n* Statehood Day (Serbia)\n* Susan B. Anthony Day (Florida, United States)\n* The ENIAC Day (Philadelphia, United States)\n* Total Defence Day (Singapore). February 15. http://en.wikipedia.org/?curid=11020."
  }
}
