{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16660",
  "eid" : "27867660-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778575558,
  "textBody" : "The Kenya Defence Forces are the armed forces of the Republic of Kenya. The Kenya Army, Kenya Navy, and Kenya Air Force comprise the national Defence Forces. The current Kenya Defence Forces were established, and its composition laid out, in Article 241 of the 2010 Constitution of Kenya; the KDF is governed by the Kenya Defence Forces Act of 2012. The President of Kenya is the commander-in-chief of all the armed forces.\n\nThe military is regularly deployed in peacekeeping missions around the world. Further, in the aftermath of the national elections of December 2007 and the violence that subsequently engulfed the country, a commission of inquiry, the Waki Commission, commended its readiness and adjudged it to \"have performed its duty well.\" Nevertheless, there have been serious allegations of human rights violations, most recently while conducting counter-insurgency operations in the Mt Elgon area and also in the district of Mandera central.\n\nKenya’s military, like many government institutions in the country, has been tainted by corruption allegations. Because the operations of the military have been traditionally cloaked by the ubiquitous blanket of \"state security\", the corruption has been less in public view, and thus less subject to public scrutiny and notoriety. This has changed recently. In what are by Kenyan standards unprecedented revelations, in 2010, credible claims of corruption were made with regard to recruitment, and procurement of Armoured Personnel Carriers. Further, the wisdom and prudence of certain decisions of procurement have been publicly questioned.\n\nHistory\n\n1896 to 1900\n\nThe Manoj between 1896 and 1900 saw the East African Rifles deployed in a number of campaigns in line with British colonial policies. In collaboration with Major Cunningham's Uganda Rifles, expeditions were organized against the Nandi who put up a strong resistance. It was not until 1906 that they were subdued.  Another one in 1900 commanded by Lieutenant Colonel Hatch, Commandant of the East African Rifles, followed this. Two medals were issued after these expeditions namely \"1898\" and \"Jubaland 1900\".\n\nThe East African Rifles also sent troops to help Uganda Rifles suppress a mutiny by Sudanese troops in Uganda. Captain Harrison who led this expedition was decorated. After being deployed on this expedition, he remained behind to form the 1st Battalion of the Uganda Rifles. This battalion later became 5 KAR.\n\nIn 1901 the British government decided to organize all the existing troops in Central Africa, East Africa, Uganda and British Somaliland under one command. Lieutenant Colonel Manning, an officer in the Indian Corps was appointed Inspector General for all the troops and promoted to the rank of general. After the troops based in different parts of British East and Central Africa territories were placed under a central command, the regiment born thereof was officially designated \"King's African Rifles\" on 1 January 1902. The composition of this regiment was as follows:-\n*The 8 companies of 1 Central African Rifles became 1 Battalion King's African Rifles.\n*The 6 companies of 2 Central African Rifles became 2 Battalion King's African Rifles.\n*The 7 companies and one camel company of East African Rifles became 3 Battalion King's African Rifles.\n*The 9 companies of the Uganda Rifles became 4 Battalion King's African Rifles.\n*The 4 companies of the Contingent of Uganda Rifles became 5 Battalion Kings African Rifles.\n\n1902-1963\n\nOn 1 April 1902, 3 KAR moved its headquarters from Mombasa to Nairobi, and together with 4 KAR and 5 KAR, was used by the British colonial government in expeditions against those who resisted British rule. In 1904 5 KAR, which was mainly made up of Indian troops, was disbanded chiefly because of maintenance costs and also because the British felt they had contained the resistance to their rule. It was however reconstituted in 1916 during World War I and stationed in Meru.\n\nLater in 1926, 5 KAR was again disbanded and their colours were handed over to 3 KAR for safe custody. On 1 March 1930 the unit was once again reconstituted, presented with their colours and stationed in Nairobi. After World War II both battalions were used by the colonial government to contain the Mau Mau rebellion. On the dawn of independence the Kenya National Assembly passed a bill (Kenya Bills 1963) to amend the status of the military forces in Kenya .\n\nAccordingly, the former units of the King's African Rifles were transformed to the Kenyan Military Forces and the Independent Kenyan Government was legally empowered to assign names to the units as deemed necessary with effect from midnight, 12 December 1963. Thus 3 KAR, 5 KAR, and 11 KAR became 3 Kenya Rifles, 5 Kenya Rifles, and 11 Kenya Rifles respectively. The transformation of King's African Rifles to Kenya Military Forces on the midnight of 12 December 1963 was a major milestone in the foundation of today's Kenya Army units.\n\n1963–present\n\nBetween 1963 and 1967, Kenya fought the Shifta War against Somali residents who sought union with their kin in the Somali Republic to the north.Bruce Baker, Escape from Domination in Africa: Political Disengagement & Its Consequences, (Africa World Press: 2003), p.83\n\nOn the evening of 24 January 1964, the failure of the Kenyan Prime Minister to appear on television, where 11th Kenya Rifles junior soldiers had been expecting a televised speech and hoping for a pay rise announcement, caused the men to mutiny.Timothy Parsons, The 1964 Army Mutinies and the Making of Modern East Africa, 120. Parsons says it is possible that the speech was only broadcast on the radio in the Nakuru area where Lanet Barracks, home of the battalion, was located. Kenyatta's government held two separate courts-martial for 43 soldiers.\n\nIn the aftermath of the mutiny and following courts-martial, the 11th Kenya Rifles was disbanded.Parsons, The 1964 Army Mutinies, 161. A new battalion, 1st Kenya Rifles, was created entirely from 340 Lanet soldiers who had been cleared of participation in the mutiny by the Kenyan Criminal Investigations Division (CID). Hornsby writes that after the mutiny, '[Kenyatta] improved conditions, announced pay rises to the military, speeded Africanisation, and instructed the intelligence services to infiltrate and watch the army for signs of disaffection.' (Hornsby, quote, 98.)\n\nDiscussions began in March 1964 between Kenya and Secretary of State for Commonwealth Relations Duncan Sandys on defence, and a formal agreement was signed on 3 June 1964. All British troops would leave by 12 December 1964, the British would assist the army, resource and train a new Kenya Air Force, and create a new Kenya Navy. They would also provide RAF and Army units to support internal security in the north-east. Significant military loans would be cancelled, and much military property made over to the Kenyan Government. In return, British aircraft would be able to transit through Kenya, RN ships of the Far East Fleet and other units could visit Mombasa, communications facilities could be used until 1966, and troops could exercise in Kenya twice a year.Hornsby, 98-99. Army training deployments have continued up until 2015, as of 2015 supervised by British Army Training Unit Kenya.\n\nTimothy Parsons wrote in 2002-03:Timothy Parsons, 'The 1964 Army Mutinies and the Making of Modern East Africa,' Greenwood Publishing Group, 2003, , 169.\n'..Kenyatta did not have to worry about the political reliability of the Kenyan Army because expatriate senior British military advisors ran it along KAR lines throughout the 1960s. Following the lessons of the Lanet protects, African officers assumed operational command of all major units, but a British training team still oversaw the Kenyan Army for most of the decade. More significantly, an informal defence arrangement with Britain reassured Kenyatta that he could rely on direct British military support in the event of an army mutiny or attempted coup.'\n\nWithin months of British Brigadier A.J. Hardy handing over command of the Kenya Army to Brigadier Joseph Ndolo on 1 December 1966, British influence was underlined with the appointment of Major General Bernard Penfold as Chief of the General Staff, a new position as senior officer of the entire armed forces. Ndolo succeeded Penfold as Chief of General Staff in 1969, but was retired on 24 June 1971 after being implicated in a coup plot allegedly organised by Joseph Owino. The service chiefs thereafter reported directly to the Minister of Defence, James Gichuru.Hornsby, 228-229. The post of Chief of the General Staff was only filled again seven years later when Daniel arap Moi moved Lieutenant General Jackson Mulinge from Army Commander to CGS in November 1978.Hornsby, 335-6. Mahamoud Mohamed succeeded Mulinge in 1986, and was CGS until 1996. Mohamed was succeeded by General Daudi Tonje, CGS 1996-2000. (Hornsby 554)\n\nThe South African Institute for Security Studies wrote when Moi was still in power: \"the Kenyan armed forces’ reputation as a politically neutral establishment has been undermined by irrefutable evidence of tribal favouritism in the appointment of key posts. In the military (and also the Police and GSU), there is a virtual monopoly of President Moi’s ethnic group, the Kalenjin, in the top brass. Of 18 military generals, at least a third are Kalenjin; of 20 brigadiers, 7 are Kalenjin - an ethnic group that accounts for only a tenth of Kenya’s population. This obviously works to the disadvantage, especially, of the Kikuyu and the Luo.\"\n\nFrom the 1990s the Kenya Army became involved in United Nations peacekeeping operations, which, Hornsby says, 'offered both experience and a source of income for the army and its soldiers.'Hornsby, 554. (The United Nations reimburses troop contributing countries for each soldier contributed.) Kenya's first peacekeeping deployment was to UNTAG in Namibia; from 1989 to 2001, Kenyan troops took part in UNTAG, UNOSOM, UNPROFOR, UNCRO (Croatia), UNTAES, UNOMIL, UNPREDEP in Macedonia (1996-1999), MONUA in Angola (1997-1999), and UNTAET in East Timor (1999-2001). In 2000, women were integrated into the regular units of the military, and the Women's Service Corps disbanded.\n\nIn the early twenty-first century, the Ministry of State for Defence, just like that of Internal Security and Provincial Administration, is part of the presidential machinery. All but senior military officers are appointed, promoted, and, if necessary, removed by the military's personnel system. The president appoints and retires senior military officers. Under the authority of the president as Commander-in-Chief, the Minister of Defence presides over the National Defence Council. The Chief of General Staff is the tactical, operational and administrative head of the military. Under the 2010 constitution, the defence forces can no longer be deployed for combat operations within Kenya without the approval of Parliament.\n\nIn October 2011, following a weekend preparatory meeting between Kenyan and Somali military officials in the town of Dhobley, Kenya Army units crossed the border to begin Operation Linda Nchi against the Al-Shabaab group of insurgents in southern Somalia. The coordinated mission was officially led by the Somali Transitional Federal Government forces, with the Kenyan troops providing a support role. In reality, Kenya had coordinated with the transitional government in Mogadishu, and with the Somali militias in the border areas, but the drive on Kismayu was run by the KDF. In early June 2012, Kenyan forces were formally integrated into AMISOM.\n\nAs of August 2012 Major General Maurice Oyugi is the army vice commander.\n\nKenya Army \n\nAs of 2004, the Kenya Army had five brigades: two infantry, one with three battalions and one with two battalions; one armoured, with three battalions; one independent infantry, with two battalions; and one engineer, with two battalions.Library of Congress, Country Profile, via mongabay.com In addition, the army included air defence artillery, airborne, and independent air cavalry battalions.\n\nThe army's units consists of two armoured brigades, four infantry brigades, one engineer brigade, one armoured reconnaissance battalion (76th), three artillery battalions, three engineer battalions, one independent air cavalry battalion with 35 armed helicopters (Embakasi), five infantry battalions, one parachute battalion and one ranger battalion for low-intensity warfare.\n\nThe official Ministry of State for Defence lists the following Army formations and services:\n\nKenya Army Formations\n\n*Kenya Army Infantry\n*Kenya Army Paratroopers\n*Kenya Army Armour (includes 78 Tank Battalion, Isiolo)\n*Kenya Army Artillery (includes 77 Artillery Battalion)\n*Kenya Army Engineers\n*50 Air Cavalry Battalion\n\nKenya Army Services\n\n*Kenya Army Ordnance Corps\n*Kenya Army Corps of Transport\n*Kenya Army Electrical and Mechanical Engineering\n*Kenya Army Corps of Signals\n*Kenya Army Military Police Corps\n*Kenya Army Education Corps\n*Medical Battalion\n*Armed Forces Constabularies\n\nRanger D Company of 20 Parachute Battalion is the only commando unit in the Kenyan Army trained to fight terrorist activities by the US through Combined Joint Task Force-Horn of Africa (CJTF-HOA) and its predecessors. Main tasks include reconnaissance, raids, ambushes, infiltration and border patrol in joint operations. The unit was deployed for counter insurgency operations in the Mt Elgon area in 2008 amid accusations of torture and illegal detention.\n\nThe Kenya Ranger Strike Force initiative began in 2006 with a request from KMOD; creation of KRSF highlighted extensively in KMOD White Paper on Military Cooperation for 2011-2016.[https://www.conferences.state.gov/RM/programevaluation2011/Related%20Documents/Defense%20Workshops/3Ds%20in%20Nairobi%20-%20An%20overview%20of%20diplomacy,%20development,%20and%20defense%20at%20the%20U.S.%20Mission,%20Nairobi,%20Kenya.pdf]   The total U.S. investment was $40M. Leveraged IMET courses for Ranger and Ranger Instructor courses, Section 1206 funding to secure training and equipment, multiple Joint Combined Exchange and Training (JCET) events, and East African Regional Security Initiative (EARSI now PREACT) to fund training and equipment. The first class taught by all Kenya Army Ranger Instructors graduated on 18 March 2011. Kenya formed a Special Operations Regiment composed of 30th Special Operations Battalion and 40th Kenya Ranger Strike Force Battalion.\n\nCombat vehicles\n\nThe acquisition of T-72s has caused significant controversy. Thirty-three vehicles ordered from Ukraine were hijacked by Somali pirates. The Ukrainian Defence Minister Yury Yekhanurov confirmed 33 Russian T-72 tanks and \"a substantial quantity of ammunition\" were aboard the captured cargo ship, called the Faina\". The ship they were being carried in, MV Faina was released and the tanks unloaded in the port city of Mombasa in February 2009. There have been doubts expressed as to whether the T-72s imported by Kenya are intended for use by the Kenyan Army. Instead, popular opinion is that they were being clandestinely imported for the southern Sudanese army, which has an arms embargo against it.\n\nThe Kenyan military has dispelled speculation by publicly showing these tanks (and other hardware) as part of its arsenal on 22 August 2010, during rehearsals for the passing of the new  Constitution of Kenya. Nevertheless, a cloud of doubt will persistently hang over the initial intent of this acquisition. Recent revelations by Wikileaks provide that \"it is a badly kept secret\" that there has been an ongoing process of armaments purchases on behalf of the Southern Sudanese government by the Kenyan government. The leaks go on to speculate that these clandestine operations were motivated by the Kenya political leadership's desire to support Southern Sudan, but not in a way that would openly provoke Khartoum or potentially threaten South Sudan's eventual independence.\n\nEquipment of Kenya Defence Forces\n\nSmall Weapon\n\n50 Air Cavalry Battalion\n\nVehicles\n\nAir Force and Navy\n\nThe Kenya Air Force was established by 1966, and revolted in 1982.\n\nThe Kenya Navy is composed of:\n* 2 offshore patrol vessels (During the 2011 refit Otomat missile systems were removed)\n* 6 inshore patrol vessels\n* 2 amphibious craft\n* 12 support vessel including patrol boats, landing ship, tug boats.\n\nOther security forces are covered at Kenya Police and Law enforcement in Kenya.\n\nNotes",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Kenya Defence Forces" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16660" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Kenya Defence Forces are the armed forces of the Republic of Kenya. The Kenya Army, Kenya Navy, and Kenya Air Force comprise the national Defence Forces. The current Kenya Defence Forces were established, and its composition laid out, in Article 241 of the 2010 Constitution of Kenya; the KDF is governed by the Kenya Defence Forces Act of 2012. The President of Kenya is the commander-in-chief of all the armed forces.\n\nThe military is regularly deployed in peacekeeping missions around the world. Further, in the aftermath of the national elections of December 2007 and the violence that subsequently engulfed the country, a commission of inquiry, the Waki Commission, commended its readiness and adjudged it to \"have performed its duty well.\" Nevertheless, there have been serious allegations of human rights violations, most recently while conducting counter-insurgency operations in the Mt Elgon area and also in the district of Mandera central.\n\nKenya’s military, like many government institutions in the country, has been tainted by corruption allegations. Because the operations of the military have been traditionally cloaked by the ubiquitous blanket of \"state security\", the corruption has been less in public view, and thus less subject to public scrutiny and notoriety. This has changed recently. In what are by Kenyan standards unprecedented revelations, in 2010, credible claims of corruption were made with regard to recruitment, and procurement of Armoured Personnel Carriers. Further, the wisdom and prudence of certain decisions of procurement have been publicly questioned.\n\nHistory\n\n1896 to 1900\n\nThe Manoj between 1896 and 1900 saw the East African Rifles deployed in a number of campaigns in line with British colonial policies. In collaboration with Major Cunningham's Uganda Rifles, expeditions were organized against the Nandi who put up a strong resistance. It was not until 1906 that they were subdued.  Another one in 1900 commanded by Lieutenant Colonel Hatch, Commandant of the East African Rifles, followed this. Two medals were issued after these expeditions namely \"1898\" and \"Jubaland 1900\".\n\nThe East African Rifles also sent troops to help Uganda Rifles suppress a mutiny by Sudanese troops in Uganda. Captain Harrison who led this expedition was decorated. After being deployed on this expedition, he remained behind to form the 1st Battalion of the Uganda Rifles. This battalion later became 5 KAR.\n\nIn 1901 the British government decided to organize all the existing troops in Central Africa, East Africa, Uganda and British Somaliland under one command. Lieutenant Colonel Manning, an officer in the Indian Corps was appointed Inspector General for all the troops and promoted to the rank of general. After the troops based in different parts of British East and Central Africa territories were placed under a central command, the regiment born thereof was officially designated \"King's African Rifles\" on 1 January 1902. The composition of this regiment was as follows:-\n*The 8 companies of 1 Central African Rifles became 1 Battalion King's African Rifles.\n*The 6 companies of 2 Central African Rifles became 2 Battalion King's African Rifles.\n*The 7 companies and one camel company of East African Rifles became 3 Battalion King's African Rifles.\n*The 9 companies of the Uganda Rifles became 4 Battalion King's African Rifles.\n*The 4 companies of the Contingent of Uganda Rifles became 5 Battalion Kings African Rifles.\n\n1902-1963\n\nOn 1 April 1902, 3 KAR moved its headquarters from Mombasa to Nairobi, and together with 4 KAR and 5 KAR, was used by the British colonial government in expeditions against those who resisted British rule. In 1904 5 KAR, which was mainly made up of Indian troops, was disbanded chiefly because of maintenance costs and also because the British felt they had contained the resistance to their rule. It was however reconstituted in 1916 during World War I and stationed in Meru.\n\nLater in 1926, 5 KAR was again disbanded and their colours were handed over to 3 KAR for safe custody. On 1 March 1930 the unit was once again reconstituted, presented with their colours and stationed in Nairobi. After World War II both battalions were used by the colonial government to contain the Mau Mau rebellion. On the dawn of independence the Kenya National Assembly passed a bill (Kenya Bills 1963) to amend the status of the military forces in Kenya .\n\nAccordingly, the former units of the King's African Rifles were transformed to the Kenyan Military Forces and the Independent Kenyan Government was legally empowered to assign names to the units as deemed necessary with effect from midnight, 12 December 1963. Thus 3 KAR, 5 KAR, and 11 KAR became 3 Kenya Rifles, 5 Kenya Rifles, and 11 Kenya Rifles respectively. The transformation of King's African Rifles to Kenya Military Forces on the midnight of 12 December 1963 was a major milestone in the foundation of today's Kenya Army units.\n\n1963–present\n\nBetween 1963 and 1967, Kenya fought the Shifta War against Somali residents who sought union with their kin in the Somali Republic to the north.Bruce Baker, Escape from Domination in Africa: Political Disengagement & Its Consequences, (Africa World Press: 2003), p.83\n\nOn the evening of 24 January 1964, the failure of the Kenyan Prime Minister to appear on television, where 11th Kenya Rifles junior soldiers had been expecting a televised speech and hoping for a pay rise announcement, caused the men to mutiny.Timothy Parsons, The 1964 Army Mutinies and the Making of Modern East Africa, 120. Parsons says it is possible that the speech was only broadcast on the radio in the Nakuru area where Lanet Barracks, home of the battalion, was located. Kenyatta's government held two separate courts-martial for 43 soldiers.\n\nIn the aftermath of the mutiny and following courts-martial, the 11th Kenya Rifles was disbanded.Parsons, The 1964 Army Mutinies, 161. A new battalion, 1st Kenya Rifles, was created entirely from 340 Lanet soldiers who had been cleared of participation in the mutiny by the Kenyan Criminal Investigations Division (CID). Hornsby writes that after the mutiny, '[Kenyatta] improved conditions, announced pay rises to the military, speeded Africanisation, and instructed the intelligence services to infiltrate and watch the army for signs of disaffection.' (Hornsby, quote, 98.)\n\nDiscussions began in March 1964 between Kenya and Secretary of State for Commonwealth Relations Duncan Sandys on defence, and a formal agreement was signed on 3 June 1964. All British troops would leave by 12 December 1964, the British would assist the army, resource and train a new Kenya Air Force, and create a new Kenya Navy. They would also provide RAF and Army units to support internal security in the north-east. Significant military loans would be cancelled, and much military property made over to the Kenyan Government. In return, British aircraft would be able to transit through Kenya, RN ships of the Far East Fleet and other units could visit Mombasa, communications facilities could be used until 1966, and troops could exercise in Kenya twice a year.Hornsby, 98-99. Army training deployments have continued up until 2015, as of 2015 supervised by British Army Training Unit Kenya.\n\nTimothy Parsons wrote in 2002-03:Timothy Parsons, 'The 1964 Army Mutinies and the Making of Modern East Africa,' Greenwood Publishing Group, 2003, , 169.\n'..Kenyatta did not have to worry about the political reliability of the Kenyan Army because expatriate senior British military advisors ran it along KAR lines throughout the 1960s. Following the lessons of the Lanet protects, African officers assumed operational command of all major units, but a British training team still oversaw the Kenyan Army for most of the decade. More significantly, an informal defence arrangement with Britain reassured Kenyatta that he could rely on direct British military support in the event of an army mutiny or attempted coup.'\n\nWithin months of British Brigadier A.J. Hardy handing over command of the Kenya Army to Brigadier Joseph Ndolo on 1 December 1966, British influence was underlined with the appointment of Major General Bernard Penfold as Chief of the General Staff, a new position as senior officer of the entire armed forces. Ndolo succeeded Penfold as Chief of General Staff in 1969, but was retired on 24 June 1971 after being implicated in a coup plot allegedly organised by Joseph Owino. The service chiefs thereafter reported directly to the Minister of Defence, James Gichuru.Hornsby, 228-229. The post of Chief of the General Staff was only filled again seven years later when Daniel arap Moi moved Lieutenant General Jackson Mulinge from Army Commander to CGS in November 1978.Hornsby, 335-6. Mahamoud Mohamed succeeded Mulinge in 1986, and was CGS until 1996. Mohamed was succeeded by General Daudi Tonje, CGS 1996-2000. (Hornsby 554)\n\nThe South African Institute for Security Studies wrote when Moi was still in power: \"the Kenyan armed forces’ reputation as a politically neutral establishment has been undermined by irrefutable evidence of tribal favouritism in the appointment of key posts. In the military (and also the Police and GSU), there is a virtual monopoly of President Moi’s ethnic group, the Kalenjin, in the top brass. Of 18 military generals, at least a third are Kalenjin; of 20 brigadiers, 7 are Kalenjin - an ethnic group that accounts for only a tenth of Kenya’s population. This obviously works to the disadvantage, especially, of the Kikuyu and the Luo.\"\n\nFrom the 1990s the Kenya Army became involved in United Nations peacekeeping operations, which, Hornsby says, 'offered both experience and a source of income for the army and its soldiers.'Hornsby, 554. (The United Nations reimburses troop contributing countries for each soldier contributed.) Kenya's first peacekeeping deployment was to UNTAG in Namibia; from 1989 to 2001, Kenyan troops took part in UNTAG, UNOSOM, UNPROFOR, UNCRO (Croatia), UNTAES, UNOMIL, UNPREDEP in Macedonia (1996-1999), MONUA in Angola (1997-1999), and UNTAET in East Timor (1999-2001). In 2000, women were integrated into the regular units of the military, and the Women's Service Corps disbanded.\n\nIn the early twenty-first century, the Ministry of State for Defence, just like that of Internal Security and Provincial Administration, is part of the presidential machinery. All but senior military officers are appointed, promoted, and, if necessary, removed by the military's personnel system. The president appoints and retires senior military officers. Under the authority of the president as Commander-in-Chief, the Minister of Defence presides over the National Defence Council. The Chief of General Staff is the tactical, operational and administrative head of the military. Under the 2010 constitution, the defence forces can no longer be deployed for combat operations within Kenya without the approval of Parliament.\n\nIn October 2011, following a weekend preparatory meeting between Kenyan and Somali military officials in the town of Dhobley, Kenya Army units crossed the border to begin Operation Linda Nchi against the Al-Shabaab group of insurgents in southern Somalia. The coordinated mission was officially led by the Somali Transitional Federal Government forces, with the Kenyan troops providing a support role. In reality, Kenya had coordinated with the transitional government in Mogadishu, and with the Somali militias in the border areas, but the drive on Kismayu was run by the KDF. In early June 2012, Kenyan forces were formally integrated into AMISOM.\n\nAs of August 2012 Major General Maurice Oyugi is the army vice commander.\n\nKenya Army \n\nAs of 2004, the Kenya Army had five brigades: two infantry, one with three battalions and one with two battalions; one armoured, with three battalions; one independent infantry, with two battalions; and one engineer, with two battalions.Library of Congress, Country Profile, via mongabay.com In addition, the army included air defence artillery, airborne, and independent air cavalry battalions.\n\nThe army's units consists of two armoured brigades, four infantry brigades, one engineer brigade, one armoured reconnaissance battalion (76th), three artillery battalions, three engineer battalions, one independent air cavalry battalion with 35 armed helicopters (Embakasi), five infantry battalions, one parachute battalion and one ranger battalion for low-intensity warfare.\n\nThe official Ministry of State for Defence lists the following Army formations and services:\n\nKenya Army Formations\n\n*Kenya Army Infantry\n*Kenya Army Paratroopers\n*Kenya Army Armour (includes 78 Tank Battalion, Isiolo)\n*Kenya Army Artillery (includes 77 Artillery Battalion)\n*Kenya Army Engineers\n*50 Air Cavalry Battalion\n\nKenya Army Services\n\n*Kenya Army Ordnance Corps\n*Kenya Army Corps of Transport\n*Kenya Army Electrical and Mechanical Engineering\n*Kenya Army Corps of Signals\n*Kenya Army Military Police Corps\n*Kenya Army Education Corps\n*Medical Battalion\n*Armed Forces Constabularies\n\nRanger D Company of 20 Parachute Battalion is the only commando unit in the Kenyan Army trained to fight terrorist activities by the US through Combined Joint Task Force-Horn of Africa (CJTF-HOA) and its predecessors. Main tasks include reconnaissance, raids, ambushes, infiltration and border patrol in joint operations. The unit was deployed for counter insurgency operations in the Mt Elgon area in 2008 amid accusations of torture and illegal detention.\n\nThe Kenya Ranger Strike Force initiative began in 2006 with a request from KMOD; creation of KRSF highlighted extensively in KMOD White Paper on Military Cooperation for 2011-2016.[https://www.conferences.state.gov/RM/programevaluation2011/Related%20Documents/Defense%20Workshops/3Ds%20in%20Nairobi%20-%20An%20overview%20of%20diplomacy,%20development,%20and%20defense%20at%20the%20U.S.%20Mission,%20Nairobi,%20Kenya.pdf]   The total U.S. investment was $40M. Leveraged IMET courses for Ranger and Ranger Instructor courses, Section 1206 funding to secure training and equipment, multiple Joint Combined Exchange and Training (JCET) events, and East African Regional Security Initiative (EARSI now PREACT) to fund training and equipment. The first class taught by all Kenya Army Ranger Instructors graduated on 18 March 2011. Kenya formed a Special Operations Regiment composed of 30th Special Operations Battalion and 40th Kenya Ranger Strike Force Battalion.\n\nCombat vehicles\n\nThe acquisition of T-72s has caused significant controversy. Thirty-three vehicles ordered from Ukraine were hijacked by Somali pirates. The Ukrainian Defence Minister Yury Yekhanurov confirmed 33 Russian T-72 tanks and \"a substantial quantity of ammunition\" were aboard the captured cargo ship, called the Faina\". The ship they were being carried in, MV Faina was released and the tanks unloaded in the port city of Mombasa in February 2009. There have been doubts expressed as to whether the T-72s imported by Kenya are intended for use by the Kenyan Army. Instead, popular opinion is that they were being clandestinely imported for the southern Sudanese army, which has an arms embargo against it.\n\nThe Kenyan military has dispelled speculation by publicly showing these tanks (and other hardware) as part of its arsenal on 22 August 2010, during rehearsals for the passing of the new  Constitution of Kenya. Nevertheless, a cloud of doubt will persistently hang over the initial intent of this acquisition. Recent revelations by Wikileaks provide that \"it is a badly kept secret\" that there has been an ongoing process of armaments purchases on behalf of the Southern Sudanese government by the Kenyan government. The leaks go on to speculate that these clandestine operations were motivated by the Kenya political leadership's desire to support Southern Sudan, but not in a way that would openly provoke Khartoum or potentially threaten South Sudan's eventual independence.\n\nEquipment of Kenya Defence Forces\n\nSmall Weapon\n\n50 Air Cavalry Battalion\n\nVehicles\n\nAir Force and Navy\n\nThe Kenya Air Force was established by 1966, and revolted in 1982.\n\nThe Kenya Navy is composed of:\n* 2 offshore patrol vessels (During the 2011 refit Otomat missile systems were removed)\n* 6 inshore patrol vessels\n* 2 amphibious craft\n* 12 support vessel including patrol boats, landing ship, tug boats.\n\nOther security forces are covered at Kenya Police and Law enforcement in Kenya.\n\nNotes. Kenya Defence Forces. http://en.wikipedia.org/?curid=16660."
  }
}
