{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13706",
  "eid" : "0c824380-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778530232,
  "textBody" : "A hero (masculine) or heroine (feminine) is a person or main character of a literary work who, in the face of danger, combats adversity through feats of ingenuity, bravery or strength, often sacrificing their own personal concerns for a greater good.\n\nThe concept of the hero can be found in classical literature. It is the main or revered character in heroic epic poetry celebrated through ancient legends of a people, often striving for military conquest and living by a continually flawed personal honor code. The definition of a hero has changed throughout time. Merriam Webster dictionary defines a hero as \"a person who is admired for great or brave acts or fine qualities.\" Examples of heroes range from mythological figures, such as Gilgamesh, Achilles and Iphigenia, to historical figures, such as Joan of Arc, modern heroes like Alvin York, Audie Murphy and Chuck Yeager, and fictional superheroes, including Superman and Batman.\n\nEtymology\n\nThe word hero comes from the Greek ἥρως (hērōs), \"hero\" (literally \"protector\" or \"defender\"), particularly one such as Heracles with divine ancestry or later given divine honors.[http://www.perseus.tufts.edu/hopper/text?doc=Perseus%3Atext%3A1999.04.0057%3Aentry%3Dh%28%2Frws ἥρως]\nHenry George Liddell, Robert Scott, A Greek-English Lexicon, on Perseus Digital Library Before the decipherment of Linear B the original form of the word was assumed to be *, hērōw-, but the Mycenaean compound ti-ri-se-ro-e demonstrates the absence of -w-. R. S. P. Beekes asserts that the word has a Pre-Greek origin.R. S. P. Beekes, Etymological Dictionary of Greek, Brill, 2009, p. 526.\n\nAccording to the American Heritage Dictionary of the English Language, the Indo-European root is *ser meaning \"to protect\". According to Eric Partridge in Origins, the Greek word  Hērōs \"is akin to\" the Latin seruāre, meaning to safeguard.  Partridge concludes, \"The basic sense of both Hera and hero would therefore be 'protector'.\"\n\nThe word 'hero' is used in English to refer either explicitly to male heroes or as a gender-neutral form (whereas the term heroine designates only a female hero). The use of 'hero' as a gender-neutral substantive has been current from at least the beginning of the 21st Century. (The American Heritage Dictionary, 4th edition [2000], offers this citation from the Washington Post: “Already a national hero in her economically troubled South Korea,... [Se Ri] Pak is packing galleries at [golf] tournaments stateside.”) In Greek the term ἥρως (hērōs) was used exclusively to refer to men. Geneviève Dermenjian, Jacques Guilhaumou and Martine Lapied in Le Panthéon des Femmes Figures et Représentations des Héroines argue that \"hero\" as a supposedly gender-neutral term carries a strong implicit male bias. See also Gender neutrality in English.\n\nHeroes in antiquity\n\nA classical hero is considered to be a \"warrior who lives and dies in the pursuit of honor\" and asserts his or her greatness by \"the brilliancy and efficiency with which they kill\". Each classical hero's life focuses on fighting, which occurs in war or during an epic quest. Classical heroes are commonly semi-divine and extraordinarily gifted, like Achilles, evolving into heroic characters through their perilous circumstances. While these heroes are incredibly resourceful and skilled, they are often foolhardy, court disaster, risk their followers' lives for trivial matters, and behave arrogantly in a childlike manner. During classical times, people regarded heroes with the highest esteem and utmost importance, explaining their prominence within epic literature. The appearance of these mortal figures marks a revolution of audiences and writers turning away from immortal gods to mortal mankind, whose heroic moments of glory survive in the memory of their descendants, extending their legacy.\n\nHector was a Trojan prince and the greatest fighter for Troy in the Trojan War, which is known primarily through Homer's The Iliad. Hector acted as leader of the Trojans and their allies in the defense of Troy, \"killing 31,000 Greek fighters,\" offers Hyginus.Hyginus, Fabulae 115. Hector was known not only for his courage but also for his noble and courtly nature. Indeed, Homer places Hector as peace-loving, thoughtful as well as bold, a good son, husband and father, and without darker motives. However, his familial values conflict greatly with his heroic aspirations in The Iliad, as he cannot be both the protector of Troy and a father to his child. Hector is ultimately betrayed by the gods when Athena appears disguised as his ally Deiphobus and convinces him to take on Achilles, leading to his death at the hands of a superior warrior.Homer. The Iliad. Trans. Robert Fagles (1990). NY: Penguin Books. Chapter 14Achilles was a Greek Hero who was considered the most formidable military fighter in the entire Trojan War and the central character of The Iliad. He was the child of Thetis and Peleus, making him a demi-god. He wielded superhuman strength on the battlefield and was blessed with a close relationship to the Gods. Achilles famously refuses to fight after his dishonoring at the hands of Agamemnon, and only returns to the war due to unadulterated rage after Hector kills his close friend Patroclus. Achilles was known for uncontrollable rage that defined many of his bloodthirsty actions, such as defiling Hector's corpse by dragging it around the city of Troy. Achilles plays a tragic role in The Iliad brought about by constant [https://books.google.com/books?id\n5TFUv2VRKd8C&pgPA91&lpg\nPA91&dqachilles+dehumanization&source\nbl&ots5D2sb_hGx_&sig\niJrfJQdt0VhRVG2iJoRf-Nc6oqA&hlen&sa\nX&ved0ahUKEwje8uWTosvJAhWGyT4KHZE7BUoQ6AEIJTAC#v\nonepage&qachilles%20dehumanization&f\nfalse de-humanization] throughout the epic, having his menis (wrath) overpower his philos (love).\n\nHeroes in myth often had close but conflicted relationships with the gods. Thus Heracles's name means \"the glory of Hera\", even though he was tormented all his life by Hera, the Queen of the Gods. Perhaps the most striking example is the Athenian king Erechtheus, whom Poseidon killed for choosing Athena over him as the city's patron god. When the Athenians worshiped Erechtheus on the Acropolis, they invoked him as Poseidon  Erechtheus.\n\nFate, or destiny, plays a massive role in the stories of classical heroes. The classical hero's heroic significance stems from battlefield conquests, an inherently dangerous action. The gods in Greek Mythology, when interacting with the heroes, often foreshadow the hero's eventual death on the battlefield. Countless heroes and gods go to great lengths to alter their  pre-destined fate, but with no success, as no immortal can change their prescribed outcomes by the three Fates. The most prominent example of this is found in Oedipus Rex. After learning that his son, Oedipus, will end up killing him, the King of Thebes, Laius, takes huge steps to assure his son's death by removing him from the kingdom. But, Oedipus slays his father without an afterthought when he unknowingly encounters him in a dispute on the road many years later. The lack of recognition enabled Oedipus to slay his father, ironically further binding his father to his fate.\n\nStories of heroism may serve as moral examples. However, classical heroes often didn't embody the Christian notion of an upstanding, perfectly moral hero. For example, Achilles's character-issues of hateful rage lead to merciless slaughter and his overwhelming pride lead to him only joining the Trojan War because he didn't want his soldiers to win all of the glory. Classical heroes, regardless of their morality, were placed in religion. In classical antiquity, cults that venerated deified heroes such as Heracles, Perseus, and Achilles played an important role in Ancient Greek religion.Graf, Fritz. (2006) \"Hero Cult.\" Brills New Pauly. Retrieved from http://referenceworks.brillonline.com/entries/brill-s-new-pauly/hero-cult-e511460?s.num\n1&s.f.s2_parents.f.book.brill-s-new-pauly&s.q\nhero. These ancient Greek hero cults worshipped heroes from oral epic tradition, with these heroes often bestowing blessings, especially healing ones, on individuals.\n\nHeroic myth and monomyth\n\nThe concept of the \"Mythic Hero Archetype\" was first developed by Lord Raglan in his 1936 book, The Hero, A Study in Tradition, Myth and Drama. It is a set of 22 common traits that he said were shared by many heroes in various cultures, myths and religions throughout history and around the world.  Raglan argued that the higher the score, the more likely the figure is mythical.Lord Raglan. The Hero: A Study in Tradition, Myth and Drama by Lord Raglan, Dover Publications, 1936\n\nThe concept of a story archetype of the standard monomythical \"hero's quest\" that was reputed to be pervasive across all cultures is somewhat controversial. Expounded mainly by Joseph Campbell in his 1949 work The Hero with a Thousand Faces, it illustrates several uniting themes of hero stories that hold similar ideas of what a hero represents, despite vastly different cultures and beliefs. The monomyth or Hero's Journey  consists of three separate stages including the Departure, Initiation, and Return. Within these stages there are several archetypes that the hero or heroine may follow including the call to adventure (which they may initially refuse), supernatural aid, proceeding down a road of trials, achieving a realization about themselves (or an apotheosis), and attaining the freedom to live through their quest or journey. Campbell offered examples of stories with similar themes  such as Krishna, Buddha, Apollonius of Tyana, and Jesus.Joseph Campbell in The Hero With a Thousand Faces Princeton University Press, 2004 [1949], 140,  One of the themes he explores is the androgynous hero, who combines male and female traits, like Bodhisattva: \"The first wonder to be noted here is the androgynous character of the Bodhisattva: masculine Avalokiteshvara, feminine Kwan Yin.\" In his 1968 book, The Masks of God: Occidental Mythology, Campbell writes \"It is clear that, whether accurate or not as to biographical detail, the moving legend of the Crucified and Risen Christ was fit to bring a new warmth, immediacy, and humanity, to the old motifs of the beloved Tammuz, Adonis, and Osiris cycles.\"Joseph Campbell. 'T'he Masks of God: Occidental Mythology Penguin, reprinted, \n\nSlavic fairy tales\n\nVladimir Propp, in his analysis of the Russian fairy tale, concluded that a fairy tale had only eight dramatis personæ, of which one was the hero,Vladimir Propp, Morphology of the Folk Tale,  and his analysis has been widely applied to non-Russian folklore. The actions that fall into such a hero's sphere include:\n# Departure on a quest\n# Reacting to the test of a donor\n# Marrying a princess (or similar figure)\nPropp distinguished between seekers and victim-heroes. A villain could initiate the issue by kidnapping the hero or driving him out; these were victim-heroes. On the other hand, an antagonist could rob the hero, or kidnap someone close to him, or, without the villain's intervention, the hero could realize that he lacked something and set out to find it; these heroes are seekers. Victims may appear in tales with seeker heroes, but the tale does not follow them both.\n\nThe hero in historical studies\n\nNo history can be written without consideration of the lengthy list of recipients of national medals for bravery, populated by firefighters, policemen and policewomen, ambulance medics and ordinary have-a-go heroes.[http://www.smh.com.au/articles/2002/12/25/1040511087609.html smh.com.au: \"Everyday heroes\"], 26 Dec 2002 These persons risked their lives to try to save or protect the lives of others: for example, the Canadian Cross of Valour (C.V.) \"recognizes acts of the most conspicuous courage in circumstances of extreme peril\";[http://www.gg.ca/document.aspx?id=13503 gg.ca: \"Decorations for Bravery Ceremony\"], 2 Feb 2010 examples of recipients are Mary Dohey and David Gordon Cheverie.\n\nThe philosopher Hegel gave a central role to the \"hero\", personalized by Napoleon, as the incarnation of a particular culture's Volksgeist, and thus of the general Zeitgeist. Thomas Carlyle's 1841 On Heroes, Hero Worship and the Heroic in History also accorded a key function to heroes and great men in history. Carlyle centered history on the biography of a few central individuals such as Oliver Cromwell or Frederick the Great. His heroes were political and military figures, the founders or topplers of states. His history of great men included geniuses good and, perhaps for the first time in historical study, evil.\n\nExplicit defenses of Carlyle's position were rare in the second part of the 20th century. Most in the philosophy of history school contend that the motive forces in history can best be described only with a wider lens than the one that Carlyle used for his portraits. For example, Karl Marx argued that history was determined by the massive social forces at play in \"class struggles\", not by the individuals by whom these forces are played out. After Marx, Herbert Spencer wrote at the end of the 19th century: \"You must admit that the genesis of the great man depends on the long series of complex influences which has produced the race in which he appears, and the social state into which that race has slowly grown....Before he can remake his society, his society must make him.\"Spencer, Herbert. [https://www.questia.com/PM.qst?a\no&d=96277756  The Study of Sociology], Appleton, 1896, p. 34.  As Michel Foucault pointed out in his analysis of societal communication and debate, history was mainly the \"science of the sovereign\", until its inversion by the \"historical and political popular discourse\", but these intellectuals attempt to relieve themselves of responsibility for their own actions, so that they can be considered unreliable sources at best  .\n\nModern examples of the typical hero are  Minnie Vautrin, Norman Bethune,  Alan Turing, Raoul Wallenberg, Mother Teresa, Nelson Mandela, and Aung San Suu Kyi.\n\nThe Annales School, led by Lucien Febvre, Marc Bloch and Fernand Braudel, would contest the exaggeration of the role of individual subjects in history. Indeed, Braudel distinguished various time scales, one accorded to the life of an individual, another accorded to the life of a few human generations, and the last one to civilizations, in which geography, economics and demography play a role considerably more decisive than that of individual subjects.\n\nAmong noticeable events in the studies of the role of the hero and Great man in history one should mention Sydney Hook's book (1943) The Hero in History.Hook, S. 1955 [1943]. The Hero in History. A Study in Limitation and Possibility. Boston, MA: Beacon Press. In the second half of the twentieth century such male-focused theory has been contested, among others by feminists writers such as Judith Fetterley in The Resisting Reader (1977) and literary theorist Nancy K. Miller, The Heroine's Text: Readings in the French and English Novel, 1722–1782.\n\nIn the epoch of globalization an individual can still change the development of the country and of the whole world so this gives reasons to some scholars to suggest returning to the problem of the role of the hero in history from the viewpoint of modern historical knowledge and using up-to-date methods of historical analysis.Grinin, Leonid  2010. The Role of an Individual in History: A Reconsideration. Social Evolution & History, Vol. 9 No. 2 (pp. 95–136) [http://www.socionauki.ru/journal/articles/129622/]\n\nWithin the frameworks of developing counterfactual history, attempts are made to examine some hypothetical scenarios of historical development. The hero attracts much attention because most of those scenarios are based on the suppositions: what would have happened if this or that historical individual had or had not been alive.Thompson. W. The Lead Economy Sequence in World Politics (From Sung China to the United States): Selected Counterfactuals. Journal of Globalization Studies. Vol. 1, num. 1. 2010. pp. 6–28 [http://www.socionauki.ru/journal/articles/126971/]\n\nHeroine or hero \n\nIf the term heroine exists, hero is often the predominantly used term even though its neutrality can be put into question. The definitions of the heroine often refer back to the one of the hero, but sometimes insinuates that their deeds are of less value, were obtained only thanks to their love of God or a country or of a man. Therefore, implying that an external explanation for the extraordinary nature of her deeds is needed to justify them. The warrior women is considered unholy, unnatural. These figures tend to be erased because they don't fit in the feminine values they are supposed to represent.\nActs of heroism coming from women are acceptable, during specific time, like when men are at war, during times of crisis, but they are otherwise often seen as suspicious. Moreover, women are often not individualized, but praised as a group for heroic deeds. Women in the military were often subordinated to tasks less likely to be praised than armed combat, and are rather praised for their courage as a general force, nurses during wartime are a good example of this phenomenon.\nIf their story gets told, they are made to fit in the acceptable script. Their story is told in a way as to match the expectations of femininity ex: maternal love, compassion, fidelity, resistance, defense. Etc. So the set of strengths in which a heroine could historically express her value are overall not the same and perceived as less valuable than their masculine counterpart.\n\nIn general, the cultural repertoire of heroic stories requires different qualities for each gender. The contrast of the ideal narrative line pits the autonomous ego-enhancing hero single-handedly and single-heartedly progressing toward a goal versus the long-suffering, selfless, socially embedded heroine, being moved in many directions, lacking the tenacious loyalty demanded of a quest.\n\nIf they get mentioned in history, the way their story is told also differs from their male counterpart, they are generally portrayed as young and beautiful, their actions are limited to a short time\nlapse in opposition to the possibility of a long heroic career for male heroes, underlying feelings that led to their heroic acts are underlined, overall less details about their life are kept and\nemphasis is put over their tragic death. Not to forget that heroes and heroines are part of a social construct, their history is told and changes throughout history to serve different purposes of memory, propaganda according to diverse social, political or religious evolutions.\n\nThe modern fictional hero\n\n\t \nThe word \"hero\" or \"heroine\", in modern times, is sometimes used to describe the protagonist or the love interest of a story, a usage which can conflict with the superhuman expectations of heroism. A classic example is Anna Karenina, the lead character in the novel of the same title by Leo Tolstoy. In modern literature the hero is more and more a problematic concept. In 1848, for example, William Makepeace Thackeray gave Vanity Fair the subtitle A Novel without a Hero, and imagined a world in which no sympathetic character was to be found.Northrop Frye, Anatomy of Criticism, p. 34,  Vanity Fair is a satirical representation of the absence of truly moral heroes in the modern world.Shmoop Editorial Team. (2008, November 11). Vanity Fair Theme of Morality and Ethics. Retrieved December 6, 2015, from http://www.shmoop.com/vanity-fair-thackeray/morality-ethics-theme.html The story focuses on the characters Emmy Sedley and Becky Sharpe (the latter as the clearly defined anti-hero), with the plot focused on the eventual marriage of these two characters to rich men, revealing character flaws as the story progresses. Even the most sympathetic characters, like Captain Dobbin, are susceptible to weakness, as he is often narcissistic and melancholy.\n\nThe larger-than-life hero is a more common feature of fantasy (particularly in comic-books and epic fantasy) than more realist works.L. Sprague de Camp, Literary Swordsmen and Sorcerers:  The Makers of Heroic Fantasy, p. 5  However, these larger-than life figures remain prevalent in society. The superhero genre is a multibillion-dollar industry that includes comic books, movies, toys and video games. Superheroes usually possess extraordinary talents and powers that no living human could ever emulate. The superhero stories often pit a super villain against the hero, with the hero fighting the crime caused by the super villain. Examples of long-running superheroes include Superman, Batman, Spider-Man and Wonder Woman.\n\nPsychology of heroism\n\nSocial psychology has begun paying attention to heroes and heroism. Zeno Franco and Philip Zimbardo point out differences between heroism and altruism, and they offer evidence that observers' perceptions of unjustified risk plays a role above and beyond risk type in determining the ascription of heroic status.\n\nAn evolutionary psychology explanation for heroic risk-taking is that it is a costly signal demonstrating the ability of the hero. It can be seen as one form of altruism for which there are also several other evolutionary explanations.Pat Barcaly. The evolution of charitable behaviour and the power of reputation. In \n\nRoma Chatterji has suggested that the hero or more generally protagonist is first and foremost a symbolic representation of the person who is experiencing the story while reading, listening or watching; thus the relevance of the hero to the individual relies a great deal on how much similarity there is between the two. One reason for the hero-as-self interpretation of stories and myths is the human inability to view the world from any perspective but a personal one.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Hero" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13706" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A hero (masculine) or heroine (feminine) is a person or main character of a literary work who, in the face of danger, combats adversity through feats of ingenuity, bravery or strength, often sacrificing their own personal concerns for a greater good.\n\nThe concept of the hero can be found in classical literature. It is the main or revered character in heroic epic poetry celebrated through ancient legends of a people, often striving for military conquest and living by a continually flawed personal honor code. The definition of a hero has changed throughout time. Merriam Webster dictionary defines a hero as \"a person who is admired for great or brave acts or fine qualities.\" Examples of heroes range from mythological figures, such as Gilgamesh, Achilles and Iphigenia, to historical figures, such as Joan of Arc, modern heroes like Alvin York, Audie Murphy and Chuck Yeager, and fictional superheroes, including Superman and Batman.\n\nEtymology\n\nThe word hero comes from the Greek ἥρως (hērōs), \"hero\" (literally \"protector\" or \"defender\"), particularly one such as Heracles with divine ancestry or later given divine honors.[http://www.perseus.tufts.edu/hopper/text?doc=Perseus%3Atext%3A1999.04.0057%3Aentry%3Dh%28%2Frws ἥρως]\nHenry George Liddell, Robert Scott, A Greek-English Lexicon, on Perseus Digital Library Before the decipherment of Linear B the original form of the word was assumed to be *, hērōw-, but the Mycenaean compound ti-ri-se-ro-e demonstrates the absence of -w-. R. S. P. Beekes asserts that the word has a Pre-Greek origin.R. S. P. Beekes, Etymological Dictionary of Greek, Brill, 2009, p. 526.\n\nAccording to the American Heritage Dictionary of the English Language, the Indo-European root is *ser meaning \"to protect\". According to Eric Partridge in Origins, the Greek word  Hērōs \"is akin to\" the Latin seruāre, meaning to safeguard.  Partridge concludes, \"The basic sense of both Hera and hero would therefore be 'protector'.\"\n\nThe word 'hero' is used in English to refer either explicitly to male heroes or as a gender-neutral form (whereas the term heroine designates only a female hero). The use of 'hero' as a gender-neutral substantive has been current from at least the beginning of the 21st Century. (The American Heritage Dictionary, 4th edition [2000], offers this citation from the Washington Post: “Already a national hero in her economically troubled South Korea,... [Se Ri] Pak is packing galleries at [golf] tournaments stateside.”) In Greek the term ἥρως (hērōs) was used exclusively to refer to men. Geneviève Dermenjian, Jacques Guilhaumou and Martine Lapied in Le Panthéon des Femmes Figures et Représentations des Héroines argue that \"hero\" as a supposedly gender-neutral term carries a strong implicit male bias. See also Gender neutrality in English.\n\nHeroes in antiquity\n\nA classical hero is considered to be a \"warrior who lives and dies in the pursuit of honor\" and asserts his or her greatness by \"the brilliancy and efficiency with which they kill\". Each classical hero's life focuses on fighting, which occurs in war or during an epic quest. Classical heroes are commonly semi-divine and extraordinarily gifted, like Achilles, evolving into heroic characters through their perilous circumstances. While these heroes are incredibly resourceful and skilled, they are often foolhardy, court disaster, risk their followers' lives for trivial matters, and behave arrogantly in a childlike manner. During classical times, people regarded heroes with the highest esteem and utmost importance, explaining their prominence within epic literature. The appearance of these mortal figures marks a revolution of audiences and writers turning away from immortal gods to mortal mankind, whose heroic moments of glory survive in the memory of their descendants, extending their legacy.\n\nHector was a Trojan prince and the greatest fighter for Troy in the Trojan War, which is known primarily through Homer's The Iliad. Hector acted as leader of the Trojans and their allies in the defense of Troy, \"killing 31,000 Greek fighters,\" offers Hyginus.Hyginus, Fabulae 115. Hector was known not only for his courage but also for his noble and courtly nature. Indeed, Homer places Hector as peace-loving, thoughtful as well as bold, a good son, husband and father, and without darker motives. However, his familial values conflict greatly with his heroic aspirations in The Iliad, as he cannot be both the protector of Troy and a father to his child. Hector is ultimately betrayed by the gods when Athena appears disguised as his ally Deiphobus and convinces him to take on Achilles, leading to his death at the hands of a superior warrior.Homer. The Iliad. Trans. Robert Fagles (1990). NY: Penguin Books. Chapter 14Achilles was a Greek Hero who was considered the most formidable military fighter in the entire Trojan War and the central character of The Iliad. He was the child of Thetis and Peleus, making him a demi-god. He wielded superhuman strength on the battlefield and was blessed with a close relationship to the Gods. Achilles famously refuses to fight after his dishonoring at the hands of Agamemnon, and only returns to the war due to unadulterated rage after Hector kills his close friend Patroclus. Achilles was known for uncontrollable rage that defined many of his bloodthirsty actions, such as defiling Hector's corpse by dragging it around the city of Troy. Achilles plays a tragic role in The Iliad brought about by constant [https://books.google.com/books?id\n5TFUv2VRKd8C&pgPA91&lpg\nPA91&dqachilles+dehumanization&source\nbl&ots5D2sb_hGx_&sig\niJrfJQdt0VhRVG2iJoRf-Nc6oqA&hlen&sa\nX&ved0ahUKEwje8uWTosvJAhWGyT4KHZE7BUoQ6AEIJTAC#v\nonepage&qachilles%20dehumanization&f\nfalse de-humanization] throughout the epic, having his menis (wrath) overpower his philos (love).\n\nHeroes in myth often had close but conflicted relationships with the gods. Thus Heracles's name means \"the glory of Hera\", even though he was tormented all his life by Hera, the Queen of the Gods. Perhaps the most striking example is the Athenian king Erechtheus, whom Poseidon killed for choosing Athena over him as the city's patron god. When the Athenians worshiped Erechtheus on the Acropolis, they invoked him as Poseidon  Erechtheus.\n\nFate, or destiny, plays a massive role in the stories of classical heroes. The classical hero's heroic significance stems from battlefield conquests, an inherently dangerous action. The gods in Greek Mythology, when interacting with the heroes, often foreshadow the hero's eventual death on the battlefield. Countless heroes and gods go to great lengths to alter their  pre-destined fate, but with no success, as no immortal can change their prescribed outcomes by the three Fates. The most prominent example of this is found in Oedipus Rex. After learning that his son, Oedipus, will end up killing him, the King of Thebes, Laius, takes huge steps to assure his son's death by removing him from the kingdom. But, Oedipus slays his father without an afterthought when he unknowingly encounters him in a dispute on the road many years later. The lack of recognition enabled Oedipus to slay his father, ironically further binding his father to his fate.\n\nStories of heroism may serve as moral examples. However, classical heroes often didn't embody the Christian notion of an upstanding, perfectly moral hero. For example, Achilles's character-issues of hateful rage lead to merciless slaughter and his overwhelming pride lead to him only joining the Trojan War because he didn't want his soldiers to win all of the glory. Classical heroes, regardless of their morality, were placed in religion. In classical antiquity, cults that venerated deified heroes such as Heracles, Perseus, and Achilles played an important role in Ancient Greek religion.Graf, Fritz. (2006) \"Hero Cult.\" Brills New Pauly. Retrieved from http://referenceworks.brillonline.com/entries/brill-s-new-pauly/hero-cult-e511460?s.num\n1&s.f.s2_parents.f.book.brill-s-new-pauly&s.q\nhero. These ancient Greek hero cults worshipped heroes from oral epic tradition, with these heroes often bestowing blessings, especially healing ones, on individuals.\n\nHeroic myth and monomyth\n\nThe concept of the \"Mythic Hero Archetype\" was first developed by Lord Raglan in his 1936 book, The Hero, A Study in Tradition, Myth and Drama. It is a set of 22 common traits that he said were shared by many heroes in various cultures, myths and religions throughout history and around the world.  Raglan argued that the higher the score, the more likely the figure is mythical.Lord Raglan. The Hero: A Study in Tradition, Myth and Drama by Lord Raglan, Dover Publications, 1936\n\nThe concept of a story archetype of the standard monomythical \"hero's quest\" that was reputed to be pervasive across all cultures is somewhat controversial. Expounded mainly by Joseph Campbell in his 1949 work The Hero with a Thousand Faces, it illustrates several uniting themes of hero stories that hold similar ideas of what a hero represents, despite vastly different cultures and beliefs. The monomyth or Hero's Journey  consists of three separate stages including the Departure, Initiation, and Return. Within these stages there are several archetypes that the hero or heroine may follow including the call to adventure (which they may initially refuse), supernatural aid, proceeding down a road of trials, achieving a realization about themselves (or an apotheosis), and attaining the freedom to live through their quest or journey. Campbell offered examples of stories with similar themes  such as Krishna, Buddha, Apollonius of Tyana, and Jesus.Joseph Campbell in The Hero With a Thousand Faces Princeton University Press, 2004 [1949], 140,  One of the themes he explores is the androgynous hero, who combines male and female traits, like Bodhisattva: \"The first wonder to be noted here is the androgynous character of the Bodhisattva: masculine Avalokiteshvara, feminine Kwan Yin.\" In his 1968 book, The Masks of God: Occidental Mythology, Campbell writes \"It is clear that, whether accurate or not as to biographical detail, the moving legend of the Crucified and Risen Christ was fit to bring a new warmth, immediacy, and humanity, to the old motifs of the beloved Tammuz, Adonis, and Osiris cycles.\"Joseph Campbell. 'T'he Masks of God: Occidental Mythology Penguin, reprinted, \n\nSlavic fairy tales\n\nVladimir Propp, in his analysis of the Russian fairy tale, concluded that a fairy tale had only eight dramatis personæ, of which one was the hero,Vladimir Propp, Morphology of the Folk Tale,  and his analysis has been widely applied to non-Russian folklore. The actions that fall into such a hero's sphere include:\n# Departure on a quest\n# Reacting to the test of a donor\n# Marrying a princess (or similar figure)\nPropp distinguished between seekers and victim-heroes. A villain could initiate the issue by kidnapping the hero or driving him out; these were victim-heroes. On the other hand, an antagonist could rob the hero, or kidnap someone close to him, or, without the villain's intervention, the hero could realize that he lacked something and set out to find it; these heroes are seekers. Victims may appear in tales with seeker heroes, but the tale does not follow them both.\n\nThe hero in historical studies\n\nNo history can be written without consideration of the lengthy list of recipients of national medals for bravery, populated by firefighters, policemen and policewomen, ambulance medics and ordinary have-a-go heroes.[http://www.smh.com.au/articles/2002/12/25/1040511087609.html smh.com.au: \"Everyday heroes\"], 26 Dec 2002 These persons risked their lives to try to save or protect the lives of others: for example, the Canadian Cross of Valour (C.V.) \"recognizes acts of the most conspicuous courage in circumstances of extreme peril\";[http://www.gg.ca/document.aspx?id=13503 gg.ca: \"Decorations for Bravery Ceremony\"], 2 Feb 2010 examples of recipients are Mary Dohey and David Gordon Cheverie.\n\nThe philosopher Hegel gave a central role to the \"hero\", personalized by Napoleon, as the incarnation of a particular culture's Volksgeist, and thus of the general Zeitgeist. Thomas Carlyle's 1841 On Heroes, Hero Worship and the Heroic in History also accorded a key function to heroes and great men in history. Carlyle centered history on the biography of a few central individuals such as Oliver Cromwell or Frederick the Great. His heroes were political and military figures, the founders or topplers of states. His history of great men included geniuses good and, perhaps for the first time in historical study, evil.\n\nExplicit defenses of Carlyle's position were rare in the second part of the 20th century. Most in the philosophy of history school contend that the motive forces in history can best be described only with a wider lens than the one that Carlyle used for his portraits. For example, Karl Marx argued that history was determined by the massive social forces at play in \"class struggles\", not by the individuals by whom these forces are played out. After Marx, Herbert Spencer wrote at the end of the 19th century: \"You must admit that the genesis of the great man depends on the long series of complex influences which has produced the race in which he appears, and the social state into which that race has slowly grown....Before he can remake his society, his society must make him.\"Spencer, Herbert. [https://www.questia.com/PM.qst?a\no&d=96277756  The Study of Sociology], Appleton, 1896, p. 34.  As Michel Foucault pointed out in his analysis of societal communication and debate, history was mainly the \"science of the sovereign\", until its inversion by the \"historical and political popular discourse\", but these intellectuals attempt to relieve themselves of responsibility for their own actions, so that they can be considered unreliable sources at best  .\n\nModern examples of the typical hero are  Minnie Vautrin, Norman Bethune,  Alan Turing, Raoul Wallenberg, Mother Teresa, Nelson Mandela, and Aung San Suu Kyi.\n\nThe Annales School, led by Lucien Febvre, Marc Bloch and Fernand Braudel, would contest the exaggeration of the role of individual subjects in history. Indeed, Braudel distinguished various time scales, one accorded to the life of an individual, another accorded to the life of a few human generations, and the last one to civilizations, in which geography, economics and demography play a role considerably more decisive than that of individual subjects.\n\nAmong noticeable events in the studies of the role of the hero and Great man in history one should mention Sydney Hook's book (1943) The Hero in History.Hook, S. 1955 [1943]. The Hero in History. A Study in Limitation and Possibility. Boston, MA: Beacon Press. In the second half of the twentieth century such male-focused theory has been contested, among others by feminists writers such as Judith Fetterley in The Resisting Reader (1977) and literary theorist Nancy K. Miller, The Heroine's Text: Readings in the French and English Novel, 1722–1782.\n\nIn the epoch of globalization an individual can still change the development of the country and of the whole world so this gives reasons to some scholars to suggest returning to the problem of the role of the hero in history from the viewpoint of modern historical knowledge and using up-to-date methods of historical analysis.Grinin, Leonid  2010. The Role of an Individual in History: A Reconsideration. Social Evolution & History, Vol. 9 No. 2 (pp. 95–136) [http://www.socionauki.ru/journal/articles/129622/]\n\nWithin the frameworks of developing counterfactual history, attempts are made to examine some hypothetical scenarios of historical development. The hero attracts much attention because most of those scenarios are based on the suppositions: what would have happened if this or that historical individual had or had not been alive.Thompson. W. The Lead Economy Sequence in World Politics (From Sung China to the United States): Selected Counterfactuals. Journal of Globalization Studies. Vol. 1, num. 1. 2010. pp. 6–28 [http://www.socionauki.ru/journal/articles/126971/]\n\nHeroine or hero \n\nIf the term heroine exists, hero is often the predominantly used term even though its neutrality can be put into question. The definitions of the heroine often refer back to the one of the hero, but sometimes insinuates that their deeds are of less value, were obtained only thanks to their love of God or a country or of a man. Therefore, implying that an external explanation for the extraordinary nature of her deeds is needed to justify them. The warrior women is considered unholy, unnatural. These figures tend to be erased because they don't fit in the feminine values they are supposed to represent.\nActs of heroism coming from women are acceptable, during specific time, like when men are at war, during times of crisis, but they are otherwise often seen as suspicious. Moreover, women are often not individualized, but praised as a group for heroic deeds. Women in the military were often subordinated to tasks less likely to be praised than armed combat, and are rather praised for their courage as a general force, nurses during wartime are a good example of this phenomenon.\nIf their story gets told, they are made to fit in the acceptable script. Their story is told in a way as to match the expectations of femininity ex: maternal love, compassion, fidelity, resistance, defense. Etc. So the set of strengths in which a heroine could historically express her value are overall not the same and perceived as less valuable than their masculine counterpart.\n\nIn general, the cultural repertoire of heroic stories requires different qualities for each gender. The contrast of the ideal narrative line pits the autonomous ego-enhancing hero single-handedly and single-heartedly progressing toward a goal versus the long-suffering, selfless, socially embedded heroine, being moved in many directions, lacking the tenacious loyalty demanded of a quest.\n\nIf they get mentioned in history, the way their story is told also differs from their male counterpart, they are generally portrayed as young and beautiful, their actions are limited to a short time\nlapse in opposition to the possibility of a long heroic career for male heroes, underlying feelings that led to their heroic acts are underlined, overall less details about their life are kept and\nemphasis is put over their tragic death. Not to forget that heroes and heroines are part of a social construct, their history is told and changes throughout history to serve different purposes of memory, propaganda according to diverse social, political or religious evolutions.\n\nThe modern fictional hero\n\n\t \nThe word \"hero\" or \"heroine\", in modern times, is sometimes used to describe the protagonist or the love interest of a story, a usage which can conflict with the superhuman expectations of heroism. A classic example is Anna Karenina, the lead character in the novel of the same title by Leo Tolstoy. In modern literature the hero is more and more a problematic concept. In 1848, for example, William Makepeace Thackeray gave Vanity Fair the subtitle A Novel without a Hero, and imagined a world in which no sympathetic character was to be found.Northrop Frye, Anatomy of Criticism, p. 34,  Vanity Fair is a satirical representation of the absence of truly moral heroes in the modern world.Shmoop Editorial Team. (2008, November 11). Vanity Fair Theme of Morality and Ethics. Retrieved December 6, 2015, from http://www.shmoop.com/vanity-fair-thackeray/morality-ethics-theme.html The story focuses on the characters Emmy Sedley and Becky Sharpe (the latter as the clearly defined anti-hero), with the plot focused on the eventual marriage of these two characters to rich men, revealing character flaws as the story progresses. Even the most sympathetic characters, like Captain Dobbin, are susceptible to weakness, as he is often narcissistic and melancholy.\n\nThe larger-than-life hero is a more common feature of fantasy (particularly in comic-books and epic fantasy) than more realist works.L. Sprague de Camp, Literary Swordsmen and Sorcerers:  The Makers of Heroic Fantasy, p. 5  However, these larger-than life figures remain prevalent in society. The superhero genre is a multibillion-dollar industry that includes comic books, movies, toys and video games. Superheroes usually possess extraordinary talents and powers that no living human could ever emulate. The superhero stories often pit a super villain against the hero, with the hero fighting the crime caused by the super villain. Examples of long-running superheroes include Superman, Batman, Spider-Man and Wonder Woman.\n\nPsychology of heroism\n\nSocial psychology has begun paying attention to heroes and heroism. Zeno Franco and Philip Zimbardo point out differences between heroism and altruism, and they offer evidence that observers' perceptions of unjustified risk plays a role above and beyond risk type in determining the ascription of heroic status.\n\nAn evolutionary psychology explanation for heroic risk-taking is that it is a costly signal demonstrating the ability of the hero. It can be seen as one form of altruism for which there are also several other evolutionary explanations.Pat Barcaly. The evolution of charitable behaviour and the power of reputation. In \n\nRoma Chatterji has suggested that the hero or more generally protagonist is first and foremost a symbolic representation of the person who is experiencing the story while reading, listening or watching; thus the relevance of the hero to the individual relies a great deal on how much similarity there is between the two. One reason for the hero-as-self interpretation of stories and myths is the human inability to view the world from any perspective but a personal one. Hero. http://en.wikipedia.org/?curid=13706."
  }
}
