{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16121",
  "eid" : "23d3cea0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778569354,
  "textBody" : "Joshua or Jehoshua (, Yehōšuʿa) is the central figure in the Hebrew Bible's Book of Joshua. According to the books of Exodus, Numbers and Joshua, he was Moses' assistant and became the leader of the Israelite tribes after the death of Moses.Michael D. Coogan, A Brief Introduction to the Old Testament, pages 166–167, Oxford University Press, 2009 His name was Hoshe'a (הוֹשֵׁעַ) the son of Nun, of the tribe of Ephraim, but Moses called him Joshua (), the name by which he is commonly known. The name is shortened to Yeshua in Nehemiah (). According to the Bible he was born in Egypt prior to the Exodus.\n\nAccording to the Hebrew Bible, Joshua was one of the twelve spies of Israel sent by Moses to explore the land of Canaan. In , and after the death of Moses, he led the Israelite tribes in the conquest of Canaan, and allocated the land to the tribes. According to Biblical chronology, Joshua lived some time in the late Bronze Age. According to , Joshua died at the age of 110.\n\nJoshua also holds a position of respect among Muslims. According to Islamic tradition, he was, along with Caleb, one of the two believing spies whom Moses had sent to spy the land of Canaan. All Muslims also see Joshua as the leader of the Israelites, following the death of Moses. Some Muslims also believe Joshua to be the \"attendant\" of Moses mentioned in the Quran, before Moses meets Khidr and Joshua plays a significant role in Islamic literature with significant narration in the Hadith, therefore he is a point of study in comparative religion, see Joshua in Islam.\n\nName\n\nThe English name \"Joshua\" is a rendering of the Hebrew language \"Yehoshua\", meaning \"Yahweh is salvation\".A Hebrew and English Lexicon of the Old Testament Francis Brown, with S.R. Driver and C.A. Briggs, based on the lexicon of William Gesenius. Oxford: Clarendon Press. p. 221 & 446 The vocalization of the second name component may be read as Hoshea—the name used in the Torah before Moses added the divine name ().Joshua, New Bible Dictionary, second edition. 1987. Douglas JD, Hillyer N, eds., Tyndale House Publishers, Inc., Wheaton, IL, USA \n\n\"Jesus\" is the English derivative of the Greek transliteration of \"Yehoshua\" via Latin. In the Septuagint, all instances of the word \"Yehoshua\" are rendered as \"\" (Iēsoūs), the closest Greek pronunciation of the   , ).cf [http://bibledatabase.net/html/septuagint/04_013.htm Numbers 13:16 LXX]  (and Moses named Hosea, son of Naue, Jesus) Thus, in modern Greek, Joshua is called \"Jesus son of Naue\" () to differentiate him from Jesus Christ.  This is also true in the Slavic languages following the Eastern Orthodox tradition (e.g. \"\", Iisús Navín, in Bulgarian, Serbian and Russian).\n\nBiblical narrative\n\nThe Exodus\n\nJoshua was a major figure in the events of the Exodus. He was charged by Moses with selecting and commanding a militia group for their first battle after exiting Egypt, against the Amalekites in Rephidim (), in which they were victorious.\n\nHe later accompanied Moses when he ascended biblical Mount Sinai to commune with God,Exodus 24:13 visualize God's plan for the Israelite tabernacle and receive the Ten Commandments. Joshua was with Moses when he descended from the mountain, heard the Israelites' celebrations around the Golden Calf,Exodus 32:17 and broke the tablets bearing the words of the commandments. Similarly, in the narrative which refers to Moses being able to speak with God in his tent of meeting outside the camp, Joshua is seen as custodian of the tent ('tabernacle of meeting') when Moses returned to the Israelite encampment.Exodus 33:11 However, when Moses returned to the mountain to re-create the tablets recording the Ten Commandments, Joshua was not present, as the biblical text states 'no man shall come up with you'.Exodus 34:3\n\nLater, Joshua was identified as one of the twelve spies sent by Moses to explore and report on the land of Canaan (), and only he and Caleb gave an encouraging report, a reward for which would be that only these two of their entire generation would enter the promised land ().\n\nAccording to , God appointed Joshua to succeed Moses as leader of the Israelites along with giving him a blessing of invincibility during his lifetime (Joshua 1:5).Joshua Chapter 1 : Honour is here put upon Joshua, and great power lodged in his hand, by him that is ... him the administration, by virtue of his solemn ordination in Moses's life-time. ..... and it will entitle them to the best blessings: God shall give them the desire of ... be done, how invincible soever the difficulties may seem that lie in the way.\nThe first part of the book of Joshua covers the period when he led the conquest of Canaan.\n\nConquest of Canaan\n\nAt the Jordan River, the waters parted, as they had for Moses at the Red Sea. The first battle after the crossing of the Jordan was the Battle of Jericho. Joshua led the destruction of Jericho, then moved on to Ai, a small neighboring city to the west. However, they were defeated with thirty-six Israelite deaths. The defeat was attributed to Achan taking an \"accursed thing\" from Jericho; and was followed by Achan and his family and animals being stoned to death to restore God's favor. Joshua then went to defeat Ai.\n\nThe Israelites faced an alliance of five Amorite kings from Jerusalem, Hebron, Jarmuth, Lachish, and Eglon. At Gibeon, Joshua asked Yahweh to cause the sun and moon to stand still, so that he could finish the battle in daylight. This event is most notable because \"There has been no day like it before or since, when the Lord heeded the voice of a man, for the Lord fought for Israel.\" () God also fought for the Israelites in this battle, for he hurled huge hailstones from the sky which killed more Canaanites than those which the Israelites slaughtered. From there on, Joshua was able to lead the Israelites to several victories, securing much of the land of Canaan. He presided over the Israelite gatherings at Gilgal and Shiloh which allocated land to the tribes of Israel (Joshua 14:1-5 and 18:1-10), and the Israelites rewarded him with the Ephraimite city of Timnath-heres or Timnath-serah, where he settled (Joshua 19:50).\n\nDeath\n\nWhen he was \"old and well advanced in years\", Joshua convened the elders and chiefs of the Israelites and exhorted them to have no fellowship with the native population, because it could lead them to be unfaithful to God.,  At a general assembly of the clans at Shechem, he took leave of the people, admonishing them to be loyal to their God, who had been so mightily manifested in the midst of them. As a witness of their promise to serve God, Joshua set up a great stone under an oak by the sanctuary of God. Soon afterward he died, at the age of 110, and was buried at Timnath-heres, in the hill country of Ephraim, north of Mount Gaash.\n\nHistoricity\n\nThe prevailing scholarly view is that Joshua is not a factual account of historical events.McConville (2010), p.4 The apparent setting of Joshua is the 13th century BCE, a time of widespread city-destruction, but with a few exceptions (Hazor, Lachish) the destroyed cities are not the ones the Bible associates with Joshua, and the ones it does associate with him show little or no sign of even being occupied at the time.Miller&Hayes, pp. 71–2.\n\nThere is a consensus that the Joshua traditions in the Pentateuch are secondary additions. The spy story of Numbers 13–14; Deut. 1:34–7, in an earlier form only mentioned Caleb. E. Meyer and G. Hoelscher deny Joshua's existence as a historical reality and conclude that he is the legendary hero of a Josephite clan.Yohanan Aharoni, S. David Sperling. Encyclopaedia Judaica, 2nd ed. Volume 11. p. 442.\n\nCarolyn Pressler, in her 2002 commentary for the Westminster Bible Companion series, suggests that readers of the Book of Joshua should give priority to its theological message (\"what passages teach about God\") and be aware of what these would have meant to audiences in the 7th and 6th centuries BCE.Pressler, pp.5–6 Richard Nelson explains, \"The needs of the centralised monarchy favoured a single story of origins combining old traditions of an exodus from Egypt, belief in a national god as 'divine warrior,' and explanations for ruined cities, social stratification and ethnic groups, and contemporary tribes.\"Nelson, p.5\n\nAuthorship of the biblical Joshua narrative is ascribed to Joshua himself by Bava Batra 15a (Talmud) and early church fathers, but in 1943 Martin Noth published an argument that behind Joshua and other books was a unified \"Deuteronomistic history\", composed in the early part of the Babylonian captivity (6th century BCE). Most scholars today believe in some such composite, containing the epic history of the premonarchical period.[https://books.google.com/books?id6-VxwC5rQtwC&dq\nDever+What+did+the+biblical+writers+know&printsecfrontcover&source\nbn&hlen&ei\nKSVhS6P5MoqUkAXF34zzCw&saX&oi\nbook_result&ctresult&resnum\n4&ved0CBkQ6AEwAw#v\nonepage&q&f\nfalse Dever, William, \"What Did the Biblical Writers Know and When Did They Know It?\" (Eerdmans, 2001)] 2001, p. 100.\n\nInternal evidence of the book of Joshua, and the repeated use of the phrase 'to this day' suggests that the events that it recounts took place some time before they were recorded.\n\nThe first record of the name Israel occurs in the Merneptah stele, erected for Egyptian Pharaoh Merneptah c. 1209 BCE, \"Israel is laid waste and his seed is not.\"Stager in Coogan 1998, p. 91. William Dever sees this \"Israel\" in the central highlands as a cultural and probably political entity, well enough established to be perceived by the Egyptians as a possible challenge to their hegemony, but an ethnic group rather than an organised state.Dever 2003, p. 206.\n\nThe number of villages in the highlands increased to more than 300 by the end of Iron Age IMcNutt 1999, p. 47. (more and larger in the north), with the settled population rising from 20,000 in the twelfth century to 40,000 in the eleventh.McNutt 1999, p. 70. The villagers probably shared the highlands with other communities such as pastoral nomads, but only villagers left sufficient remains to determine their settlement patterns.McNutt 1999, p. 69. Archaeologists and historians see more continuity than discontinuity between these highland settlements and the preceding Late Bronze Age Canaanite culture.Bright 2000, p. 472. Certain features, such as ceramic repertoire and agrarian settlement plans, have been said to be distinctives of highland sites,Killebrew 2005, p. 13. and collar-rimmed jars and four-roomed houses have been said to be intrinsically \"Israelite\", but have also been said to belong to a commonly shared culture throughout Iron I Canaan.Miller 1986, p. 72. While some archaeologists interpret the absence of pig bones from the highland sites as an indicator of ethnicity,Killebrew 2005, p. 176. this is not certain.Bright 2000, p. 473. Villages had populations of up to 300 or 400,Miller 2005, p. 98. which lived by farming and herding and were largely self-sufficient;McNutt 1999, p. 72. economic interchange was prevalent.Miller 2005, p. 99.\n\nAccording to Ann E. Killebrew, \"Most scholars today accept that the majority of the conquest narratives in the book of Joshua are devoid of historical reality\".Miller 1977, 87–93; Van Seters 1983, 322–37; Schoors 1987, 77-92; Na'aman 1994b, 218-30, 249-50\n\nThe question of the date and degrees of conquest and/or assimilation of the indigenous population is uncertain, as academics and archaeologists differ in their interpretation of the archaeological and other evidence.\"Introduction to the Old Testament, chapter on Joshua, by T. Longman and R. Dillard, Zondervan Books (2006)\n\nViews\n\nIn rabbinical literature\n\nIn rabbinic literature Joshua is regarded as a faithful, humble, deserving, wise man. Biblical verses illustrative of these qualities and of their reward are applied to him. \"He that waits on his master shall be honored\" (Pro. xxvii. 18) is construed as a reference to Joshua (Midrash Numbers Rabbah xii.), as is also the first part of the same verse, \"Whoso keepes the fig-tree shall eat the fruit thereof\" (Midrash Yalk., Josh. 2; Numbers Rabbah xii. 21). That \"honor shall uphold the humble in spirit\" (Pro. xxix. 23) is proved by Joshua's victory over Amalek (Midrash Numbers Rabbah xiii). Not the sons of Moses—as Moses himself had expected—but Joshua was appointed successor to the son of Amram (Midrash Numbers Rabbah xii). Moses was shown how Joshua reproved that Othniel (Yalḳ., Num. 776).\n\nIn Christianity\n\nMost modern Bibles translate  to identify Jesus as a better Joshua, as Joshua led Israel into the rest of Canaan, but Jesus leads the people of God into \"God's rest\". Among the early Church Fathers, Joshua is considered a type of Jesus Christ.\n\nIn Islam\n\nJoshua is not mentioned by name in the Qur’ān, but his name appears in other Islamic literature. In the Qur'anic account of the conquest of Canaan, Joshua and Caleb are referenced, but not named, as two \"Allah-fearing men\", on whom God \"had bestowed His grace\".Abdullah Yusuf Ali, The Holy Qur'an: Text, Translation and Commentary, Note. 726 to verse 23: \"Among those who returned after spying out the land were two men who had faith and courage. They were Joshua and Caleb. Joshua afterwards succeeded Moses in the leadership after 40 years. These two men pleaded for an immediate entry through the proper Gate, which I understand to mean, \"after taking all due precautions and making all due preparations.\" Cf. 2:189 and n. 203. But of course, they said, they must put their trust in Allah for victory.\"\n\nAlthough Joshua was regarded by some classical scholars as the prophetic successor to Moses (),Joshua is mentioned as a prophet in Ibn Kathir's Stories of the Prophets Tabari relates in his History of the Prophets and Kings that Joshua was one of the twelve spies and Muslim scholars believe that the two believing spies referred to in the Qur’ān are Joshua and Caleb. Joshua was exceptional among the Israelites for being one of the few faithful followers of Allah.\n\nJoshua is further mentioned in Islamic literature, and significant events from his Muslim narratives include the crossing of the Jordan river and the conquest of Bait al-Maqdis.Tabari, History of the Prophets and Kings, Vol. I:  414–429, 498–499, 503–516 But Muslim literature also preserves traditions of Joshua not found in the Hebrew Bible. Joshua is credited with being present at Moses's death and literature records that Moses's garments were with Joshua at the time of his departure.Encyclopedia of Islam, Vol. XI, pg. 351, Yusha ibn Nun [Joshua, son of Nun] In Sahih Bukhari and Sahih Muslim, Joshua is mentioned as Yusha' bin Nun and is the attendant to Moses during his meeting with Khidr.Bukhari, Book 6, Volume 60, Hadiths 249, 250, 251: Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))Bukhari, Book 1, Volume 3, Hadith 124: KnowledgeMuslim, Book 30, Hadith 5864: The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His Companions (Kitab Al-Fada'il)\n\nJoshua is believed by some Muslims to be buried on Joshua's Hill in the Beykoz district of Istanbul. Alternative traditional sites for the Prophet's tomb are situated in Israel (the Shia shrine at Al-Nabi Yusha'), Jordan (An-Nabi Yusha’ bin Noon, a Sunni shrine near the city of Al-SaltMazar Hazrat Yusha’ bin Noon, on the website of the Islamic Supreme Council of Canada  [http://www.islamicsupremecouncil.com/islamic-heritage-tabarrukat/]Tomb of Prophet Yusha' (photo of the tomb; Islamic view on Prophet Yusha'/Joshua) [http://www.islamiclandmarks.com/jordan/tomb-of-yusha-as]) and Iraq (the Nabi Yusha' shrine of Baghdad).\n\nIn art and literature\n\n* In the literary tradition of medieval Europe, Joshua is known as one of the Nine Worthies.\n* In The Divine Comedy Joshua's spirit appears to Dante in the Heaven of Mars, where he is grouped with the other \"warriors of the faith.\"\n* Baroque composer Georg Frideric Handel composed the oratorio \"Joshua\" in 1747. Composer Franz Waxman composed an oratorio \"Joshua\" in 1959.\n\nYahrtzeit\n\nThe annual commemoration of Joshua's yahrtzeit (the anniversary of his death) is marked on the 26th of Nisan on the Hebrew calendar. Thousands make the pilgrimage to the Tomb of Joshua in Kifl Haris on the preceding night.\n\nYom HaAliyah\n\nYom HaAliyah (Aliyah Day) () is an Israeli national holiday celebrated annually on the tenth of the Hebrew month of Nisan to commemorate Joshua having led the Israelites across the Jordan River into the Land of Israel while carrying the Ark of the Covenant.\n\nJoshua tree\n\nLegend has it that Mormon pioneers in the United States first referred to the yucca brevifolia agave plant as the Joshua tree because its branches reminded them of Joshua stretching his arms upward in supplication, guiding the travelers westward.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Joshua" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16121" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Joshua or Jehoshua (, Yehōšuʿa) is the central figure in the Hebrew Bible's Book of Joshua. According to the books of Exodus, Numbers and Joshua, he was Moses' assistant and became the leader of the Israelite tribes after the death of Moses.Michael D. Coogan, A Brief Introduction to the Old Testament, pages 166–167, Oxford University Press, 2009 His name was Hoshe'a (הוֹשֵׁעַ) the son of Nun, of the tribe of Ephraim, but Moses called him Joshua (), the name by which he is commonly known. The name is shortened to Yeshua in Nehemiah (). According to the Bible he was born in Egypt prior to the Exodus.\n\nAccording to the Hebrew Bible, Joshua was one of the twelve spies of Israel sent by Moses to explore the land of Canaan. In , and after the death of Moses, he led the Israelite tribes in the conquest of Canaan, and allocated the land to the tribes. According to Biblical chronology, Joshua lived some time in the late Bronze Age. According to , Joshua died at the age of 110.\n\nJoshua also holds a position of respect among Muslims. According to Islamic tradition, he was, along with Caleb, one of the two believing spies whom Moses had sent to spy the land of Canaan. All Muslims also see Joshua as the leader of the Israelites, following the death of Moses. Some Muslims also believe Joshua to be the \"attendant\" of Moses mentioned in the Quran, before Moses meets Khidr and Joshua plays a significant role in Islamic literature with significant narration in the Hadith, therefore he is a point of study in comparative religion, see Joshua in Islam.\n\nName\n\nThe English name \"Joshua\" is a rendering of the Hebrew language \"Yehoshua\", meaning \"Yahweh is salvation\".A Hebrew and English Lexicon of the Old Testament Francis Brown, with S.R. Driver and C.A. Briggs, based on the lexicon of William Gesenius. Oxford: Clarendon Press. p. 221 & 446 The vocalization of the second name component may be read as Hoshea—the name used in the Torah before Moses added the divine name ().Joshua, New Bible Dictionary, second edition. 1987. Douglas JD, Hillyer N, eds., Tyndale House Publishers, Inc., Wheaton, IL, USA \n\n\"Jesus\" is the English derivative of the Greek transliteration of \"Yehoshua\" via Latin. In the Septuagint, all instances of the word \"Yehoshua\" are rendered as \"\" (Iēsoūs), the closest Greek pronunciation of the   , ).cf [http://bibledatabase.net/html/septuagint/04_013.htm Numbers 13:16 LXX]  (and Moses named Hosea, son of Naue, Jesus) Thus, in modern Greek, Joshua is called \"Jesus son of Naue\" () to differentiate him from Jesus Christ.  This is also true in the Slavic languages following the Eastern Orthodox tradition (e.g. \"\", Iisús Navín, in Bulgarian, Serbian and Russian).\n\nBiblical narrative\n\nThe Exodus\n\nJoshua was a major figure in the events of the Exodus. He was charged by Moses with selecting and commanding a militia group for their first battle after exiting Egypt, against the Amalekites in Rephidim (), in which they were victorious.\n\nHe later accompanied Moses when he ascended biblical Mount Sinai to commune with God,Exodus 24:13 visualize God's plan for the Israelite tabernacle and receive the Ten Commandments. Joshua was with Moses when he descended from the mountain, heard the Israelites' celebrations around the Golden Calf,Exodus 32:17 and broke the tablets bearing the words of the commandments. Similarly, in the narrative which refers to Moses being able to speak with God in his tent of meeting outside the camp, Joshua is seen as custodian of the tent ('tabernacle of meeting') when Moses returned to the Israelite encampment.Exodus 33:11 However, when Moses returned to the mountain to re-create the tablets recording the Ten Commandments, Joshua was not present, as the biblical text states 'no man shall come up with you'.Exodus 34:3\n\nLater, Joshua was identified as one of the twelve spies sent by Moses to explore and report on the land of Canaan (), and only he and Caleb gave an encouraging report, a reward for which would be that only these two of their entire generation would enter the promised land ().\n\nAccording to , God appointed Joshua to succeed Moses as leader of the Israelites along with giving him a blessing of invincibility during his lifetime (Joshua 1:5).Joshua Chapter 1 : Honour is here put upon Joshua, and great power lodged in his hand, by him that is ... him the administration, by virtue of his solemn ordination in Moses's life-time. ..... and it will entitle them to the best blessings: God shall give them the desire of ... be done, how invincible soever the difficulties may seem that lie in the way.\nThe first part of the book of Joshua covers the period when he led the conquest of Canaan.\n\nConquest of Canaan\n\nAt the Jordan River, the waters parted, as they had for Moses at the Red Sea. The first battle after the crossing of the Jordan was the Battle of Jericho. Joshua led the destruction of Jericho, then moved on to Ai, a small neighboring city to the west. However, they were defeated with thirty-six Israelite deaths. The defeat was attributed to Achan taking an \"accursed thing\" from Jericho; and was followed by Achan and his family and animals being stoned to death to restore God's favor. Joshua then went to defeat Ai.\n\nThe Israelites faced an alliance of five Amorite kings from Jerusalem, Hebron, Jarmuth, Lachish, and Eglon. At Gibeon, Joshua asked Yahweh to cause the sun and moon to stand still, so that he could finish the battle in daylight. This event is most notable because \"There has been no day like it before or since, when the Lord heeded the voice of a man, for the Lord fought for Israel.\" () God also fought for the Israelites in this battle, for he hurled huge hailstones from the sky which killed more Canaanites than those which the Israelites slaughtered. From there on, Joshua was able to lead the Israelites to several victories, securing much of the land of Canaan. He presided over the Israelite gatherings at Gilgal and Shiloh which allocated land to the tribes of Israel (Joshua 14:1-5 and 18:1-10), and the Israelites rewarded him with the Ephraimite city of Timnath-heres or Timnath-serah, where he settled (Joshua 19:50).\n\nDeath\n\nWhen he was \"old and well advanced in years\", Joshua convened the elders and chiefs of the Israelites and exhorted them to have no fellowship with the native population, because it could lead them to be unfaithful to God.,  At a general assembly of the clans at Shechem, he took leave of the people, admonishing them to be loyal to their God, who had been so mightily manifested in the midst of them. As a witness of their promise to serve God, Joshua set up a great stone under an oak by the sanctuary of God. Soon afterward he died, at the age of 110, and was buried at Timnath-heres, in the hill country of Ephraim, north of Mount Gaash.\n\nHistoricity\n\nThe prevailing scholarly view is that Joshua is not a factual account of historical events.McConville (2010), p.4 The apparent setting of Joshua is the 13th century BCE, a time of widespread city-destruction, but with a few exceptions (Hazor, Lachish) the destroyed cities are not the ones the Bible associates with Joshua, and the ones it does associate with him show little or no sign of even being occupied at the time.Miller&Hayes, pp. 71–2.\n\nThere is a consensus that the Joshua traditions in the Pentateuch are secondary additions. The spy story of Numbers 13–14; Deut. 1:34–7, in an earlier form only mentioned Caleb. E. Meyer and G. Hoelscher deny Joshua's existence as a historical reality and conclude that he is the legendary hero of a Josephite clan.Yohanan Aharoni, S. David Sperling. Encyclopaedia Judaica, 2nd ed. Volume 11. p. 442.\n\nCarolyn Pressler, in her 2002 commentary for the Westminster Bible Companion series, suggests that readers of the Book of Joshua should give priority to its theological message (\"what passages teach about God\") and be aware of what these would have meant to audiences in the 7th and 6th centuries BCE.Pressler, pp.5–6 Richard Nelson explains, \"The needs of the centralised monarchy favoured a single story of origins combining old traditions of an exodus from Egypt, belief in a national god as 'divine warrior,' and explanations for ruined cities, social stratification and ethnic groups, and contemporary tribes.\"Nelson, p.5\n\nAuthorship of the biblical Joshua narrative is ascribed to Joshua himself by Bava Batra 15a (Talmud) and early church fathers, but in 1943 Martin Noth published an argument that behind Joshua and other books was a unified \"Deuteronomistic history\", composed in the early part of the Babylonian captivity (6th century BCE). Most scholars today believe in some such composite, containing the epic history of the premonarchical period.[https://books.google.com/books?id6-VxwC5rQtwC&dq\nDever+What+did+the+biblical+writers+know&printsecfrontcover&source\nbn&hlen&ei\nKSVhS6P5MoqUkAXF34zzCw&saX&oi\nbook_result&ctresult&resnum\n4&ved0CBkQ6AEwAw#v\nonepage&q&f\nfalse Dever, William, \"What Did the Biblical Writers Know and When Did They Know It?\" (Eerdmans, 2001)] 2001, p. 100.\n\nInternal evidence of the book of Joshua, and the repeated use of the phrase 'to this day' suggests that the events that it recounts took place some time before they were recorded.\n\nThe first record of the name Israel occurs in the Merneptah stele, erected for Egyptian Pharaoh Merneptah c. 1209 BCE, \"Israel is laid waste and his seed is not.\"Stager in Coogan 1998, p. 91. William Dever sees this \"Israel\" in the central highlands as a cultural and probably political entity, well enough established to be perceived by the Egyptians as a possible challenge to their hegemony, but an ethnic group rather than an organised state.Dever 2003, p. 206.\n\nThe number of villages in the highlands increased to more than 300 by the end of Iron Age IMcNutt 1999, p. 47. (more and larger in the north), with the settled population rising from 20,000 in the twelfth century to 40,000 in the eleventh.McNutt 1999, p. 70. The villagers probably shared the highlands with other communities such as pastoral nomads, but only villagers left sufficient remains to determine their settlement patterns.McNutt 1999, p. 69. Archaeologists and historians see more continuity than discontinuity between these highland settlements and the preceding Late Bronze Age Canaanite culture.Bright 2000, p. 472. Certain features, such as ceramic repertoire and agrarian settlement plans, have been said to be distinctives of highland sites,Killebrew 2005, p. 13. and collar-rimmed jars and four-roomed houses have been said to be intrinsically \"Israelite\", but have also been said to belong to a commonly shared culture throughout Iron I Canaan.Miller 1986, p. 72. While some archaeologists interpret the absence of pig bones from the highland sites as an indicator of ethnicity,Killebrew 2005, p. 176. this is not certain.Bright 2000, p. 473. Villages had populations of up to 300 or 400,Miller 2005, p. 98. which lived by farming and herding and were largely self-sufficient;McNutt 1999, p. 72. economic interchange was prevalent.Miller 2005, p. 99.\n\nAccording to Ann E. Killebrew, \"Most scholars today accept that the majority of the conquest narratives in the book of Joshua are devoid of historical reality\".Miller 1977, 87–93; Van Seters 1983, 322–37; Schoors 1987, 77-92; Na'aman 1994b, 218-30, 249-50\n\nThe question of the date and degrees of conquest and/or assimilation of the indigenous population is uncertain, as academics and archaeologists differ in their interpretation of the archaeological and other evidence.\"Introduction to the Old Testament, chapter on Joshua, by T. Longman and R. Dillard, Zondervan Books (2006)\n\nViews\n\nIn rabbinical literature\n\nIn rabbinic literature Joshua is regarded as a faithful, humble, deserving, wise man. Biblical verses illustrative of these qualities and of their reward are applied to him. \"He that waits on his master shall be honored\" (Pro. xxvii. 18) is construed as a reference to Joshua (Midrash Numbers Rabbah xii.), as is also the first part of the same verse, \"Whoso keepes the fig-tree shall eat the fruit thereof\" (Midrash Yalk., Josh. 2; Numbers Rabbah xii. 21). That \"honor shall uphold the humble in spirit\" (Pro. xxix. 23) is proved by Joshua's victory over Amalek (Midrash Numbers Rabbah xiii). Not the sons of Moses—as Moses himself had expected—but Joshua was appointed successor to the son of Amram (Midrash Numbers Rabbah xii). Moses was shown how Joshua reproved that Othniel (Yalḳ., Num. 776).\n\nIn Christianity\n\nMost modern Bibles translate  to identify Jesus as a better Joshua, as Joshua led Israel into the rest of Canaan, but Jesus leads the people of God into \"God's rest\". Among the early Church Fathers, Joshua is considered a type of Jesus Christ.\n\nIn Islam\n\nJoshua is not mentioned by name in the Qur’ān, but his name appears in other Islamic literature. In the Qur'anic account of the conquest of Canaan, Joshua and Caleb are referenced, but not named, as two \"Allah-fearing men\", on whom God \"had bestowed His grace\".Abdullah Yusuf Ali, The Holy Qur'an: Text, Translation and Commentary, Note. 726 to verse 23: \"Among those who returned after spying out the land were two men who had faith and courage. They were Joshua and Caleb. Joshua afterwards succeeded Moses in the leadership after 40 years. These two men pleaded for an immediate entry through the proper Gate, which I understand to mean, \"after taking all due precautions and making all due preparations.\" Cf. 2:189 and n. 203. But of course, they said, they must put their trust in Allah for victory.\"\n\nAlthough Joshua was regarded by some classical scholars as the prophetic successor to Moses (),Joshua is mentioned as a prophet in Ibn Kathir's Stories of the Prophets Tabari relates in his History of the Prophets and Kings that Joshua was one of the twelve spies and Muslim scholars believe that the two believing spies referred to in the Qur’ān are Joshua and Caleb. Joshua was exceptional among the Israelites for being one of the few faithful followers of Allah.\n\nJoshua is further mentioned in Islamic literature, and significant events from his Muslim narratives include the crossing of the Jordan river and the conquest of Bait al-Maqdis.Tabari, History of the Prophets and Kings, Vol. I:  414–429, 498–499, 503–516 But Muslim literature also preserves traditions of Joshua not found in the Hebrew Bible. Joshua is credited with being present at Moses's death and literature records that Moses's garments were with Joshua at the time of his departure.Encyclopedia of Islam, Vol. XI, pg. 351, Yusha ibn Nun [Joshua, son of Nun] In Sahih Bukhari and Sahih Muslim, Joshua is mentioned as Yusha' bin Nun and is the attendant to Moses during his meeting with Khidr.Bukhari, Book 6, Volume 60, Hadiths 249, 250, 251: Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))Bukhari, Book 1, Volume 3, Hadith 124: KnowledgeMuslim, Book 30, Hadith 5864: The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His Companions (Kitab Al-Fada'il)\n\nJoshua is believed by some Muslims to be buried on Joshua's Hill in the Beykoz district of Istanbul. Alternative traditional sites for the Prophet's tomb are situated in Israel (the Shia shrine at Al-Nabi Yusha'), Jordan (An-Nabi Yusha’ bin Noon, a Sunni shrine near the city of Al-SaltMazar Hazrat Yusha’ bin Noon, on the website of the Islamic Supreme Council of Canada  [http://www.islamicsupremecouncil.com/islamic-heritage-tabarrukat/]Tomb of Prophet Yusha' (photo of the tomb; Islamic view on Prophet Yusha'/Joshua) [http://www.islamiclandmarks.com/jordan/tomb-of-yusha-as]) and Iraq (the Nabi Yusha' shrine of Baghdad).\n\nIn art and literature\n\n* In the literary tradition of medieval Europe, Joshua is known as one of the Nine Worthies.\n* In The Divine Comedy Joshua's spirit appears to Dante in the Heaven of Mars, where he is grouped with the other \"warriors of the faith.\"\n* Baroque composer Georg Frideric Handel composed the oratorio \"Joshua\" in 1747. Composer Franz Waxman composed an oratorio \"Joshua\" in 1959.\n\nYahrtzeit\n\nThe annual commemoration of Joshua's yahrtzeit (the anniversary of his death) is marked on the 26th of Nisan on the Hebrew calendar. Thousands make the pilgrimage to the Tomb of Joshua in Kifl Haris on the preceding night.\n\nYom HaAliyah\n\nYom HaAliyah (Aliyah Day) () is an Israeli national holiday celebrated annually on the tenth of the Hebrew month of Nisan to commemorate Joshua having led the Israelites across the Jordan River into the Land of Israel while carrying the Ark of the Covenant.\n\nJoshua tree\n\nLegend has it that Mormon pioneers in the United States first referred to the yucca brevifolia agave plant as the Joshua tree because its branches reminded them of Joshua stretching his arms upward in supplication, guiding the travelers westward. Joshua. http://en.wikipedia.org/?curid=16121."
  }
}
