{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8233",
  "eid" : "e68cb430-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778466547,
  "textBody" : "Death metal is an extreme subgenre of heavy metal music. It typically employs heavily distorted and low-tuned guitars, played with techniques such as palm muting and tremolo picking, deep growling vocals, aggressive, powerful drumming featuring double kick or blast beat techniques, minor keys or atonality, abrupt tempo, key, and time signature changes and chromatic chord progressions. The lyrical themes of death metal may invoke slasher film-stylized violence,Moynihan, Michael, and Dirik Søderlind (1998). Lords of Chaos (2nd ed.). Feral House. , p. 27 religion (sometimes Satanism), occultism, Lovecraftian horror, nature, mysticism, mythology, philosophy, science fiction, and politics,[http://www.wikihow.com/Appreciate-Death-Metal Wikihow: How to Appreciate Death Metal] and they may describe extreme acts, including mutilation, dissection, torture, rape, cannibalism, and necrophilia.\n\nBuilding from the musical structure of thrash metal and early black metal, death metal emerged during the mid-1980s. Bands such as Venom, Celtic Frost, Slayer, and Kreator were important influences on the genre's creation. Possessed and Death, along with bands such as Obituary, Autopsy and Morbid Angel, are often considered pioneers of the genre. In the late 1980s and early 1990s, death metal gained more media attention as popular genre niche record labels like Combat, Earache, and Roadrunner, began to sign death metal bands at a rapid rate.\n\nSince then, death metal has diversified, spawning several subgenres. Melodic death metal combines death metal elements with those of the new wave of British heavy metal. Technical death metal is a complex style, with uncommon time signatures, atypical rhythms and unusual harmonies and melodies. Death-doom combines the deep growled vocals and double-kick drumming of death metal with the slow tempos and melancholic atmosphere of doom metal. Deathgrind, goregrind and pornogrind mix the complexity of death metal with the intensity, speed, and brevity of grindcore. Deathcore combines death metal with metalcore traits. Death 'n' roll combines death metal's growled vocals and highly distorted, detuned guitar riffs with elements of 1970s hard rock and heavy metal.\n\nHistory\n\nEmergence and early history\n\nEnglish heavy metal band Venom, from Newcastle, crystallized the elements of what later became known as thrash metal, death metal and black metal, with their 1981 album Welcome to Hell. Their dark, blistering sound, harsh vocals, and macabre, proudly Satanic imagery proved a major inspiration for extreme metal bands. Another highly influential band, Slayer, formed in 1981. Although the band was a thrash metal act, Slayer's music was more violent than their thrash contemporaries Metallica, Megadeth, and Anthrax. Their breakneck speed and instrumental prowess combined with lyrics about death, violence, war, and Satanism won Slayer a rabid cult following. According to AllMusic, their third album Reign in Blood inspired the entire death metal genre. It had a big impact on genre leaders such as Death, Obituary, and Morbid Angel.\n\nPossessed, a band that formed in the San Francisco Bay Area during 1983, is described by Allmusic as \"connecting the dots\" between thrash metal and death metal with their 1985 debut album, Seven Churches. While attributed as having a Slayer influence, current and former members of the band had actually cited Venom and Motörhead, as well as early work by Exodus, as the main influences on their sound. Although the group had released only two studio albums and an EP in their formative years, they have been described by music journalists and musicians as either being \"monumental\" in developing the death metal style, or as being the first death metal band. Earache Records noted that \"the likes of Trey Azagthoth and Morbid Angel based what they were doing in their formative years on the Possessed blueprint laid down on the legendary Seven Churches recording. Possessed arguably did more to further the cause of 'Death Metal' than any of the early acts on the scene back in the mid-late 80's.\"\n\nDuring the same period as the dawn of Possessed, a second influential metal band was formed in Orlando, Florida: Death. Death, originally called Mantas, was formed in 1983 by Chuck Schuldiner, Kam Lee, and Rick Rozz. In 1984 they released their first demo entitled Death by Metal, followed by several more. The tapes circulated through the tape trader world, quickly establishing the band's name. With Death guitarist Schuldiner adopting vocal duties, the band made a major impact on the scene. The fast minor-key riffs and solos were complemented with fast drumming, creating a style that would catch on in tape trading circles. Schuldiner has been credited by Allmusic's Eduardo Rivadavia for being widely recognized as the \"Father of Death Metal\". Death's 1987 debut release, Scream Bloody Gore, has been described by About.com's Chad Bowar as being the \"evolution from thrash metal to death metal\", and \"the first true death metal record\" by the San Francisco Chronicle. Along with Possessed and Death, other pioneers of death metal in the United States include Macabre, Necrophagia, Master, Massacre, Immolation, Cannibal Corpse, and Post Mortem.\n\nGrowing popularity\n\nBy 1989, many bands had been signed by eager record labels wanting to cash in on the subgenre, including Florida's Obituary, Morbid Angel and Deicide. This collective of death metal bands hailing from Florida are often labeled as \"Florida death metal\". Morbid Angel pushed the genre to its most extreme level, both musically and lyrically, with the release of their debut album Altars of Madness in 1989. The album \"redefined what it meant to be heavy while influencing an upcoming class of brutal death metal.\" Death metal spread to Sweden in the late 1980s, flourishing with pioneers such as Carnage, God Macabre, Entombed, Dismember and Unleashed. In the early 1990s, the rise of melodic death metal was recognized, with bands such as Dark Tranquillity, At the Gates, and In Flames.\n\nFollowing the original death metal innovators, new subgenres began by the end of the decade. British band Napalm Death became increasingly associated with death metal, in particular, on 1990s Harmony Corruption. This album displays aggressive and fairly technical guitar riffing, complex rhythmics, a sophisticated growling vocal delivery by Mark \"Barney\" Greenway, and socially aware lyrical subjects, leading to a merging with the \"grindcore\" subgenre. Other bands contributing significantly to this early movement include Britain's Bolt Thrower and Carcass, and New York's Suffocation.\n\nTo close the circle, Death released their fourth album Human in 1991. Death's founder Schuldiner helped push the boundaries of uncompromising speed and technical virtuosity, mixing technical and intricate rhythm guitar work with complex arrangements and emotive guitar solos.[http://www.emptywords.org Empty Words, where there are dozens of reviews along this line] Other examples are Carcass's Necroticism – Descanting the Insalubrious, Suffocation's Effigy of the Forgotten and Entombed's Clandestine from 1991. At this point, all the above characteristics are present: abrupt tempo and count changes, on occasion extremely fast drumming, morbid lyrics and growling vocal delivery.\n\nEarache Records, Relativity Records and Roadrunner Records became the genre's most important labels,'Death Metal Special: Dealers in Death' Terrorizer #151 with Earache releasing albums by Carcass, Napalm Death, Morbid Angel, and Entombed, and Roadrunner releasing albums by Obituary, and Pestilence. Although these labels had not been death metal labels, initially, they became the genre's flagship labels in the beginning of the 1990s. In addition to these, other labels formed as well, such as Nuclear Blast, Century Media, and Peaceville. Many of these labels would go on to achieve successes in other genres of metal throughout the 1990s.\n\nIn September 1990, Death's manager Eric Greif held one of the first North American death metal festivals, Day of Death, in Milwaukee suburb Waukesha, Wisconsin, and featured 26 bands including Autopsy, Broken Hope, Hellwitch, Obliveon, Revenant, Viogression, Immolation, Atheist, and Cynic.[http://www.officialatheist.com/index.php?item=biography Biography, Official Atheist site] . Retrieved December 10, 2008\n\nLater history\n\nDeath metal's popularity achieved its initial peak between the 1992–93 era, with some bands such as Morbid Angel, Cannibal Corpse, as well as Obituary, enjoying mild commercial success. However, the genre as a whole never broke into the mainstream. The genre's mounting popularity may have been partly responsible for a strong rivalry between Norwegian black metal and Swedish death metal scenes. Fenriz of Darkthrone has noted that Norwegian black metal musicians were \"fed up with the whole death metal scene\" at the time. Death metal diversified in the 1990s, spawning a rich variety of subgenres which still have a large \"underground\" following at the present.\n\nCharacteristics\n\nInstrumentation\n\nThe setup most frequently used within the death metal genre is two guitarists, a bass player, a vocalist and a drummer often using \"hyper double-bass blast beats\". Although this is the standard setup, bands have been known to occasionally incorporate other instruments such as electronic keyboards.[http://heavymetal.about.com/od/heavymetal101/p/melodicdeathmetalprofile.htm Marsicano, D. Melodic Death Metal], About.com (Retrieved October 27, 2010) The genre is often identified by fast, heavily distorted and low tuned guitars, played with techniques such as palm muting and tremolo picking. The percussion is usually aggressive and powerful.\n\nDeath metal is known for its abrupt tempo, key, and time signature changes. Death metal may include chromatic chord progressions and a varied song structure. In some circumstances, the style will incorporate melodic riffs and harmonies for effect. This incorporation of melody and harmonious playing was even further used in the creation of melodic death metal. These compositions tend to emphasize an ongoing development of themes and motifs.\n\nVocals and lyrics\n\nDeath metal vocals are referred to as death growls; hoarse roars/snarls. Death growling is mistakenly thought to be a form of screaming using the lowest vocal register known as vocal fry, however vocal fry is actually a form of overtone screaming, and while growling can be performed this way by experienced vocalists who use the fry screaming technique, \"true\" death growling is in fact created by an altogether different technique.Interview with Samuel Deschaine, Death Metal Vocal Instructor 2011 The three major methods of harsh vocalization used in the genre are often mistaken for each other, encompassing vocal fry screaming, false chord screaming, and \"true\" death growls. Growling is sometimes also referred to as Cookie Monster vocals, tongue-in-cheek, due to the vocal similarity to the voice of the popular Sesame Street character of the same name. Although often criticized, death growls serve the aesthetic purpose of matching death metal's aggressive lyrical content.Sharpe-Young, Garry. Death Metal,  High-pitched screaming is occasionally utilized in death metal, being heard in songs by Death, Aborted, Exhumed, Dying Fetus, Cannibal Corpse, and Deicide.\n\nThe lyrical themes of death metal may invoke slasher film-stylised violence, but may also extend to topics like Satanism, religion, occultism, Lovecraftian horror, nature, mysticism, philosophy, science fiction, and politics. Although violence may be explored in various other genres as well, death metal may elaborate on the details of extreme acts, including mutilation, dissection, torture, rape, cannibalism, and necrophilia. Sociologist Keith Kahn-Harris commented this apparent glamorisation of violence may be attributed to a \"fascination\" with the human body that all people share to some degree, a fascination which mixes desire and disgust. Heavy metal author Gavin Baddeley also stated there does seem to be a connection between \"how acquainted one is with their own mortality\" and \"how much they crave images of death and violence\" via the media.Baddeley, Gavin. Raising Hell!: The Book of Satan and Rock 'n' Roll Additionally, contributing artists to the genre often defend death metal as little more than an extreme form of art and entertainment, similar to horror films in the motion picture industry. This explanation has brought such musicians under fire from activists internationally, who claim that this is often lost on a large number of adolescents, who are left with the glamorisation of such violence without social context or awareness of why such imagery is stimulating.\n\nAccording to Alex Webster, bassist of Cannibal Corpse, \"The gory lyrics are probably not, as much as people say, [what's keeping us] from being mainstream. Like, 'death metal would never go into the mainstream because the lyrics are too gory?' I think it's really the music, because violent entertainment is totally mainstream.\"[http://www.waytooloud.com/2007/10/23/cannibal-corpse-alex-webster-and-george-%E2%80%9Ccorpsegrinder%E2%80%9D-fisher/ Alex Webster (Cannibal Corpse) interview] \n\nOrigin of the term\n\nThe most popular theory of the subgenre's christening is Possessed's 1984 demo, Death Metal; the song from the eponymous demo would also be featured on the band's 1985 debut album, Seven Churches. Possessed vocalist/bassist Jeff Becerra said he coined the term in early 1983 for a high school English class assignment. Another possible origin was a magazine called Death Metal, started by Thomas Fischer and Martin Ain of Hellhammer and Celtic Frost. The name was later given to the 1984 compilation Death Metal released by Noise Records. The term might also have originated from other recordings, such as the demo released by Death in 1984, called Death by Metal.\n\nSubgenres and fusion genres\n\nCited examples are not necessarily exclusive to one particular style. Many bands can easily be placed in two or more of the following categories, and a band's specific categorization is often a source of contention due to personal opinion and interpretation.\n* Melodic death metal: Scandinavian death metal could be considered the forerunner of \"melodic death metal\". Melodic death metal, sometimes referred to as \"melodeath\", is traditional heavy metal mixed with some death metal elements. Unlike most other death metal, melodeath usually features screams instead of growls, slower tempos, much more melody and even clean vocals are heard at rare times. Carcass is sometimes credited with releasing the first melodic death metal album with 1993's Heartwork, although Swedish bands In Flames, Dark Tranquillity, and At the Gates are usually mentioned as the main pioneers of the genre and of the Gothenburg metal sound.\n\n* Technical death metal: Technical death metal and progressive death metal are related terms that refer to bands distinguished by the complexity of their music. Common traits are dynamic song structures, uncommon time signatures, atypical rhythms and unusual harmonies and melodies. Bands described as technical death metal or progressive death metal usually fuse common death metal aesthetics with elements of progressive rock, jazz or classical music. While the term technical death metal is sometimes used to describe bands that focus on speed and extremity as well as complexity, the line between progressive and technical death metal is thin. Tech death and prog death, for short, are terms commonly applied to such bands as Nile, Edge of Sanity, and Opeth. Necrophagist and Spawn of Possession are known for a classical music-influenced death metal style. Death metal pioneers Death also refined their style in a more progressive direction in their final years. Some albums for this subgenre are Hallucinations (1990) by the German band Atrocity and Death's Human (1991). This style has significantly influenced many bands, creating a stream that in Europe was carried out at first by bands such as Gory Blister and Electrocution. The Polish band Decapitated gained recognition as one of Europe's primary modern technical death metal acts.\n* Symphonic death metal is a genre of death metal that add elements of classical music. Bands described as symphonic death metal include Fleshgod Apocalypse, Septicflesh,  Necronomicon, Children of Bodom and Epica. Haggard's 2000 album, Awaking the Centuries, has been described as death metal-styled symphonic metal. \n* Death-doom: Death-doom is a style that combines the slow tempos and melancholic atmosphere of doom metal with the deep growling vocals and double-kick drumming of death metal. The style emerged during the late 1980s and gained a certain amount of popularity during the 1990s. It was pioneered by bands such as Autopsy, Winter, Asphyx, Disembowelment, Paradise Lost, and My Dying Bride. This style spawned the more extreme subgenre of funeral doom metal, which is even slower and more atmospheric.\n\n* Goregrind, deathgrind and pornogrind are styles that mix the intensity, speed, and brevity of grindcore with the complexity of death metal. They differ from death metal in that guitar solos are often a rarity, shrieked vocals are more prominent as the main vocal (though death growls are still utilized and some deathgrind bands make more use of the latter vocal style), and songs are generally shorter in length, usually between one and three minutes that keep with grindcore's tradition of short time lengths in songs. All three of these styles differ from grindcore in the more technical approach and less evident hardcore punk influence and aesthetics. Some notable examples of deathgrind are Brujeria, Cattle Decapitation, Cephalic Carnage, Pig Destroyer, Circle of Dead Children, Rotten Sound, Gut and Cock and Ball Torture.\n* Deathcore: With the rise in popularity of metalcore, some of its traits have been combined with death metal. Bands such as Suicide Silence, Carnifex and Salt the Wound combine death metal with a variance of metalcore elements. Characteristics of death metal, such as fast drumming (including blast beats), down-tuned guitars, tremolo picking, growled vocals, and high-pitched shrieks are combined with the breakdowns of metalcore. Decibel magazine stated that \"one of Suffocation's trademarks, breakdowns, has spawned an entire metal subgenre: deathcore.\"\n\n* Death 'n' roll: is a style that combines death metal's growled vocals and highly distorted detuned guitar riffs along with elements of 1970s hard rock and heavy metal. Notable examples include Entombed, Gorefest, Avatar, and Six Feet Under.\n* Blackened death metal is a style that combines death metal with black metal. Examples of blackened death metal bands are Dissection, Belphegor, Behemoth, Akercocke, and Sacramentum.\n* Slam death metal is a style that was evolved from the 1990s New York death metal scene, incorporating elements of hardcore punk. In contrast to other death metal styles, it's not generally focused on guitar solos and blast beats; instead it employs mid-tempo rhythms, breakdowns, palm-muted riffage, as well as hip hop-inspired vocal and drum beat rhythms. Notable acts include Devourment, Cephalotripsy and Abominable Putridity.\n* Industrial death metal is a genre of death metal that add elements of industrial music. Some notable bands include Fear Factory, Nailbomb, Autokrator and Meathook Seed.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Death metal" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8233" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Death metal is an extreme subgenre of heavy metal music. It typically employs heavily distorted and low-tuned guitars, played with techniques such as palm muting and tremolo picking, deep growling vocals, aggressive, powerful drumming featuring double kick or blast beat techniques, minor keys or atonality, abrupt tempo, key, and time signature changes and chromatic chord progressions. The lyrical themes of death metal may invoke slasher film-stylized violence,Moynihan, Michael, and Dirik Søderlind (1998). Lords of Chaos (2nd ed.). Feral House. , p. 27 religion (sometimes Satanism), occultism, Lovecraftian horror, nature, mysticism, mythology, philosophy, science fiction, and politics,[http://www.wikihow.com/Appreciate-Death-Metal Wikihow: How to Appreciate Death Metal] and they may describe extreme acts, including mutilation, dissection, torture, rape, cannibalism, and necrophilia.\n\nBuilding from the musical structure of thrash metal and early black metal, death metal emerged during the mid-1980s. Bands such as Venom, Celtic Frost, Slayer, and Kreator were important influences on the genre's creation. Possessed and Death, along with bands such as Obituary, Autopsy and Morbid Angel, are often considered pioneers of the genre. In the late 1980s and early 1990s, death metal gained more media attention as popular genre niche record labels like Combat, Earache, and Roadrunner, began to sign death metal bands at a rapid rate.\n\nSince then, death metal has diversified, spawning several subgenres. Melodic death metal combines death metal elements with those of the new wave of British heavy metal. Technical death metal is a complex style, with uncommon time signatures, atypical rhythms and unusual harmonies and melodies. Death-doom combines the deep growled vocals and double-kick drumming of death metal with the slow tempos and melancholic atmosphere of doom metal. Deathgrind, goregrind and pornogrind mix the complexity of death metal with the intensity, speed, and brevity of grindcore. Deathcore combines death metal with metalcore traits. Death 'n' roll combines death metal's growled vocals and highly distorted, detuned guitar riffs with elements of 1970s hard rock and heavy metal.\n\nHistory\n\nEmergence and early history\n\nEnglish heavy metal band Venom, from Newcastle, crystallized the elements of what later became known as thrash metal, death metal and black metal, with their 1981 album Welcome to Hell. Their dark, blistering sound, harsh vocals, and macabre, proudly Satanic imagery proved a major inspiration for extreme metal bands. Another highly influential band, Slayer, formed in 1981. Although the band was a thrash metal act, Slayer's music was more violent than their thrash contemporaries Metallica, Megadeth, and Anthrax. Their breakneck speed and instrumental prowess combined with lyrics about death, violence, war, and Satanism won Slayer a rabid cult following. According to AllMusic, their third album Reign in Blood inspired the entire death metal genre. It had a big impact on genre leaders such as Death, Obituary, and Morbid Angel.\n\nPossessed, a band that formed in the San Francisco Bay Area during 1983, is described by Allmusic as \"connecting the dots\" between thrash metal and death metal with their 1985 debut album, Seven Churches. While attributed as having a Slayer influence, current and former members of the band had actually cited Venom and Motörhead, as well as early work by Exodus, as the main influences on their sound. Although the group had released only two studio albums and an EP in their formative years, they have been described by music journalists and musicians as either being \"monumental\" in developing the death metal style, or as being the first death metal band. Earache Records noted that \"the likes of Trey Azagthoth and Morbid Angel based what they were doing in their formative years on the Possessed blueprint laid down on the legendary Seven Churches recording. Possessed arguably did more to further the cause of 'Death Metal' than any of the early acts on the scene back in the mid-late 80's.\"\n\nDuring the same period as the dawn of Possessed, a second influential metal band was formed in Orlando, Florida: Death. Death, originally called Mantas, was formed in 1983 by Chuck Schuldiner, Kam Lee, and Rick Rozz. In 1984 they released their first demo entitled Death by Metal, followed by several more. The tapes circulated through the tape trader world, quickly establishing the band's name. With Death guitarist Schuldiner adopting vocal duties, the band made a major impact on the scene. The fast minor-key riffs and solos were complemented with fast drumming, creating a style that would catch on in tape trading circles. Schuldiner has been credited by Allmusic's Eduardo Rivadavia for being widely recognized as the \"Father of Death Metal\". Death's 1987 debut release, Scream Bloody Gore, has been described by About.com's Chad Bowar as being the \"evolution from thrash metal to death metal\", and \"the first true death metal record\" by the San Francisco Chronicle. Along with Possessed and Death, other pioneers of death metal in the United States include Macabre, Necrophagia, Master, Massacre, Immolation, Cannibal Corpse, and Post Mortem.\n\nGrowing popularity\n\nBy 1989, many bands had been signed by eager record labels wanting to cash in on the subgenre, including Florida's Obituary, Morbid Angel and Deicide. This collective of death metal bands hailing from Florida are often labeled as \"Florida death metal\". Morbid Angel pushed the genre to its most extreme level, both musically and lyrically, with the release of their debut album Altars of Madness in 1989. The album \"redefined what it meant to be heavy while influencing an upcoming class of brutal death metal.\" Death metal spread to Sweden in the late 1980s, flourishing with pioneers such as Carnage, God Macabre, Entombed, Dismember and Unleashed. In the early 1990s, the rise of melodic death metal was recognized, with bands such as Dark Tranquillity, At the Gates, and In Flames.\n\nFollowing the original death metal innovators, new subgenres began by the end of the decade. British band Napalm Death became increasingly associated with death metal, in particular, on 1990s Harmony Corruption. This album displays aggressive and fairly technical guitar riffing, complex rhythmics, a sophisticated growling vocal delivery by Mark \"Barney\" Greenway, and socially aware lyrical subjects, leading to a merging with the \"grindcore\" subgenre. Other bands contributing significantly to this early movement include Britain's Bolt Thrower and Carcass, and New York's Suffocation.\n\nTo close the circle, Death released their fourth album Human in 1991. Death's founder Schuldiner helped push the boundaries of uncompromising speed and technical virtuosity, mixing technical and intricate rhythm guitar work with complex arrangements and emotive guitar solos.[http://www.emptywords.org Empty Words, where there are dozens of reviews along this line] Other examples are Carcass's Necroticism – Descanting the Insalubrious, Suffocation's Effigy of the Forgotten and Entombed's Clandestine from 1991. At this point, all the above characteristics are present: abrupt tempo and count changes, on occasion extremely fast drumming, morbid lyrics and growling vocal delivery.\n\nEarache Records, Relativity Records and Roadrunner Records became the genre's most important labels,'Death Metal Special: Dealers in Death' Terrorizer #151 with Earache releasing albums by Carcass, Napalm Death, Morbid Angel, and Entombed, and Roadrunner releasing albums by Obituary, and Pestilence. Although these labels had not been death metal labels, initially, they became the genre's flagship labels in the beginning of the 1990s. In addition to these, other labels formed as well, such as Nuclear Blast, Century Media, and Peaceville. Many of these labels would go on to achieve successes in other genres of metal throughout the 1990s.\n\nIn September 1990, Death's manager Eric Greif held one of the first North American death metal festivals, Day of Death, in Milwaukee suburb Waukesha, Wisconsin, and featured 26 bands including Autopsy, Broken Hope, Hellwitch, Obliveon, Revenant, Viogression, Immolation, Atheist, and Cynic.[http://www.officialatheist.com/index.php?item=biography Biography, Official Atheist site] . Retrieved December 10, 2008\n\nLater history\n\nDeath metal's popularity achieved its initial peak between the 1992–93 era, with some bands such as Morbid Angel, Cannibal Corpse, as well as Obituary, enjoying mild commercial success. However, the genre as a whole never broke into the mainstream. The genre's mounting popularity may have been partly responsible for a strong rivalry between Norwegian black metal and Swedish death metal scenes. Fenriz of Darkthrone has noted that Norwegian black metal musicians were \"fed up with the whole death metal scene\" at the time. Death metal diversified in the 1990s, spawning a rich variety of subgenres which still have a large \"underground\" following at the present.\n\nCharacteristics\n\nInstrumentation\n\nThe setup most frequently used within the death metal genre is two guitarists, a bass player, a vocalist and a drummer often using \"hyper double-bass blast beats\". Although this is the standard setup, bands have been known to occasionally incorporate other instruments such as electronic keyboards.[http://heavymetal.about.com/od/heavymetal101/p/melodicdeathmetalprofile.htm Marsicano, D. Melodic Death Metal], About.com (Retrieved October 27, 2010) The genre is often identified by fast, heavily distorted and low tuned guitars, played with techniques such as palm muting and tremolo picking. The percussion is usually aggressive and powerful.\n\nDeath metal is known for its abrupt tempo, key, and time signature changes. Death metal may include chromatic chord progressions and a varied song structure. In some circumstances, the style will incorporate melodic riffs and harmonies for effect. This incorporation of melody and harmonious playing was even further used in the creation of melodic death metal. These compositions tend to emphasize an ongoing development of themes and motifs.\n\nVocals and lyrics\n\nDeath metal vocals are referred to as death growls; hoarse roars/snarls. Death growling is mistakenly thought to be a form of screaming using the lowest vocal register known as vocal fry, however vocal fry is actually a form of overtone screaming, and while growling can be performed this way by experienced vocalists who use the fry screaming technique, \"true\" death growling is in fact created by an altogether different technique.Interview with Samuel Deschaine, Death Metal Vocal Instructor 2011 The three major methods of harsh vocalization used in the genre are often mistaken for each other, encompassing vocal fry screaming, false chord screaming, and \"true\" death growls. Growling is sometimes also referred to as Cookie Monster vocals, tongue-in-cheek, due to the vocal similarity to the voice of the popular Sesame Street character of the same name. Although often criticized, death growls serve the aesthetic purpose of matching death metal's aggressive lyrical content.Sharpe-Young, Garry. Death Metal,  High-pitched screaming is occasionally utilized in death metal, being heard in songs by Death, Aborted, Exhumed, Dying Fetus, Cannibal Corpse, and Deicide.\n\nThe lyrical themes of death metal may invoke slasher film-stylised violence, but may also extend to topics like Satanism, religion, occultism, Lovecraftian horror, nature, mysticism, philosophy, science fiction, and politics. Although violence may be explored in various other genres as well, death metal may elaborate on the details of extreme acts, including mutilation, dissection, torture, rape, cannibalism, and necrophilia. Sociologist Keith Kahn-Harris commented this apparent glamorisation of violence may be attributed to a \"fascination\" with the human body that all people share to some degree, a fascination which mixes desire and disgust. Heavy metal author Gavin Baddeley also stated there does seem to be a connection between \"how acquainted one is with their own mortality\" and \"how much they crave images of death and violence\" via the media.Baddeley, Gavin. Raising Hell!: The Book of Satan and Rock 'n' Roll Additionally, contributing artists to the genre often defend death metal as little more than an extreme form of art and entertainment, similar to horror films in the motion picture industry. This explanation has brought such musicians under fire from activists internationally, who claim that this is often lost on a large number of adolescents, who are left with the glamorisation of such violence without social context or awareness of why such imagery is stimulating.\n\nAccording to Alex Webster, bassist of Cannibal Corpse, \"The gory lyrics are probably not, as much as people say, [what's keeping us] from being mainstream. Like, 'death metal would never go into the mainstream because the lyrics are too gory?' I think it's really the music, because violent entertainment is totally mainstream.\"[http://www.waytooloud.com/2007/10/23/cannibal-corpse-alex-webster-and-george-%E2%80%9Ccorpsegrinder%E2%80%9D-fisher/ Alex Webster (Cannibal Corpse) interview] \n\nOrigin of the term\n\nThe most popular theory of the subgenre's christening is Possessed's 1984 demo, Death Metal; the song from the eponymous demo would also be featured on the band's 1985 debut album, Seven Churches. Possessed vocalist/bassist Jeff Becerra said he coined the term in early 1983 for a high school English class assignment. Another possible origin was a magazine called Death Metal, started by Thomas Fischer and Martin Ain of Hellhammer and Celtic Frost. The name was later given to the 1984 compilation Death Metal released by Noise Records. The term might also have originated from other recordings, such as the demo released by Death in 1984, called Death by Metal.\n\nSubgenres and fusion genres\n\nCited examples are not necessarily exclusive to one particular style. Many bands can easily be placed in two or more of the following categories, and a band's specific categorization is often a source of contention due to personal opinion and interpretation.\n* Melodic death metal: Scandinavian death metal could be considered the forerunner of \"melodic death metal\". Melodic death metal, sometimes referred to as \"melodeath\", is traditional heavy metal mixed with some death metal elements. Unlike most other death metal, melodeath usually features screams instead of growls, slower tempos, much more melody and even clean vocals are heard at rare times. Carcass is sometimes credited with releasing the first melodic death metal album with 1993's Heartwork, although Swedish bands In Flames, Dark Tranquillity, and At the Gates are usually mentioned as the main pioneers of the genre and of the Gothenburg metal sound.\n\n* Technical death metal: Technical death metal and progressive death metal are related terms that refer to bands distinguished by the complexity of their music. Common traits are dynamic song structures, uncommon time signatures, atypical rhythms and unusual harmonies and melodies. Bands described as technical death metal or progressive death metal usually fuse common death metal aesthetics with elements of progressive rock, jazz or classical music. While the term technical death metal is sometimes used to describe bands that focus on speed and extremity as well as complexity, the line between progressive and technical death metal is thin. Tech death and prog death, for short, are terms commonly applied to such bands as Nile, Edge of Sanity, and Opeth. Necrophagist and Spawn of Possession are known for a classical music-influenced death metal style. Death metal pioneers Death also refined their style in a more progressive direction in their final years. Some albums for this subgenre are Hallucinations (1990) by the German band Atrocity and Death's Human (1991). This style has significantly influenced many bands, creating a stream that in Europe was carried out at first by bands such as Gory Blister and Electrocution. The Polish band Decapitated gained recognition as one of Europe's primary modern technical death metal acts.\n* Symphonic death metal is a genre of death metal that add elements of classical music. Bands described as symphonic death metal include Fleshgod Apocalypse, Septicflesh,  Necronomicon, Children of Bodom and Epica. Haggard's 2000 album, Awaking the Centuries, has been described as death metal-styled symphonic metal. \n* Death-doom: Death-doom is a style that combines the slow tempos and melancholic atmosphere of doom metal with the deep growling vocals and double-kick drumming of death metal. The style emerged during the late 1980s and gained a certain amount of popularity during the 1990s. It was pioneered by bands such as Autopsy, Winter, Asphyx, Disembowelment, Paradise Lost, and My Dying Bride. This style spawned the more extreme subgenre of funeral doom metal, which is even slower and more atmospheric.\n\n* Goregrind, deathgrind and pornogrind are styles that mix the intensity, speed, and brevity of grindcore with the complexity of death metal. They differ from death metal in that guitar solos are often a rarity, shrieked vocals are more prominent as the main vocal (though death growls are still utilized and some deathgrind bands make more use of the latter vocal style), and songs are generally shorter in length, usually between one and three minutes that keep with grindcore's tradition of short time lengths in songs. All three of these styles differ from grindcore in the more technical approach and less evident hardcore punk influence and aesthetics. Some notable examples of deathgrind are Brujeria, Cattle Decapitation, Cephalic Carnage, Pig Destroyer, Circle of Dead Children, Rotten Sound, Gut and Cock and Ball Torture.\n* Deathcore: With the rise in popularity of metalcore, some of its traits have been combined with death metal. Bands such as Suicide Silence, Carnifex and Salt the Wound combine death metal with a variance of metalcore elements. Characteristics of death metal, such as fast drumming (including blast beats), down-tuned guitars, tremolo picking, growled vocals, and high-pitched shrieks are combined with the breakdowns of metalcore. Decibel magazine stated that \"one of Suffocation's trademarks, breakdowns, has spawned an entire metal subgenre: deathcore.\"\n\n* Death 'n' roll: is a style that combines death metal's growled vocals and highly distorted detuned guitar riffs along with elements of 1970s hard rock and heavy metal. Notable examples include Entombed, Gorefest, Avatar, and Six Feet Under.\n* Blackened death metal is a style that combines death metal with black metal. Examples of blackened death metal bands are Dissection, Belphegor, Behemoth, Akercocke, and Sacramentum.\n* Slam death metal is a style that was evolved from the 1990s New York death metal scene, incorporating elements of hardcore punk. In contrast to other death metal styles, it's not generally focused on guitar solos and blast beats; instead it employs mid-tempo rhythms, breakdowns, palm-muted riffage, as well as hip hop-inspired vocal and drum beat rhythms. Notable acts include Devourment, Cephalotripsy and Abominable Putridity.\n* Industrial death metal is a genre of death metal that add elements of industrial music. Some notable bands include Fear Factory, Nailbomb, Autokrator and Meathook Seed. Death metal. http://en.wikipedia.org/?curid=8233."
  }
}
