{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=2076",
  "eid" : "bd8be0b0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778397755,
  "textBody" : "The Acropolis of Athens (Ancient Greek: Ἀκρόπολις, tr. Akrópolis;Thucydides 2.15.3: \"ἡ Ἀκρόπολις ἡ νῦν οὖσα πόλις ῆν\". , tr. Akrópoli Athenón) is an ancient citadel located on a rocky outcrop above the city of Athens and contains the remains of several ancient buildings of great architectural and historic significance, the most famous being the Parthenon.  The word  acropolis is from the Greek words  (akron, \"highest point, extremity\") and  (polis, \"city\").acro-. (n.d.). In Greek, Acropolis means \"Highest City\".  The American Heritage Dictionary of the English Language, Fourth Edition. Retrieved September 29, 2008, [http://dictionary.reference.com/browse/acro- from Dictionary.com website:] Quote: \"[From Greek akros, extreme; see  ak- in Indo-European roots.]\" Although the term acropolis is generic and there are many other acropoleis in Greece, the significance of the Acropolis of Athens is such that it is commonly known as \"The Acropolis\" without qualification. During ancient times it was known also more properly as Cecropia, after the legendary serpent-man, Cecrops, the first Athenian king. \n\nWhile there is evidence that the hill was inhabited as far back as the fourth millennium BC, it was Pericles (c. 495 – 429 BC) in the fifth century BC who coordinated the construction of the site's most important present remains including the Parthenon, the Propylaia, the Erechtheion and the Temple of Athena Nike.Hurwit 2000, p. 87[http://odysseus.culture.gr/h/3/eh351.jsp?obj_id2384 \"History\"], Odysseus. Retrieved 2 December 2012. The Parthenon and the other buildings were damaged seriously during the 1687 siege by the Venetians during the Morean War when gunpowder being stored in the Parthenon was hit by a cannonball and exploded.[http://www.nicholasreeves.com/item.aspx?category\nWriting&id=281 Nicholas Reeves and Dyfri Williams, \"The Parthenon in Ruins\"] , British Museum Magazine 57 (spring/summer 2007), pp. 36-38. Retrieved 2 December 2012.\n\nHistory\n\nEarly settlement\n\nThe Acropolis is located on a flattish-topped rock that rises 150 m above sea level in the city of Athens, with a surface area of about 3 ha. While the earliest artifacts date to the Middle Neolithic era, there have been documented habitations in Attica from the Early Neolithic period (6th millennium BC). There is little doubt that a Mycenaean megaron palace stood upon the hill during the late Bronze Age. Nothing of this megaron survives except, probably, a single limestone column-base and pieces of several sandstone steps. Soon after the palace was constructed, a Cyclopean massive circuit wall was built, 760 meters long, up to 10 meters high, and ranging from 3.5 to 6 meters thick. This wall would serve as the main defense for the acropolis until the 5th century.Hurwit 2000, p. 74-75. The wall consisted of two parapets built with large stone blocks and cemented with an earth mortar called emplekton (Greek: ἔμπλεκτον).[http://www.perseus.tufts.edu/hopper/text?doc\nPerseus%3Atext%3A1999.04.0057%3Aentry%3De%29%2Fmplektos ἔμπλεκτος],\nHenry George Liddell, Robert Scott, A Greek-English Lexicon, on Perseus Digital Library The wall uses typical Mycenaean conventions in that it followed the natural contour of the terrain and its gate, which was towards the south, was arranged obliquely, with a parapet and tower overhanging the incomers' right-hand side, thus facilitating defense. There were two lesser approaches up the hill on its north side, consisting of steep, narrow flights of steps cut in the rock.  Homer is assumed to refer to this fortification when he mentions the \"strong-built House of Erechtheus\" (Odyssey 7.81). At some time before the 13th century BC, an earthquake caused a fissure near the northeastern edge of the Acropolis. This fissure extended some 35 meters to a bed of soft marl in which a well was dug.Hurwit 2000, p. 78. An elaborate set of stairs was built and the well served as an invaluable, protected source of drinking water during times of siege for some portion of the Mycenaean period.[http://www.hydriaproject.net/en/cases/athens/acropolis_hill/mycenaean.html \"The springs and fountains of the Acropolis hill\"] , Hydria Project. Retrieved 2 December 2012.  There is no conclusive evidence for the existence of a Mycenean palace on top of the Athenian Acropolis. However, if there was such a palace, it seems to have been supplanted by later building activity.\n\nArchaic Acropolis\n\nNot much is known about the architectural appearance of the Acropolis until the Archaic era. During the 7th and the 6th centuries BC, the site was controlled by Kylon during the failed Kylonian revolt, and twice by Peisistratos; all attempts directed at seizing political power by coups d'état. Apart from the Hekatompedon mentioned later, Peisistratos also built an entry gate or Propylaea. Nevertheless, it seems that a nine-gate wall, the Enneapylon,[http://odysseus.culture.gr/h/2/eh251.jsp?obj_id\n8242 \"Acropolis fortification wall\"], Odysseus. Retrieved 2 December 2012. had been built around the biggest water spring, the Clepsydra, at the northwestern foot.\n\nA temple to Athena Polias, the tutelary deity of the city, was erected between 570–550 BC. This Doric limestone building, from which many relics survive, is referred to as the Hekatompedon (Greek for \"hundred–footed\"), Ur-Parthenon (German for \"original Parthenon\" or \"primitive Parthenon\"), H–Architecture or Bluebeard temple, after the pedimental three-bodied man-serpent sculpture, whose beards were painted dark blue. Whether this temple replaced an older one, or just a sacred precinct or altar, is not known. Probably, the Hekatompedon was built where the Parthenon now stands.Hurwit 2000, p. 111.\n\nBetween 529–520 BC yet another temple was built by the Peisistratids, the Old Temple of Athena, usually referred to as the Arkhaios Neōs (ἀρχαῖος νεώς, \"ancient temple\"). This temple of Athena Polias was built upon the Dörpfeld foundations,Hurwit 2000, p. 121. between the Erechtheion and the still-standing Parthenon. Arkhaios Neōs was destroyed by the Persian invasion during 480 BC; however, the temple was probably reconstructed during 454 BC, since the treasury of the Delian League was transferred in its opisthodomos. The temple may have been burnt down during 406/405 BC as Xenophon mentions that the old temple of Athena was set afire. Pausanias does not mention it in his 2nd century AD Description of Greece. [http://www.eie.gr/archaeologia/gr/02_DELTIA/Old_Temple_of_Athena.aspx], Retrieved 5 June 2012\n\nAround 500 BC the Hekatompedon was dismantled to make place for a new grander building, the \"Older Parthenon\" (often referred to as the Pre-Parthenon, \"early Parthenon\"). For this reason, Athenians decided to stop the construction of the Olympieion temple which was connoted with the tyrant Peisistratos and his sons and, instead, used the Piraeus limestone destined for the Olympieion to build the Older Parthenon. In order to accommodate the new temple, the south part of the summit was cleared, made level by adding some 8,000 two-ton blocks of limestone, a foundation 11 m deep at some points, and the rest was filled with soil kept in place by the retaining wall. However, after the victorious Battle of Marathon in 490 BC, the plan was revised and marble was used instead. The limestone phase of the building is referred to as Pre-Parthenon I and the marble phase as Pre-Parthenon II. In 485 BC, construction stalled to save resources as Xerxes became king of Persia and war seemed imminent.Manolis Korres, [http://www.eie.gr/archaeologia/En/chapter_more_3.aspx Topographic Issues of the Acropolis], Archaeology of the City of Athens; Retrieved 7 June 2012\nThe Older Parthenon was still under construction when the Persians indeed invaded and sacked the city in 480 BC. The building was burned and looted, along with the Ancient Temple and practically everything else on the rock.[http://www.perseus.tufts.edu/hopper/artifact;jsessionid7EAE195E7827EA194D2FFC77288CE706?name\nAthens%2C+Pre-Parthenon&object=Building \"Athens, Pre-Parthenon (Building)\"], Perseus Digital Library. Retrieved 3 December 2012.Dörpfeld, W: Der aeltere Parthenon, Ath. Mitt, XVII, 1892, pp. 158–89.  After the Persian crisis had subsided, the Athenians incorporated many architectural parts of the unfinished temple (unfluted column drums, triglyphs, metopes, etc.) into the newly built northern curtain wall of the Acropolis, where they served as a prominent \"war memorial\" and can still be seen today. The devastated site was cleared of debris. Statuary, cult objects, religious offerings and unsalvageable architectural members were buried ceremoniously in several deeply dug pits on the hill, serving conveniently as a fill for the artificial plateau created around the classic Parthenon. This \"Persian debris\" is the richest archaeological deposit excavated on the Acropolis.Kavvadias, Panagiotis, Kawerau, Georg: Die Ausgrabung der Akropolis vom Jahre 1885 bis zum Jahre 1890, Athens, 1906 \n\nThe Periclean building program\n\nAfter winning at Eurymedon during 468 BC, Cimon and Themistocles ordered the reconstruction of the  southern and northern walls of the Acropolis. Most of the major temples, including the Parthenon, were rebuilt by order of Pericles during the so-called Golden Age of Athens (460–430 BC). Phidias, an Athenian sculptor, and Ictinus and Callicrates, two famous architects, were responsible for the reconstruction.[http://www.greatbuildings.com/architects/Ictinus_and_Callicrates_wi.html \"Ictinus and Callicrates with Phidias\"], Architecture Week. Retrieved 3 December 2012.\n\nDuring 437 BC, Mnesicles started building the Propylaea, a monumental gate at the western end of the Acropolis with Doric columns of Pentelic marble, built partly upon the old propylaea of Peisistratos. These colonnades were almost finished during 432 BC and had two wings, the northern one decorated with paintings by Polygnotus. About the same time, south of the Propylaea, building started on the small Ionic Temple of Athena Nike in Pentelic marble with tetrastyle porches, preserving the essentials of Greek temple design. After an interruption caused by the Peloponnesian War, the temple was finished during the time of Nicias' peace, between 421 BC and 409 BC.\n\nConstruction of the elegant temple of Erechtheion in Pentelic marble (421–406 BC) was in accordance with a complex plan which took account of the extremely uneven ground and the need to circumvent several shrines in the area. The entrance, facing east, is lined with six Ionic columns. Unusually, the temple has two porches, one on the northwest corner borne by Ionic columns, the other, to the southwest, supported by huge female figures or Caryatids. The eastern part of the temple was dedicated to Athena Polias, while the western part, serving the cult of the archaic king Poseidon-Erechtheus, housed the altars of Hephaestus and Voutos, brother of Erechtheus. Little is known about the original plan of the interior which was destroyed by fire during the first century BC and has been rebuilt several times.[http://www.ancient-greece.org/architecture/erechtheion.html Thomas Sakoulas, \"Erechtheion\"], Ancient-Greece.org. Retrieved 7 December 2012.[http://odysseus.culture.gr/h/2/eh251.jsp?obj_id=973Ioanna Venieri, \"Erechtheion\"], Odysseus. Retrieved 7 December 2012.\n\nDuring the same period, a combination of sacred precincts including the temples of Athena Polias, Poseidon, Erechtheus, Cecrops, Herse, Pandrosos and Aglauros, with its Kore Porch (Porch of the Maidens) or Caryatids' balcony was begun.[http://www.calvin.edu/academic/clas/pathways/acropoli/aere3.htm \"The Acropolis of Athens\"]. Retrieved 9 February 2013.  Between the temple of Athena Nike and the Parthenon, there was the Sanctuary of Artemis Brauronia (or the Brauroneion), the goddess represented as a bear and worshipped in the deme of Brauron. According to Pausanias, a wooden statue or xoanon of the goddess and a statue of Artemis made by Praxiteles during the 4th century BC were both in the sanctuary.[http://www.theacropolismuseum.gr/en/content/sanctuary-artemis-brauronia-0 \"The Sanctuary of Artemis Brauronia\"], Acropolis Museum. Retrieved 9 February 2013.\n\nBehind the Propylaea, Phidias' gigantic bronze statue of Athena Promachos (\"Athena who fights in the front line\"), built between 450 BC and 448 BC, dominated. The base was  high, while the total height of the statue was 9 m. The goddess held a lance the gilt tip of which could be seen as a reflection by crews on ships rounding Cape Sounion, and a giant shield on the left side, decorated by Mys with images of the fight between the Centaurs and the Lapiths. Other monuments that have left almost nothing visible to the present day are the Chalkotheke, the Pandroseion, Pandion's sanctuary, Athena's altar, Zeus Polieus's sanctuary and, from Roman times, the circular temple of Augustus and Rome.\n\nHellenistic and Roman period\n\nDuring the Hellenistic and Roman periods, many of the existing buildings in the area of the Acropolis were repaired., due to damage from age, and occasionally, war.Travlos, John, Pictorial Dictionary of Ancient Athens, London: Thames and Hudson, 1971. p.54.  Monuments to foreign kings were erected, notably those of the Attalid kings of Pergamon Attalos II (in front of the NW corner of the Parthenon), and Eumenes II, in front of the Propylaia.  These were rededicated during the early Roman Empire to Augustus or Claudius (uncertain), and Agrippa, respectively.Hurwit 2000 p. 278  Eumenes was also responsible for constructing a stoa on the South slope, not unlike that of Attalos in the Agora below.[http://www.greek-thesaurus.gr/the-acropolis-the-stoa-of-Eumenes.html \"The Stoa of Eumenes\"], The Acropolis of Athens. Greek Thesaurus. Retrieved 9 February 2013.\n\nDuring the Julio-Claudian period, the Temple of Rome and Augustus, a small, round edifice, about 23 meters from the Parthenon, was to be the last significant ancient construction on the summit of the rock.Hurwit 2000, p. 279.  Around the same time, on the North slope, in a cave next to the one dedicated to Pan since the classical period, a sanctuary was founded where the archons dedicated to Apollo on assuming office.Nulton, Peter, The Sanctuary of Apollo Hypoakraios and Imperial Athens, Archaeologia Transatlantica XXI, 2003.  During 161 AD, on the South slope, the Roman Herodes Atticus built his grand amphitheatre or Odeon. It was destroyed by the invading Herulians a century later but was reconstructed during the 1950s.\n\nDuring the 3rd century, under threat from a Herulian invasion, repairs were made to the Acropolis walls, and the \"Beulé Gate\" was constructed to restrict entrance in front of the Propylaia, thus returning the Acropolis to use as a fortress.\n\nByzantine, Latin and Ottoman period\n\nDuring the Byzantine period, the Parthenon was used as a church, dedicated to the Virgin Mary.[http://www.ancientgreece.com/s/Parthenon/ \"The Partenon\"], Ancient Greece. Retrieved 9 February 2013. During the Latin Duchy of Athens, the Acropolis functioned as the city's administrative center, with the Parthenon as its cathedral, and the Propylaia as part of the Ducal Palace. A large tower was added, the \"Frankopyrgos\", demolished during the 19th century.\n\nAfter the Ottoman conquest of Greece, the Parthenon was used as the garrison headquarters of the Turkish army,Hellenistic ministry of culture [http://odysseus.culture.gr/h/3/eh351.jsp?obj_id=2384 History of the Acropolis of Athens] and the Erechtheum was turned into the Governor's private Harem. The buildings of the Acropolis suffered significant damage during the 1687 siege by the Venetians in the Morean War.  The Parthenon, which was being used as a gunpowder magazine, was hit by artillery shot and damaged severely.[http://whc.unesco.org/en/list/404 \"Acropolis, Athens: Long description\"], UNESCO. Retrieved 9 February 2013.\n\nDuring subsequent years, the Acropolis was a site of bustling human activity with many Byzantine, Frankish, and Ottoman structures.  The dominant feature during the Ottoman period was a mosque inside the Parthenon, complete with a minaret.  After the Greek War of Independence, most features that dated from the Byzantine, Frankish and Ottoman periods were cleared from the site in an attempt to restore the monument to its original form, \"cleansed\" of all later additions.[http://www.nicholasreeves.com/item.aspx?categoryWriting&id\n281 Nicholas Reeves and Dyfri Williams, \"The Parthenon in Ruins\"] , British Museum Magazine, No 57, 2007, pages 36–38. Retrieved 9 February 2013.\n\nArchaeological remains\n\nThe entrance to the Acropolis was a monumental gateway termed the Propylaea. To the south of the entrance is the tiny Temple of Athena Nike. At the centre of the Acropolis is the Parthenon or Temple of Athena Parthenos (Athena the Virgin). East of the entrance and north of the Parthenon is the temple known as the Erechtheum. South of the platform that forms the top of the Acropolis there are also the remains of the ancient, though often remodelled, Theatre of Dionysus. A few hundred metres away, there is the now partially reconstructed Odeon of Herodes Atticus.\n\nAll the valuable ancient artifacts are situated in the Acropolis Museum, which resides on the southern slope of the same rock, 280 metres from the Parthenon.[http://www.theacropolismuseum.gr/en \"The Acropolis Museum\"]. Retrieved 9 February 2013.\n\nSite plan\n\nSite plan of the Acropolis at Athens showing the major archaeological remains\n\nImage:AcropolisatathensSitePlan.png|right|500px|alt=Site plan of the Acropolis at Athens\npoly 332 198 447 158 468 217 352 254 Parthenon\npoly 305 130 374 115 385 146 314 167 Old Temple of Athena\npoly 346 116 389 108 375 71 334 82 Erechtheum\npoly 248 137 266 160 252 168 243 151 Statue of Athena Promachos\npoly 104 164 193 115 225 200 158 224 Propylaea\npoly 132 223 152 226 150 257 136 255 Temple of Athena Nike\npoly 168 256 193 261 188 278 166 277 Eleusinion\npoly 191 213 258 199 245 259 185 246 Sanctuary of Artemis Brauronia or Brauroneion\npoly 248 260 315 276 321 245 255 231 Chalkotheke\npoly 322 78 337 97 343 111 310 122 304 108 Pandroseion\npoly 258 81 281 73 288 96 266 102 Arrephorion\npoly 402 102 428 100 435 120 408 127 Altar of Athena Polias\npoly 462 120 500 96 540 96 533 136 506 146 464 149 Sanctuary of Zeus Polieus\npoly 574 155 641 184 628 212 564 183 Sanctuary of Pandion\npoly 26 384 56 336 88 314 129 313 160 337 174 370 175 399 139 416 72 417 25 402 Odeon of Herodes Atticus\npoly 182 381 462 384 460 419 179 415 Stoa of Eumenes\npoly 395 325 469 309 478 356 406 372 Sanctuary of Asclepius or Asclepieion\npoly 484 397 492 356 516 323 555 297 596 293 642 300 670 311 650 345 683 389 540 457 Theatre of Dionysus Eleuthereus\npoly 655 343 738 276 807 356 722 425 Odeon of Pericles\npoly 564 460 678 414 684 442 627 505 586 515 Temenos of Dionysus Eleuthereus\npoly 300 32 332 42 323 67 296 64 Aglaureion\n\n#Parthenon\n#Old Temple of Athena\n#Erechtheum\n#Statue of Athena Promachos\n#Propylaea\n#Temple of Athena Nike\n#Eleusinion\n#Sanctuary of Artemis Brauronia or Brauroneion\n#Chalkotheke\n#Pandroseion\n#Arrephorion\n#Altar of Athena\n#Sanctuary of Zeus Polieus\n#Sanctuary of Pandion\n#Odeon of Herodes Atticus\n#Stoa of Eumenes\n#Sanctuary of Asclepius or Asclepieion\n#Theatre of Dionysus Eleuthereus\n#Odeon of Pericles\n#Temenos of Dionysus Eleuthereus\n#Aglaureion\n\nThe Acropolis Restoration Project\n\nThe Project began during 1975 but as of 2017 has almost ground to a halt.  The goal of the restoration was to reverse the decay of centuries of attrition, pollution, destruction stemming from military use, and misguided past restorations.  The project included collection and identification of all stone fragments, even small ones, from the Acropolis and its slopes and the attempt was made to restore as much as possible using reassembled original material (anastylosis), with new marble from Mount Penteli used sparingly.  All restoration was made using titanium dowels and is designed to be completely reversible, in case future experts decide to change things.  A combination of cutting-edge modern technology and extensive research and reinvention of ancient techniques were used.[http://www.lsa.umich.edu/UMICH/modgreek/Home/Window%20to%20Greek%20Culture/Lectures%20at%20U-M/LaUM_Mallouchou_restorationacropolis.pdf Fani Mallouchou-Tufano, \"The Restoration of the Athenian Acropolis\"] , University of Michigan. Retrieved 9 February 2013.\n\nThe Parthenon colonnades, largely destroyed by Venetian bombardment during the 17th century, were restored, with many wrongly assembled columns now properly placed.  The roof and floor of the Propylaea were partly restored, with sections of the roof made of new marble and decorated with blue and gold inserts, as in the original. Restoration of the Temple of Athena Nike was completed in 2010.[http://www.ysma.gr/static/files/Newsletter11_ENG.pdf \"2010 – 2011, The progress of restoration on the Acropolis\"], The Acropolis Restoration News, July 2011. Retrieved 9 February 2013.\n\nA total of 2,675 tons of architectural members were restored, with 686 stones reassembled from fragments of the originals, 905 patched with new marble, and 186 parts made entirely of new marble.  A total of 530 cubic meters of new Pentelic marble were used.[http://www.columbia.edu/cu/hellenic/ \"Acropolis Restoration Project-Lecture by Maria Ioannidou, Director, Acropolis Restoration Service\"], Columbia University. Retrieved 9 February 2013.\n\nCultural significance\n\nEvery four years, the Athenians had a festival called the Panathenaea that rivaled the Olympic Games in popularity. During the festival, a procession (believed to be depicted on the Parthenon frieze) traveled through the city via the Panathenaic Way and culminated on the Acropolis.  There, a new robe of woven wool (peplos) was placed on either the statue of Athena Polias in the Erechtheum (during a regular Panathenaea) or on the statue of Athena Parthenos in the Parthenon (during the Great Panathenaea, held every four years).\n\nWithin the later tradition of Western Civilization and classical revival the Acropolis, from at least the mid-18th century on, has often been invoked as a key symbol of the Greek legacy and of the glories of Classical Greece.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Acropolis of Athens" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=2076" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Acropolis of Athens (Ancient Greek: Ἀκρόπολις, tr. Akrópolis;Thucydides 2.15.3: \"ἡ Ἀκρόπολις ἡ νῦν οὖσα πόλις ῆν\". , tr. Akrópoli Athenón) is an ancient citadel located on a rocky outcrop above the city of Athens and contains the remains of several ancient buildings of great architectural and historic significance, the most famous being the Parthenon.  The word  acropolis is from the Greek words  (akron, \"highest point, extremity\") and  (polis, \"city\").acro-. (n.d.). In Greek, Acropolis means \"Highest City\".  The American Heritage Dictionary of the English Language, Fourth Edition. Retrieved September 29, 2008, [http://dictionary.reference.com/browse/acro- from Dictionary.com website:] Quote: \"[From Greek akros, extreme; see  ak- in Indo-European roots.]\" Although the term acropolis is generic and there are many other acropoleis in Greece, the significance of the Acropolis of Athens is such that it is commonly known as \"The Acropolis\" without qualification. During ancient times it was known also more properly as Cecropia, after the legendary serpent-man, Cecrops, the first Athenian king. \n\nWhile there is evidence that the hill was inhabited as far back as the fourth millennium BC, it was Pericles (c. 495 – 429 BC) in the fifth century BC who coordinated the construction of the site's most important present remains including the Parthenon, the Propylaia, the Erechtheion and the Temple of Athena Nike.Hurwit 2000, p. 87[http://odysseus.culture.gr/h/3/eh351.jsp?obj_id2384 \"History\"], Odysseus. Retrieved 2 December 2012. The Parthenon and the other buildings were damaged seriously during the 1687 siege by the Venetians during the Morean War when gunpowder being stored in the Parthenon was hit by a cannonball and exploded.[http://www.nicholasreeves.com/item.aspx?category\nWriting&id=281 Nicholas Reeves and Dyfri Williams, \"The Parthenon in Ruins\"] , British Museum Magazine 57 (spring/summer 2007), pp. 36-38. Retrieved 2 December 2012.\n\nHistory\n\nEarly settlement\n\nThe Acropolis is located on a flattish-topped rock that rises 150 m above sea level in the city of Athens, with a surface area of about 3 ha. While the earliest artifacts date to the Middle Neolithic era, there have been documented habitations in Attica from the Early Neolithic period (6th millennium BC). There is little doubt that a Mycenaean megaron palace stood upon the hill during the late Bronze Age. Nothing of this megaron survives except, probably, a single limestone column-base and pieces of several sandstone steps. Soon after the palace was constructed, a Cyclopean massive circuit wall was built, 760 meters long, up to 10 meters high, and ranging from 3.5 to 6 meters thick. This wall would serve as the main defense for the acropolis until the 5th century.Hurwit 2000, p. 74-75. The wall consisted of two parapets built with large stone blocks and cemented with an earth mortar called emplekton (Greek: ἔμπλεκτον).[http://www.perseus.tufts.edu/hopper/text?doc\nPerseus%3Atext%3A1999.04.0057%3Aentry%3De%29%2Fmplektos ἔμπλεκτος],\nHenry George Liddell, Robert Scott, A Greek-English Lexicon, on Perseus Digital Library The wall uses typical Mycenaean conventions in that it followed the natural contour of the terrain and its gate, which was towards the south, was arranged obliquely, with a parapet and tower overhanging the incomers' right-hand side, thus facilitating defense. There were two lesser approaches up the hill on its north side, consisting of steep, narrow flights of steps cut in the rock.  Homer is assumed to refer to this fortification when he mentions the \"strong-built House of Erechtheus\" (Odyssey 7.81). At some time before the 13th century BC, an earthquake caused a fissure near the northeastern edge of the Acropolis. This fissure extended some 35 meters to a bed of soft marl in which a well was dug.Hurwit 2000, p. 78. An elaborate set of stairs was built and the well served as an invaluable, protected source of drinking water during times of siege for some portion of the Mycenaean period.[http://www.hydriaproject.net/en/cases/athens/acropolis_hill/mycenaean.html \"The springs and fountains of the Acropolis hill\"] , Hydria Project. Retrieved 2 December 2012.  There is no conclusive evidence for the existence of a Mycenean palace on top of the Athenian Acropolis. However, if there was such a palace, it seems to have been supplanted by later building activity.\n\nArchaic Acropolis\n\nNot much is known about the architectural appearance of the Acropolis until the Archaic era. During the 7th and the 6th centuries BC, the site was controlled by Kylon during the failed Kylonian revolt, and twice by Peisistratos; all attempts directed at seizing political power by coups d'état. Apart from the Hekatompedon mentioned later, Peisistratos also built an entry gate or Propylaea. Nevertheless, it seems that a nine-gate wall, the Enneapylon,[http://odysseus.culture.gr/h/2/eh251.jsp?obj_id\n8242 \"Acropolis fortification wall\"], Odysseus. Retrieved 2 December 2012. had been built around the biggest water spring, the Clepsydra, at the northwestern foot.\n\nA temple to Athena Polias, the tutelary deity of the city, was erected between 570–550 BC. This Doric limestone building, from which many relics survive, is referred to as the Hekatompedon (Greek for \"hundred–footed\"), Ur-Parthenon (German for \"original Parthenon\" or \"primitive Parthenon\"), H–Architecture or Bluebeard temple, after the pedimental three-bodied man-serpent sculpture, whose beards were painted dark blue. Whether this temple replaced an older one, or just a sacred precinct or altar, is not known. Probably, the Hekatompedon was built where the Parthenon now stands.Hurwit 2000, p. 111.\n\nBetween 529–520 BC yet another temple was built by the Peisistratids, the Old Temple of Athena, usually referred to as the Arkhaios Neōs (ἀρχαῖος νεώς, \"ancient temple\"). This temple of Athena Polias was built upon the Dörpfeld foundations,Hurwit 2000, p. 121. between the Erechtheion and the still-standing Parthenon. Arkhaios Neōs was destroyed by the Persian invasion during 480 BC; however, the temple was probably reconstructed during 454 BC, since the treasury of the Delian League was transferred in its opisthodomos. The temple may have been burnt down during 406/405 BC as Xenophon mentions that the old temple of Athena was set afire. Pausanias does not mention it in his 2nd century AD Description of Greece. [http://www.eie.gr/archaeologia/gr/02_DELTIA/Old_Temple_of_Athena.aspx], Retrieved 5 June 2012\n\nAround 500 BC the Hekatompedon was dismantled to make place for a new grander building, the \"Older Parthenon\" (often referred to as the Pre-Parthenon, \"early Parthenon\"). For this reason, Athenians decided to stop the construction of the Olympieion temple which was connoted with the tyrant Peisistratos and his sons and, instead, used the Piraeus limestone destined for the Olympieion to build the Older Parthenon. In order to accommodate the new temple, the south part of the summit was cleared, made level by adding some 8,000 two-ton blocks of limestone, a foundation 11 m deep at some points, and the rest was filled with soil kept in place by the retaining wall. However, after the victorious Battle of Marathon in 490 BC, the plan was revised and marble was used instead. The limestone phase of the building is referred to as Pre-Parthenon I and the marble phase as Pre-Parthenon II. In 485 BC, construction stalled to save resources as Xerxes became king of Persia and war seemed imminent.Manolis Korres, [http://www.eie.gr/archaeologia/En/chapter_more_3.aspx Topographic Issues of the Acropolis], Archaeology of the City of Athens; Retrieved 7 June 2012\nThe Older Parthenon was still under construction when the Persians indeed invaded and sacked the city in 480 BC. The building was burned and looted, along with the Ancient Temple and practically everything else on the rock.[http://www.perseus.tufts.edu/hopper/artifact;jsessionid7EAE195E7827EA194D2FFC77288CE706?name\nAthens%2C+Pre-Parthenon&object=Building \"Athens, Pre-Parthenon (Building)\"], Perseus Digital Library. Retrieved 3 December 2012.Dörpfeld, W: Der aeltere Parthenon, Ath. Mitt, XVII, 1892, pp. 158–89.  After the Persian crisis had subsided, the Athenians incorporated many architectural parts of the unfinished temple (unfluted column drums, triglyphs, metopes, etc.) into the newly built northern curtain wall of the Acropolis, where they served as a prominent \"war memorial\" and can still be seen today. The devastated site was cleared of debris. Statuary, cult objects, religious offerings and unsalvageable architectural members were buried ceremoniously in several deeply dug pits on the hill, serving conveniently as a fill for the artificial plateau created around the classic Parthenon. This \"Persian debris\" is the richest archaeological deposit excavated on the Acropolis.Kavvadias, Panagiotis, Kawerau, Georg: Die Ausgrabung der Akropolis vom Jahre 1885 bis zum Jahre 1890, Athens, 1906 \n\nThe Periclean building program\n\nAfter winning at Eurymedon during 468 BC, Cimon and Themistocles ordered the reconstruction of the  southern and northern walls of the Acropolis. Most of the major temples, including the Parthenon, were rebuilt by order of Pericles during the so-called Golden Age of Athens (460–430 BC). Phidias, an Athenian sculptor, and Ictinus and Callicrates, two famous architects, were responsible for the reconstruction.[http://www.greatbuildings.com/architects/Ictinus_and_Callicrates_wi.html \"Ictinus and Callicrates with Phidias\"], Architecture Week. Retrieved 3 December 2012.\n\nDuring 437 BC, Mnesicles started building the Propylaea, a monumental gate at the western end of the Acropolis with Doric columns of Pentelic marble, built partly upon the old propylaea of Peisistratos. These colonnades were almost finished during 432 BC and had two wings, the northern one decorated with paintings by Polygnotus. About the same time, south of the Propylaea, building started on the small Ionic Temple of Athena Nike in Pentelic marble with tetrastyle porches, preserving the essentials of Greek temple design. After an interruption caused by the Peloponnesian War, the temple was finished during the time of Nicias' peace, between 421 BC and 409 BC.\n\nConstruction of the elegant temple of Erechtheion in Pentelic marble (421–406 BC) was in accordance with a complex plan which took account of the extremely uneven ground and the need to circumvent several shrines in the area. The entrance, facing east, is lined with six Ionic columns. Unusually, the temple has two porches, one on the northwest corner borne by Ionic columns, the other, to the southwest, supported by huge female figures or Caryatids. The eastern part of the temple was dedicated to Athena Polias, while the western part, serving the cult of the archaic king Poseidon-Erechtheus, housed the altars of Hephaestus and Voutos, brother of Erechtheus. Little is known about the original plan of the interior which was destroyed by fire during the first century BC and has been rebuilt several times.[http://www.ancient-greece.org/architecture/erechtheion.html Thomas Sakoulas, \"Erechtheion\"], Ancient-Greece.org. Retrieved 7 December 2012.[http://odysseus.culture.gr/h/2/eh251.jsp?obj_id=973Ioanna Venieri, \"Erechtheion\"], Odysseus. Retrieved 7 December 2012.\n\nDuring the same period, a combination of sacred precincts including the temples of Athena Polias, Poseidon, Erechtheus, Cecrops, Herse, Pandrosos and Aglauros, with its Kore Porch (Porch of the Maidens) or Caryatids' balcony was begun.[http://www.calvin.edu/academic/clas/pathways/acropoli/aere3.htm \"The Acropolis of Athens\"]. Retrieved 9 February 2013.  Between the temple of Athena Nike and the Parthenon, there was the Sanctuary of Artemis Brauronia (or the Brauroneion), the goddess represented as a bear and worshipped in the deme of Brauron. According to Pausanias, a wooden statue or xoanon of the goddess and a statue of Artemis made by Praxiteles during the 4th century BC were both in the sanctuary.[http://www.theacropolismuseum.gr/en/content/sanctuary-artemis-brauronia-0 \"The Sanctuary of Artemis Brauronia\"], Acropolis Museum. Retrieved 9 February 2013.\n\nBehind the Propylaea, Phidias' gigantic bronze statue of Athena Promachos (\"Athena who fights in the front line\"), built between 450 BC and 448 BC, dominated. The base was  high, while the total height of the statue was 9 m. The goddess held a lance the gilt tip of which could be seen as a reflection by crews on ships rounding Cape Sounion, and a giant shield on the left side, decorated by Mys with images of the fight between the Centaurs and the Lapiths. Other monuments that have left almost nothing visible to the present day are the Chalkotheke, the Pandroseion, Pandion's sanctuary, Athena's altar, Zeus Polieus's sanctuary and, from Roman times, the circular temple of Augustus and Rome.\n\nHellenistic and Roman period\n\nDuring the Hellenistic and Roman periods, many of the existing buildings in the area of the Acropolis were repaired., due to damage from age, and occasionally, war.Travlos, John, Pictorial Dictionary of Ancient Athens, London: Thames and Hudson, 1971. p.54.  Monuments to foreign kings were erected, notably those of the Attalid kings of Pergamon Attalos II (in front of the NW corner of the Parthenon), and Eumenes II, in front of the Propylaia.  These were rededicated during the early Roman Empire to Augustus or Claudius (uncertain), and Agrippa, respectively.Hurwit 2000 p. 278  Eumenes was also responsible for constructing a stoa on the South slope, not unlike that of Attalos in the Agora below.[http://www.greek-thesaurus.gr/the-acropolis-the-stoa-of-Eumenes.html \"The Stoa of Eumenes\"], The Acropolis of Athens. Greek Thesaurus. Retrieved 9 February 2013.\n\nDuring the Julio-Claudian period, the Temple of Rome and Augustus, a small, round edifice, about 23 meters from the Parthenon, was to be the last significant ancient construction on the summit of the rock.Hurwit 2000, p. 279.  Around the same time, on the North slope, in a cave next to the one dedicated to Pan since the classical period, a sanctuary was founded where the archons dedicated to Apollo on assuming office.Nulton, Peter, The Sanctuary of Apollo Hypoakraios and Imperial Athens, Archaeologia Transatlantica XXI, 2003.  During 161 AD, on the South slope, the Roman Herodes Atticus built his grand amphitheatre or Odeon. It was destroyed by the invading Herulians a century later but was reconstructed during the 1950s.\n\nDuring the 3rd century, under threat from a Herulian invasion, repairs were made to the Acropolis walls, and the \"Beulé Gate\" was constructed to restrict entrance in front of the Propylaia, thus returning the Acropolis to use as a fortress.\n\nByzantine, Latin and Ottoman period\n\nDuring the Byzantine period, the Parthenon was used as a church, dedicated to the Virgin Mary.[http://www.ancientgreece.com/s/Parthenon/ \"The Partenon\"], Ancient Greece. Retrieved 9 February 2013. During the Latin Duchy of Athens, the Acropolis functioned as the city's administrative center, with the Parthenon as its cathedral, and the Propylaia as part of the Ducal Palace. A large tower was added, the \"Frankopyrgos\", demolished during the 19th century.\n\nAfter the Ottoman conquest of Greece, the Parthenon was used as the garrison headquarters of the Turkish army,Hellenistic ministry of culture [http://odysseus.culture.gr/h/3/eh351.jsp?obj_id=2384 History of the Acropolis of Athens] and the Erechtheum was turned into the Governor's private Harem. The buildings of the Acropolis suffered significant damage during the 1687 siege by the Venetians in the Morean War.  The Parthenon, which was being used as a gunpowder magazine, was hit by artillery shot and damaged severely.[http://whc.unesco.org/en/list/404 \"Acropolis, Athens: Long description\"], UNESCO. Retrieved 9 February 2013.\n\nDuring subsequent years, the Acropolis was a site of bustling human activity with many Byzantine, Frankish, and Ottoman structures.  The dominant feature during the Ottoman period was a mosque inside the Parthenon, complete with a minaret.  After the Greek War of Independence, most features that dated from the Byzantine, Frankish and Ottoman periods were cleared from the site in an attempt to restore the monument to its original form, \"cleansed\" of all later additions.[http://www.nicholasreeves.com/item.aspx?categoryWriting&id\n281 Nicholas Reeves and Dyfri Williams, \"The Parthenon in Ruins\"] , British Museum Magazine, No 57, 2007, pages 36–38. Retrieved 9 February 2013.\n\nArchaeological remains\n\nThe entrance to the Acropolis was a monumental gateway termed the Propylaea. To the south of the entrance is the tiny Temple of Athena Nike. At the centre of the Acropolis is the Parthenon or Temple of Athena Parthenos (Athena the Virgin). East of the entrance and north of the Parthenon is the temple known as the Erechtheum. South of the platform that forms the top of the Acropolis there are also the remains of the ancient, though often remodelled, Theatre of Dionysus. A few hundred metres away, there is the now partially reconstructed Odeon of Herodes Atticus.\n\nAll the valuable ancient artifacts are situated in the Acropolis Museum, which resides on the southern slope of the same rock, 280 metres from the Parthenon.[http://www.theacropolismuseum.gr/en \"The Acropolis Museum\"]. Retrieved 9 February 2013.\n\nSite plan\n\nSite plan of the Acropolis at Athens showing the major archaeological remains\n\nImage:AcropolisatathensSitePlan.png|right|500px|alt=Site plan of the Acropolis at Athens\npoly 332 198 447 158 468 217 352 254 Parthenon\npoly 305 130 374 115 385 146 314 167 Old Temple of Athena\npoly 346 116 389 108 375 71 334 82 Erechtheum\npoly 248 137 266 160 252 168 243 151 Statue of Athena Promachos\npoly 104 164 193 115 225 200 158 224 Propylaea\npoly 132 223 152 226 150 257 136 255 Temple of Athena Nike\npoly 168 256 193 261 188 278 166 277 Eleusinion\npoly 191 213 258 199 245 259 185 246 Sanctuary of Artemis Brauronia or Brauroneion\npoly 248 260 315 276 321 245 255 231 Chalkotheke\npoly 322 78 337 97 343 111 310 122 304 108 Pandroseion\npoly 258 81 281 73 288 96 266 102 Arrephorion\npoly 402 102 428 100 435 120 408 127 Altar of Athena Polias\npoly 462 120 500 96 540 96 533 136 506 146 464 149 Sanctuary of Zeus Polieus\npoly 574 155 641 184 628 212 564 183 Sanctuary of Pandion\npoly 26 384 56 336 88 314 129 313 160 337 174 370 175 399 139 416 72 417 25 402 Odeon of Herodes Atticus\npoly 182 381 462 384 460 419 179 415 Stoa of Eumenes\npoly 395 325 469 309 478 356 406 372 Sanctuary of Asclepius or Asclepieion\npoly 484 397 492 356 516 323 555 297 596 293 642 300 670 311 650 345 683 389 540 457 Theatre of Dionysus Eleuthereus\npoly 655 343 738 276 807 356 722 425 Odeon of Pericles\npoly 564 460 678 414 684 442 627 505 586 515 Temenos of Dionysus Eleuthereus\npoly 300 32 332 42 323 67 296 64 Aglaureion\n\n#Parthenon\n#Old Temple of Athena\n#Erechtheum\n#Statue of Athena Promachos\n#Propylaea\n#Temple of Athena Nike\n#Eleusinion\n#Sanctuary of Artemis Brauronia or Brauroneion\n#Chalkotheke\n#Pandroseion\n#Arrephorion\n#Altar of Athena\n#Sanctuary of Zeus Polieus\n#Sanctuary of Pandion\n#Odeon of Herodes Atticus\n#Stoa of Eumenes\n#Sanctuary of Asclepius or Asclepieion\n#Theatre of Dionysus Eleuthereus\n#Odeon of Pericles\n#Temenos of Dionysus Eleuthereus\n#Aglaureion\n\nThe Acropolis Restoration Project\n\nThe Project began during 1975 but as of 2017 has almost ground to a halt.  The goal of the restoration was to reverse the decay of centuries of attrition, pollution, destruction stemming from military use, and misguided past restorations.  The project included collection and identification of all stone fragments, even small ones, from the Acropolis and its slopes and the attempt was made to restore as much as possible using reassembled original material (anastylosis), with new marble from Mount Penteli used sparingly.  All restoration was made using titanium dowels and is designed to be completely reversible, in case future experts decide to change things.  A combination of cutting-edge modern technology and extensive research and reinvention of ancient techniques were used.[http://www.lsa.umich.edu/UMICH/modgreek/Home/Window%20to%20Greek%20Culture/Lectures%20at%20U-M/LaUM_Mallouchou_restorationacropolis.pdf Fani Mallouchou-Tufano, \"The Restoration of the Athenian Acropolis\"] , University of Michigan. Retrieved 9 February 2013.\n\nThe Parthenon colonnades, largely destroyed by Venetian bombardment during the 17th century, were restored, with many wrongly assembled columns now properly placed.  The roof and floor of the Propylaea were partly restored, with sections of the roof made of new marble and decorated with blue and gold inserts, as in the original. Restoration of the Temple of Athena Nike was completed in 2010.[http://www.ysma.gr/static/files/Newsletter11_ENG.pdf \"2010 – 2011, The progress of restoration on the Acropolis\"], The Acropolis Restoration News, July 2011. Retrieved 9 February 2013.\n\nA total of 2,675 tons of architectural members were restored, with 686 stones reassembled from fragments of the originals, 905 patched with new marble, and 186 parts made entirely of new marble.  A total of 530 cubic meters of new Pentelic marble were used.[http://www.columbia.edu/cu/hellenic/ \"Acropolis Restoration Project-Lecture by Maria Ioannidou, Director, Acropolis Restoration Service\"], Columbia University. Retrieved 9 February 2013.\n\nCultural significance\n\nEvery four years, the Athenians had a festival called the Panathenaea that rivaled the Olympic Games in popularity. During the festival, a procession (believed to be depicted on the Parthenon frieze) traveled through the city via the Panathenaic Way and culminated on the Acropolis.  There, a new robe of woven wool (peplos) was placed on either the statue of Athena Polias in the Erechtheum (during a regular Panathenaea) or on the statue of Athena Parthenos in the Parthenon (during the Great Panathenaea, held every four years).\n\nWithin the later tradition of Western Civilization and classical revival the Acropolis, from at least the mid-18th century on, has often been invoked as a key symbol of the Greek legacy and of the glories of Classical Greece. Acropolis of Athens. http://en.wikipedia.org/?curid=2076."
  }
}
