{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=746",
  "eid" : "91cb50f0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778324351,
  "textBody" : "Azerbaijan ( ; , officially the Republic of Azerbaijan (, is a country in the South Caucasus region of Eurasia at the crossroads of Eastern Europe and Western Asia.While often politically aligned with Europe, Azerbaijan is generally considered to be at least mostly in Southwest Asia geographically with its northern part bisected by the standard Asia-Europe divide, the Greater Caucasus. The United Nations [http://unstats.un.org/unsd/methods/m49/m49regin.htm classification of world regions] places Azerbaijan in Western Asia; the CIA World Factbook places it mostly in Southwest Asia [https://www.cia.gov/library/publications/the-world-factbook/geos/aj.html] and [http://www.m-w.com/dictionary/Azerbaijan Merriam-Webster's Collegiate Dictionary] places it in both; [http://www.nationalgeographic.com/xpeditions/atlas/index.html?Parentasia&Rootmap\nazerba&Moded&SubMode\nw NationalGeographic.com], and [http://www.britannica.com/EBchecked/topic/46781/Azerbaijan Encyclopædia Britannica] also place Georgia in Asia. Conversely, some sources place Azerbaijan in Europe such as [http://worldatlas.com/webimage/countrys/eu.htm Worldatlas.com]. It is bound by the Caspian Sea to the east, Russia to the north, Georgia to the northwest, Armenia to the west and Iran to the south. The exclave of Nakhchivan is bound by Armenia to the north and east, Iran to the south and west, and has an 11 km long border with Turkey in the north west.\n\nThe Azerbaijan Democratic Republic proclaimed its independence in 1918 and became the first democratic state in the Muslim-oriented world. The country was incorporated into the Soviet Union in 1920 as the Azerbaijan Soviet Socialist Republic.\n The modern Republic of Azerbaijan proclaimed its independence on 30 August 1991,\n prior to the official dissolution of the USSR in December 1991. In September 1991, the Armenian majority of the disputed Nagorno-Karabakh region seceded to form the Republic of Artsakh.\n\n The region and seven adjacent districts outside it became de facto independent with the end of the Nagorno-Karabakh War in 1994. These regions are internationally recognized as part of Azerbaijan pending a solution to the status of the Nagorno-Karabakh, found through negotiations facilitated by the OSCE.\n\nAzerbaijan is a unitary semi-presidential republic. The country is a member state of the Council of Europe, the OSCE and the NATO Partnership for Peace (PfP) program. It is one of six independent Turkic states, an active member of the Turkic Council and the TÜRKSOY community. Azerbaijan has diplomatic relations with 158 countries and holds membership in 38 international organizations. It is one of the founding members of GUAM, the Commonwealth of Independent States (CIS)\n\n and the Organization for the Prohibition of Chemical Weapons. A member of the United Nations since 1992 after its independence, Azerbaijan was elected to membership in the newly established Human Rights Council by the United Nations General Assembly on 9 May 2006. Its term of office began on 19 June 2006.\n\n Azerbaijan is also a member state of the Non-Aligned Movement, holds observer status in World Trade Organization, and is a correspondent at the International Telecommunication Union.\n\nThe Constitution of Azerbaijan does not declare an official religion and all major political forces in the country are secularist. However, the majority of the population are of a Shiite Muslim background.\n\n Most Azerbaijanis, however, do not actively practice any religion, and the country has been seen to be one of the most irreligious countries in the Muslim world, with 53% stating religion has little to no importance in their lives, according to Pew Research Center and Gallup polls.[http://www.gallup.com/poll/114211/alabamians-iranians-common.aspx What Alabamians and Iranians Have in Common]. Gallup. Retrieved on 30 June 2017.[http://www.prweb.com/releases/2013/6/prweb10839650.htm Islam and Secularism: the Azerbaijani experience and its reflection in France]. Prweb.com (17 June 2013). Retrieved on 30 June 2017.[http://www.pewresearch.org/fact-tank/2017/02/27/muslims-and-islam-key-findings-in-the-u-s-and-around-the-world/ Muslims and Islam: Key findings in the U.S. and around the world | Pew Research Center]. Pewresearch.org (26 May 2017). Retrieved on 30 June 2017. Azerbaijan has a high level of human development which ranks on par with most Eastern European countries.\n\n It has a high rate of economic development\n\n and literacy,\n\n as well as a low rate of unemployment.\n\n However, the ruling party, the New Azerbaijan Party, has been accused of authoritarianism and human rights abuses.\n\nName\n\nAccording to a modern etymology, the term Azerbaijan derives from that of Atropates, a Persian satrap under the Achaemenid Empire, who was later reinstated as the satrap of Media under Alexander the Great.Nevertheless, \"despite being one of the chief vassals of Sasanian Shahanshah, the Albanian king had only a semblance of authority, and the Sassanid marzban (military governor) held most civil, religious, and military authority. The original etymology of this name is thought to have its roots in the once-dominant Zoroastrianism. In the Avesta's Frawardin Yasht (\"Hymn to the Guardian Angels\"), there is a mention of âterepâtahe ashaonô fravashîm ýazamaide, which literally translates from Avestan as \"we worship the fravashi of the holy Atropatene.\" The name \"Atropates\" itself is the Greek transliteration of an Old Iranian, probably Median, compounded name with the meaning \"Protected by the (Holy) Fire\" or \"The Land of the (Holy) Fire\". The Greek name was mentioned by Diodorus Siculus and Strabo. Over the span of millennia, the name evolved to  (Middle Persian), then to , ,  (New Persian) and present-day Azerbaijan.\n\nThe name Azerbaijan was first adopted for the area of the present-day Republic of Azerbaijan by the government of Musavat in 1918, after the collapse of the Russian Empire, when the independent Azerbaijan Democratic Republic was established. Until then, the designation had been used exclusively to identify the adjacent region of contemporary northwestern Iran, while the area of the Azerbaijan Democratic Republic was formerly referred to as Arran and Shirvan. The name adoptation was motivated by the prospect of uniting with the Persian Azerbaijanis as one entity, and was enacted despite Iranian protests.\n\nDuring the Soviet rule, the country was also spelled in English from the Russian transliteration as Azerbaydzhan.\n\nHistory\n\nAntiquity\n\nThe earliest evidence of human settlement in the territory of Azerbaijan dates back to the late Stone Age and is related to the Guruchay culture of Azokh Cave. The Upper Paleolithic and late Bronze Age cultures are attested in the caves of Tağılar, Damcılı, Zar, Yataq-yeri and in the necropolises of Leylatepe and Saraytepe.\n\nEarly settlements included the Scythians in the 9th century BC. Following the Scythians, Iranian Medes came to dominate the area to the south of the Aras. The Medes forged a vast empire between 900–700 BC, which was integrated into the Achaemenid Empire around 550 BC. The area was conquered by the Achaemenids leading to the spread of Zoroastrianism. Later it became part of Alexander the Great's Empire and its successor, the Seleucid Empire. During this period, Zoroastrianism spread in the Caucasus and Atropatene. Caucasian Albanians, the original inhabitants of northeastern Azerbaijan, ruled that area from around the 4th century BC, and established an independent kingdom.\n\nFrom the Sasanid period to the Safavid period\n\nThe Sasanian Empire turned Caucasian Albania into a vassal state in 252, while King Urnayr officially adopted Christianity as the state religion in the 4th century. Despite Sassanid rule, Albania remained an entity in the region until the 9th century, while fully subordinate to Sassanid Iran, and retained its monarchy. Despite being one of the chief vassals of the Sasanian emperor, the Albanian king had only a semblance of authority, and the Sasanian marzban (military governor) held most civil, religious, and military authority.\n\nIn the first half of the 7th century, Caucasian Albania, as a vassal of the Sasanians, came under nominal Muslim rule due to the Muslim conquest of Persia. The Umayyad Caliphate repulsed both the Sasanians and Byzantines from Transcaucasia and turned Caucasian Albania into a vassal state after Christian resistance led by King Javanshir, was suppressed in 667. The power vacuum left by the decline of the Abbasid Caliphate was filled by numerous local dynasties such as the Sallarids, Sajids, and Shaddadids. At the beginning of the 11th century, the territory was gradually seized by waves of Oghuz Turks from Central Asia. The first of these Turkic dynasties established was the Seljuk Empire, who entered the area now known as Azerbaijan by 1067.\n\nThe pre-Turkic population that lived on the territory of modern Azerbaijan spoke several Indo-European and Caucasian languages, among them Armenian\n map Caucasian Albania\n\nМоисей Хоренский. Армянская География VII в. Перевод Патканова К.П. СПб., 1877. стр. 40,17Hewsen, Robert H. \"The Kingdom of Artsakh,\" in T. Samuelian & M. Stone, eds. Medieval Armenian Culture. Chico, CA, 1983 and an Iranian language, Old Azeri, which was gradually replaced by a Turkic language, the early precursor of the Azerbaijani language of today.\n Some linguists have also stated that the Tati dialects of Iranian Azerbaijan and the Republic of Azerbaijan, like those spoken by the Tats, are descended from Old Azeri.\n\n Locally, the possessions of the subsequent Seljuk Empire were ruled by Eldiguzids, technically vassals of the Seljuk sultans, but sometimes de facto rulers themselves. Under the Seljuks, local poets such as Nizami Ganjavi and Khaqani gave rise to a blossoming of Persian literature on the territory of present-day Azerbaijan.\n\nThe local dynasty of the Shirvanshahs became a vassal state of Timur's Empire, and assisted him in his war with the ruler of the Golden Horde Tokhtamysh. Following Timur's death, two independent and rival states emerged: Kara Koyunlu and Aq Qoyunlu. The Shirvanshahs returned, maintaining a high degree of autonomy as local rulers and vassals from 861, for numerous centuries to come. In 1501, the Safavid dynasty of Iran subdued the Shirvanshahs, and gained its possessions. In the course of the next century, the Safavids converted the formerly Sunni population to Shia Islam,\n\n as they did with the population in what is modern-day Iran. The Safavids allowed the Shirvanshahs to remain in power, under Safavid suzerainty, until 1538, when Safavid king Tahmasp I (r. 1524–1576) completely deposed them, and made the area into the Safavid province of Shirvan. The Sunni Ottomans briefly managed to occupy parts of present-day Azerbaijan as a result of the Ottoman-Safavid War of 1578–1590; by the early 17th century, they were ousted by Safavid Iranian ruler Abbas I (r. 1588–1629). In the wake of the demise of the Safavid Empire, Baku and its environs were briefly occupied by the Russians as a consequence of the Russo-Persian War of 1722–1723. Despite brief intermissions such as these by Safavid Iran's neighboring rivals, the land of what is today Azerbaijan remained under Iranian rule from the earliest advent of the Safavids up to the course of the 19th century.\n\nContemporary history\n\nAfter the Safavids, the area was ruled by the Iranian Afsharid dynasty. After the death of Nader Shah (r. 1736–1747), many of his former subjects capitalized on the eruption of instability. Numerous self-ruling khanates with various forms of autonomy\n\n emerged in the area. The rulers of these khanates were directly related to the ruling dynasties of Iran, and were vassals and subjects of the Iranian shah.Encyclopedia of Soviet law By Ferdinand Joseph Maria Feldbrugge, Gerard Pieter van den Berg, William B. Simons, Page 457 The khanates exercised control over their affairs via international trade routes between Central Asia and the West.\n\nThereafter, the area was under the successive rule of the Iranian Zands and Qajars. From the late 18th century, Imperial Russia switched to a more aggressive geo-political stance towards its two neighbors and rivals to the south, namely Iran and the Ottoman Empire.Gabor Agoston, Bruce Alan Masters. [https://books.google.com/books?idQjzYdCxumFcC&pg\nPA125&dqrussia+tries+conquer+caucasus+from+iran+19th+century&hl\nnl&saX&ved\n0CCAQ6AEwAGoVChMIofudgoCJxgIVK53bCh0quwCt#vonepage&q\nrussia%20tries%20conquer%20caucasus%20from%20iran%2019th%20century&ffalse Encyclopedia of the Ottoman Empire] Infobase Publishing, 1 January 2009  p 125 Russia now actively tried to gain possession of the Caucasus region which was, for the most part, in the hands of Iran.\n In 1804, the Russians invaded and sacked the Iranian town of Ganja, sparking the Russo-Persian War of 1804–1813. The militarily superior Russians ended the Russo-Persian War of 1804–1813 with a victory.\n\nFollowing Qajar Iran's loss in the 1804–1813 war, it was forced to concede suzerainty over most of the khanates, along with Georgia and Dagestan to the Russian Empire, per the Treaty of Gulistan.Timothy C. Dowling [https://books.google.com/books?id\nKTq2BQAAQBAJ&pgPA728&dq\nrusso+persian+war+1804-1813&hlnl&sa\nX&eiQnOXVJXpCcz7UPevhPAK&ved\n0CCcQ6AEwAQ#vonepage&q\nrusso%20persian%20war%201804-1813&f=false Russia at War: From the Mongol Conquest to Afghanistan, Chechnya, and Beyond] pp 728–729 ABC-CLIO, 2 December 2014 \n\nThe area to the north of the river Aras, amongst which territory lies the contemporary Republic of Azerbaijan, was Iranian territory until it was occupied by Russia in the 19th century.\n\n About a decade later, in violation of the Gulistan treaty, the Russians invaded Iran's Erivan Khanate. This sparked the final bout of hostilities between the two, the Russo-Persian War of 1826–1828. The resulting Treaty of Turkmenchay, forced Qajar Iran to cede sovereignty over the Erivan Khanate, the Nakhchivan Khanate and the remainder of the Lankaran Khanate, comprising the last parts of the soil of the contemporary Azerbaijani Republic that were still in Iranian hands. After incorporation of all Caucasian territories from Iran into Russia, the new border between the two was set at the Aras River, which, upon the Soviet Union's disintegration, subsequently became part of the border between Iran and the Azerbaijan Republic.\n\nQajar Iran was forced to cede its Caucasian territories to Russia in the 19th century, which thus included the territory of the modern-day Azerbaijan Republic, while as a result of that cession, the Azerbaijani ethnic group is nowadays parted between two nations: Iran and Azerbaijan.Swietochowski, Tadeusz. [https://books.google.com/books?idEPP3ti4hysUC&pg\nPA104&dqrusso-persian+wars+parted+the+azerbaijanis&hl\nnl&saX&ved\n0CCAQ6AEwAGoVChMI07TdyuWVxgIV5EvbCh2SvQDLP#vonepage&q\nrusso-persian%20wars%20parted%20the%20azerbaijanis&f=false Eastern Europe, Russia and Central Asia 2003] Taylor and Francis, 2003.  p 104 Nevertheless, the number of ethnic Azerbaijanis in Iran far outnumber those in neighbouring Azerbaijan.\n\nAfter the collapse of the Russian Empire during World War I, the short-lived Transcaucasian Democratic Federative Republic was declared, constituting the present-day republics of Azerbaijan, Georgia, and Armenia.\n\nIt was followed by the March Days massacresRussia and a Divided Azerbaijan: A Borderland in Transition, by Tadeusz Świętochowski, Columbia University Press, 1995, p. 66 that took place between 30 March and 2 April 1918 in the city of Baku and adjacent areas of the Baku Governorate of the Russian Empire. When the republic dissolved in May 1918, the leading Musavat party declared independence as the Azerbaijan Democratic Republic (ADR), adopting the name of \"Azerbaijan\" for the new republic; a name that prior to the proclamation of the ADR was solely used to refer to the adjacent northwestern region of contemporary Iran. The ADR was the first modern parliamentary republic in the Muslim world.Schulze, Reinhard. A Modern History of the Islamic World. I.B.Tauris, 2000. . Among the important accomplishments of the Parliament was the extension of suffrage to women, making Azerbaijan the first Muslim nation to grant women equal political rights with men. Another important accomplishment of ADR was the establishment of Baku State University, which was the first modern-type university founded in the Muslim East.\n By March 1920, it was obvious that Soviet Russia would attack Baku. Vladimir Lenin said that the invasion was justified as Soviet Russia could not survive without Baku's oil. Independent Azerbaijan lasted only 23 months until the Bolshevik 11th Soviet Red Army invaded it, establishing the Azerbaijan SSR on 28 April 1920. Although the bulk of the newly formed Azerbaijani army was engaged in putting down an Armenian revolt that had just broken out in Karabakh, Azerbaijanis did not surrender their brief independence of 1918–20 quickly or easily. As many as 20,000 Azerbaijani soldiers died resisting what was effectively a Russian reconquest.\n\nOn 13 October 1921, the Soviet republics of Russia, Armenia, Azerbaijan, and Georgia signed an agreement with Turkey known as the Treaty of Kars. The previously independent Republic of Aras would also become the Nakhichevan Autonomous Soviet Socialist Republic within the Azerbaijan SSR by the treaty of Kars. On the other hand, Armenia was awarded the region of Zangezur and Turkey agreed to return Gyumri (then known as Alexandropol).\n\nDuring World War II, Azerbaijan played a crucial role in the strategic energy policy of the Soviet Union, with 80 percent of the Soviet Union's oil on the Eastern Front being supplied by Baku. By the Decree of the Supreme Soviet of the USSR in February 1942, the commitment of more than 500 workers and employees of the oil industry of Azerbaijan were awarded orders and medals. Operation Edelweiss carried out by the German Wehrmacht targeted Baku because of its importance as the energy (petroleum) dynamo of the USSR. A fifth of all Azerbaijanis fought in the Second World War from 1941 to 1945. Approximately 681,000 people with over 100,000 of them women went to the front, while the total population of Azerbaijan was 3.4 million at the time. Some 250,000 people from Azerbaijan were killed on the front. More than 130 Azerbaijanis were named Heroes of the Soviet Union. Azerbaijani Major-General Azi Aslanov was twice awarded the Hero of the Soviet Union.\n\nIndependence\n\nFollowing the politics of glasnost, initiated by Mikhail Gorbachev, civil unrest and ethnic strife grew in various regions of the Soviet Union, including Nagorno-Karabakh, an autonomous region of the Azerbaijan SSR. The disturbances in Azerbaijan, in response to Moscow's indifference to an already heated conflict, resulted in calls for independence and secession, which culminated in the Black January events in Baku. Later in 1990, the Supreme Council of the Azerbaijan SSR dropped the words \"Soviet Socialist\" from the title, adopted the \"Declaration of Sovereignty of the Azerbaijan Republic\" and restored the flag of the Azerbaijan Democratic Republic as the state flag. As a consequence of the failed coup which occurred in August in Moscow, on 18 October 1991, the Supreme Council of Azerbaijan adopted a Declaration of Independence which was affirmed by a nationwide referendum in December 1991, while the Soviet Union officially ceased to exist on 26 December 1991.\n\nThe early years of independence were overshadowed by the Nagorno-Karabakh war with the ethnic Armenian majority of Nagorno-Karabakh backed by Armenia.Full text of the Bishkek Protocol with signatures of representatives of Azerbaijan, Nagorno-Karabakh, and Armenia. http://peacemaker.un.org/armeniaazerbaijan-bishkekprotocol94 By the end of the hostilities in 1994, Armenians controlled up to 14–16 percent of Azerbaijani territory, including Nagorno-Karabakh itself.Thomas De Waal. Black Garden: Armenia And Azerbaijan Through Peace and War. New York: New York University Press, p. 286. . During the war many atrocities were committed including the massacres at Malibeyli and Gushchular, the Garadaghly massacre, the Agdaban and the Khojaly massacres. Furthermore, an estimated 30,000 people have been killed and more than a million people have been displaced.[http://belfercenter.ksg.harvard.edu/publication/1283/conflict_that_can_be_resolved_in_time.html A Conflict That Can Be Resolved in Time: Nagorno-Karabakh]. International Herald Tribune. 29 November 2003. Four United Nations Security Council Resolutions (822, 853, 874, and 884) demand for \"the immediate withdrawal of all Armenian forces from all occupied territories of Azerbaijan.\" Many Russians and Armenians left Azerbaijan during the 1990s.[http://www.eurasianet.org/departments/insight/articles/pp083003.shtml Southern Caucasus: Facing Integration Problems, Ethnic Russians Long For Better Life]. EurasiaNet.org. 30 August 2003. According to the 1970 census, there were 510,000 ethnic Russians and 484,000 Armenians in Azerbaijan.\"[http://encyclopedia2.thefreedictionary.com/Azerbaijan+Soviet+Socialist+Republic Azerbaijan Soviet Socialist Republic]\". The Great Soviet Encyclopedia (1979).\n\nIn 1993, democratically elected president Abulfaz Elchibey was overthrown by a military insurrection led by Colonel Surat Huseynov, which resulted in the rise to power of the former leader of Soviet Azerbaijan, Heydar Aliyev. In 1994, Surat Huseynov, by that time the prime minister, attempted another military coup against Heydar Aliyev, but he was arrested and charged with treason. A year later, in 1995, another coup was attempted against Aliyev, this time by the commander of the OMON special unit, Rovshan Javadov. The coup was averted, resulting in the killing of the latter and disbanding of Azerbaijan's OMON units. At the same time, the country was tainted by rampant corruption in the governing bureaucracy. In October 1998, Aliyev was reelected for a second term. Despite the much improved economy, particularly with the exploitation of the Azeri-Chirag-Guneshli oil field and Shah Deniz gas field, Aliyev's presidency was criticized due to suspected election frauds and corruption.\n\nIlham Aliyev, Heydar Aliyev's son, became chairman of the New Azerbaijan Party as well as President of Azerbaijan when his father died in 2003. He was reelected to a third term as president in October 2013.\n\nGeography\n\nGeographically Azerbaijan is located in the South Caucasus region of Eurasia, straddling Western Asia and Eastern Europe. It lies between latitudes 38° and 42° N, and longitudes 44° and 51° E. The total length of Azerbaijan's land borders is 2648 km, of which 1,007 kilometers are with Armenia, 756 kilometers with Iran, 480 kilometers with Georgia, 390 kilometers with Russia and 15 kilometers with Turkey. The coastline stretches for 800 km, and the length of the widest area of the Azerbaijani section of the Caspian Sea is 456 km. The territory of Azerbaijan extends 400 km from north to south, and 500 km from west to east.\n\nThree physical features dominate Azerbaijan: the Caspian Sea, whose shoreline forms a natural boundary to the east; the Greater Caucasus mountain range to the north; and the extensive flatlands at the country's center. There are also three mountain ranges, the Greater and Lesser Caucasus, and the Talysh Mountains, together covering approximately 40% of the country. The highest peak of Azerbaijan is Mount Bazardüzü (4,466 m), while the lowest point lies in the Caspian Sea (−28 m). Nearly half of all the mud volcanoes on Earth are concentrated in Azerbaijan, these volcanoes were also among nominees for the New7Wonders of Nature.\n\nThe main water sources are surface waters. However, only 24 of the 8,350 rivers are greater than 100 km in length. All the rivers drain into the Caspian Sea in the east of the country. The largest lake is Sarysu (67 km²), and the longest river is Kur (1,515 km), which is transboundary with Armenia. Azerbaijan's four main islands in the Caspian Sea have a combined area of over thirty square kilometers.\n\nSince the independence of Azerbaijan in 1991, the Azerbaijani government has taken drastic measures to preserve the environment of Azerbaijan. But national protection of the environment started to truly improve after 2001 when the state budget increased due to new revenues provided by the Baku-Tbilisi-Ceyhan pipeline. Within four years protected areas doubled and now make up eight percent of the country's territory. Since 2001 the government has set up seven large reserves and almost doubled the sector of the budget earmarked for environmental protection.\n\nLandscape\n\nAzerbaijan is home to a vast variety of landscapes. Over half of Azerbaijan's land mass consists of mountain ridges, crests, yailas, and plateaus which rise up to hypsometric levels of 400–1000 meters (including the Middle and Lower lowlands), in some places (Talis, Jeyranchol-Ajinohur and Langabiz-Alat foreranges) up to 100–120 meters, and others from 0–50 meters and up (Qobustan, Absheron). The rest of Azerbaijan's terrain consist of plains and lowlands. Hypsometric marks within the Caucasus region vary from about −28 meters at the Caspian Sea shoreline up to 4,466 meters (Bazardüzü peak).\n\nThe formation of climate in Azerbaijan is influenced particularly by cold arctic air masses of Scandinavian anticyclone, temperate of Siberian anticyclone, and Central Asian anticyclone. Azerbaijan's diverse landscape affects the ways air masses enter the country. The Greater Caucasus protects the country from direct influences of cold air masses coming from the north. That leads to the formation of subtropical climate on most foothills and plains of the country. Meanwhile, plains and foothills are characterized by high solar radiation rates.\n\n9 out of 11 existing climate zones are present in Azerbaijan. Both the absolute minimum temperature (  ) and the absolute maximum temperature ( 46 °C ) were observed in Julfa and Ordubad – regions of Nakhchivan Autonomous Republic. The maximum annual precipitation falls in Lankaran (1600 to) and the minimum in Absheron (200 to).\n\nRivers and lakes form the principal part of the water systems of Azerbaijan, they were formed over a long geological timeframe and changed significantly throughout that period. This is particularly evidenced by remnants of ancient rivers found throughout the country. The country's water systems are continually changing under the influence of natural forces and human introduced industrial activities. Artificial rivers (canals) and ponds are a part of Azerbaijan's water systems. In terms of water supply, Azerbaijan is below the average in the world with approximately 100000 m3 per year of water per square kilometer. All big water reservoirs are built on Kur. The hydrography of Azerbaijan basically belongs to the Caspian Sea basin.\n\nThere are 8,350 rivers of various lengths within Azerbaijan. Only 24 rivers are over 100 kilometers long. The Kura and Aras are the major rivers in Azerbaijan, they run through the Kura-Aras Lowland. The rivers that directly flow into the Caspian Sea, originate mainly from the north-eastern slope of the Major Caucasus and Talysh Mountains and run along the Samur–Devechi and Lankaran lowlands.\n\nYanar Dag, translated as \"burning mountain\", is a natural gas fire which blazes continuously on a hillside on the Absheron Peninsula on the Caspian Sea near Baku, which itself is known as the \"land of fire.\" Flames jet out into the air from a thin, porous sandstone layer. It is a tourist attraction to visitors to the Baku area.\n\nBiodiversity\n\nThe first reports on the richness and diversity of animal life in Azerbaijan can be found in travel notes of Eastern travelers. Animal carvings on architectural monuments, ancient rocks and stones survived up to the present times. The first information on the flora and fauna of Azerbaijan was collected during the visits of naturalists to Azerbaijan in the 17th century.\n\nThere are 106 species of mammals, 97 species of fish, 363 species of birds, 10 species of amphibians and 52 species of reptiles which have been recorded and classified in Azerbaijan. The national animal of Azerbaijan is the Karabakh horse, a mountain-steppe racing and riding horse endemic to Azerbaijan. The Karabakh horse has a reputation for its good temper, speed, elegance and intelligence. It is one of the oldest breeds, with ancestry dating to the ancient world. However, today the horse is an endangered species.\n\nAzerbaijan's flora consists of more than 4,500 species of higher plants. Due to the unique climate in Azerbaijan, the flora is much richer in the number of species than the flora of the other republics of the South Caucasus. About 67 percent of the species growing in the whole Caucasus can be found in Azerbaijan.\n\nPolitics\n\nThe structural formation of Azerbaijan's political system was completed by the adoption of the new Constitution on 12 November 1995. According to Article 23 of the Constitution, the state symbols of the Azerbaijan Republic are the flag, the coat of arms, and the national anthem. The state power in Azerbaijan is limited only by law for internal issues, but for international affairs is additionally limited by the provisions of international agreements.\n\nThe government of Azerbaijan is based on the separation of powers among the legislative, executive, and judicial branches. The legislative power is held by the unicameral National Assembly and the Supreme National Assembly in the Nakhchivan Autonomous Republic. Parliamentary elections are held every five years, on the first Sunday of November. The Yeni Azerbaijan Party, and independents loyal to the ruling government, currently hold almost all of the Parliament's 125 seats. During the 2010 Parliamentary election, the opposition parties, Musavat and Azerbaijani Popular Front Party, failed to win a single seat. European observers found numerous irregularities in the run-up to the election and on election day.\n\nThe executive power is held by the President, who is elected for a seven-year term by direct elections, and the Prime Minister. The president is authorized to form the Cabinet, a collective executive body, accountable to both the President and the National Assembly. The Cabinet of Azerbaijan consists primarily of the prime minister, his deputies, and ministers. The president does not have the right to dissolve the National Assembly, but has the right to veto its decisions. To override the presidential veto, the parliament must have a majority of 95 votes. The judicial power is vested in the Constitutional Court, Supreme Court, and the Economic Court. The president nominates the judges in these courts. The European Commission for the Efficiency of Justice (CEPEJ) report refers to the Azerbaijani justice model on the selection of new judges as best practice that reflects the particular features and the course of development towards ensuring the independence and quality of the judiciary in a new democracy.\n\nThe Security Council is the deliberative body under the president, and he organizes it according to the Constitution. It was established on 10 April 1997. The administrative department is not a part of the president's office but manages the financial, technical and pecuniary activities of both the president and his office.\n\nAlthough Azerbaijan has held several elections since regaining its independence and it has many of the formal institutions of democracy, it remains classified as \"not free\" (on border with \"partly free\") by Freedom House. In recent years, large numbers of Azerbaijani journalists, bloggers, lawyers, and human rights activists have been rounded up and jailed for their criticism of President Aliyev and government authorities.\"[https://www.washingtonpost.com/opinions/jailed-without-trial-in-azerbaijan/2015/03/01/34a1d342-bea1-11e4-bdfa-b8e8f594e6ee_story.html Jailed without trial in Azerbaijan],\" The Washington Post. 1 March 2015. Retrieved 26 September 2015. A resolution adopted by the European Parliament in September 2015 described Azerbaijan as \"having suffered the greatest decline in democratic governance in all of Eurasia over the past ten years,\" noting as well that its dialogue with the country on human rights has \"not made any substantial progress.\"\"[https://www.washingtonpost.com/opinions/no-this-is-the-truth-about-azerbaijan/2015/09/25/d68a6fd0-608f-11e5-b38e-06883aacba64_story.html No, this is the truth about Azerbaijan’s repression].\" The Washington Post. 25 September 2015. Retrieved 26 September 2015. On 17 March 2016, the President of Azerbaijan signed a decree pardoning more than a dozen of the persons regarded as political prisoners by some NGOs.[http://president.az/articles/18131 Azərbaycan Prezidentinin Rəsmi internet səhifəsi – SƏNƏDLƏR » Sərəncamlar Məhkum edilmiş bir sıra şəxslərin əfv olunması haqqında Azərbaycan Respublikası Prezidentinin Sərəncamı]. President.az. Retrieved on 1 July 2017. This decree was welcomed as a positive step by the US State Department.[https://2009-2017.state.gov/r/pa/prs/ps/2016/03/254820.htm Release of Activists, Journalists, and Political Party Members in Azerbaijan]. 2009–2017.state.gov. Retrieved on 1 July 2017. On 16 March 2017 another pardon decree was signed, which led to the release of additional persons regarded as political prisoners.[http://president.az/articles/23141 Azərbaycan Prezidentinin Rəsmi internet səhifəsi – SƏNƏDLƏR » Sərəncamlar Məhkum edilmiş bir sıra şəxslərin əfv olunması haqqında Azərbaycan Respublikası Prezidentinin Sərəncamı]. President.az. Retrieved on 1 July 2017.\n\nAzerbaijan has been harshly criticized for bribing foreign officials and diplomats in order to promote its causes abroad and legitimize its elections at home, a practice which has been termed as Caviar diplomacy. However, on 6 March 2017, ESISC (European Strategic Intelligence and Security Center) published a report called “The Armenian Connection” where it attacked human rights NGOs and research organisations criticising human rights violations and corruption in Azerbaijan.\nESISC in that report asserted that \"Caviar diplomacy\" report elaborated by ESI aimed to create climate of suspicion based on slander to form a network of MPs that would engage in a political war against Azerbaijan, and that the network composed of European PMs, Armenian officials and some NGOs: Human Rights Watch, Amnesty International, \"Human Rights House Foundation\", \"Open Dialog, European Stability Initiative, and Helsinki Committee for Human Rights, was financed by the Soros Foundation. According to Robert Coalson (Radio Free Europe), ESISC is a part of Baku's lobbying efforts to extend to the use of front think tanks to shift public opinion.[https://www.rferl.org/a/azerbaijan-baku-caviar-oil/25162410.html Baku Smooths Over Its Rights Record With A Thick Layer Of Caviar] // Radio Free Europe, November 08, 2013 Freedom Files Analytical Centre said that \"The report is written in the worst traditions of authoritarian propaganda\".[https://civicsolidarity.org/sites/default/files/az_lobbying_corruption_report_10_march_2017_public_version_color_1.pdf AN EXPLORATION INTO AZERBAIJAN’S SOPHISTICATED SYSTEM OF PROJECTING ITS INTERNATIONAL INFLUENCE, BUYING WESTERN POLITICIANS AND CAPTURING INTERGOVERNMENTAL ORGANISATIONS] // Freedom Files Analytical Centre (Civic Solidarity Platform), March 2017\n\nForeign relations\n\nThe short-lived Azerbaijan Democratic Republic succeeded in establishing diplomatic relations with six countries, sending diplomatic representatives to Germany and Finland. The process of international recognition of Azerbaijan's independence from the collapsing Soviet Union lasted roughly one year. The most recent country to recognize Azerbaijan was Bahrain, on 6 November 1996. Full diplomatic relations, including mutual exchanges of missions, were first established with Turkey, Pakistan, the United States, Iran and Israel. Azerbaijan has placed a particular emphasis on its \"special relationship\" with Turkey.\n\nAzerbaijan has diplomatic relations with 158 countries so far and holds membership in 38 international organizations. It holds observer status in the Non-Aligned Movement and World Trade Organization and is a correspondent at the International Telecommunication Union. On 9 May 2006 Azerbaijan was elected to membership in the newly established Human Rights Council by the United Nations General Assembly. The term of office began on 19 June 2006. Azerbaijan for the first time elected as a non-permanent member of the UN Security Council in 2011 with the support of 155 countries.\n\nForeign policy priorities of Azerbaijan include, first of all, the restoration of its territorial integrity; elimination of the consequences of occupation of Nagorno-Karabakh and seven other regions of Azerbaijan surrounding Nagorno-Karabakh; integration into European and Euro-Atlantic structure; contribution to international security; cooperation with international organizations; regional cooperation and bilateral relations; strengthening of defense capability; promotion of security by domestic policy means; strengthening of democracy; preservation of ethnic and religious tolerance; scientific, educational, and cultural policy and preservation of moral values; economic and social development; enhancing internal and border security; and migration, energy, and transportation security policy.\n\nThe Azerbaijani government, in late 2007, stated that the long-standing dispute over the Armenian-occupied territory of Nagorno-Karabakh is almost certain to spark a new war if it remains unresolved. The Government is in the process of increasing its military budget.\n\nAzerbaijan is an active member of international coalitions fighting international terrorism. Azerbaijan was one of the first countries to offer support after the September 11 attacks. The country is contributing to peacekeeping efforts in Kosovo, Afghanistan and Iraq. Azerbaijan is an active member of NATO's Partnership for Peace program. It also maintains good relations with the European Union and could potentially one day apply for membership.\n\nAdministrative divisions\n\nAzerbaijan is divided into 10 economic regions; 66 rayons (rayonlar, singular rayon) and 77 cities (şəhərlər, singular şəhər) of which 12 are under the direct authority of the republic. Moreover, Azerbaijan includes the Autonomous Republic (muxtar respublika) of Nakhchivan. The President of Azerbaijan appoints the governors of these units, while the government of Nakhchivan is elected and approved by the parliament of Nakhchivan Autonomous Republic.\n\n;Absheron Economic Region\n* Absheron (Abşeron)\n* Khizi (Xızı)\n* Baku (Bakı)\n* Sumqayit (Sumqayıt)\n;Aran Economic Region\n* Aghjabadi (Ağcabədi)\n* Aghdash (Ağdaş)\n* Barda (Bərdə)\n* Beylagan (Beyləqan)\n* Bilasuvar (Biləsuvar)\n* Goychay (Göyçay)\n* Hajigabul (Hacıqabul)\n* Imishli (İmişli)\n* Kurdamir (Kürdəmir)\n* Neftchala (Neftçala)\n* Saatly (Saatlı)\n* Sabirabad (Sabirabad)\n* Salyan (Salyan)\n* Ujar (Ucar)\n* Yevlakh (Yevlax)\n* Zardab (Zərdab)\n* Mingachevir (Mingəçevir)\n* Shirvan (Şirvan)\n* Yevlakh (Yevlax)\n;Daghlig Shirvan\n* Aghsu (Ağsu)\n* Gobustan (Qobustan)\n* Ismailly (İsmayıllı)\n* Shamakhy (Şamaxı)\n\n;Ganja-Gazakh\n* Aghstafa (Ağstafa)\n* Dashkasan (Daşkəsən)\n* Gadabay (Gədəbəy)\n* Gazakh (Qazax)\n* Goygol (Göygöl)\n* Goranboy (Goranboy)\n* Samukh (Samux)\n* Shamkir (Şəmkir)\n* Tovuz (Tovuz)\n* Ganja (Gəncə)\n* Naftalan (Naftalan)\n;Guba-Khachmaz\n* Guba (Quba)\n* Gusar (Qusar)\n* Khachmaz (Xaçmaz)\n* Shabran (Şabran)\n* Siyazan (Siyəzən)\n;Kalbajar-Lachin\n* Gubadly (Qubadlı)\n* Kalbajar (Kəlbəcər)\n* Lachin (Laçın)\n* Zangilan (Zəngilan)\n;Lankaran\n* Astara (Astara)\n* Jalilabad (Cəlilabad)\n* Lankaran (Lənkəran)\n* Lerik (Lerik)\n* Masally (Masallı)\n\n* Yardimly (Yardımlı)\n* Lankaran (Lənkəran)\n;Nakhchivan\n* Babek (Babək)\n* Julfa (Culfa)\n* Kangarli (Kəngərli)\n* Ordubad (Ordubad)\n* Sadarak (Sədərək)\n* Shahbuz (Şahbuz)\n* Sharur (Şərur)\n* Nakhchivan (Naxçıvan)\n;Shaki-Zaqatala\n* Balakan (Balakən)\n* Gabala (Qəbələ)\n* Gakh (Qax)\n* Oghuz (Oğuz)\n* Shaki (Şəki)\n* Zaqatala (Zaqatala)\n* Shaki (Şəki)\n;Yukhari Garabakh\n* Aghdam (Ağdam)\n* Fuzuli (Füzuli)\n* Jabrayil (Cəbrayıl)\n* Khojaly (Xocalı)\n* Khojavend (Xocavənd)\n* Shusha (Şuşa)\n* Tartar (Tərtər)\n* Khankendi (Xankəndi)\n* Shusha (Şuşa)\n\nNote: The cities under the direct authority of the republic in italics.\n\nMilitary\n\nThe history of the modern Azerbaijan army dates back to Azerbaijan Democratic Republic in 1918, when the National Army of the newly formed Azerbaijan Democratic Republic was created on 26 June 1918.[http://www.azembassy.com.pk/en/book/?getc3 Azerbaijan: Short History of Statehood] , Embassy of Republic of Azerbaijan in Pakistan, 2005, Chapter 3.[http://www.calend.ru/holidays/0/0/1393/ Creation of National Army in 1918] . When Azerbaijan gained independence after the dissolution of the Soviet Union, the Armed Forces of the Republic of Azerbaijan were created according to the Law on the Armed Forces of 9 October 1991.[http://www.base.spinform.ru/show_doc.fwx?Regnom\n2893 Law of the Republic of Azerbaijan on Armed Forces], No. 210-XII, 9 October 1991 . The original date of the establishment of the short-lived National Army is celebrated as Army Day (26 June) in today's Azerbaijan.[http://news.trend.az/index.shtml?shownews&newsid\n1232458&lang=EN Azerbaijan's Army Day (26 June)] declared by Presidential Decree of 22 May 1998.\nAs of 2002, Azerbaijan had 95,000 active personnel in its armed forces. There are also 17,000 paramilitary troops.C. W. Blandy [http://www.da.mod.uk/colleges/arag/document-listings/caucasus/08(17)CWB.pdf Azerbaijan: Is War Over Nagornyy Karabakh a Realistic Option? Advanced Research and Assessment Group. Caucasus Series 08/17. – Defense Academy of the United Kingdom, 2008, p.12] The armed forces have three branches: the Land Forces, the Air Forces and the Navy. Additionally the armed forces embrace several military sub-groups that can be involved in state defense when needed. These are the Internal Troops of the Ministry of Internal Affairs and the State Border Service, which includes the Coast Guard as well. The Azerbaijan National Guard is a further paramilitary force. It operates as a semi-independent entity of the Special State Protection Service, an agency subordinate to the President.\n\nAzerbaijan adheres to the Treaty on Conventional Armed Forces in Europe and has signed all major international arms and weapons treaties. Azerbaijan closely cooperates with NATO in programs such as Partnership for Peace and Individual Partnership Action Plan. Azerbaijan has deployed 151 of its Peacekeeping Forces in Iraq and another 184 in Afghanistan.\n\nThe defense budget of Azerbaijan for 2011 was set at US$3.1 billion. In addition to that, $1.36 billion was planned to be used for the needs of the defense industry, which bring up the total military budget to 4.6 billion. Azerbaijani President Ilham Aliyev said on 26 June 2011 that the defence spending reached $3.3 billion that year.\n\nAzerbaijan's defense budget for 2013 is $3.7 billion.\n\nAzerbaijani defense industry manufactures small arms, artillery systems, tanks, armors and noctovision devices, aviation bombs, pilotless vehicles, various military vehicles and military planes and helicopters.\n\nEconomy\n\nAfter gaining independence in 1991, Azerbaijan became a member of the International Monetary Fund, the World Bank, the European Bank for Reconstruction and Development, the Islamic Development Bank and the Asian Development Bank.\n\n The banking system of Azerbaijan consists of the Central Bank of Azerbaijan, commercial banks and non-banking credit organizations. The National (now Central) Bank was created in 1992 based on the Azerbaijan State Savings Bank, an affiliate of the former State Savings Bank of the USSR. The Central Bank serves as Azerbaijan's central bank, empowered to issue the national currency, the Azerbaijani manat, and to supervise all commercial banks. Two major commercial banks are UniBank and the state-owned International Bank of Azerbaijan, run by Dr. Jahangir Hajiyev.\n\nPushed up by spending and demand growth, the 2007 Q1 inflation rate reached 16.6%.\n Nominal incomes and monthly wages climbed 29% and 25% respectively against this figure, but price increases in non-oil industry encouraged inflation. Azerbaijan shows some signs of the so-called \"Dutch disease\" because of its fast-growing energy sector, which causes inflation and makes non-energy exports more expensive.\n\nIn the early 2000s the chronically high inflation was brought under control. This led to the launch of a new currency, the new Azerbaijani manat, on 1 January 2006, to cement the economic reforms and erase the vestiges of an unstable economy.\n\nIn 2008, Azerbaijan was cited as one of the top 10 reformers by the World Bank's Doing Business Report.\n\nAzerbaijan is also ranked 57th in the Global Competitiveness Report for 2010–2011, above other CIS countries.\n\n By 2012 the GDP of Azerbaijan had increased 20-fold from to its 1995 level.Bibliothek der Friedrich-Ebert-Stiftung, http://library.fes.de/pdf-files/id-moe/09454.pdf\n\nEnergy\n\n \n\nTwo-thirds of Azerbaijan is rich in oil and natural gas.\n\n The history of the oil industry of Azerbaijan dates back to the ancient period. Arabian historian and traveler Ahmed Al-Belaruri mentioned about the economics of Absheron peninsula in the ancient times, oil lands, also, white and black oil in Absheron.\n\nThe region of the Lesser Caucasus accounts for most of the country's gold, silver, iron, copper, titanium, chromium, manganese, cobalt, molybdenum, complex ore and antimony. In September 1994, a 30-year contract was signed between the State Oil Company of Azerbaijan Republic (SOCAR) and 13 oil companies, among them Amoco, BP, ExxonMobil, Lukoil and Statoil. As Western oil companies are able to tap deepwater oilfields untouched by the Soviet exploitation, Azerbaijan is considered one of the most important spots in the world for oil exploration and development. Meanwhile, the State Oil Fund of Azerbaijan was established as an extra-budgetary fund to ensure macroeconomic stability, transparency in the management of oil revenue, and safeguarding of resources for future generations.\n\nAzeriqaz, a sub-company of SOCAR, intends to ensure full gasification of the country by 2021.\n\nAzerbaijan is one of the sponsors of the East–West and North–South energy transport corridors. Baku–Tbilisi–Kars railway line will connect the Caspian region with Turkey, is expected to be completed in July 2017. The Trans-Anatolian Natural Gas Pipeline (TANAP) and Trans-Adriatic Pipeline (TAP) will deliver natural gas from Azerbaijan’s Shah Deniz gas to Turkey and Europe.\n\nAzerbaijan extended the agreement on development of ACG until 2050 according to the amended PSA signed on 14 September 2017 by SOCAR and co-venturers (BP, Chevron, INPEX, Statoil, ExxonMobil, TP, ITOCHU and ONGC Videsh).\n\nAgriculture\n\nAzerbaijan has the largest agricultural basin in the region. About 54.9 percent of Azerbaijan is agricultural land. At the beginning of 2007 there were 4,755,100 hectares of utilized agricultural area.\n\n In the same year the total wood resources counted 136 million m³. Azerbaijan's agricultural scientific research institutes are focused on meadows and pastures, horticulture and subtropical crops, green vegetables, viticulture and wine-making, cotton growing and medicinal plants.\n\n In some areas it is profitable to grow grain, potatoes, sugar beets, cotton\n\n and tobacco. Livestock, dairy products, and wine and spirits are also important farm products. The Caspian fishing industry concentrates on the dwindling stocks of sturgeon and beluga. In 2002 the Azerbaijani merchant marine had 54 ships.\n\nSome products previously imported from abroad have begun to be produced locally. Among them are Coca-Cola by Coca-Cola Bottlers LTD, beer by Baki-Kastel, parquet by Nehir and oil pipes by EUPEC Pipe Coating Azerbaijan.\n\nTourism\n\nTourism is an important part of the economy of Azerbaijan. The country was a well-known tourist spot in the 1980s. However, the fall of the Soviet Union, and the Nagorno-Karabakh War during the 1990s, damaged the tourist industry and the image of Azerbaijan as a tourist destination.\n\nIt was not until the 2000s that the tourism industry began to recover, and the country has since experienced a high rate of growth in the number of tourist visits and overnight stays.[http://www.azadliq.org/content/article/388501.html Azərbaycan Qarabağın turizm imkanlarını təbliğ edir]  In the recent years, Azerbaijan has also become a popular destination for religious, spa, and health care tourism. During winter, the Shahdag Mountain Resort offers skiing with state of the art facilities.\n\nThe government of Azerbaijan has set the development of Azerbaijan as an elite tourist destination as a top priority. It is a national strategy to make tourism a major, if not the single largest, contributor to the Azerbaijani economy. These activities are regulated by the Ministry of Culture and Tourism of Azerbaijan.\nThere are 63 countries which have visa-free score.[https://www.passportindex.org/byRank.php?ccode=az Global Passport Power Rank | Passport Index 2017]. Passportindex.org. Retrieved on 1 July 2017.\nE-visa[https://evisa.gov.az/en/ Home Page | The Electronic Visa System of Azerbaijan Republic]. Evisa.gov.az. Retrieved on 1 July 2017. – for a visit of foreigners of visa-required countries to the Republic of Azerbaijan.\n\nAccording to Travel and Tourism Competitiveness Report 2015 of the World Economic Forum Azerbaijan holds 84th place.Crotti, Robert and Misrahi, Tiffany(2015) [http://www3.weforum.org/docs/TT15/WEF_TTCR_Chapter1.1_2015.pdf Chapter 1.1 \"The Travel & Tourism Competitiveness Index 2015: T&T as a Resilient Contribution to National Development\"] in The Travel & Tourism Competitiveness Index 2015. World Economic Forum\n\nAzerbaijan placed among top ten countries due to the strongest growth in visitor exports in years of 2010–2016 according to the report prepared by the World Travel and Tourism Council.https://www.wttc.org/-/media/files/reports/economic-impact-research/2017-documents/global-economic-impact-and-issues-2017.pdf As well as, Azerbaijan is at the first place (46.1%) among the countries which have the fastest developing travel and tourism economies in addition with strong inbound international visitor spending last year.\n\nTransportation\n\nThe convenient location of Azerbaijan on the crossroad of major international traffic arteries, such as the Silk Road and the south–north corridor, highlights the strategic importance of transportation sector for the country's economy. The transport sector in the country includes roads, railways, aviation, and maritime transport.\n\nAzerbaijan is also an important economic hub in the transportation of raw materials. The Baku–Tbilisi–Ceyhan pipeline (BTC) became operational in May 2006 and extends more than 1,774 kilometers through the territories of Azerbaijan, Georgia and Turkey. The BTC is designed to transport up to 50 million tons of crude oil annually and carries oil from the Caspian Sea oilfields to global markets. The South Caucasus Pipeline, also stretching through the territory of Azerbaijan, Georgia and Turkey, became operational at the end of 2006 and offers additional gas supplies to the European market from the Shah Deniz gas field. Shah Deniz is expected to produce up to 296 billion cubic meters of natural gas per year. Azerbaijan also plays a major role in the EU-sponsored Silk Road Project.\n\nIn 2002, the Azerbaijani government established the Ministry of Transport with a broad range of policy and regulatory functions. In the same year, the country became a member of the Vienna Convention on Road Traffic. The highest priority being; upgrading the transport network and transforming transportation services into one of the key comparative advantages of the country, as this would be highly conducive to the development of other sectors of the economy.\n\nIn 2012, the construction of Kars–Tbilisi–Baku railway expected to provide transportation between Asia and Europe through connecting the railways of China and Kazakhstan in the east with Turkey's Marmaray to the European railway system in the west. Broad-gauge railways in 2010 stretched for 2918 km and electrified railways numbered 1278 km. By 2010, there were 35 airports and one heliport.\n\nScience and technology\n\nIn the 21st century, a new oil and gas boom helped to improve the situation in Azerbaijan's science and technology sectors, and the government launched a campaign aimed at modernization and innovation. The government estimates that profits from the information technology and communication industry will grow and become comparable with those from oil production.\n\nAzerbaijan has a large and steadily growing Internet sector, mostly uninfluenced by the global financial crisis; rapid growth is forecast for at least five more years.\n\nThe country has also been making progress in developing its telecoms sector. The Ministry of Communications & Information Technologies (MCIT), as well as being an operator through its role in Aztelekom, is both a policy-maker and regulator. Public pay phones are available for local calls and require the purchase of a token from the telephone exchange or some shops and kiosks. Tokens allow a call of indefinite duration. , there were 1,397,000 main telephone lines[https://www.cia.gov/library/publications/the-world-factbook/rankorder/2150rank.html CIA.gov], CIA World Factbook Telephones – main lines in use, Azerbaijan 1,397,000 main lines and 1,485,000 internet users.[https://www.cia.gov/library/publications/the-world-factbook/rankorder/2153rank.html CIA.gov], CIA World Factbook Internet users, Azerbaijan Internet users: 1,485,000. There are four GSM providers: Azercell, Bakcell, Azerfon (Nar Mobile), Nakhtel mobile network operators and one CDMA.\n\nIn the 21st century a number of prominent Azerbaijani geodynamics and geotectonics scientists, inspired by the fundamental works of Elchin Khalilov and others, designed hundreds of earthquake prediction stations and earthquake-resistant buildings that now constitute the bulk of The Republican Center of Seismic Service.\n\nThe Azerbaijan National Aerospace Agency launched its first satellite AzerSat 1 into orbit on 7 February 2013 from Guiana Space Centre in French Guiana at orbital positions 46° East. The satellite will cover Europe and significant part of Asian countries and Africa and will have transmission for TV, radio broadcasting and the internet. The launch of its own satellite on orbit is Azerbaijan's first action in realizing prospective projects to turn itself into a country with a space industry.\n\nDemographics\n\nFrom the total population of 9.705. 600 people as of the beginning of 2016, nearly 53,1% was urban population, the remaining 46,9% was the rural population. 50,2% of the total population were female.The sex ratio for total population in that year was therefore 0.99 males per female.[http://www.stat.gov.az/source/demoqraphy/ap/ Azərbaycanın əhalisi | Azərbaycan Respublikasının Dövlət Statistika Komitəsi]. Stat.gov.az. Retrieved on 1 July 2017.\n\nThe 2011 population growth-rate was 0.85%, compared to 1.09% worldwide. A significant factor restricting the population growth is a high level of migration. In 2011 Azerbaijan saw migration of −1.14/1,000 people.\n\nThe Azerbaijani diaspora is found in 42 countries and in turn there are many centers for ethnic minorities inside Azerbaijan, including the German cultural society \"Karelhaus\", Slavic cultural center, Azerbaijani-Israeli community, Kurdish cultural center, International Talysh Association, Lezgin national center \"Samur\", Azerbaijani-Tatar community, Crimean Tatars society, etc.\n\nEthnic groups\n\nThe ethnic composition of the population according to the 2009 population census: 91.60% Azerbaijanis, 2.02% Lezgians, 1.35% Armenians (almost all Armenians live in the break-away region of Nagorno-Karabakh), 1.34% Russians, 1.26% Talysh, 0.56% Avars, 0.43% Turks, 0.29% Tatars, 0.28% Tats, 0.24% Ukrainians, 0.14% Tsakhurs, 0.11% Georgians, 0.10% Jews, 0.07% Kurds, other 0.21%.\n\nIranian Azerbaijanis are by far the largest minority in Iran. The number of ethnic Azerbaijanis in Iran furthermore far outnumber those in neighboring Azerbaijan. The CIA World Factbook estimates Iranian Azerbaijanis as comprising at least 16% of Iran's population.CIA – The World Factbook. [https://www.cia.gov/library/publications/the-world-factbook/geos/ir.html CIA.gov]  \"Iran\".\n\nUrbanization\n\nIn total, Azerbaijan has 78 cities, 63 city districts, and one special legal status city. These are followed by 261 urban-type settlements and 4248 villages.\n\nLanguages\n\nThe official language is Azerbaijani (Turkic language), which is spoken by approximately 92% of the population as a mother tongue.[http://data.un.org/Data.aspx?d\nPOP&ftableCode%3a27%3bcountryCode%3a31%3brefYear%3a1999%2c2009%3bareaCode%3a0%3bsexCode%3a0&c\n2,3,10,15,16&s_countryEnglishNameOrderBy:asc,refYear:desc,areaCode:asc&v\n1 Population by language, sex and urban/rural residence], UN Data. Retrieved 27 August 2016. It belongs to the Turkic language family. Russian and Armenian (only in Nagorno-Karabakh) are also spoken, and each are the mother tongue of around 1.5% of the population respectively. Russian and English play significant roles as second or third languages of education and communication. There are a dozen other minority languages spoken natively in the country. Avar, Budukh, Georgian, Juhuri, Khinalug, Kryts, Lezgian, Rutul, Talysh, Tat, Tsakhur, and Udi are all spoken by small minorities. Some of these language communities are very small and their numbers are decreasing.Clifton, John M., editor. 2002 (vol 1.), 2003 (vol. 2). Studies in languages of Azerbaijan. Baku, Azerbaijan and Saint Petersburg, Russia: Institute of International Relations, Academy of Sciences of Azerbaijan and North Eurasian Group, SIL International. Armenian is almost exclusively spoken in the break-away Nagorno-Karabakh region.\n\nReligion\n\nAround 98% of the population are Muslims. 85% of the Muslims are Shia Muslims and 15% Sunni Muslims,[http://files.preslib.az/projects/remz/pdf_en/atr_din.pdf Administrative Department of the President of the Republic of Azerbaijan – Presidential Library – Religion]. (PDF) . Retrieved on 1 July 2017. and the Republic of Azerbaijan has the second highest Shia population percentage in the world.[http://www.pewforum.org/2009/10/07/mapping-the-global-muslim-population/ Mapping the Global Muslim Population | Pew Research Center]. Pewforum.org (7 October 2009). Retrieved on 1 July 2017. Other faiths are practised by the country's various ethnic groups. Under article 48 of its Constitution, Azerbaijan is a secular state and ensures religious freedom. In a 2006–2008 Gallup poll, only 21% of respondents from Azerbaijan stated that religion is an important part of their daily lives. This makes Azerbaijan the least religious Muslim-majority country in the world.[http://www.gallup.com/poll/114211/Alabamians-Iranians-Common.aspx GALLUP – What Alabamians and Iranians Have in Common] – data accessed on 19 August 2014\n\nOf the nation's religious minorities, the estimated 280,000 Christians (3.1%) are mostly Russian and Georgian Orthodox and Armenian Apostolic (almost all Armenians live in the break-away region of Nagorno-Karabakh). In 2003, there were 250 Roman Catholics. Other Christian denominations as of 2002 include Lutherans, Baptists and Molokans. There is also a small Protestant community. Azerbaijan also has an ancient Jewish population with a 2,500-year history; Jewish organizations estimate that 10,000–20,000 Jews remain in Azerbaijan. Azerbaijan also is home to members of the Bahá'í, Hare Krishna and Jehovah's Witnesses communities, as well as adherents of the other religious communities. Some religious communities have been unofficially restricted from religious freedom. A U.S. State Department report on the matter mentions detention of members of certain Muslim and Christian groups, and many groups have difficulty registering with the SCWRA.[https://www.state.gov/documents/organization/192997.pdf Azerbaijan]. state.gov\n\nEducation\n\nA relatively high percentage of Azerbaijanis have obtained some form of higher education, most notably in scientific and technical subjects. In the Soviet era, literacy and average education levels rose dramatically from their very low starting point, despite two changes in the standard alphabet, from Perso-Arabic script to Latin in the 1920s and from Roman to Cyrillic in the 1930s. According to Soviet data, 100 percent of males and females (ages nine to forty-nine) were literate in 1970. According to the United Nations Development Program Report 2009, the literacy rate in Azerbaijan is 99.5 percent.\n\nSince independence, one of the first laws that Azerbaijan's Parliament passed to disassociate itself from the Soviet Union was to adopt a modified-Latin alphabet to replace Cyrillic. Other than that the Azerbaijani system has undergone little structural change. Initial alterations have included the reestablishment of religious education (banned during the Soviet period) and curriculum changes that have reemphasized the use of the Azerbaijani language and have eliminated ideological content. In addition to elementary schools, the education institutions include thousands of preschools, general secondary schools, and vocational schools, including specialized secondary schools and technical schools. Education through the eighth grade is compulsory.\n\nCulture\n\nThe culture of Azerbaijan has developed as a result of many influences. Today, national traditions are well preserved in the country despite Western influences, including globalized consumer culture. Some of the main elements of the Azerbaijani culture are: music, literature, folk dances and art, cuisine, architecture, cinematography and Novruz Bayram. The latter is derived from the traditional celebration of the New Year in the ancient Iranian religion of Zoroastrianism. Novruz is a family holiday.\n\nThe profile of Azerbaijan's population consists, as stated above, of Azerbaijanis, as well as other nationalities or ethnic groups, compactly living in various areas of the country. Azerbaijani national and traditional dresses are the Chokha and Papakhi. There are radio broadcasts in Russian, Georgian, Kurdish, Lezgian and Talysh languages, which are financed from the state budget. Some local radio stations in Balakan and Khachmaz organize broadcasts in Avar and Tat. In Baku several newspapers are published in Russian, Kurdish (Dengi Kurd), Lezgian (Samur) and Talysh languages. Jewish society \"Sokhnut\" publishes the newspaper Aziz.\n\nMusic and folk dances\n\nMusic of Azerbaijan builds on folk traditions that reach back nearly a thousand years.David C. King. Azerbaijan, Marshall Cavendish, 2006, p. 94 For centuries Azerbaijani music has evolved under the badge of monody, producing rhythmically diverse melodies.Энциклопедический музыкальный словарь, 2-е изд., Москва, 1966 (Encyclopedical Music Dictionary (1966), 2nd ed., Moscow) Azerbaijani music has a branchy mode system, where chromatization of major and minor scales is of great importance. Among national musical instruments there are 14 string instruments, eight percussion instruments and six wind instruments. According to The Grove Dictionary of Music and Musicians, \"in terms of ethnicity, culture and religion the Azerbaijani are musically much closer to Iran than Turkey.\"\n\nMugham, meykhana and ashiq art are among the many musical traditions of Azerbaijan. Mugham is usually a suite with poetry and instrumental interludes. When performing mugham, the singers have to transform their emotions into singing and music. In contrast to the mugham traditions of Central Asian countries, Azerbaijani mugham is more free-form and less rigid; it is often compared to the improvised field of jazz. UNESCO proclaimed the Azerbaijani mugham tradition a Masterpiece of the Oral and Intangible Heritage of Humanity on 7 November 2003. Meykhana is a kind of traditional Azerbaijani distinctive folk unaccompanied song, usually performed by several people improvising on a particular subject.\n\nAshiq combines poetry, storytelling, dance and vocal and instrumental music into a traditional performance art that stands as a symbol of Azerbaijani culture. It is a mystic troubadour or traveling bard who sings and plays the saz. This tradition has its origin in the Shamanistic beliefs of ancient Turkic peoples.[http://vlib.iue.it/carrie/texts/carrie_books/paksoy-6/cae05.html \"ashik, shaman\"] – European University Institute, Florence, Italy (retrieved 10 August 2006). Ashiqs' songs are semi-improvised around common bases. Azerbaijan's ashiq art was included in the list of Intangible Cultural Heritage by the UNESCO on 30 September 2009.\n\nSince the mid-1960s, Western-influenced Azerbaijani pop music, in its various forms, that has been growing in popularity in Azerbaijan, while genres such as rock and hip hop are widely produced and enjoyed. Azerbaijani pop and Azerbaijani folk music arose with the international popularity of performers like Alim Qasimov, Rashid Behbudov, Vagif Mustafazadeh, Muslim Magomayev, Shovkat Alakbarova and Rubaba Muradova. Azerbaijan is an enthusiastic participant in the Eurovision Song Contest. Azerbaijan made its debut appearance at the 2008 Eurovision Song Contest. The country's entry gained third place in 2009 and fifth the following year. Ell and Nikki won the first place at the Eurovision Song Contest 2011 with the song \"Running Scared\", entitling Azerbaijan to host the contest in 2012, in Baku. They have never missed a Grand Final.\n\nThere are dozens of Azerbaijani folk dances. They are performed at formal celebrations and the dancers wear national clothes like the Chokha, which is well-preserved within the national dances. Most dances have a very fast rhythm. The national dance shows the characteristics of the Azerbaijani nation.\n\nLiterature\n\nAmong the medieval authors born within the territorial limits of modern Azerbaijani Republic was Persian poet and philosopher Nizami, called Ganjavi after his place of birth, Ganja, who was the author of the Khamseh (\"The Quintuplet\"), composed of five romantic poems, including \"The Treasure of Mysteries,\" \"Khosrow and Shīrīn,\" and \"Leyli and Mejnūn.\"[http://www.britannica.com/EBchecked/topic/46781/Azerbaijan/44294/Education Azerbaijan. Cultural life]. Encyclopædia Britannica.\n\nThe earliest known figure in Azerbaijani literature was Izzeddin Hasanoglu, who composed a divan consisting of Persian and Turkic ghazals.A.Caferoglu, \"Adhari(azeri)\", in Encyclopedia of Islam, (new edition), Vol. 1, (Leiden, 1986) In Persian ghazals he used his pen-name, while his Turkic ghazals were composed under his own name of Hasanoghlu.\n\nClassical literature in Azerbaijani was formed in the 14th century based on the various Early Middle Ages dialects of Tabriz and Shirvan. Among the poets of this period were Gazi Burhanaddin, Haqiqi (pen-name of Jahan-shah Qara Qoyunlu), and Habibi. The end of the 14th century was also the period of starting literary activity of Imadaddin Nesimi, one of the greatest Turkic Hurufi mystical poets of the late 14th and early 15th centuries and one of the most prominent early divan masters in Turkic literary history, who also composed poetry in Persian and Arabic. The divan and ghazal styles were further developed by poets Qasim al-Anvar, Fuzuli and Khatai (pen-name of Safavid Shah Ismail I).\n\nThe Book of Dede Korkut consists of two manuscripts copied in the 16th century,Michael E. Meeker, \"The Dede Korkut Ethic\", International Journal of Middle East Studies, Vol. 24, No. 3 (Aug. 1992), 395–417. excerpt: The Book of Dede Korkut is an early record of oral Turkic folktales in Anatolia, and as such, one of the mythic charters of Turkish nationalist ideology. The oldest versions of the Book of Dede Korkut consist of two manuscripts copied in the 16th century. The twelve stories that are recorded in these manuscripts are believed to be derived from a cycle of stories and songs circulating among Turkic peoples living in northeastern Anatolia and northwestern Azerbaijan. According to Lewis (1974), an older substratum of these oral traditions dates to conflicts between the ancient Oghuz and their Turkish rivals in Central Asia (the Pecheneks and the Kipchaks), but this substratum has been clothed in references to the 14th-century campaigns of the Akkoyunlu Confederation of Turkic tribes against the Georgians, the Abkhaz, and the Greeks in Trebizond. Such stories and songs would have emerged no earlier than the beginning of the 13th century, and the written versions that have reached us would have been composed no later than the beginning of the 15th century. By this time, the Turkic peoples in question had been in touch with Islamic civilization for several centuries, had come to call themselves \"Turcoman\" rather than \"Oghuz,\" had close associations with sedentary and urbanized societies, and were participating in Islamized regimes that included nomads, farmers, and townsmen. Some had abandoned their nomadic way of life altogether. was not written earlier than the 15th century.Cemal Kafadar(1995), \"in Between Two Worlds: Construction of the Ottoman states\", University of California Press, 1995. Excerpt: \"It was not earlier than the fifteenth century. Based on the fact that the author is buttering up both the Akkoyunlu and Ottoman rulers, it has been suggested that the composition belongs to someone living in the undefined border region lands between the two states during the reign of Uzun Hassan (1466–78). G. Lewis on the hand dates the composition \"fairly early in the 15th century at least.\"İlker Evrım Bınbaş, Encyclopædia Iranica, \"Oguz Khan Narratives\" [http://www.iranicaonline.org/articles/oguz-khan-narratives Encyclopædia Iranica | Articles]. Retrieved October 2010. \"The Ketāb-e Dede Qorqut, which is a collection of twelve stories reflecting the oral traditions of the Turkmens in the 15th-century eastern Anatolia, is also called Oḡuz-nāma\" It is a collection of 12 stories reflecting the oral tradition of Oghuz nomads. The 16th-century poet, Muhammed Fuzuli produced his timeless philosophical and lyrical Qazals in Arabic, Persian, and Azerbaijani. Benefiting immensely from the fine literary traditions of his environment, and building upon the legacy of his predecessors, Fizuli was destined to become the leading literary figure of his society. His major works include The Divan of Ghazals and The Qasidas. In the same century, Azerbaijani literature further flourished with the development of Ashik () poetic genre of bards. During the same period, under the pen-name of Khatāī ( for sinner) Shah Ismail I wrote about 1400 verses in Azerbaijani, which were later published as his Divan. A unique literary style known as qoshma ( for improvization) was introduced in this period, and developed by Shah Ismail and later by his son and successor, Shah Tahmasp I.\n\nIn the span of the 17th and 18th centuries, Fizuli's unique genres as well Ashik poetry were taken up by prominent poets and writers such as Qovsi of Tabriz, Shah Abbas Sani, Agha Mesih Shirvani, Nishat, Molla Vali Vidadi, Molla Panah Vagif, Amani, Zafar and others. Along with Turks, Turkmens and Uzbeks, Azerbaijanis also celebrate the Epic of Koroglu (from  for blind man's son), a legendary folk hero. Several documented versions of Koroglu epic remain at the Institute for Manuscripts of the National Academy of Sciences of Azerbaijan.\n\nModern literature in Azerbaijan is based on the Shirvani dialect mainly, while in Iran it is based on the Tabrizi one. The first newspaper in Azerbaijani, Akinchi was published in 1875. In the mid-19th century, it was taught in the schools of Baku, Ganja, Shaki, Tbilisi, and Yerevan. Since 1845, it has also been taught in the University of Saint Petersburg in Russia.\n\nFolk art\n\nAzerbaijanis have a rich and distinctive culture, a major part of which is decorative and applied art. This form of art is represented by a wide range of handicrafts, such as chasing, jeweler, engraving in metal, carving in wood, stone and bone, carpet-making, lasing, pattern weaving and printing, knitting and embroidery. Each of these types of decorative art, evidence of the endowments of the Azerbaijan nation, is very much in favor here. Many interesting facts pertaining to the development of arts and crafts in Azerbaijan were reported by numerous merchants, travelers and diplomats who had visited these places at different times.\n\nThe Azerbaijani carpet is a traditional handmade textile of various sizes, with dense texture and a pile or pile-less surface, whose patterns are characteristic of Azerbaijan's many carpet-making regions. In November 2010 the Azerbaijani carpet was proclaimed a Masterpiece of Intangible Heritage by UNESCO.\n\nAzerbaijan has been since the ancient times known as a center of a large variety of crafts. The archeological dig on the territory of Azerbaijan testifies to the well developed agriculture, stock raising, metal working, pottery, ceramics, and carpet-weaving that date as far back as to the 2nd millennium BC. Archeological sites in Dashbulaq, Hasansu, Zayamchai, and Tovuzchai uncovered from the BTC pipeline have revealed early Iron Age artifacts.\n\nAzerbaijani carpets can be categorized under several large groups and a multitude of subgroups. Scientific research of the Azerbaijani carpet is connected with the name of Latif Kerimov, a prominent scientist and artist. It was his classification that related the four large groups of carpets with the four geographical zones of Azerbaijan, Guba-Shirvan, Ganja-Kazakh, Karabakh and Tabriz.\n\nCuisine\n\nThe traditional cuisine is famous for an abundance of vegetables and greens used seasonally in the dishes. Fresh herbs, including mint, cilantro (coriander), dill, basil, parsley, tarragon, leeks, chives, thyme, marjoram, green onion, and watercress, are very popular and often accompany main dishes on the table. Climatic diversity and fertility of the land are reflected in the national dishes, which are based on fish from the Caspian Sea, local meat (mainly mutton and beef), and an abundance of seasonal vegetables and greens. Saffron-rice plov is the flagship food in Azerbaijan and black tea is the national beverage. Azerbaijanis often use traditional armudu (pear-shaped) glass as they have very strong tea culture. Popular traditional dishes include bozbash (lamb soup that exists in several regional varieties with the addition of different vegetables), qutab (fried turnover with a filling of greens or minced meat) and dushbara (sort of dumplings of dough filled with ground meat and flavor).\n\nArchitecture\n\nAzerbaijani architecture typically combines elements of East and West. Azerbaijiani architecture has heavy influences from Persian architecture. Many ancient architectural treasures such as the Maiden Tower and Palace of the Shirvanshahs in the Walled City of Baku survive in modern Azerbaijan. Entries submitted on the UNESCO World Heritage tentative list include the Ateshgah of Baku, Momine Khatun Mausoleum, Hirkan National Park, Binegadi National Park, Lökbatan Mud Volcano, Baku Stage Mountain, Caspian Shore Defensive Constructions, Shusha National Reserve, Ordubad National Reserve and the Palace of Shaki Khans.\n\nAmong other architectural treasures are Quadrangular Castle in Mardakan, Parigala in Yukhary Chardaglar, a number of bridges spanning the Aras River, and several mausoleums. In the 19th and early 20th centuries, little monumental architecture was created, but distinctive residences were built in Baku and elsewhere. Among the most recent architectural monuments, the Baku subways are noted for their lavish decor.\n\nThe task for modern Azerbaijani architecture is diverse application of modern aesthetics, the search for an architect's own artistic style and inclusion of the existing historico-cultural environment. Major projects such as Heydar Aliyev Cultural Center, Flame Towers, Baku Crystal Hall, Baku White City and SOCAR Tower have transformed the country's skyline and promotes its contemporary identity.\n\nVisual art\n\nAzerbaijani art includes one of the oldest art objects in the world, which were discovered as Gamigaya Petroglyphs in the territory of Ordubad Rayon are dated back to the 1st to 4th centuries BC. About 1500 dislodged and carved rock paintings with images of deer, goats, bulls, dogs, snakes, birds, fantastic beings and also people, carriages and various symbols had been found out on basalt rocks.[http://irs-az.com/pdf/090621154956.pdf Наскальные рисунки Гямигая]. irs-az.com. Norwegian ethnographer and adventurer Thor Heyerdahl was convinced that people from the area went to Scandinavia in about 100 AD and took their boat building skills with them, and transmuted them into the Viking boats in Northern Europe.\n\nOver the centuries, Azerbaijani art has gone through many stylistic changes. Azerbaijani painting is traditionally characterized by a warmth of colour and light, as exemplified in the works of Azim Azimzade and Bahruz Kangarli, and a preoccupation with religious figures and cultural motifs. Azerbaijani painting enjoyed preeminence in Caucasus for hundreds of years, from the Romanesque and Ottoman periods, and through the Soviet and Baroque periods, the latter two of which saw fruition in Azerbaijan. Other notable artists who fall within these periods include Sattar Bahlulzade, Togrul Narimanbekov, Tahir Salahov, Alakbar Rezaguliyev, Mirza Gadim Iravani, Mikayil Abdullayev and Boyukagha Mirzazade.\n\nCinema\n\nThe film industry in Azerbaijan dates back to 1898. In fact, Azerbaijan was among the first countries involved in cinematography. Therefore, it's not surprising that this apparatus soon showed up in Baku – at the start of the 20th century, this bay town on the Caspian was producing more than 50 percent of the world's supply of oil. Just like today, the oil industry attracted foreigners eager to invest and to work.[http://www.azer.com/aiweb/categories/magazine/53_folder/53_articles/53_100years.html Celebrating 100 Years in Film, not 80] by Aydin Kazimzade. Azerbaijan International, Autumn 1997 In 1919, during the Azerbaijan Democratic Republic, a documentary The Celebration of the Anniversary of Azerbaijani Independence was filmed on Azerbaijan's independence day, 27 May, and premiered in June 1919 at several theatres in Baku. After the Soviet power was established in 1920, Nariman Narimanov, Chairman of the Revolutionary Committee of Azerbaijan, signed a decree nationalizing Azerbaijan's cinema. This also influenced the creation of Azerbaijani animation.\n\nIn 1991, after Azerbaijan gained its independence from the Soviet Union, the first Baku International Film Festival East-West was held in Baku. In December 2000, the former President of Azerbaijan, Heydar Aliyev, signed a decree proclaiming 2 August to be the professional holiday of filmmakers of Azerbaijan. Today Azerbaijani filmmakers are again dealing with issues similar to those faced by cinematographers prior to the establishment of the Soviet Union in 1920. Once again, both choice of content and sponsorship of films are largely left up to the initiative of the filmmaker.\n\nMedia and media freedom\n\nThere are three state-owned television channels: AzTV, Idman TV and Medeniyyet TV. One public channel and 6 private channels: İctimai Television, ANS TV, Space TV, Lider TV, Azad Azerbaijan TV, Xazar TV and Region TV.\n\nHuman rights in Azerbaijan\n\nThe Constitution of Azerbaijan claims to guarantee freedom of speech, but this is denied in practice. After several years of decline in press and media freedom, in 2014 the media environment in Azerbaijan deteriorated rapidly under a governmental campaign to silence any opposition and criticism, even while the country led the Committee of Ministers of the Council of Europe (May–November 2014). Spurious legal charges and impunity in violence against journalists have remained the norm.Parliamentary Assembly of the Council of Europe, [http://www.cfom.org.uk/wp-content/uploads/2014/07/PACE-HORSLEY-FINAL-2014-REPORT-AAC-25_14-Flego-protection-of-media-freedom-18-June.pdf The Protection of media freedom in Europe].Background report prepared by Mr William Horsley, special representative for media freedom of the Association of European Journalists All foreign broadcasts are banned in the country.Freedom House, [https://freedomhouse.org/report/freedom-press/2015/azerbaijan Azerbaijan] 2015 Press Freedom report\n\nAccording to the 2013 Freedom House Freedom of the Press report, Azerbaijan's press freedom status is \"not free,\" and Azerbaijan ranks 177th out of 196 countries.\n\nRadio Free Europe/Radio Liberty and Voice of America are banned in Azerbaijan.\n\nDuring the last few years, three journalists were killed and several prosecuted in trials described as unfair by international human rights organizations. Azerbaijan has the biggest number of journalists imprisoned in Europe and Central Asia in 2015, according to the Committee to Protect Journalists, and is the 5th most censored country in the world, ahead of Iran and China.\n\nA report by an Amnesty International researcher in October 2015 points to '...the severe deterioration of human rights in Azerbaijan over the past few years. Sadly Azerbaijan has been allowed to get away with unprecedented levels of repression and in the process almost wipe out its civil society'. Amnesty's 2015/16 annual report on the country stated ' ... persecution of political dissent continued. Human rights organizations remained unable to resume their work. At least 18 prisoners of conscience remained in detention at the end of the year. Reprisals against independent journalists and activists persisted both in the country and abroad, while their family members also faced harassment and arrests. International human rights monitors were barred and expelled from the country. Reports of torture and other ill-treatment persisted.'\n\nThe Guardian reported in April 2017 that \"Azerbaijan’s ruling elite operated a secret $2.9bn (£2.2bn) scheme to pay prominent Europeans, buy luxury goods and launder money through a network of opaque British companies .... Leaked data shows that the Azerbaijani leadership, accused of serial human rights abuses, systemic corruption and rigging elections, made more than 16,000 covert payments from 2012 to 2014. Some of this money went to politicians and journalists, as part of an international lobbying operation to deflect criticism of Azerbaijan’s president, Ilham Aliyev, and to promote a positive image of his oil-rich country.\" There was no suggestion that all recipients were aware of the source of the money as it arrived via a disguised route.\n\nSports\n\nFreestyle wrestling has been traditionally regarded as Azerbaijan's national sport, in which Azerbaijan won up to fourteen medals, including four golds since joining the National Olympic Committee. Currently, the most popular sports include football and wrestling.\n\nFootball is the most popular sport in Azerbaijan, and the Association of Football Federations of Azerbaijan with 9,122 registered players, is the largest sporting association in the country. The national football team of Azerbaijan demonstrates relatively low performance in the international arena compared to the nation football clubs. The most successful Azerbaijani football clubs are Neftchi Baku, Qarabağ, and Gabala. In 2012, Neftchi Baku became the first Azerbaijani team to advance to the group stage of a European competition, beating APOEL of Cyprus 4–2 on aggregate in the play-off round of the 2012-13 UEFA Europa League. In 2014, Qarabağ became the second Azerbaijani club advancing to the group stage of UEFA Europa League. In 2017, after beating Copenhagen 2–2(a) in the play-off round of the UEFA Champions League, Qarabağ became the first Azerbaijani club to reach the Group stage. Futsal is another popular sport in Azerbaijan. The Azerbaijan national futsal team reached fourth place in the 2010 UEFA Futsal Championship, while domestic club Araz Naxçivan clinched bronze medals at the 2009–10 UEFA Futsal Cup and 2013–14 UEFA Futsal Cup. Azerbaijan was the main sponsor of Spanish football club Atlético de Madrid during seasons 2013/2014 and 2014/2015, a partnership that the club described should 'promote the image of Azerbaijan in the world'.\n\nBackgammon also plays a major role in Azerbaijani culture. The game is very popular in Azerbaijan and is widely played among the local public.[http://www.inforing.net/publications/infopress/sport.php?ELEMENT_ID=3348 Нарды – игра, требующая сноровки и удачи]  There are also different variations of backgammon developed and analyzed by Azerbaijani experts.\n\nAzerbaijan is one of the leading volleyball countries in the world and its Azerbaijan Women's Volleyball Super League is one of strongest women leagues in world. Its women's national team came fourth at the 2005 European Championship. Over the last years, clubs like Rabita Baku and Azerrail Baku achieved great success at European cups. Azerbaijani volleyball players include likes of Valeriya Korotenko, Oksana Parkhomenko, Inessa Korkmaz, Natalya Mammadova and Alla Hasanova.\n\nOther well-known Azerbaijani athletes are Namig Abdullayev, Toghrul Asgarov, Rovshan Bayramov, Sharif Sharifov, Mariya Stadnik and Farid Mansurov in wrestling, Nazim Huseynov, Elnur Mammadli, Elkhan Mammadov and Rustam Orujov in judo, Rafael Aghayev in karate, Magomedrasul Majidov and Aghasi Mammadov in boxing, Nizami Pashayev in Olympic weightlifting, Azad Asgarov in pankration, Eduard Mammadov in kickboxing, and K-1 fighter Zabit Samedov.\n\nAzerbaijan has a Formula One race-track and the country hosted its first Formula One Grand Prix on 19 June 2016. Other annual sporting events held in the country are the Baku Cup tennis tournament and the Tour d'Azerbaïdjan cycling race.\n\nAzerbaijan hosted several major sport competitions since the late 2000s, including the 2013 F1 Powerboat World Championship, 2012 FIFA U-17 Women's World Cup, 2011 AIBA World Boxing Championships, 2010 European Wrestling Championships, 2009 Rhythmic Gymnastics European Championships, 2014 European Taekwondo Championships, 2014 Rhythmic Gymnastics European Championships, 2016 World Chess Olympiad. On 8 December 2012, Baku was selected to host the 2015 European Games, the first to be held in competition's history. Baku is also set to host the fourth Islamic Solidarity Games in 2017.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Azerbaijan" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=746" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Azerbaijan ( ; , officially the Republic of Azerbaijan (, is a country in the South Caucasus region of Eurasia at the crossroads of Eastern Europe and Western Asia.While often politically aligned with Europe, Azerbaijan is generally considered to be at least mostly in Southwest Asia geographically with its northern part bisected by the standard Asia-Europe divide, the Greater Caucasus. The United Nations [http://unstats.un.org/unsd/methods/m49/m49regin.htm classification of world regions] places Azerbaijan in Western Asia; the CIA World Factbook places it mostly in Southwest Asia [https://www.cia.gov/library/publications/the-world-factbook/geos/aj.html] and [http://www.m-w.com/dictionary/Azerbaijan Merriam-Webster's Collegiate Dictionary] places it in both; [http://www.nationalgeographic.com/xpeditions/atlas/index.html?Parentasia&Rootmap\nazerba&Moded&SubMode\nw NationalGeographic.com], and [http://www.britannica.com/EBchecked/topic/46781/Azerbaijan Encyclopædia Britannica] also place Georgia in Asia. Conversely, some sources place Azerbaijan in Europe such as [http://worldatlas.com/webimage/countrys/eu.htm Worldatlas.com]. It is bound by the Caspian Sea to the east, Russia to the north, Georgia to the northwest, Armenia to the west and Iran to the south. The exclave of Nakhchivan is bound by Armenia to the north and east, Iran to the south and west, and has an 11 km long border with Turkey in the north west.\n\nThe Azerbaijan Democratic Republic proclaimed its independence in 1918 and became the first democratic state in the Muslim-oriented world. The country was incorporated into the Soviet Union in 1920 as the Azerbaijan Soviet Socialist Republic.\n The modern Republic of Azerbaijan proclaimed its independence on 30 August 1991,\n prior to the official dissolution of the USSR in December 1991. In September 1991, the Armenian majority of the disputed Nagorno-Karabakh region seceded to form the Republic of Artsakh.\n\n The region and seven adjacent districts outside it became de facto independent with the end of the Nagorno-Karabakh War in 1994. These regions are internationally recognized as part of Azerbaijan pending a solution to the status of the Nagorno-Karabakh, found through negotiations facilitated by the OSCE.\n\nAzerbaijan is a unitary semi-presidential republic. The country is a member state of the Council of Europe, the OSCE and the NATO Partnership for Peace (PfP) program. It is one of six independent Turkic states, an active member of the Turkic Council and the TÜRKSOY community. Azerbaijan has diplomatic relations with 158 countries and holds membership in 38 international organizations. It is one of the founding members of GUAM, the Commonwealth of Independent States (CIS)\n\n and the Organization for the Prohibition of Chemical Weapons. A member of the United Nations since 1992 after its independence, Azerbaijan was elected to membership in the newly established Human Rights Council by the United Nations General Assembly on 9 May 2006. Its term of office began on 19 June 2006.\n\n Azerbaijan is also a member state of the Non-Aligned Movement, holds observer status in World Trade Organization, and is a correspondent at the International Telecommunication Union.\n\nThe Constitution of Azerbaijan does not declare an official religion and all major political forces in the country are secularist. However, the majority of the population are of a Shiite Muslim background.\n\n Most Azerbaijanis, however, do not actively practice any religion, and the country has been seen to be one of the most irreligious countries in the Muslim world, with 53% stating religion has little to no importance in their lives, according to Pew Research Center and Gallup polls.[http://www.gallup.com/poll/114211/alabamians-iranians-common.aspx What Alabamians and Iranians Have in Common]. Gallup. Retrieved on 30 June 2017.[http://www.prweb.com/releases/2013/6/prweb10839650.htm Islam and Secularism: the Azerbaijani experience and its reflection in France]. Prweb.com (17 June 2013). Retrieved on 30 June 2017.[http://www.pewresearch.org/fact-tank/2017/02/27/muslims-and-islam-key-findings-in-the-u-s-and-around-the-world/ Muslims and Islam: Key findings in the U.S. and around the world | Pew Research Center]. Pewresearch.org (26 May 2017). Retrieved on 30 June 2017. Azerbaijan has a high level of human development which ranks on par with most Eastern European countries.\n\n It has a high rate of economic development\n\n and literacy,\n\n as well as a low rate of unemployment.\n\n However, the ruling party, the New Azerbaijan Party, has been accused of authoritarianism and human rights abuses.\n\nName\n\nAccording to a modern etymology, the term Azerbaijan derives from that of Atropates, a Persian satrap under the Achaemenid Empire, who was later reinstated as the satrap of Media under Alexander the Great.Nevertheless, \"despite being one of the chief vassals of Sasanian Shahanshah, the Albanian king had only a semblance of authority, and the Sassanid marzban (military governor) held most civil, religious, and military authority. The original etymology of this name is thought to have its roots in the once-dominant Zoroastrianism. In the Avesta's Frawardin Yasht (\"Hymn to the Guardian Angels\"), there is a mention of âterepâtahe ashaonô fravashîm ýazamaide, which literally translates from Avestan as \"we worship the fravashi of the holy Atropatene.\" The name \"Atropates\" itself is the Greek transliteration of an Old Iranian, probably Median, compounded name with the meaning \"Protected by the (Holy) Fire\" or \"The Land of the (Holy) Fire\". The Greek name was mentioned by Diodorus Siculus and Strabo. Over the span of millennia, the name evolved to  (Middle Persian), then to , ,  (New Persian) and present-day Azerbaijan.\n\nThe name Azerbaijan was first adopted for the area of the present-day Republic of Azerbaijan by the government of Musavat in 1918, after the collapse of the Russian Empire, when the independent Azerbaijan Democratic Republic was established. Until then, the designation had been used exclusively to identify the adjacent region of contemporary northwestern Iran, while the area of the Azerbaijan Democratic Republic was formerly referred to as Arran and Shirvan. The name adoptation was motivated by the prospect of uniting with the Persian Azerbaijanis as one entity, and was enacted despite Iranian protests.\n\nDuring the Soviet rule, the country was also spelled in English from the Russian transliteration as Azerbaydzhan.\n\nHistory\n\nAntiquity\n\nThe earliest evidence of human settlement in the territory of Azerbaijan dates back to the late Stone Age and is related to the Guruchay culture of Azokh Cave. The Upper Paleolithic and late Bronze Age cultures are attested in the caves of Tağılar, Damcılı, Zar, Yataq-yeri and in the necropolises of Leylatepe and Saraytepe.\n\nEarly settlements included the Scythians in the 9th century BC. Following the Scythians, Iranian Medes came to dominate the area to the south of the Aras. The Medes forged a vast empire between 900–700 BC, which was integrated into the Achaemenid Empire around 550 BC. The area was conquered by the Achaemenids leading to the spread of Zoroastrianism. Later it became part of Alexander the Great's Empire and its successor, the Seleucid Empire. During this period, Zoroastrianism spread in the Caucasus and Atropatene. Caucasian Albanians, the original inhabitants of northeastern Azerbaijan, ruled that area from around the 4th century BC, and established an independent kingdom.\n\nFrom the Sasanid period to the Safavid period\n\nThe Sasanian Empire turned Caucasian Albania into a vassal state in 252, while King Urnayr officially adopted Christianity as the state religion in the 4th century. Despite Sassanid rule, Albania remained an entity in the region until the 9th century, while fully subordinate to Sassanid Iran, and retained its monarchy. Despite being one of the chief vassals of the Sasanian emperor, the Albanian king had only a semblance of authority, and the Sasanian marzban (military governor) held most civil, religious, and military authority.\n\nIn the first half of the 7th century, Caucasian Albania, as a vassal of the Sasanians, came under nominal Muslim rule due to the Muslim conquest of Persia. The Umayyad Caliphate repulsed both the Sasanians and Byzantines from Transcaucasia and turned Caucasian Albania into a vassal state after Christian resistance led by King Javanshir, was suppressed in 667. The power vacuum left by the decline of the Abbasid Caliphate was filled by numerous local dynasties such as the Sallarids, Sajids, and Shaddadids. At the beginning of the 11th century, the territory was gradually seized by waves of Oghuz Turks from Central Asia. The first of these Turkic dynasties established was the Seljuk Empire, who entered the area now known as Azerbaijan by 1067.\n\nThe pre-Turkic population that lived on the territory of modern Azerbaijan spoke several Indo-European and Caucasian languages, among them Armenian\n map Caucasian Albania\n\nМоисей Хоренский. Армянская География VII в. Перевод Патканова К.П. СПб., 1877. стр. 40,17Hewsen, Robert H. \"The Kingdom of Artsakh,\" in T. Samuelian & M. Stone, eds. Medieval Armenian Culture. Chico, CA, 1983 and an Iranian language, Old Azeri, which was gradually replaced by a Turkic language, the early precursor of the Azerbaijani language of today.\n Some linguists have also stated that the Tati dialects of Iranian Azerbaijan and the Republic of Azerbaijan, like those spoken by the Tats, are descended from Old Azeri.\n\n Locally, the possessions of the subsequent Seljuk Empire were ruled by Eldiguzids, technically vassals of the Seljuk sultans, but sometimes de facto rulers themselves. Under the Seljuks, local poets such as Nizami Ganjavi and Khaqani gave rise to a blossoming of Persian literature on the territory of present-day Azerbaijan.\n\nThe local dynasty of the Shirvanshahs became a vassal state of Timur's Empire, and assisted him in his war with the ruler of the Golden Horde Tokhtamysh. Following Timur's death, two independent and rival states emerged: Kara Koyunlu and Aq Qoyunlu. The Shirvanshahs returned, maintaining a high degree of autonomy as local rulers and vassals from 861, for numerous centuries to come. In 1501, the Safavid dynasty of Iran subdued the Shirvanshahs, and gained its possessions. In the course of the next century, the Safavids converted the formerly Sunni population to Shia Islam,\n\n as they did with the population in what is modern-day Iran. The Safavids allowed the Shirvanshahs to remain in power, under Safavid suzerainty, until 1538, when Safavid king Tahmasp I (r. 1524–1576) completely deposed them, and made the area into the Safavid province of Shirvan. The Sunni Ottomans briefly managed to occupy parts of present-day Azerbaijan as a result of the Ottoman-Safavid War of 1578–1590; by the early 17th century, they were ousted by Safavid Iranian ruler Abbas I (r. 1588–1629). In the wake of the demise of the Safavid Empire, Baku and its environs were briefly occupied by the Russians as a consequence of the Russo-Persian War of 1722–1723. Despite brief intermissions such as these by Safavid Iran's neighboring rivals, the land of what is today Azerbaijan remained under Iranian rule from the earliest advent of the Safavids up to the course of the 19th century.\n\nContemporary history\n\nAfter the Safavids, the area was ruled by the Iranian Afsharid dynasty. After the death of Nader Shah (r. 1736–1747), many of his former subjects capitalized on the eruption of instability. Numerous self-ruling khanates with various forms of autonomy\n\n emerged in the area. The rulers of these khanates were directly related to the ruling dynasties of Iran, and were vassals and subjects of the Iranian shah.Encyclopedia of Soviet law By Ferdinand Joseph Maria Feldbrugge, Gerard Pieter van den Berg, William B. Simons, Page 457 The khanates exercised control over their affairs via international trade routes between Central Asia and the West.\n\nThereafter, the area was under the successive rule of the Iranian Zands and Qajars. From the late 18th century, Imperial Russia switched to a more aggressive geo-political stance towards its two neighbors and rivals to the south, namely Iran and the Ottoman Empire.Gabor Agoston, Bruce Alan Masters. [https://books.google.com/books?idQjzYdCxumFcC&pg\nPA125&dqrussia+tries+conquer+caucasus+from+iran+19th+century&hl\nnl&saX&ved\n0CCAQ6AEwAGoVChMIofudgoCJxgIVK53bCh0quwCt#vonepage&q\nrussia%20tries%20conquer%20caucasus%20from%20iran%2019th%20century&ffalse Encyclopedia of the Ottoman Empire] Infobase Publishing, 1 January 2009  p 125 Russia now actively tried to gain possession of the Caucasus region which was, for the most part, in the hands of Iran.\n In 1804, the Russians invaded and sacked the Iranian town of Ganja, sparking the Russo-Persian War of 1804–1813. The militarily superior Russians ended the Russo-Persian War of 1804–1813 with a victory.\n\nFollowing Qajar Iran's loss in the 1804–1813 war, it was forced to concede suzerainty over most of the khanates, along with Georgia and Dagestan to the Russian Empire, per the Treaty of Gulistan.Timothy C. Dowling [https://books.google.com/books?id\nKTq2BQAAQBAJ&pgPA728&dq\nrusso+persian+war+1804-1813&hlnl&sa\nX&eiQnOXVJXpCcz7UPevhPAK&ved\n0CCcQ6AEwAQ#vonepage&q\nrusso%20persian%20war%201804-1813&f=false Russia at War: From the Mongol Conquest to Afghanistan, Chechnya, and Beyond] pp 728–729 ABC-CLIO, 2 December 2014 \n\nThe area to the north of the river Aras, amongst which territory lies the contemporary Republic of Azerbaijan, was Iranian territory until it was occupied by Russia in the 19th century.\n\n About a decade later, in violation of the Gulistan treaty, the Russians invaded Iran's Erivan Khanate. This sparked the final bout of hostilities between the two, the Russo-Persian War of 1826–1828. The resulting Treaty of Turkmenchay, forced Qajar Iran to cede sovereignty over the Erivan Khanate, the Nakhchivan Khanate and the remainder of the Lankaran Khanate, comprising the last parts of the soil of the contemporary Azerbaijani Republic that were still in Iranian hands. After incorporation of all Caucasian territories from Iran into Russia, the new border between the two was set at the Aras River, which, upon the Soviet Union's disintegration, subsequently became part of the border between Iran and the Azerbaijan Republic.\n\nQajar Iran was forced to cede its Caucasian territories to Russia in the 19th century, which thus included the territory of the modern-day Azerbaijan Republic, while as a result of that cession, the Azerbaijani ethnic group is nowadays parted between two nations: Iran and Azerbaijan.Swietochowski, Tadeusz. [https://books.google.com/books?idEPP3ti4hysUC&pg\nPA104&dqrusso-persian+wars+parted+the+azerbaijanis&hl\nnl&saX&ved\n0CCAQ6AEwAGoVChMI07TdyuWVxgIV5EvbCh2SvQDLP#vonepage&q\nrusso-persian%20wars%20parted%20the%20azerbaijanis&f=false Eastern Europe, Russia and Central Asia 2003] Taylor and Francis, 2003.  p 104 Nevertheless, the number of ethnic Azerbaijanis in Iran far outnumber those in neighbouring Azerbaijan.\n\nAfter the collapse of the Russian Empire during World War I, the short-lived Transcaucasian Democratic Federative Republic was declared, constituting the present-day republics of Azerbaijan, Georgia, and Armenia.\n\nIt was followed by the March Days massacresRussia and a Divided Azerbaijan: A Borderland in Transition, by Tadeusz Świętochowski, Columbia University Press, 1995, p. 66 that took place between 30 March and 2 April 1918 in the city of Baku and adjacent areas of the Baku Governorate of the Russian Empire. When the republic dissolved in May 1918, the leading Musavat party declared independence as the Azerbaijan Democratic Republic (ADR), adopting the name of \"Azerbaijan\" for the new republic; a name that prior to the proclamation of the ADR was solely used to refer to the adjacent northwestern region of contemporary Iran. The ADR was the first modern parliamentary republic in the Muslim world.Schulze, Reinhard. A Modern History of the Islamic World. I.B.Tauris, 2000. . Among the important accomplishments of the Parliament was the extension of suffrage to women, making Azerbaijan the first Muslim nation to grant women equal political rights with men. Another important accomplishment of ADR was the establishment of Baku State University, which was the first modern-type university founded in the Muslim East.\n By March 1920, it was obvious that Soviet Russia would attack Baku. Vladimir Lenin said that the invasion was justified as Soviet Russia could not survive without Baku's oil. Independent Azerbaijan lasted only 23 months until the Bolshevik 11th Soviet Red Army invaded it, establishing the Azerbaijan SSR on 28 April 1920. Although the bulk of the newly formed Azerbaijani army was engaged in putting down an Armenian revolt that had just broken out in Karabakh, Azerbaijanis did not surrender their brief independence of 1918–20 quickly or easily. As many as 20,000 Azerbaijani soldiers died resisting what was effectively a Russian reconquest.\n\nOn 13 October 1921, the Soviet republics of Russia, Armenia, Azerbaijan, and Georgia signed an agreement with Turkey known as the Treaty of Kars. The previously independent Republic of Aras would also become the Nakhichevan Autonomous Soviet Socialist Republic within the Azerbaijan SSR by the treaty of Kars. On the other hand, Armenia was awarded the region of Zangezur and Turkey agreed to return Gyumri (then known as Alexandropol).\n\nDuring World War II, Azerbaijan played a crucial role in the strategic energy policy of the Soviet Union, with 80 percent of the Soviet Union's oil on the Eastern Front being supplied by Baku. By the Decree of the Supreme Soviet of the USSR in February 1942, the commitment of more than 500 workers and employees of the oil industry of Azerbaijan were awarded orders and medals. Operation Edelweiss carried out by the German Wehrmacht targeted Baku because of its importance as the energy (petroleum) dynamo of the USSR. A fifth of all Azerbaijanis fought in the Second World War from 1941 to 1945. Approximately 681,000 people with over 100,000 of them women went to the front, while the total population of Azerbaijan was 3.4 million at the time. Some 250,000 people from Azerbaijan were killed on the front. More than 130 Azerbaijanis were named Heroes of the Soviet Union. Azerbaijani Major-General Azi Aslanov was twice awarded the Hero of the Soviet Union.\n\nIndependence\n\nFollowing the politics of glasnost, initiated by Mikhail Gorbachev, civil unrest and ethnic strife grew in various regions of the Soviet Union, including Nagorno-Karabakh, an autonomous region of the Azerbaijan SSR. The disturbances in Azerbaijan, in response to Moscow's indifference to an already heated conflict, resulted in calls for independence and secession, which culminated in the Black January events in Baku. Later in 1990, the Supreme Council of the Azerbaijan SSR dropped the words \"Soviet Socialist\" from the title, adopted the \"Declaration of Sovereignty of the Azerbaijan Republic\" and restored the flag of the Azerbaijan Democratic Republic as the state flag. As a consequence of the failed coup which occurred in August in Moscow, on 18 October 1991, the Supreme Council of Azerbaijan adopted a Declaration of Independence which was affirmed by a nationwide referendum in December 1991, while the Soviet Union officially ceased to exist on 26 December 1991.\n\nThe early years of independence were overshadowed by the Nagorno-Karabakh war with the ethnic Armenian majority of Nagorno-Karabakh backed by Armenia.Full text of the Bishkek Protocol with signatures of representatives of Azerbaijan, Nagorno-Karabakh, and Armenia. http://peacemaker.un.org/armeniaazerbaijan-bishkekprotocol94 By the end of the hostilities in 1994, Armenians controlled up to 14–16 percent of Azerbaijani territory, including Nagorno-Karabakh itself.Thomas De Waal. Black Garden: Armenia And Azerbaijan Through Peace and War. New York: New York University Press, p. 286. . During the war many atrocities were committed including the massacres at Malibeyli and Gushchular, the Garadaghly massacre, the Agdaban and the Khojaly massacres. Furthermore, an estimated 30,000 people have been killed and more than a million people have been displaced.[http://belfercenter.ksg.harvard.edu/publication/1283/conflict_that_can_be_resolved_in_time.html A Conflict That Can Be Resolved in Time: Nagorno-Karabakh]. International Herald Tribune. 29 November 2003. Four United Nations Security Council Resolutions (822, 853, 874, and 884) demand for \"the immediate withdrawal of all Armenian forces from all occupied territories of Azerbaijan.\" Many Russians and Armenians left Azerbaijan during the 1990s.[http://www.eurasianet.org/departments/insight/articles/pp083003.shtml Southern Caucasus: Facing Integration Problems, Ethnic Russians Long For Better Life]. EurasiaNet.org. 30 August 2003. According to the 1970 census, there were 510,000 ethnic Russians and 484,000 Armenians in Azerbaijan.\"[http://encyclopedia2.thefreedictionary.com/Azerbaijan+Soviet+Socialist+Republic Azerbaijan Soviet Socialist Republic]\". The Great Soviet Encyclopedia (1979).\n\nIn 1993, democratically elected president Abulfaz Elchibey was overthrown by a military insurrection led by Colonel Surat Huseynov, which resulted in the rise to power of the former leader of Soviet Azerbaijan, Heydar Aliyev. In 1994, Surat Huseynov, by that time the prime minister, attempted another military coup against Heydar Aliyev, but he was arrested and charged with treason. A year later, in 1995, another coup was attempted against Aliyev, this time by the commander of the OMON special unit, Rovshan Javadov. The coup was averted, resulting in the killing of the latter and disbanding of Azerbaijan's OMON units. At the same time, the country was tainted by rampant corruption in the governing bureaucracy. In October 1998, Aliyev was reelected for a second term. Despite the much improved economy, particularly with the exploitation of the Azeri-Chirag-Guneshli oil field and Shah Deniz gas field, Aliyev's presidency was criticized due to suspected election frauds and corruption.\n\nIlham Aliyev, Heydar Aliyev's son, became chairman of the New Azerbaijan Party as well as President of Azerbaijan when his father died in 2003. He was reelected to a third term as president in October 2013.\n\nGeography\n\nGeographically Azerbaijan is located in the South Caucasus region of Eurasia, straddling Western Asia and Eastern Europe. It lies between latitudes 38° and 42° N, and longitudes 44° and 51° E. The total length of Azerbaijan's land borders is 2648 km, of which 1,007 kilometers are with Armenia, 756 kilometers with Iran, 480 kilometers with Georgia, 390 kilometers with Russia and 15 kilometers with Turkey. The coastline stretches for 800 km, and the length of the widest area of the Azerbaijani section of the Caspian Sea is 456 km. The territory of Azerbaijan extends 400 km from north to south, and 500 km from west to east.\n\nThree physical features dominate Azerbaijan: the Caspian Sea, whose shoreline forms a natural boundary to the east; the Greater Caucasus mountain range to the north; and the extensive flatlands at the country's center. There are also three mountain ranges, the Greater and Lesser Caucasus, and the Talysh Mountains, together covering approximately 40% of the country. The highest peak of Azerbaijan is Mount Bazardüzü (4,466 m), while the lowest point lies in the Caspian Sea (−28 m). Nearly half of all the mud volcanoes on Earth are concentrated in Azerbaijan, these volcanoes were also among nominees for the New7Wonders of Nature.\n\nThe main water sources are surface waters. However, only 24 of the 8,350 rivers are greater than 100 km in length. All the rivers drain into the Caspian Sea in the east of the country. The largest lake is Sarysu (67 km²), and the longest river is Kur (1,515 km), which is transboundary with Armenia. Azerbaijan's four main islands in the Caspian Sea have a combined area of over thirty square kilometers.\n\nSince the independence of Azerbaijan in 1991, the Azerbaijani government has taken drastic measures to preserve the environment of Azerbaijan. But national protection of the environment started to truly improve after 2001 when the state budget increased due to new revenues provided by the Baku-Tbilisi-Ceyhan pipeline. Within four years protected areas doubled and now make up eight percent of the country's territory. Since 2001 the government has set up seven large reserves and almost doubled the sector of the budget earmarked for environmental protection.\n\nLandscape\n\nAzerbaijan is home to a vast variety of landscapes. Over half of Azerbaijan's land mass consists of mountain ridges, crests, yailas, and plateaus which rise up to hypsometric levels of 400–1000 meters (including the Middle and Lower lowlands), in some places (Talis, Jeyranchol-Ajinohur and Langabiz-Alat foreranges) up to 100–120 meters, and others from 0–50 meters and up (Qobustan, Absheron). The rest of Azerbaijan's terrain consist of plains and lowlands. Hypsometric marks within the Caucasus region vary from about −28 meters at the Caspian Sea shoreline up to 4,466 meters (Bazardüzü peak).\n\nThe formation of climate in Azerbaijan is influenced particularly by cold arctic air masses of Scandinavian anticyclone, temperate of Siberian anticyclone, and Central Asian anticyclone. Azerbaijan's diverse landscape affects the ways air masses enter the country. The Greater Caucasus protects the country from direct influences of cold air masses coming from the north. That leads to the formation of subtropical climate on most foothills and plains of the country. Meanwhile, plains and foothills are characterized by high solar radiation rates.\n\n9 out of 11 existing climate zones are present in Azerbaijan. Both the absolute minimum temperature (  ) and the absolute maximum temperature ( 46 °C ) were observed in Julfa and Ordubad – regions of Nakhchivan Autonomous Republic. The maximum annual precipitation falls in Lankaran (1600 to) and the minimum in Absheron (200 to).\n\nRivers and lakes form the principal part of the water systems of Azerbaijan, they were formed over a long geological timeframe and changed significantly throughout that period. This is particularly evidenced by remnants of ancient rivers found throughout the country. The country's water systems are continually changing under the influence of natural forces and human introduced industrial activities. Artificial rivers (canals) and ponds are a part of Azerbaijan's water systems. In terms of water supply, Azerbaijan is below the average in the world with approximately 100000 m3 per year of water per square kilometer. All big water reservoirs are built on Kur. The hydrography of Azerbaijan basically belongs to the Caspian Sea basin.\n\nThere are 8,350 rivers of various lengths within Azerbaijan. Only 24 rivers are over 100 kilometers long. The Kura and Aras are the major rivers in Azerbaijan, they run through the Kura-Aras Lowland. The rivers that directly flow into the Caspian Sea, originate mainly from the north-eastern slope of the Major Caucasus and Talysh Mountains and run along the Samur–Devechi and Lankaran lowlands.\n\nYanar Dag, translated as \"burning mountain\", is a natural gas fire which blazes continuously on a hillside on the Absheron Peninsula on the Caspian Sea near Baku, which itself is known as the \"land of fire.\" Flames jet out into the air from a thin, porous sandstone layer. It is a tourist attraction to visitors to the Baku area.\n\nBiodiversity\n\nThe first reports on the richness and diversity of animal life in Azerbaijan can be found in travel notes of Eastern travelers. Animal carvings on architectural monuments, ancient rocks and stones survived up to the present times. The first information on the flora and fauna of Azerbaijan was collected during the visits of naturalists to Azerbaijan in the 17th century.\n\nThere are 106 species of mammals, 97 species of fish, 363 species of birds, 10 species of amphibians and 52 species of reptiles which have been recorded and classified in Azerbaijan. The national animal of Azerbaijan is the Karabakh horse, a mountain-steppe racing and riding horse endemic to Azerbaijan. The Karabakh horse has a reputation for its good temper, speed, elegance and intelligence. It is one of the oldest breeds, with ancestry dating to the ancient world. However, today the horse is an endangered species.\n\nAzerbaijan's flora consists of more than 4,500 species of higher plants. Due to the unique climate in Azerbaijan, the flora is much richer in the number of species than the flora of the other republics of the South Caucasus. About 67 percent of the species growing in the whole Caucasus can be found in Azerbaijan.\n\nPolitics\n\nThe structural formation of Azerbaijan's political system was completed by the adoption of the new Constitution on 12 November 1995. According to Article 23 of the Constitution, the state symbols of the Azerbaijan Republic are the flag, the coat of arms, and the national anthem. The state power in Azerbaijan is limited only by law for internal issues, but for international affairs is additionally limited by the provisions of international agreements.\n\nThe government of Azerbaijan is based on the separation of powers among the legislative, executive, and judicial branches. The legislative power is held by the unicameral National Assembly and the Supreme National Assembly in the Nakhchivan Autonomous Republic. Parliamentary elections are held every five years, on the first Sunday of November. The Yeni Azerbaijan Party, and independents loyal to the ruling government, currently hold almost all of the Parliament's 125 seats. During the 2010 Parliamentary election, the opposition parties, Musavat and Azerbaijani Popular Front Party, failed to win a single seat. European observers found numerous irregularities in the run-up to the election and on election day.\n\nThe executive power is held by the President, who is elected for a seven-year term by direct elections, and the Prime Minister. The president is authorized to form the Cabinet, a collective executive body, accountable to both the President and the National Assembly. The Cabinet of Azerbaijan consists primarily of the prime minister, his deputies, and ministers. The president does not have the right to dissolve the National Assembly, but has the right to veto its decisions. To override the presidential veto, the parliament must have a majority of 95 votes. The judicial power is vested in the Constitutional Court, Supreme Court, and the Economic Court. The president nominates the judges in these courts. The European Commission for the Efficiency of Justice (CEPEJ) report refers to the Azerbaijani justice model on the selection of new judges as best practice that reflects the particular features and the course of development towards ensuring the independence and quality of the judiciary in a new democracy.\n\nThe Security Council is the deliberative body under the president, and he organizes it according to the Constitution. It was established on 10 April 1997. The administrative department is not a part of the president's office but manages the financial, technical and pecuniary activities of both the president and his office.\n\nAlthough Azerbaijan has held several elections since regaining its independence and it has many of the formal institutions of democracy, it remains classified as \"not free\" (on border with \"partly free\") by Freedom House. In recent years, large numbers of Azerbaijani journalists, bloggers, lawyers, and human rights activists have been rounded up and jailed for their criticism of President Aliyev and government authorities.\"[https://www.washingtonpost.com/opinions/jailed-without-trial-in-azerbaijan/2015/03/01/34a1d342-bea1-11e4-bdfa-b8e8f594e6ee_story.html Jailed without trial in Azerbaijan],\" The Washington Post. 1 March 2015. Retrieved 26 September 2015. A resolution adopted by the European Parliament in September 2015 described Azerbaijan as \"having suffered the greatest decline in democratic governance in all of Eurasia over the past ten years,\" noting as well that its dialogue with the country on human rights has \"not made any substantial progress.\"\"[https://www.washingtonpost.com/opinions/no-this-is-the-truth-about-azerbaijan/2015/09/25/d68a6fd0-608f-11e5-b38e-06883aacba64_story.html No, this is the truth about Azerbaijan’s repression].\" The Washington Post. 25 September 2015. Retrieved 26 September 2015. On 17 March 2016, the President of Azerbaijan signed a decree pardoning more than a dozen of the persons regarded as political prisoners by some NGOs.[http://president.az/articles/18131 Azərbaycan Prezidentinin Rəsmi internet səhifəsi – SƏNƏDLƏR » Sərəncamlar Məhkum edilmiş bir sıra şəxslərin əfv olunması haqqında Azərbaycan Respublikası Prezidentinin Sərəncamı]. President.az. Retrieved on 1 July 2017. This decree was welcomed as a positive step by the US State Department.[https://2009-2017.state.gov/r/pa/prs/ps/2016/03/254820.htm Release of Activists, Journalists, and Political Party Members in Azerbaijan]. 2009–2017.state.gov. Retrieved on 1 July 2017. On 16 March 2017 another pardon decree was signed, which led to the release of additional persons regarded as political prisoners.[http://president.az/articles/23141 Azərbaycan Prezidentinin Rəsmi internet səhifəsi – SƏNƏDLƏR » Sərəncamlar Məhkum edilmiş bir sıra şəxslərin əfv olunması haqqında Azərbaycan Respublikası Prezidentinin Sərəncamı]. President.az. Retrieved on 1 July 2017.\n\nAzerbaijan has been harshly criticized for bribing foreign officials and diplomats in order to promote its causes abroad and legitimize its elections at home, a practice which has been termed as Caviar diplomacy. However, on 6 March 2017, ESISC (European Strategic Intelligence and Security Center) published a report called “The Armenian Connection” where it attacked human rights NGOs and research organisations criticising human rights violations and corruption in Azerbaijan.\nESISC in that report asserted that \"Caviar diplomacy\" report elaborated by ESI aimed to create climate of suspicion based on slander to form a network of MPs that would engage in a political war against Azerbaijan, and that the network composed of European PMs, Armenian officials and some NGOs: Human Rights Watch, Amnesty International, \"Human Rights House Foundation\", \"Open Dialog, European Stability Initiative, and Helsinki Committee for Human Rights, was financed by the Soros Foundation. According to Robert Coalson (Radio Free Europe), ESISC is a part of Baku's lobbying efforts to extend to the use of front think tanks to shift public opinion.[https://www.rferl.org/a/azerbaijan-baku-caviar-oil/25162410.html Baku Smooths Over Its Rights Record With A Thick Layer Of Caviar] // Radio Free Europe, November 08, 2013 Freedom Files Analytical Centre said that \"The report is written in the worst traditions of authoritarian propaganda\".[https://civicsolidarity.org/sites/default/files/az_lobbying_corruption_report_10_march_2017_public_version_color_1.pdf AN EXPLORATION INTO AZERBAIJAN’S SOPHISTICATED SYSTEM OF PROJECTING ITS INTERNATIONAL INFLUENCE, BUYING WESTERN POLITICIANS AND CAPTURING INTERGOVERNMENTAL ORGANISATIONS] // Freedom Files Analytical Centre (Civic Solidarity Platform), March 2017\n\nForeign relations\n\nThe short-lived Azerbaijan Democratic Republic succeeded in establishing diplomatic relations with six countries, sending diplomatic representatives to Germany and Finland. The process of international recognition of Azerbaijan's independence from the collapsing Soviet Union lasted roughly one year. The most recent country to recognize Azerbaijan was Bahrain, on 6 November 1996. Full diplomatic relations, including mutual exchanges of missions, were first established with Turkey, Pakistan, the United States, Iran and Israel. Azerbaijan has placed a particular emphasis on its \"special relationship\" with Turkey.\n\nAzerbaijan has diplomatic relations with 158 countries so far and holds membership in 38 international organizations. It holds observer status in the Non-Aligned Movement and World Trade Organization and is a correspondent at the International Telecommunication Union. On 9 May 2006 Azerbaijan was elected to membership in the newly established Human Rights Council by the United Nations General Assembly. The term of office began on 19 June 2006. Azerbaijan for the first time elected as a non-permanent member of the UN Security Council in 2011 with the support of 155 countries.\n\nForeign policy priorities of Azerbaijan include, first of all, the restoration of its territorial integrity; elimination of the consequences of occupation of Nagorno-Karabakh and seven other regions of Azerbaijan surrounding Nagorno-Karabakh; integration into European and Euro-Atlantic structure; contribution to international security; cooperation with international organizations; regional cooperation and bilateral relations; strengthening of defense capability; promotion of security by domestic policy means; strengthening of democracy; preservation of ethnic and religious tolerance; scientific, educational, and cultural policy and preservation of moral values; economic and social development; enhancing internal and border security; and migration, energy, and transportation security policy.\n\nThe Azerbaijani government, in late 2007, stated that the long-standing dispute over the Armenian-occupied territory of Nagorno-Karabakh is almost certain to spark a new war if it remains unresolved. The Government is in the process of increasing its military budget.\n\nAzerbaijan is an active member of international coalitions fighting international terrorism. Azerbaijan was one of the first countries to offer support after the September 11 attacks. The country is contributing to peacekeeping efforts in Kosovo, Afghanistan and Iraq. Azerbaijan is an active member of NATO's Partnership for Peace program. It also maintains good relations with the European Union and could potentially one day apply for membership.\n\nAdministrative divisions\n\nAzerbaijan is divided into 10 economic regions; 66 rayons (rayonlar, singular rayon) and 77 cities (şəhərlər, singular şəhər) of which 12 are under the direct authority of the republic. Moreover, Azerbaijan includes the Autonomous Republic (muxtar respublika) of Nakhchivan. The President of Azerbaijan appoints the governors of these units, while the government of Nakhchivan is elected and approved by the parliament of Nakhchivan Autonomous Republic.\n\n;Absheron Economic Region\n* Absheron (Abşeron)\n* Khizi (Xızı)\n* Baku (Bakı)\n* Sumqayit (Sumqayıt)\n;Aran Economic Region\n* Aghjabadi (Ağcabədi)\n* Aghdash (Ağdaş)\n* Barda (Bərdə)\n* Beylagan (Beyləqan)\n* Bilasuvar (Biləsuvar)\n* Goychay (Göyçay)\n* Hajigabul (Hacıqabul)\n* Imishli (İmişli)\n* Kurdamir (Kürdəmir)\n* Neftchala (Neftçala)\n* Saatly (Saatlı)\n* Sabirabad (Sabirabad)\n* Salyan (Salyan)\n* Ujar (Ucar)\n* Yevlakh (Yevlax)\n* Zardab (Zərdab)\n* Mingachevir (Mingəçevir)\n* Shirvan (Şirvan)\n* Yevlakh (Yevlax)\n;Daghlig Shirvan\n* Aghsu (Ağsu)\n* Gobustan (Qobustan)\n* Ismailly (İsmayıllı)\n* Shamakhy (Şamaxı)\n\n;Ganja-Gazakh\n* Aghstafa (Ağstafa)\n* Dashkasan (Daşkəsən)\n* Gadabay (Gədəbəy)\n* Gazakh (Qazax)\n* Goygol (Göygöl)\n* Goranboy (Goranboy)\n* Samukh (Samux)\n* Shamkir (Şəmkir)\n* Tovuz (Tovuz)\n* Ganja (Gəncə)\n* Naftalan (Naftalan)\n;Guba-Khachmaz\n* Guba (Quba)\n* Gusar (Qusar)\n* Khachmaz (Xaçmaz)\n* Shabran (Şabran)\n* Siyazan (Siyəzən)\n;Kalbajar-Lachin\n* Gubadly (Qubadlı)\n* Kalbajar (Kəlbəcər)\n* Lachin (Laçın)\n* Zangilan (Zəngilan)\n;Lankaran\n* Astara (Astara)\n* Jalilabad (Cəlilabad)\n* Lankaran (Lənkəran)\n* Lerik (Lerik)\n* Masally (Masallı)\n\n* Yardimly (Yardımlı)\n* Lankaran (Lənkəran)\n;Nakhchivan\n* Babek (Babək)\n* Julfa (Culfa)\n* Kangarli (Kəngərli)\n* Ordubad (Ordubad)\n* Sadarak (Sədərək)\n* Shahbuz (Şahbuz)\n* Sharur (Şərur)\n* Nakhchivan (Naxçıvan)\n;Shaki-Zaqatala\n* Balakan (Balakən)\n* Gabala (Qəbələ)\n* Gakh (Qax)\n* Oghuz (Oğuz)\n* Shaki (Şəki)\n* Zaqatala (Zaqatala)\n* Shaki (Şəki)\n;Yukhari Garabakh\n* Aghdam (Ağdam)\n* Fuzuli (Füzuli)\n* Jabrayil (Cəbrayıl)\n* Khojaly (Xocalı)\n* Khojavend (Xocavənd)\n* Shusha (Şuşa)\n* Tartar (Tərtər)\n* Khankendi (Xankəndi)\n* Shusha (Şuşa)\n\nNote: The cities under the direct authority of the republic in italics.\n\nMilitary\n\nThe history of the modern Azerbaijan army dates back to Azerbaijan Democratic Republic in 1918, when the National Army of the newly formed Azerbaijan Democratic Republic was created on 26 June 1918.[http://www.azembassy.com.pk/en/book/?getc3 Azerbaijan: Short History of Statehood] , Embassy of Republic of Azerbaijan in Pakistan, 2005, Chapter 3.[http://www.calend.ru/holidays/0/0/1393/ Creation of National Army in 1918] . When Azerbaijan gained independence after the dissolution of the Soviet Union, the Armed Forces of the Republic of Azerbaijan were created according to the Law on the Armed Forces of 9 October 1991.[http://www.base.spinform.ru/show_doc.fwx?Regnom\n2893 Law of the Republic of Azerbaijan on Armed Forces], No. 210-XII, 9 October 1991 . The original date of the establishment of the short-lived National Army is celebrated as Army Day (26 June) in today's Azerbaijan.[http://news.trend.az/index.shtml?shownews&newsid\n1232458&lang=EN Azerbaijan's Army Day (26 June)] declared by Presidential Decree of 22 May 1998.\nAs of 2002, Azerbaijan had 95,000 active personnel in its armed forces. There are also 17,000 paramilitary troops.C. W. Blandy [http://www.da.mod.uk/colleges/arag/document-listings/caucasus/08(17)CWB.pdf Azerbaijan: Is War Over Nagornyy Karabakh a Realistic Option? Advanced Research and Assessment Group. Caucasus Series 08/17. – Defense Academy of the United Kingdom, 2008, p.12] The armed forces have three branches: the Land Forces, the Air Forces and the Navy. Additionally the armed forces embrace several military sub-groups that can be involved in state defense when needed. These are the Internal Troops of the Ministry of Internal Affairs and the State Border Service, which includes the Coast Guard as well. The Azerbaijan National Guard is a further paramilitary force. It operates as a semi-independent entity of the Special State Protection Service, an agency subordinate to the President.\n\nAzerbaijan adheres to the Treaty on Conventional Armed Forces in Europe and has signed all major international arms and weapons treaties. Azerbaijan closely cooperates with NATO in programs such as Partnership for Peace and Individual Partnership Action Plan. Azerbaijan has deployed 151 of its Peacekeeping Forces in Iraq and another 184 in Afghanistan.\n\nThe defense budget of Azerbaijan for 2011 was set at US$3.1 billion. In addition to that, $1.36 billion was planned to be used for the needs of the defense industry, which bring up the total military budget to 4.6 billion. Azerbaijani President Ilham Aliyev said on 26 June 2011 that the defence spending reached $3.3 billion that year.\n\nAzerbaijan's defense budget for 2013 is $3.7 billion.\n\nAzerbaijani defense industry manufactures small arms, artillery systems, tanks, armors and noctovision devices, aviation bombs, pilotless vehicles, various military vehicles and military planes and helicopters.\n\nEconomy\n\nAfter gaining independence in 1991, Azerbaijan became a member of the International Monetary Fund, the World Bank, the European Bank for Reconstruction and Development, the Islamic Development Bank and the Asian Development Bank.\n\n The banking system of Azerbaijan consists of the Central Bank of Azerbaijan, commercial banks and non-banking credit organizations. The National (now Central) Bank was created in 1992 based on the Azerbaijan State Savings Bank, an affiliate of the former State Savings Bank of the USSR. The Central Bank serves as Azerbaijan's central bank, empowered to issue the national currency, the Azerbaijani manat, and to supervise all commercial banks. Two major commercial banks are UniBank and the state-owned International Bank of Azerbaijan, run by Dr. Jahangir Hajiyev.\n\nPushed up by spending and demand growth, the 2007 Q1 inflation rate reached 16.6%.\n Nominal incomes and monthly wages climbed 29% and 25% respectively against this figure, but price increases in non-oil industry encouraged inflation. Azerbaijan shows some signs of the so-called \"Dutch disease\" because of its fast-growing energy sector, which causes inflation and makes non-energy exports more expensive.\n\nIn the early 2000s the chronically high inflation was brought under control. This led to the launch of a new currency, the new Azerbaijani manat, on 1 January 2006, to cement the economic reforms and erase the vestiges of an unstable economy.\n\nIn 2008, Azerbaijan was cited as one of the top 10 reformers by the World Bank's Doing Business Report.\n\nAzerbaijan is also ranked 57th in the Global Competitiveness Report for 2010–2011, above other CIS countries.\n\n By 2012 the GDP of Azerbaijan had increased 20-fold from to its 1995 level.Bibliothek der Friedrich-Ebert-Stiftung, http://library.fes.de/pdf-files/id-moe/09454.pdf\n\nEnergy\n\n \n\nTwo-thirds of Azerbaijan is rich in oil and natural gas.\n\n The history of the oil industry of Azerbaijan dates back to the ancient period. Arabian historian and traveler Ahmed Al-Belaruri mentioned about the economics of Absheron peninsula in the ancient times, oil lands, also, white and black oil in Absheron.\n\nThe region of the Lesser Caucasus accounts for most of the country's gold, silver, iron, copper, titanium, chromium, manganese, cobalt, molybdenum, complex ore and antimony. In September 1994, a 30-year contract was signed between the State Oil Company of Azerbaijan Republic (SOCAR) and 13 oil companies, among them Amoco, BP, ExxonMobil, Lukoil and Statoil. As Western oil companies are able to tap deepwater oilfields untouched by the Soviet exploitation, Azerbaijan is considered one of the most important spots in the world for oil exploration and development. Meanwhile, the State Oil Fund of Azerbaijan was established as an extra-budgetary fund to ensure macroeconomic stability, transparency in the management of oil revenue, and safeguarding of resources for future generations.\n\nAzeriqaz, a sub-company of SOCAR, intends to ensure full gasification of the country by 2021.\n\nAzerbaijan is one of the sponsors of the East–West and North–South energy transport corridors. Baku–Tbilisi–Kars railway line will connect the Caspian region with Turkey, is expected to be completed in July 2017. The Trans-Anatolian Natural Gas Pipeline (TANAP) and Trans-Adriatic Pipeline (TAP) will deliver natural gas from Azerbaijan’s Shah Deniz gas to Turkey and Europe.\n\nAzerbaijan extended the agreement on development of ACG until 2050 according to the amended PSA signed on 14 September 2017 by SOCAR and co-venturers (BP, Chevron, INPEX, Statoil, ExxonMobil, TP, ITOCHU and ONGC Videsh).\n\nAgriculture\n\nAzerbaijan has the largest agricultural basin in the region. About 54.9 percent of Azerbaijan is agricultural land. At the beginning of 2007 there were 4,755,100 hectares of utilized agricultural area.\n\n In the same year the total wood resources counted 136 million m³. Azerbaijan's agricultural scientific research institutes are focused on meadows and pastures, horticulture and subtropical crops, green vegetables, viticulture and wine-making, cotton growing and medicinal plants.\n\n In some areas it is profitable to grow grain, potatoes, sugar beets, cotton\n\n and tobacco. Livestock, dairy products, and wine and spirits are also important farm products. The Caspian fishing industry concentrates on the dwindling stocks of sturgeon and beluga. In 2002 the Azerbaijani merchant marine had 54 ships.\n\nSome products previously imported from abroad have begun to be produced locally. Among them are Coca-Cola by Coca-Cola Bottlers LTD, beer by Baki-Kastel, parquet by Nehir and oil pipes by EUPEC Pipe Coating Azerbaijan.\n\nTourism\n\nTourism is an important part of the economy of Azerbaijan. The country was a well-known tourist spot in the 1980s. However, the fall of the Soviet Union, and the Nagorno-Karabakh War during the 1990s, damaged the tourist industry and the image of Azerbaijan as a tourist destination.\n\nIt was not until the 2000s that the tourism industry began to recover, and the country has since experienced a high rate of growth in the number of tourist visits and overnight stays.[http://www.azadliq.org/content/article/388501.html Azərbaycan Qarabağın turizm imkanlarını təbliğ edir]  In the recent years, Azerbaijan has also become a popular destination for religious, spa, and health care tourism. During winter, the Shahdag Mountain Resort offers skiing with state of the art facilities.\n\nThe government of Azerbaijan has set the development of Azerbaijan as an elite tourist destination as a top priority. It is a national strategy to make tourism a major, if not the single largest, contributor to the Azerbaijani economy. These activities are regulated by the Ministry of Culture and Tourism of Azerbaijan.\nThere are 63 countries which have visa-free score.[https://www.passportindex.org/byRank.php?ccode=az Global Passport Power Rank | Passport Index 2017]. Passportindex.org. Retrieved on 1 July 2017.\nE-visa[https://evisa.gov.az/en/ Home Page | The Electronic Visa System of Azerbaijan Republic]. Evisa.gov.az. Retrieved on 1 July 2017. – for a visit of foreigners of visa-required countries to the Republic of Azerbaijan.\n\nAccording to Travel and Tourism Competitiveness Report 2015 of the World Economic Forum Azerbaijan holds 84th place.Crotti, Robert and Misrahi, Tiffany(2015) [http://www3.weforum.org/docs/TT15/WEF_TTCR_Chapter1.1_2015.pdf Chapter 1.1 \"The Travel & Tourism Competitiveness Index 2015: T&T as a Resilient Contribution to National Development\"] in The Travel & Tourism Competitiveness Index 2015. World Economic Forum\n\nAzerbaijan placed among top ten countries due to the strongest growth in visitor exports in years of 2010–2016 according to the report prepared by the World Travel and Tourism Council.https://www.wttc.org/-/media/files/reports/economic-impact-research/2017-documents/global-economic-impact-and-issues-2017.pdf As well as, Azerbaijan is at the first place (46.1%) among the countries which have the fastest developing travel and tourism economies in addition with strong inbound international visitor spending last year.\n\nTransportation\n\nThe convenient location of Azerbaijan on the crossroad of major international traffic arteries, such as the Silk Road and the south–north corridor, highlights the strategic importance of transportation sector for the country's economy. The transport sector in the country includes roads, railways, aviation, and maritime transport.\n\nAzerbaijan is also an important economic hub in the transportation of raw materials. The Baku–Tbilisi–Ceyhan pipeline (BTC) became operational in May 2006 and extends more than 1,774 kilometers through the territories of Azerbaijan, Georgia and Turkey. The BTC is designed to transport up to 50 million tons of crude oil annually and carries oil from the Caspian Sea oilfields to global markets. The South Caucasus Pipeline, also stretching through the territory of Azerbaijan, Georgia and Turkey, became operational at the end of 2006 and offers additional gas supplies to the European market from the Shah Deniz gas field. Shah Deniz is expected to produce up to 296 billion cubic meters of natural gas per year. Azerbaijan also plays a major role in the EU-sponsored Silk Road Project.\n\nIn 2002, the Azerbaijani government established the Ministry of Transport with a broad range of policy and regulatory functions. In the same year, the country became a member of the Vienna Convention on Road Traffic. The highest priority being; upgrading the transport network and transforming transportation services into one of the key comparative advantages of the country, as this would be highly conducive to the development of other sectors of the economy.\n\nIn 2012, the construction of Kars–Tbilisi–Baku railway expected to provide transportation between Asia and Europe through connecting the railways of China and Kazakhstan in the east with Turkey's Marmaray to the European railway system in the west. Broad-gauge railways in 2010 stretched for 2918 km and electrified railways numbered 1278 km. By 2010, there were 35 airports and one heliport.\n\nScience and technology\n\nIn the 21st century, a new oil and gas boom helped to improve the situation in Azerbaijan's science and technology sectors, and the government launched a campaign aimed at modernization and innovation. The government estimates that profits from the information technology and communication industry will grow and become comparable with those from oil production.\n\nAzerbaijan has a large and steadily growing Internet sector, mostly uninfluenced by the global financial crisis; rapid growth is forecast for at least five more years.\n\nThe country has also been making progress in developing its telecoms sector. The Ministry of Communications & Information Technologies (MCIT), as well as being an operator through its role in Aztelekom, is both a policy-maker and regulator. Public pay phones are available for local calls and require the purchase of a token from the telephone exchange or some shops and kiosks. Tokens allow a call of indefinite duration. , there were 1,397,000 main telephone lines[https://www.cia.gov/library/publications/the-world-factbook/rankorder/2150rank.html CIA.gov], CIA World Factbook Telephones – main lines in use, Azerbaijan 1,397,000 main lines and 1,485,000 internet users.[https://www.cia.gov/library/publications/the-world-factbook/rankorder/2153rank.html CIA.gov], CIA World Factbook Internet users, Azerbaijan Internet users: 1,485,000. There are four GSM providers: Azercell, Bakcell, Azerfon (Nar Mobile), Nakhtel mobile network operators and one CDMA.\n\nIn the 21st century a number of prominent Azerbaijani geodynamics and geotectonics scientists, inspired by the fundamental works of Elchin Khalilov and others, designed hundreds of earthquake prediction stations and earthquake-resistant buildings that now constitute the bulk of The Republican Center of Seismic Service.\n\nThe Azerbaijan National Aerospace Agency launched its first satellite AzerSat 1 into orbit on 7 February 2013 from Guiana Space Centre in French Guiana at orbital positions 46° East. The satellite will cover Europe and significant part of Asian countries and Africa and will have transmission for TV, radio broadcasting and the internet. The launch of its own satellite on orbit is Azerbaijan's first action in realizing prospective projects to turn itself into a country with a space industry.\n\nDemographics\n\nFrom the total population of 9.705. 600 people as of the beginning of 2016, nearly 53,1% was urban population, the remaining 46,9% was the rural population. 50,2% of the total population were female.The sex ratio for total population in that year was therefore 0.99 males per female.[http://www.stat.gov.az/source/demoqraphy/ap/ Azərbaycanın əhalisi | Azərbaycan Respublikasının Dövlət Statistika Komitəsi]. Stat.gov.az. Retrieved on 1 July 2017.\n\nThe 2011 population growth-rate was 0.85%, compared to 1.09% worldwide. A significant factor restricting the population growth is a high level of migration. In 2011 Azerbaijan saw migration of −1.14/1,000 people.\n\nThe Azerbaijani diaspora is found in 42 countries and in turn there are many centers for ethnic minorities inside Azerbaijan, including the German cultural society \"Karelhaus\", Slavic cultural center, Azerbaijani-Israeli community, Kurdish cultural center, International Talysh Association, Lezgin national center \"Samur\", Azerbaijani-Tatar community, Crimean Tatars society, etc.\n\nEthnic groups\n\nThe ethnic composition of the population according to the 2009 population census: 91.60% Azerbaijanis, 2.02% Lezgians, 1.35% Armenians (almost all Armenians live in the break-away region of Nagorno-Karabakh), 1.34% Russians, 1.26% Talysh, 0.56% Avars, 0.43% Turks, 0.29% Tatars, 0.28% Tats, 0.24% Ukrainians, 0.14% Tsakhurs, 0.11% Georgians, 0.10% Jews, 0.07% Kurds, other 0.21%.\n\nIranian Azerbaijanis are by far the largest minority in Iran. The number of ethnic Azerbaijanis in Iran furthermore far outnumber those in neighboring Azerbaijan. The CIA World Factbook estimates Iranian Azerbaijanis as comprising at least 16% of Iran's population.CIA – The World Factbook. [https://www.cia.gov/library/publications/the-world-factbook/geos/ir.html CIA.gov]  \"Iran\".\n\nUrbanization\n\nIn total, Azerbaijan has 78 cities, 63 city districts, and one special legal status city. These are followed by 261 urban-type settlements and 4248 villages.\n\nLanguages\n\nThe official language is Azerbaijani (Turkic language), which is spoken by approximately 92% of the population as a mother tongue.[http://data.un.org/Data.aspx?d\nPOP&ftableCode%3a27%3bcountryCode%3a31%3brefYear%3a1999%2c2009%3bareaCode%3a0%3bsexCode%3a0&c\n2,3,10,15,16&s_countryEnglishNameOrderBy:asc,refYear:desc,areaCode:asc&v\n1 Population by language, sex and urban/rural residence], UN Data. Retrieved 27 August 2016. It belongs to the Turkic language family. Russian and Armenian (only in Nagorno-Karabakh) are also spoken, and each are the mother tongue of around 1.5% of the population respectively. Russian and English play significant roles as second or third languages of education and communication. There are a dozen other minority languages spoken natively in the country. Avar, Budukh, Georgian, Juhuri, Khinalug, Kryts, Lezgian, Rutul, Talysh, Tat, Tsakhur, and Udi are all spoken by small minorities. Some of these language communities are very small and their numbers are decreasing.Clifton, John M., editor. 2002 (vol 1.), 2003 (vol. 2). Studies in languages of Azerbaijan. Baku, Azerbaijan and Saint Petersburg, Russia: Institute of International Relations, Academy of Sciences of Azerbaijan and North Eurasian Group, SIL International. Armenian is almost exclusively spoken in the break-away Nagorno-Karabakh region.\n\nReligion\n\nAround 98% of the population are Muslims. 85% of the Muslims are Shia Muslims and 15% Sunni Muslims,[http://files.preslib.az/projects/remz/pdf_en/atr_din.pdf Administrative Department of the President of the Republic of Azerbaijan – Presidential Library – Religion]. (PDF) . Retrieved on 1 July 2017. and the Republic of Azerbaijan has the second highest Shia population percentage in the world.[http://www.pewforum.org/2009/10/07/mapping-the-global-muslim-population/ Mapping the Global Muslim Population | Pew Research Center]. Pewforum.org (7 October 2009). Retrieved on 1 July 2017. Other faiths are practised by the country's various ethnic groups. Under article 48 of its Constitution, Azerbaijan is a secular state and ensures religious freedom. In a 2006–2008 Gallup poll, only 21% of respondents from Azerbaijan stated that religion is an important part of their daily lives. This makes Azerbaijan the least religious Muslim-majority country in the world.[http://www.gallup.com/poll/114211/Alabamians-Iranians-Common.aspx GALLUP – What Alabamians and Iranians Have in Common] – data accessed on 19 August 2014\n\nOf the nation's religious minorities, the estimated 280,000 Christians (3.1%) are mostly Russian and Georgian Orthodox and Armenian Apostolic (almost all Armenians live in the break-away region of Nagorno-Karabakh). In 2003, there were 250 Roman Catholics. Other Christian denominations as of 2002 include Lutherans, Baptists and Molokans. There is also a small Protestant community. Azerbaijan also has an ancient Jewish population with a 2,500-year history; Jewish organizations estimate that 10,000–20,000 Jews remain in Azerbaijan. Azerbaijan also is home to members of the Bahá'í, Hare Krishna and Jehovah's Witnesses communities, as well as adherents of the other religious communities. Some religious communities have been unofficially restricted from religious freedom. A U.S. State Department report on the matter mentions detention of members of certain Muslim and Christian groups, and many groups have difficulty registering with the SCWRA.[https://www.state.gov/documents/organization/192997.pdf Azerbaijan]. state.gov\n\nEducation\n\nA relatively high percentage of Azerbaijanis have obtained some form of higher education, most notably in scientific and technical subjects. In the Soviet era, literacy and average education levels rose dramatically from their very low starting point, despite two changes in the standard alphabet, from Perso-Arabic script to Latin in the 1920s and from Roman to Cyrillic in the 1930s. According to Soviet data, 100 percent of males and females (ages nine to forty-nine) were literate in 1970. According to the United Nations Development Program Report 2009, the literacy rate in Azerbaijan is 99.5 percent.\n\nSince independence, one of the first laws that Azerbaijan's Parliament passed to disassociate itself from the Soviet Union was to adopt a modified-Latin alphabet to replace Cyrillic. Other than that the Azerbaijani system has undergone little structural change. Initial alterations have included the reestablishment of religious education (banned during the Soviet period) and curriculum changes that have reemphasized the use of the Azerbaijani language and have eliminated ideological content. In addition to elementary schools, the education institutions include thousands of preschools, general secondary schools, and vocational schools, including specialized secondary schools and technical schools. Education through the eighth grade is compulsory.\n\nCulture\n\nThe culture of Azerbaijan has developed as a result of many influences. Today, national traditions are well preserved in the country despite Western influences, including globalized consumer culture. Some of the main elements of the Azerbaijani culture are: music, literature, folk dances and art, cuisine, architecture, cinematography and Novruz Bayram. The latter is derived from the traditional celebration of the New Year in the ancient Iranian religion of Zoroastrianism. Novruz is a family holiday.\n\nThe profile of Azerbaijan's population consists, as stated above, of Azerbaijanis, as well as other nationalities or ethnic groups, compactly living in various areas of the country. Azerbaijani national and traditional dresses are the Chokha and Papakhi. There are radio broadcasts in Russian, Georgian, Kurdish, Lezgian and Talysh languages, which are financed from the state budget. Some local radio stations in Balakan and Khachmaz organize broadcasts in Avar and Tat. In Baku several newspapers are published in Russian, Kurdish (Dengi Kurd), Lezgian (Samur) and Talysh languages. Jewish society \"Sokhnut\" publishes the newspaper Aziz.\n\nMusic and folk dances\n\nMusic of Azerbaijan builds on folk traditions that reach back nearly a thousand years.David C. King. Azerbaijan, Marshall Cavendish, 2006, p. 94 For centuries Azerbaijani music has evolved under the badge of monody, producing rhythmically diverse melodies.Энциклопедический музыкальный словарь, 2-е изд., Москва, 1966 (Encyclopedical Music Dictionary (1966), 2nd ed., Moscow) Azerbaijani music has a branchy mode system, where chromatization of major and minor scales is of great importance. Among national musical instruments there are 14 string instruments, eight percussion instruments and six wind instruments. According to The Grove Dictionary of Music and Musicians, \"in terms of ethnicity, culture and religion the Azerbaijani are musically much closer to Iran than Turkey.\"\n\nMugham, meykhana and ashiq art are among the many musical traditions of Azerbaijan. Mugham is usually a suite with poetry and instrumental interludes. When performing mugham, the singers have to transform their emotions into singing and music. In contrast to the mugham traditions of Central Asian countries, Azerbaijani mugham is more free-form and less rigid; it is often compared to the improvised field of jazz. UNESCO proclaimed the Azerbaijani mugham tradition a Masterpiece of the Oral and Intangible Heritage of Humanity on 7 November 2003. Meykhana is a kind of traditional Azerbaijani distinctive folk unaccompanied song, usually performed by several people improvising on a particular subject.\n\nAshiq combines poetry, storytelling, dance and vocal and instrumental music into a traditional performance art that stands as a symbol of Azerbaijani culture. It is a mystic troubadour or traveling bard who sings and plays the saz. This tradition has its origin in the Shamanistic beliefs of ancient Turkic peoples.[http://vlib.iue.it/carrie/texts/carrie_books/paksoy-6/cae05.html \"ashik, shaman\"] – European University Institute, Florence, Italy (retrieved 10 August 2006). Ashiqs' songs are semi-improvised around common bases. Azerbaijan's ashiq art was included in the list of Intangible Cultural Heritage by the UNESCO on 30 September 2009.\n\nSince the mid-1960s, Western-influenced Azerbaijani pop music, in its various forms, that has been growing in popularity in Azerbaijan, while genres such as rock and hip hop are widely produced and enjoyed. Azerbaijani pop and Azerbaijani folk music arose with the international popularity of performers like Alim Qasimov, Rashid Behbudov, Vagif Mustafazadeh, Muslim Magomayev, Shovkat Alakbarova and Rubaba Muradova. Azerbaijan is an enthusiastic participant in the Eurovision Song Contest. Azerbaijan made its debut appearance at the 2008 Eurovision Song Contest. The country's entry gained third place in 2009 and fifth the following year. Ell and Nikki won the first place at the Eurovision Song Contest 2011 with the song \"Running Scared\", entitling Azerbaijan to host the contest in 2012, in Baku. They have never missed a Grand Final.\n\nThere are dozens of Azerbaijani folk dances. They are performed at formal celebrations and the dancers wear national clothes like the Chokha, which is well-preserved within the national dances. Most dances have a very fast rhythm. The national dance shows the characteristics of the Azerbaijani nation.\n\nLiterature\n\nAmong the medieval authors born within the territorial limits of modern Azerbaijani Republic was Persian poet and philosopher Nizami, called Ganjavi after his place of birth, Ganja, who was the author of the Khamseh (\"The Quintuplet\"), composed of five romantic poems, including \"The Treasure of Mysteries,\" \"Khosrow and Shīrīn,\" and \"Leyli and Mejnūn.\"[http://www.britannica.com/EBchecked/topic/46781/Azerbaijan/44294/Education Azerbaijan. Cultural life]. Encyclopædia Britannica.\n\nThe earliest known figure in Azerbaijani literature was Izzeddin Hasanoglu, who composed a divan consisting of Persian and Turkic ghazals.A.Caferoglu, \"Adhari(azeri)\", in Encyclopedia of Islam, (new edition), Vol. 1, (Leiden, 1986) In Persian ghazals he used his pen-name, while his Turkic ghazals were composed under his own name of Hasanoghlu.\n\nClassical literature in Azerbaijani was formed in the 14th century based on the various Early Middle Ages dialects of Tabriz and Shirvan. Among the poets of this period were Gazi Burhanaddin, Haqiqi (pen-name of Jahan-shah Qara Qoyunlu), and Habibi. The end of the 14th century was also the period of starting literary activity of Imadaddin Nesimi, one of the greatest Turkic Hurufi mystical poets of the late 14th and early 15th centuries and one of the most prominent early divan masters in Turkic literary history, who also composed poetry in Persian and Arabic. The divan and ghazal styles were further developed by poets Qasim al-Anvar, Fuzuli and Khatai (pen-name of Safavid Shah Ismail I).\n\nThe Book of Dede Korkut consists of two manuscripts copied in the 16th century,Michael E. Meeker, \"The Dede Korkut Ethic\", International Journal of Middle East Studies, Vol. 24, No. 3 (Aug. 1992), 395–417. excerpt: The Book of Dede Korkut is an early record of oral Turkic folktales in Anatolia, and as such, one of the mythic charters of Turkish nationalist ideology. The oldest versions of the Book of Dede Korkut consist of two manuscripts copied in the 16th century. The twelve stories that are recorded in these manuscripts are believed to be derived from a cycle of stories and songs circulating among Turkic peoples living in northeastern Anatolia and northwestern Azerbaijan. According to Lewis (1974), an older substratum of these oral traditions dates to conflicts between the ancient Oghuz and their Turkish rivals in Central Asia (the Pecheneks and the Kipchaks), but this substratum has been clothed in references to the 14th-century campaigns of the Akkoyunlu Confederation of Turkic tribes against the Georgians, the Abkhaz, and the Greeks in Trebizond. Such stories and songs would have emerged no earlier than the beginning of the 13th century, and the written versions that have reached us would have been composed no later than the beginning of the 15th century. By this time, the Turkic peoples in question had been in touch with Islamic civilization for several centuries, had come to call themselves \"Turcoman\" rather than \"Oghuz,\" had close associations with sedentary and urbanized societies, and were participating in Islamized regimes that included nomads, farmers, and townsmen. Some had abandoned their nomadic way of life altogether. was not written earlier than the 15th century.Cemal Kafadar(1995), \"in Between Two Worlds: Construction of the Ottoman states\", University of California Press, 1995. Excerpt: \"It was not earlier than the fifteenth century. Based on the fact that the author is buttering up both the Akkoyunlu and Ottoman rulers, it has been suggested that the composition belongs to someone living in the undefined border region lands between the two states during the reign of Uzun Hassan (1466–78). G. Lewis on the hand dates the composition \"fairly early in the 15th century at least.\"İlker Evrım Bınbaş, Encyclopædia Iranica, \"Oguz Khan Narratives\" [http://www.iranicaonline.org/articles/oguz-khan-narratives Encyclopædia Iranica | Articles]. Retrieved October 2010. \"The Ketāb-e Dede Qorqut, which is a collection of twelve stories reflecting the oral traditions of the Turkmens in the 15th-century eastern Anatolia, is also called Oḡuz-nāma\" It is a collection of 12 stories reflecting the oral tradition of Oghuz nomads. The 16th-century poet, Muhammed Fuzuli produced his timeless philosophical and lyrical Qazals in Arabic, Persian, and Azerbaijani. Benefiting immensely from the fine literary traditions of his environment, and building upon the legacy of his predecessors, Fizuli was destined to become the leading literary figure of his society. His major works include The Divan of Ghazals and The Qasidas. In the same century, Azerbaijani literature further flourished with the development of Ashik () poetic genre of bards. During the same period, under the pen-name of Khatāī ( for sinner) Shah Ismail I wrote about 1400 verses in Azerbaijani, which were later published as his Divan. A unique literary style known as qoshma ( for improvization) was introduced in this period, and developed by Shah Ismail and later by his son and successor, Shah Tahmasp I.\n\nIn the span of the 17th and 18th centuries, Fizuli's unique genres as well Ashik poetry were taken up by prominent poets and writers such as Qovsi of Tabriz, Shah Abbas Sani, Agha Mesih Shirvani, Nishat, Molla Vali Vidadi, Molla Panah Vagif, Amani, Zafar and others. Along with Turks, Turkmens and Uzbeks, Azerbaijanis also celebrate the Epic of Koroglu (from  for blind man's son), a legendary folk hero. Several documented versions of Koroglu epic remain at the Institute for Manuscripts of the National Academy of Sciences of Azerbaijan.\n\nModern literature in Azerbaijan is based on the Shirvani dialect mainly, while in Iran it is based on the Tabrizi one. The first newspaper in Azerbaijani, Akinchi was published in 1875. In the mid-19th century, it was taught in the schools of Baku, Ganja, Shaki, Tbilisi, and Yerevan. Since 1845, it has also been taught in the University of Saint Petersburg in Russia.\n\nFolk art\n\nAzerbaijanis have a rich and distinctive culture, a major part of which is decorative and applied art. This form of art is represented by a wide range of handicrafts, such as chasing, jeweler, engraving in metal, carving in wood, stone and bone, carpet-making, lasing, pattern weaving and printing, knitting and embroidery. Each of these types of decorative art, evidence of the endowments of the Azerbaijan nation, is very much in favor here. Many interesting facts pertaining to the development of arts and crafts in Azerbaijan were reported by numerous merchants, travelers and diplomats who had visited these places at different times.\n\nThe Azerbaijani carpet is a traditional handmade textile of various sizes, with dense texture and a pile or pile-less surface, whose patterns are characteristic of Azerbaijan's many carpet-making regions. In November 2010 the Azerbaijani carpet was proclaimed a Masterpiece of Intangible Heritage by UNESCO.\n\nAzerbaijan has been since the ancient times known as a center of a large variety of crafts. The archeological dig on the territory of Azerbaijan testifies to the well developed agriculture, stock raising, metal working, pottery, ceramics, and carpet-weaving that date as far back as to the 2nd millennium BC. Archeological sites in Dashbulaq, Hasansu, Zayamchai, and Tovuzchai uncovered from the BTC pipeline have revealed early Iron Age artifacts.\n\nAzerbaijani carpets can be categorized under several large groups and a multitude of subgroups. Scientific research of the Azerbaijani carpet is connected with the name of Latif Kerimov, a prominent scientist and artist. It was his classification that related the four large groups of carpets with the four geographical zones of Azerbaijan, Guba-Shirvan, Ganja-Kazakh, Karabakh and Tabriz.\n\nCuisine\n\nThe traditional cuisine is famous for an abundance of vegetables and greens used seasonally in the dishes. Fresh herbs, including mint, cilantro (coriander), dill, basil, parsley, tarragon, leeks, chives, thyme, marjoram, green onion, and watercress, are very popular and often accompany main dishes on the table. Climatic diversity and fertility of the land are reflected in the national dishes, which are based on fish from the Caspian Sea, local meat (mainly mutton and beef), and an abundance of seasonal vegetables and greens. Saffron-rice plov is the flagship food in Azerbaijan and black tea is the national beverage. Azerbaijanis often use traditional armudu (pear-shaped) glass as they have very strong tea culture. Popular traditional dishes include bozbash (lamb soup that exists in several regional varieties with the addition of different vegetables), qutab (fried turnover with a filling of greens or minced meat) and dushbara (sort of dumplings of dough filled with ground meat and flavor).\n\nArchitecture\n\nAzerbaijani architecture typically combines elements of East and West. Azerbaijiani architecture has heavy influences from Persian architecture. Many ancient architectural treasures such as the Maiden Tower and Palace of the Shirvanshahs in the Walled City of Baku survive in modern Azerbaijan. Entries submitted on the UNESCO World Heritage tentative list include the Ateshgah of Baku, Momine Khatun Mausoleum, Hirkan National Park, Binegadi National Park, Lökbatan Mud Volcano, Baku Stage Mountain, Caspian Shore Defensive Constructions, Shusha National Reserve, Ordubad National Reserve and the Palace of Shaki Khans.\n\nAmong other architectural treasures are Quadrangular Castle in Mardakan, Parigala in Yukhary Chardaglar, a number of bridges spanning the Aras River, and several mausoleums. In the 19th and early 20th centuries, little monumental architecture was created, but distinctive residences were built in Baku and elsewhere. Among the most recent architectural monuments, the Baku subways are noted for their lavish decor.\n\nThe task for modern Azerbaijani architecture is diverse application of modern aesthetics, the search for an architect's own artistic style and inclusion of the existing historico-cultural environment. Major projects such as Heydar Aliyev Cultural Center, Flame Towers, Baku Crystal Hall, Baku White City and SOCAR Tower have transformed the country's skyline and promotes its contemporary identity.\n\nVisual art\n\nAzerbaijani art includes one of the oldest art objects in the world, which were discovered as Gamigaya Petroglyphs in the territory of Ordubad Rayon are dated back to the 1st to 4th centuries BC. About 1500 dislodged and carved rock paintings with images of deer, goats, bulls, dogs, snakes, birds, fantastic beings and also people, carriages and various symbols had been found out on basalt rocks.[http://irs-az.com/pdf/090621154956.pdf Наскальные рисунки Гямигая]. irs-az.com. Norwegian ethnographer and adventurer Thor Heyerdahl was convinced that people from the area went to Scandinavia in about 100 AD and took their boat building skills with them, and transmuted them into the Viking boats in Northern Europe.\n\nOver the centuries, Azerbaijani art has gone through many stylistic changes. Azerbaijani painting is traditionally characterized by a warmth of colour and light, as exemplified in the works of Azim Azimzade and Bahruz Kangarli, and a preoccupation with religious figures and cultural motifs. Azerbaijani painting enjoyed preeminence in Caucasus for hundreds of years, from the Romanesque and Ottoman periods, and through the Soviet and Baroque periods, the latter two of which saw fruition in Azerbaijan. Other notable artists who fall within these periods include Sattar Bahlulzade, Togrul Narimanbekov, Tahir Salahov, Alakbar Rezaguliyev, Mirza Gadim Iravani, Mikayil Abdullayev and Boyukagha Mirzazade.\n\nCinema\n\nThe film industry in Azerbaijan dates back to 1898. In fact, Azerbaijan was among the first countries involved in cinematography. Therefore, it's not surprising that this apparatus soon showed up in Baku – at the start of the 20th century, this bay town on the Caspian was producing more than 50 percent of the world's supply of oil. Just like today, the oil industry attracted foreigners eager to invest and to work.[http://www.azer.com/aiweb/categories/magazine/53_folder/53_articles/53_100years.html Celebrating 100 Years in Film, not 80] by Aydin Kazimzade. Azerbaijan International, Autumn 1997 In 1919, during the Azerbaijan Democratic Republic, a documentary The Celebration of the Anniversary of Azerbaijani Independence was filmed on Azerbaijan's independence day, 27 May, and premiered in June 1919 at several theatres in Baku. After the Soviet power was established in 1920, Nariman Narimanov, Chairman of the Revolutionary Committee of Azerbaijan, signed a decree nationalizing Azerbaijan's cinema. This also influenced the creation of Azerbaijani animation.\n\nIn 1991, after Azerbaijan gained its independence from the Soviet Union, the first Baku International Film Festival East-West was held in Baku. In December 2000, the former President of Azerbaijan, Heydar Aliyev, signed a decree proclaiming 2 August to be the professional holiday of filmmakers of Azerbaijan. Today Azerbaijani filmmakers are again dealing with issues similar to those faced by cinematographers prior to the establishment of the Soviet Union in 1920. Once again, both choice of content and sponsorship of films are largely left up to the initiative of the filmmaker.\n\nMedia and media freedom\n\nThere are three state-owned television channels: AzTV, Idman TV and Medeniyyet TV. One public channel and 6 private channels: İctimai Television, ANS TV, Space TV, Lider TV, Azad Azerbaijan TV, Xazar TV and Region TV.\n\nHuman rights in Azerbaijan\n\nThe Constitution of Azerbaijan claims to guarantee freedom of speech, but this is denied in practice. After several years of decline in press and media freedom, in 2014 the media environment in Azerbaijan deteriorated rapidly under a governmental campaign to silence any opposition and criticism, even while the country led the Committee of Ministers of the Council of Europe (May–November 2014). Spurious legal charges and impunity in violence against journalists have remained the norm.Parliamentary Assembly of the Council of Europe, [http://www.cfom.org.uk/wp-content/uploads/2014/07/PACE-HORSLEY-FINAL-2014-REPORT-AAC-25_14-Flego-protection-of-media-freedom-18-June.pdf The Protection of media freedom in Europe].Background report prepared by Mr William Horsley, special representative for media freedom of the Association of European Journalists All foreign broadcasts are banned in the country.Freedom House, [https://freedomhouse.org/report/freedom-press/2015/azerbaijan Azerbaijan] 2015 Press Freedom report\n\nAccording to the 2013 Freedom House Freedom of the Press report, Azerbaijan's press freedom status is \"not free,\" and Azerbaijan ranks 177th out of 196 countries.\n\nRadio Free Europe/Radio Liberty and Voice of America are banned in Azerbaijan.\n\nDuring the last few years, three journalists were killed and several prosecuted in trials described as unfair by international human rights organizations. Azerbaijan has the biggest number of journalists imprisoned in Europe and Central Asia in 2015, according to the Committee to Protect Journalists, and is the 5th most censored country in the world, ahead of Iran and China.\n\nA report by an Amnesty International researcher in October 2015 points to '...the severe deterioration of human rights in Azerbaijan over the past few years. Sadly Azerbaijan has been allowed to get away with unprecedented levels of repression and in the process almost wipe out its civil society'. Amnesty's 2015/16 annual report on the country stated ' ... persecution of political dissent continued. Human rights organizations remained unable to resume their work. At least 18 prisoners of conscience remained in detention at the end of the year. Reprisals against independent journalists and activists persisted both in the country and abroad, while their family members also faced harassment and arrests. International human rights monitors were barred and expelled from the country. Reports of torture and other ill-treatment persisted.'\n\nThe Guardian reported in April 2017 that \"Azerbaijan’s ruling elite operated a secret $2.9bn (£2.2bn) scheme to pay prominent Europeans, buy luxury goods and launder money through a network of opaque British companies .... Leaked data shows that the Azerbaijani leadership, accused of serial human rights abuses, systemic corruption and rigging elections, made more than 16,000 covert payments from 2012 to 2014. Some of this money went to politicians and journalists, as part of an international lobbying operation to deflect criticism of Azerbaijan’s president, Ilham Aliyev, and to promote a positive image of his oil-rich country.\" There was no suggestion that all recipients were aware of the source of the money as it arrived via a disguised route.\n\nSports\n\nFreestyle wrestling has been traditionally regarded as Azerbaijan's national sport, in which Azerbaijan won up to fourteen medals, including four golds since joining the National Olympic Committee. Currently, the most popular sports include football and wrestling.\n\nFootball is the most popular sport in Azerbaijan, and the Association of Football Federations of Azerbaijan with 9,122 registered players, is the largest sporting association in the country. The national football team of Azerbaijan demonstrates relatively low performance in the international arena compared to the nation football clubs. The most successful Azerbaijani football clubs are Neftchi Baku, Qarabağ, and Gabala. In 2012, Neftchi Baku became the first Azerbaijani team to advance to the group stage of a European competition, beating APOEL of Cyprus 4–2 on aggregate in the play-off round of the 2012-13 UEFA Europa League. In 2014, Qarabağ became the second Azerbaijani club advancing to the group stage of UEFA Europa League. In 2017, after beating Copenhagen 2–2(a) in the play-off round of the UEFA Champions League, Qarabağ became the first Azerbaijani club to reach the Group stage. Futsal is another popular sport in Azerbaijan. The Azerbaijan national futsal team reached fourth place in the 2010 UEFA Futsal Championship, while domestic club Araz Naxçivan clinched bronze medals at the 2009–10 UEFA Futsal Cup and 2013–14 UEFA Futsal Cup. Azerbaijan was the main sponsor of Spanish football club Atlético de Madrid during seasons 2013/2014 and 2014/2015, a partnership that the club described should 'promote the image of Azerbaijan in the world'.\n\nBackgammon also plays a major role in Azerbaijani culture. The game is very popular in Azerbaijan and is widely played among the local public.[http://www.inforing.net/publications/infopress/sport.php?ELEMENT_ID=3348 Нарды – игра, требующая сноровки и удачи]  There are also different variations of backgammon developed and analyzed by Azerbaijani experts.\n\nAzerbaijan is one of the leading volleyball countries in the world and its Azerbaijan Women's Volleyball Super League is one of strongest women leagues in world. Its women's national team came fourth at the 2005 European Championship. Over the last years, clubs like Rabita Baku and Azerrail Baku achieved great success at European cups. Azerbaijani volleyball players include likes of Valeriya Korotenko, Oksana Parkhomenko, Inessa Korkmaz, Natalya Mammadova and Alla Hasanova.\n\nOther well-known Azerbaijani athletes are Namig Abdullayev, Toghrul Asgarov, Rovshan Bayramov, Sharif Sharifov, Mariya Stadnik and Farid Mansurov in wrestling, Nazim Huseynov, Elnur Mammadli, Elkhan Mammadov and Rustam Orujov in judo, Rafael Aghayev in karate, Magomedrasul Majidov and Aghasi Mammadov in boxing, Nizami Pashayev in Olympic weightlifting, Azad Asgarov in pankration, Eduard Mammadov in kickboxing, and K-1 fighter Zabit Samedov.\n\nAzerbaijan has a Formula One race-track and the country hosted its first Formula One Grand Prix on 19 June 2016. Other annual sporting events held in the country are the Baku Cup tennis tournament and the Tour d'Azerbaïdjan cycling race.\n\nAzerbaijan hosted several major sport competitions since the late 2000s, including the 2013 F1 Powerboat World Championship, 2012 FIFA U-17 Women's World Cup, 2011 AIBA World Boxing Championships, 2010 European Wrestling Championships, 2009 Rhythmic Gymnastics European Championships, 2014 European Taekwondo Championships, 2014 Rhythmic Gymnastics European Championships, 2016 World Chess Olympiad. On 8 December 2012, Baku was selected to host the 2015 European Games, the first to be held in competition's history. Baku is also set to host the fourth Islamic Solidarity Games in 2017. Azerbaijan. http://en.wikipedia.org/?curid=746."
  }
}
