{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=6340",
  "eid" : "db1bee90-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778447353,
  "textBody" : "Canadian English (CanE, CE, en-CAen-CA is the language code for Canadian English, as defined by ISO standards (see ISO 639-1 and ISO 3166-1 alpha-2) and Internet standards (see IETF language tag).) is the set of varieties of the English language native to Canada. According to the 2011 census, English was the first language of approximately 19 million Canadians, or 57% of the population; the remainder of the population were native speakers of French Canadian (22%) or other languages (allophones, 21%). A larger number, 28 million people, reported using English as their dominant language. 82% of Canadians outside the province of Quebec reported speaking English natively, but within Quebec the figure was just 7.7% as most of its residents are native speakers of Québécois.\n\nCanadian English contains major elements of both British English and American English, as well as many uniquely Canadian characteristics.Dollinger, Stefan (2008).\"New-Dialect Formation in Canada.\"  Amsterdam: Benjamins, 978 90 272 31068 6. p. 25.\" While, broadly speaking, Canadian English tends to be closest to American English in terms of linguistic distance,Boberg, Charles (2004) [https://books.google.com/books?id\ngZV7AAAAQBAJ&dqStandard Canadian English].\" In Raymond Hickey. Standards of English: Codified Varieties Around the World. Cambridge University Press. p. 159.Labov, p. 222. the precise influence of American English, British English and other sources on Canadian English varieties has been the ongoing focus of systematic studies since the 1950s.\n\nPhonologically, Canadian and American English are classified together as North American English, emphasizing the fact that the vast majority of outsiders, even other native English speakers, cannot distinguish the typical accents of the two countries by sound alone. There are minor disagreements over the degree to which even Canadians and Americans themselves can differentiate their own two accents, and there is even evidence that some Western American English (Pacific Northwest and California English, for example) is undergoing a vowel shift partially coinciding with the one first reported in mainland Canadian English in the early 1990s.Harbeck, James (2014) \"[http://theweek.com/articles/453616/why-difficult-tell-canadian-accent-from-californian Why It's Difficult to Tell a Canadian Accent from a Californian One].\" The Week. The Week Publications, Inc.\n\nHistory\n\nThe term \"Canadian English\" is first attested in a speech by the Reverend A. Constable Geikie in an address to the Canadian Institute in 1857 (see [http://www.dchp.ca/DCHP-1/ DCHP-1 Online], s.v  \"Canadian English\", Avis et al. 1967). Geikie, a Scottish-born Canadian, reflected the Anglocentric attitude that would be prevalent in Canada for the next hundred years when he referred to the language as \"a corrupt dialect\", in comparison with what he considered the proper English spoken by immigrants from Britain.Chambers, p. xi.\n\nCanadian English is the product of five waves of immigration and settlement over a period of more than two centuries. The first large wave of permanent English-speaking settlement in Canada, and linguistically the most important, was the influx of Loyalists fleeing the American Revolution, chiefly from the Mid-Atlantic States – as such, Canadian English is believed by some scholars to have derived from northern American English.\"[https://books.google.com/books?idia5tHVtQPn8C&pg\nPA268&dq=%22northern+american+english%22#PPA422,M1 Canadian English].\" Brinton, Laurel J., and Fee, Marjery, ed. (2005). Ch. 12. in The Cambridge history of the English language. Volume VI: English in North America., Algeo, John, ed., pp. 422–440. Cambridge, UK: Cambridge University Press, 1992.\n. On p. 422: \"It is now generally agreed that Canadian English originated as a variant of northern American English (the speech of New England, New York, New Jersey, and Pennsylvania).\"\"Canadian English.\" McArthur, T., ed. (2005). Concise Oxford companion to the English language, pp. 96–102. Oxford, UK: Oxford University Press. . On p. 97: \"Because Canadian English and American English are so alike, some scholars have argued that in linguistic terms Canadian English is no more or less than a variety of (Northern) American English. The historical development of Canadian English is underexplored, but recent studies suggest that Canadian English has been developing features of its own since the early 19th century,Dollinger, Stefan. (2008).\"New-Dialect Formation in Canada.\" Amsterdam: Benjamins, 978 90 272 31068 6. p. 279.\" while recent studies have shown the emergence of Canadian English features.\"Labov, Ash, Boberg. 2006. The Atlas of North American English. Berlin: Mouton, ch. 15. The second wave from Britain and Ireland was encouraged to settle in Canada after the War of 1812 by the governors of Canada, who were worried about American dominance and influence among its citizens. Further waves of immigration from around the globe peaked in 1910, 1960 and at the present time had a lesser influence, but they did make Canada a multicultural country, ready to accept linguistic change from around the world during the current period of globalization.Chambers, p. xi–xii.\n\nThe languages of Aboriginal peoples in Canada started to influence European languages used in Canada even before widespread settlement took place, and the French of Lower Canada provided vocabulary to the English of Upper Canada.\n\nHistorical linguistics\n\nStudies on earlier forms of English in Canada are rare, yet connections with other work to historical linguistics can be forged. An overview of diachronic work on Canadian English, or diachronically-relevant work, is Dollinger (2012, updated to 2017).Dollinger, Stefan. 2012. [https://www.academia.edu/4001676/Varieties_of_English_Canadian_English_in_real-time_perspective Canadian English in real-time perspective]. In: English Historical Linguistics: An International Handbook. Vol. II. (HSK 34.2), ed. by Alexander Bergs & Laurel Brinton, 1858-1880. Berlin, New York: Mouton de Gruyter. UPDATED version, for 2017, is found here: https://www.academia.edu/35010966/Varieties_of_English_Canadian_English_in_real-time_perspective_2017_updated_version_of_2012_paper_ Until the 2000s, basically all commentators on the history of CanE have argued from the \"language-external\" history, i.e. social and political history (e.g.,Bloomfield, Morton W. 1948. Bloomfield, Morton W. 1948. Canadian English and its relation to eighteenth century American speech. Journal of English and Germanic Philology 47: 59-66Scargill, Matthew H. 1957. Sources of Canadian English. Journal of English and Germanic Philology 56: 611-614). An exception has been in the area of lexis, where Avis et al's (1967) Dictionary of Canadianisms on Historical Principles, offered real-time historical data through its quotations. Recently, historical linguists have started to study earlier Canadian English on historical linguistic data. DCHP-1 is now available in open access.Dollinger, Stefan (ed.-in-chief), Laurel J. Brinton and Margery Fee (eds). 2013. [http://www.dchp.ca/DCHP-1/ DCHP-1 Online: A Dictionary of Canadianisms on Historical Principles Online]. Based on Walter S. Avis et al. (1967). Vancouver, BC: University of British Columbia.) Most notably, [https://www.academia.edu/4006034/New-Dialect_Formation_in_Canada_Evidence_from_the_English_Modal_Auxiliaries Dollinger (2008)] pioneered the historical corpus linguistic approach for English in Canada with CONTE (Corpus of Early Ontario English, 1776-1849) and offers a developmental scenario for 18th- and 19th-century Ontario. Recently, Reuter (2015),Reuter, David. 2015.Newspaper, politics, and Canadian English: a corpus-based analysis of selected linguistic variables in early nineteenth-century Ontario newspapers. Ph.D. thesis. University of Kiel, Germany. with a 19th-century newspaper corpus from Ontario, has confirmed the scenario laid out in Dollinger (2008).\n\nHistorically, Canadian English included a class-based sociolect known as Canadian dainty.[http://www.cbc.ca/news/canada/toronto/canadian-dainty-accent-canada-day-1.4167610 \"Some Canadians used to speak with a quasi-British accent called Canadian Dainty\"]. CBC News, July 1, 2017. Treated as a marker of upper-class prestige in the 19th century and the early part of the 20th, Canadian dainty was marked by the use of some features of British English pronunciation, resulting in an accent similar to the Mid-Atlantic accent known in the United States. This accent faded in prominence following World War II, when it became stigmatized as pretentious, and is now almost never heard in contemporary Canadian life outside of archival recordings used in film, television or radio documentaries.\n\nSpelling tendencies\n\nCanadian spelling of the English language combines British and American conventions.\n\n* Words such as realize and paralyze are usually spelled with -ize or -yze rather than -ise or -yse. (The etymological convention that verbs derived from Greek roots are spelled with -ize and those from Latin with -ise is preserved in that practice.Sir Ernest Gowers, ed., Fowler's Modern English Usage, 2nd ed. (Oxford: OUP, 1965), 314.)\n* French-derived words that in American English end with -or and -er, such as color or center, often retain British spellings (colour and centre). \n* While the United States uses the Anglo-French spelling defense and offense (noun), most Canadians use the British spellings defence and offence. (Note that defensive and offensive are universal.)\n* Some nouns, as in British English, take -ice while matching verbs take -ise – for example, practice and licence are nouns while practise and license are the respective corresponding verbs. (Note that advice and advise are universal across all forms of English in this respect.)\n* Canadian spelling sometimes retains the British practice of doubling consonants when adding suffixes to words even when the final syllable (before the suffix) is not stressed. Compare Canadian (and British) travelled, counselling, and marvellous (more often than not in Canadian while always doubled in British) to American traveled, counseling, and marvelous. In American English, such consonants are only doubled when stressed; thus, for instance, controllable and enthralling are universal. (Note that both Canadian and British English use balloted and profiting.)\n* In other cases, Canadians and Americans differ from British spelling, such as in the case of nouns like curb and tire, which in British English are spelled kerb and tyre. \n\nCanadian spelling conventions can be partly explained by Canada's trade history. For instance, the British spelling of the word cheque probably relates to Canada's once-important ties to British financial institutions. Canada's automobile industry, on the other hand, has been dominated by American firms from its inception, explaining why Canadians use the American spelling of tire (hence, \"Canadian Tire\") and American terminology for automobiles and their parts (for example, truck instead of lorry, gasoline instead of petrol, trunk instead of boot).\n\nCanada's political history has also had an influence on Canadian spelling. Canada's first prime minister, John A. Macdonald, once directed the Governor General of Canada to issue an order-in-council directing that government papers be written in the British style.Richard Gwyn, John A.: The Man Who Made Us, ([Place of publication not listed]: Random House Canada), 2007, pp. 3–4.\n\nA contemporary reference for formal Canadian spelling is the spelling used for Hansard transcripts of the Parliament of Canada . Many Canadian editors, though, use the Canadian Oxford Dictionary, often along with the chapter on spelling in Editing Canadian English, and, where necessary (depending on context), one or more other references. \n\nThroughout part of the 20th century, some Canadian newspapers adopted American spellings, for example, color as opposed to the British-based colour. Some of the most substantial historical spelling data can be found in [https://www.academia.edu/23083415/New_data_for_an_English_usage_puzzle_the_long_history_of_spelling_variation_in_Canadian_English_and_its_linguistic_implications Dollinger (2010)] and Grue (2013). The use of such spellings was the long-standing practice of the Canadian Press perhaps since that news agency's inception, but visibly the norm prior to World War II. The practice of dropping the letter u in such words was also considered a labour-saving technique during the early days of printing in which movable type was set manually. Canadian newspapers also received much of their international content from American press agencies, therefore it was much easier for editorial staff to leave the spellings from the wire services as provided.\n\nIn the 1990s, Canadian newspapers began to adopt the British spelling variants such as -our endings, notably with The Globe and Mail changing its spelling policy in October 1990. Other Canadian newspapers adopted similar changes later that decade, such as the Southam newspaper chain's conversion in September 1998. The Toronto Star adopted this new spelling policy in September 1997 after that publication's ombudsman discounted the issue earlier in 1997. The Star had always avoided using recognized Canadian spelling, citing the Gage Canadian Dictionary in their defence. Controversy around this issue was frequent. When the Gage Dictionary finally adopted standard Canadian spelling, the Star followed suit. Some publishers, e.g. Maclean's, continue to prefer American spellings.\n\nDictionaries of Canadian English\n\nThe first Canadian dictionaries of Canadian English were edited by Walter Spencer Avis and published by Gage Ltd. The Beginner's Dictionary (1962), the Intermediate Dictionary (1964) and, finally, the Senior Dictionary (1967) were milestones in Canadian English lexicography. In November 1967, the flagship dictionary, the scholarly A Dictionary of Canadianisms on Historical Principles (Avis et al. 1967) was published and completed the first edition of Gage Publishing's Dictionary of Canadian English Series (online version accessible [http://www.dchp.ca/dchp1/ here], as Dollinger, Brinton and Fee 2013). Many secondary schools in Canada use the graded dictionaries. The dictionaries have regularly been updated since: the Senior Dictionary was renamed Gage Canadian Dictionary. Its fifth edition was printed beginning in 1997. Gage was acquired by Thomson Nelson around 2003. The latest editions were published in 2009 by HarperCollins. On 17 March 2017, coinciding with the 57th anniversary of founding editor Charles J. Lovell's passing, a second edition of DCHP was presented on the occasion of Canada's sesquicentennial as DCHP-2, which can be accessed [http://www.dchp.ca/dchp2 here] (as Dollinger & Fee 2017). DCHP-2 incorporates the c. 10,000 lexemes from DCHP-1 and adds c. 1300 novel meanings or 1002 lexemes to the documented lexicon of Canadian English, with a number of methodological innovations (see [https://www.academia.edu/20618274/Revising_the_Dictionary_of_Canadianisms_on_Historical_Principles_World_Englishes_and_linguistic_variation_in_real-time_revised_version_ Dollinger In press] [as of June 2017] for a summary of these features).\n\nIn 1997, the ITP Nelson Dictionary of the Canadian English Language was another product, but has not been updated since.\n\nIn 1998, Oxford University Press produced a Canadian English dictionary, after five years of lexicographical research, entitled The Oxford Canadian Dictionary. A second edition, retitled The Canadian Oxford Dictionary, was published in 2004. Just as the older dictionaries it includes uniquely Canadian words and words borrowed from other languages, and surveyed spellings, such as whether colour or color was the more popular choice in common use. Paperback and concise versions (2005, 2006), with minor updates, are available.\n\nThe scholarly Dictionary of Canadianisms on Historical Principles (DCHP) was first published in 1967 by Gage Ltd. It was a partner project of the Senior Dictionary (and appeared only a few weeks apart from it). The DCHP can be considered the \"Canadian OED\", as it documents the historical development of Canadian English words that can be classified as \"Canadianisms\". It therefore includes words such as mukluk, Canuck, bluff and grow op, but does not list common core words such as desk, table or car. It is a specialist, scholarly dictionary, but is not without interest to the general public. A digital edition in open access is now available. In 2006, a second edition (DCHP-2)\nwas commenced at UBC in Vancouver, and is/was launched on 17 March 2017 on www.dchp.ca/dchp2. The principles of DCHP-2, which includes frequency information on items and rationales for each term's assessment as a Canadianism (or not) are explained in the chief editor's account. An example of the Frequency charts, which are normalized internet domain searches, is shown on the right-hand side for the example chip wagon 'food cart for mobile lunches etc.'\n\nPhonology and phonetics\n\nIn terms of the major sound systems (phonologies) of English around the world, Canadian English aligns most closely to American English, both being grouped together under a common North American English sound system; the mainstream Canadian accent (\"Standard Canadian\") is often compared to the very similar and largely overlapping \"General American\" accent, an accent widely spoken throughout the United States and perceived there as being relatively lacking in any noticeable regional features.\n\nThe provinces east of Ontario show the largest dialect diversity. Northern Canada is, according to William Labov, a dialect region in formation, and a homogeneous dialect has not yet formed.Labov, p. 214 A very homogeneous dialect exists in Western and Central Canada, a situation that is similar to that of the Western United States. Labov identifies an inland region that concentrates all of the defining features of the dialect centred on the Prairies, with periphery areas with more variable patterns including the metropolitan areas of Vancouver and Toronto. This dialect forms a dialect continuum with the far Western U.S. English, however it is sharply differentiated from the Inland Northern U.S. English of the central and eastern Great Lakes region.\n\nStandard Canadian English\n\nStandard Canadian English is socially defined. It is the variety spoken, in Chamber's (1998: 252) definition, by Anglophone or multilingual residents, who are second generation or later (i.e. born in Canada) and who live in urban settings.Dollinger, Stefan (2012). \"Varieties of English: Canadian English in real-time perspective.\" In English Historical Linguistics: An International Handbook (HSK 34.2), Alexander Bergs & Laurel J. Brinton (eds), 1858-1880. Berlin: De Gruyter. pp. 1859-1860. Applying this definition, c. 36% of the Canadian population speak Standard Canadian English in the 2006 population, with 38% in the 2011 census.\n\nAlthough Canadian English phonology is part of the greater North American sound system, and therefore similar to U.S. English phonology, the pronunciation of particular words may have British influence, while other pronunciations are uniquely Canadian.[https://books.google.com/books?idia5tHVtQPn8C&printsec\nfrontcover#vonepage&q\nlever&f=false The Cambridge History of the English Language],\nedited by John Algeo, Volume 6, p. 431\n* The name of the letter Z is normally the Anglo-European (and French) zed; the American zee is less common in Canada, and it is often stigmatized; though the latter usage is not uncommon, especially among younger Canadians.\n\n* In the words adult and composite – the emphasis is usually on the first syllable, as in Britain.\n* Canadians side with the British on the pronunciation of shone, often lever, and several other words; been is pronounced by many speakers as rather than; as in Southern England.\n* Furthermore, in accordance with British traditions, schedule can sometimes be; process, progress, and project are occasionally pronounced,, and, respectively; harassment is sometimes pronouncedThe pronunciation with the stress on the second syllable is the most common pronunciation, but is considered incorrect by some people.  - Canadian Oxford Dictionary while leisure is rarely.\n* Again and against are often pronounced rather than.\n* The stressed vowel of words such as borrow, sorry or tomorrow is rather than.\n* Words like semi, anti, and multi tend to be pronounced,, and rather than,, and.\n* Loanwords that have a low central vowel in their language of origin, such as llama, pasta, and pyjamas, as well as place names like Gaza and Vietnam, tend to have rather than (which is the same as due to the father–bother merger, see below); this also applies to older loans like drama or Apache. The word khaki is sometimes pronounced, the preferred pronunciation of the Canadian Army during the Second World War.The pronunciation was the one used by author and veteran Farley Mowat.\n*Like most other North American English dialects, typical Canadian English uses a rhotic accent and has the Mary–marry–merry merger which makes word pairs like Barry/berry, Carrie/Kerry,  hairy/Harry, perish/parish, etc. as well as trios like airable/errable/arable and Mary/merry/marry have identical pronunciations (however, a distinction between the marry and merry sets remains in Montreal); the father–bother merger that makes lager/logger, con/Kahn, etc. sound identical. In addition to that, flapping of intervocalic and to alveolar tap before reduced vowels is ubiquitous, so the words ladder and latter, for example, are mostly or entirely pronounced the same.\n*Perhaps the most recognizable feature of Canadian English is \"Canadian raising\". For the beginning points of the diphthongs (gliding vowels) (as in the words height and mice) and (as in shout and house), the tongue is often more \"raised\" in the mouth when these diphthongs come before voiceless consonants, in comparison with other varieties of English. Before voiceless consonants, becomes; thus, a split between rider as and writer possibly as (). In General American, out is typically, but, with slight Canadian raising, it may sound more like, or, with the strong Canadian raising of the Prairies and Nova Scotia, more like. \n*Almost all Canadians have the cot–caught merger, which also occurs primarily in the Western U.S., but often elsewhere in the U.S., especially recently. Speakers do not distinguish the vowels (as in caught) and (as in cot), which merge.\n*The above merger creates a hole in the short vowel sub-systemMartinet, Andre 1955. Economie des changements phonetiques. Berne: Francke. and triggers a sound change known as the Canadian Shift, which involves the front lax vowels each lowering or retracting away from their original placements.Labov p. 219.\n\nRegional variation\n\nThe literature has for a long time conflated the notions of Standard Canadian English (StCE) and regional variation. While some regional dialects are close with the StCE, they are not identical with it. To the untrained ear, for instance, a BC middle class speaker from a rural setting may sound like a StCE speaker, while, given Chambers' definition, such person, because of the rural provenance, would not be included in the accepted definition (see the previous section). The Atlas of North American English, while being the best source for US regional variation, is not a good source for Canadian regional variation, as its analysis is based on only 33 Canadian speakers. Boberg's (2005, 2008) studies offer the best data for the delimitation of dialect zones. The results for vocabulary (Boberg 2005) and phonetics (Boberg 2008) overlap to a great extent, which has allowed the proposal of dialect zones. Dollinger and Clarke (2012: 459, Table 1), which distinguishes between: \n* West (BC, Alberta, Saskatchewan, Manitoba; with BC a sub zone on the lexical level)\n* Ontario (with Northwestern Ontario a transition zone with the West) \n* Quebec (concerning the c. 500,000 Anglophone speakers in the province, not the francophone speakers of English)\n* Maritimes (PEI, NS, NB, with PEI a subgroup on the lexical level)\n* Newfoundland                             (after [https://www.academia.edu/4001738/On_the_Autonomy_and_Homogeneity_of_Canadian_English_with_Sandra_Clarke_ Dollinger and Clarke 2012]: 459)\n\nBritish Columbia\n\nBritish Columbia English shares dialect features with both Standard Canadian English and the American Pacific Northwest English. In Vancouver, speakers exhibit more vowel retraction of before nasals than people from Toronto, and this retraction may become a regional marker of West Coast English.Erin Hall \"Regional variation in Canadian English vowel backing\" /aeg/ raising (found words such as bag, vague and bagel), a prominent feature in western American speakers, is also found in Vancouver speakers.  Canadian raising (found in words such as \"about\" and \"writer\") is less prominent in BC than other parts of the country and is on the decline further, with many speakers not raising before voiceless consonants. Younger speakers in the Greater Vancouver area do not even raise, causing \"about\" to sound somewhat like \"a boat\".  The \"o\" in such words as holy, goal, load, know, etc. is pronounced as a back and rounded, but not as rounded as in the Prairies where there is a strong Scandinavian, Slavic and German influence.\n\nOntario\n\nCanadian raising is quite strong throughout the province of Ontario, except within the Ottawa Valley. The Canadian Shift is also a common vowel shift found in Ontario. The retraction of was found to be more advanced for women in Ontario than for people from the Prairies or Atlantic Canada and men.\n\nIn Southwestern Ontario (roughly in the line south from Sarnia to St. Catharines), despite the existence of the many characteristics of West/Central Canadian English, many speakers, especially those under 30 speak a dialect which is influenced by the Inland Northern American English dialect found on much of the American regions adjacent to the Great Lakes, though there are minor differences such as Canadian raising (listen to \"ice\" vs \"my\"). Additionally, there is a tendency to round the mouth after pronouncing the vowel \"o\" which is distinct from the General American Accent. Also, the vowel of \"bag\" sounds closer to \"vague\" or \"egg\"; \"right\" sounds like \"rate\"; and the \"ah\" vowel in \"can't\" is drawn out, sounding like \"kee-ant\".\n\nThe subregion of Midwestern Ontario consists of the Counties of Huron, Bruce, Grey, and Perth.  The \"Queen's Bush\" as the area was called, did not experience communication with Southwestern and Central dialects until the early 20th century.  Thus, a strong accent similar to Central Ontarian is heard, yet many different phrasings exist.  It is typical in the area to drop phonetic sounds to make shorter contractions, such as: Prolly (Probably), Goin' (Going), and \"Wuts goin' on tonight?  D'ya wanna do sumthin'?\"  It is particularly strong in the County of Bruce, so much that it is commonly referred to as being the Bruce Cownian (Bruce Countian) accent. Also 'er' sounds are often pronounced 'air', with \"were\" sounding more like \"wear\".\n\nResidents of the Golden Horseshoe (including the Greater Toronto Area) are known to merge the second with the in Toronto, pronouncing the name variously as, or even or. This, however, is not unique to Toronto as Atlanta is often pronounced \"Atlanna\" by residents. In Toronto and the other areas within the Greater Toronto Area, the th sound is often pronounced. Sometimes is elided altogether, resulting in \"Do you want this one er'iss one?\" The word southern is often pronounced with. In the area north of the Regional Municipality of York and south of Parry Sound, notably among those who were born in the surrounding communities, the cutting down of syllables and consonants often heard, e.g. \"probably\" is reduced to \"prolly\", or \"probly\" when used as a response. In Greater Toronto, the diphthong tends to be fronted (as a result the word about is pronounced as or ‘a-beh-oot’).\n\nThe Greater Toronto Area is diverse linguistically with 44 percent of its people holding a mother tongue other than English. As a result Toronto has a distinct variation from other regions.Labov pp. 214–215. In Toronto's ethnic communities there are many words that are distinct; many of which come from the city's large Caribbean community. Although only 1.5% of Torontonians speak French, a relatively low proportion of them (56.2%) are native speakers of English, according to the 2006 Census. As a result Toronto shows a more variable speech pattern.Labov p. 214–215.\n\nIn Eastern Ontario, Canadian raising is not as strong as it is in the rest of the province. In Prescott and Russell, parts of Stormont-Dundas-Glengarry and Eastern Ottawa, French accents are often mixed with English ones due to the high Franco-Ontarian population there. In Lanark County, Western Ottawa and Leeds-Grenville and the rest of Stormont-Dundas-Glengarry, the accent spoken is nearly identical to that spoken in Central Ontario and the Quinte area. Phrases such as \"got it\" is often pronounced as. Okay is often pronounced as, while \"hello\" is often pronounced as.\n\nA linguistic exclave has also formed in the Ottawa Valley, heavily influenced by original Scottish, Irish, and German settlers, and existing along the Ontario-Quebec boundary, has its own distinct accent known as the Ottawa Valley twang or brogue).Henry, Alison. 1992. Infinitives in a For-To Dialect. Natural Language & Linguistic Theory 2, 279. Phonetically, the Ottawa Valley twang is characterized by the lack of Canadian raising as well as the cot–caught merger, two common elements of mainstream Canadian English. However, this accent is quite rare in the region today.Cheshire, Jenny. (ed.) 1991. English Around the World: Sociolinguistic Perspectives. New York: Cambridge University Press, 134.\n\nQuebec\n\nEnglish is a minority language in Quebec (with French in the majority), but has many speakers in Montreal, the Eastern Townships and in the Gatineau-Ottawa region. Uniquely, many people in Montreal distinguish between words like marry versus merry and parish versus perish, which are homophones to most other speakers of Canadian English. Quebec also has French influence.  A person with English mother tongue and still speaking English as the first language is called an Anglophone versus a French speaker, or Francophone.  Quebec Anglophones generally pronounce French street names in Montreal as French words. Pie IX Boulevard is pronounced as in French, not as \"pie nine\", but as \"pee-nuff\". On the other hand, Anglophones do pronounce final d's as in Bernard and Bouchard; the word Montreal is pronounced as an English word and Rue Lambert-Closse is known as Clossy Street.\n\nIn the city of Montreal, especially in some of the western suburbs like Côte-St-Luc and Hampstead, there is a strong Jewish influence in the English spoken in these areas. A large wave of Jewish immigration from Eastern Europe and the former Soviet Union before and after World War II is also evident today. Their English has a strong Yiddish influence; there are some similarities to English spoken in New York. Words used mainly in Quebec and especially in Montreal are:Boberg, p. 36. stage for \"apprenticeship\" or \"internship\", copybook for a notebook, dépanneur or dep for a convenience store, and guichet for an ABM/ATM. It is also common for Anglophones, particularly of Greek or Italian descent, to use translated French words instead of common English equivalents such as \"open\" and \"close\" for \"on\" and \"off\" or \"Open the lights, please\" for \"Turn on the lights, please\".\n\nMaritimes\n\nMany in the Maritime provinces – Nova Scotia, New Brunswick and Prince Edward Island – have an accent that sounds more like Scottish English and, in some places, Irish English than General American. Outside of major communities, dialects can vary markedly from community to community, as well as from province to province, reflecting ethnic origin as well as a past in which there were few roads and many communities, with some villages very isolated. Into the 1980s, residents of villages in northern Nova Scotia could identify themselves by dialects and accents distinctive to their village. The dialects of Prince Edward Island are often considered the most distinct grouping.\n\nThe phonology of Maritimer English has some unique features:\n* Cot-caught merger in effect, but toward a central vowel.\n* No Canadian Shift of the short front vowels\n* Pre-consonantal is sometimes (though rarely) deleted.\n* The flapping of intervocalic and to alveolar tap between vowels, as well as pronouncing it as a glottal stop, is less common in the Maritimes. Therefore, battery is pronounced instead of.\n* Especially among the older generation, and are not merged; that is, the beginning sound of why, white, and which is different from that of witch, with, wear.\n* Like most varieties of CanE, Maritimer English contains Canadian raising.\n\nNewfoundland\n\nThe dialect spoken in the province of Newfoundland and Labrador, an autonomous dominion until March 31, 1949, is often considered the most distinctive Canadian English dialect. Some Newfoundland English differs in vowel pronunciation, morphology, syntax, and preservation of archaic adverbial-intensifiers. The dialect can vary markedly from community to community, as well as from region to region, reflecting ethnic origin as well as a past in which there were few roads and many communities, and fishing villages in particular remained very isolated. A few speakers have a transitional pin–pen merger.\n\nAboriginal north\n\nFirst Nations and Inuit people from Northern Canada speak a version of Canadian English influenced by the phonology of their first languages. European Canadians in these regions are relatively recent arrivals, and have not produced a dialect that is distinct from southern Canadian English.Labov, William; Ash, Sharon; and Boberg, Charles. [https://books.google.com/books?idqa4-dFqi6iMC&pg\nPA216 The Atlas of North American English: Phonetics, Phonology, and Sound Change]. Walter de Gruyter, 2006, p. 216: \"In general, the English spoken in the Canadian North can be viewed as a dialect in formation ... The region's European population is too sparsely settled, too diverse in origin, and too recently arrived to have produced an identifiable, homogeneous dialect distinct from southern Canadian English, while its large Aboriginal population speaks a range of varieties influenced by non-English substrates ...\"\n\nGrammar\n\n* When writing, Canadians may start a sentence with As well, in the sense of \"in addition\"; this construction is a Canadianism.Trudgill and Hannah, International English (4th edition), p. 76.\n* In speech and in writing, Canadian English speakers permit (and often use) a transitive form for some past tense verbs where only an intransitive form is permitted in most other dialects.  Examples include: \"finished something\" (rather than \"finished with something\"), \"done something\" (rather than \"done with something\"), \"graduated university\" (rather than \"graduated from university\").\n\nVocabulary\n\nWhere Canadian English shares vocabulary with other English dialects, it tends to share most with American English, but also has many non-American terms distinctively shared instead with Britain. British and American terms also can coexist in Canadian English to various extents, sometimes with new nuances in meaning; a classic example is holiday (British) often used interchangeably with vacation (American), though, in Canadian speech, the latter can more narrowly mean a trip elsewhere and the former can mean general time off work. In addition, the vocabulary of Canadian English also features some words that are seldom (if ever) found elsewhere. A good resource for these and other words is the Dictionary of Canadianisms on Historical Principles, which is currently being revised at the University of British Columbia in Vancouver, British Columbia. The Canadian public appears to take interest in unique \"Canadianisms\": words that are distinctively characteristic of Canadian English—though perhaps not exclusive to Canada; there is some disagreement about the extent to which \"Canadianism\" means a term actually unique to Canada, with such an understanding possibly overstated by the popular media.\"[https://www.academia.edu/4002053/Uniquely_Canadian_Eh_Review_of_Barber_Katherine._2007._Only_in_Canada_You_Say_A_Treasury_of_Canadian_Language._Oxford_University_Press Uniquely Canadian, Eh?]\" Review of Barber, Katherine by Stefan Dollinger. 2007. Only in Canada You Say: A Treasury of Canadian Language. Oxford University Press.\nAs a member of the Commonwealth of Nations, Canada shares many items of institutional terminology and professional designations with the countries of the former British Empire – for example, constable, for a police officer of the lowest rank, and chartered accountant.\n\nEducation\n\nThe term college, which refers to post-secondary education in general in the U.S., refers in Canada to either a post-secondary technical or vocational institution, or to one of the colleges that exist as federated schools within some Canadian universities. Most often, a college is a community college, not a university. It may also refer to a CEGEP in Quebec. In Canada, college student might denote someone obtaining a diploma in business management while university student is the term for someone earning a bachelor's degree. For that reason, going to college does not have the same meaning as going to university, unless the speaker or context clarifies the specific level of post-secondary education that is meant.\n\nWithin the public school system the chief administrator of a school is generally \"the principal\", as in the United States, but the term is not used preceding his or her name, i.e. \"Principal Smith\". The assistant to the principal is not titled as \"assistant principal\", but rather as \"vice-principal\", although the former is not unknown. This usage is identical to that in Northern Ireland.\n\nCanadian universities publish calendars or schedules, not catalogs as in the U.S.. Canadian students write or take exams (in the U.S., students generally \"take\" exams while teachers \"write\" them); they rarely sit them (standard British usage). Those who supervise students during an exam are sometimes called invigilators as in Britain, or sometimes proctors as in the U.S; usage may depend on the region or even the individual institution.\n\nSuccessive years of school are usually referred to as grade one, grade two, and so on. In Quebec, the speaker (if Francophone) will often say primary one, primary two (a direct translation from the French), and so on; while Anglophones will say grade one, grade two. (Compare American first grade, second grade (sporadically found in Canada), and English/Welsh Year 1, Year 2, Scottish/Nth.Irish Primary 1, Primary 2 or P1, P2, and Sth.Irish First Class, Second Class and so on.).American Speech 80.1 (2005), p. 47. The year of school before grade 1 is usually called \"Kindergarten\", with the exception of Nova Scotia, where it is called \"grade primary\".\n\nIn the U.S., the four years of high school are termed the freshman, sophomore, junior, and senior years (terms also used for college years); in Canada, the specific levels are used instead (i.e., \"grade nine\").American Speech 80.1 (2005), p. 48. As for higher education, only the term freshman (often reduced to frosh) has some currency in Canada. The American usages \"sophomore\", \"junior\" and \"senior\" are not used in Canadian university terminology, or in speech. The specific high-school grades and university years are therefore stated and individualized; for example, the grade 12s failed to graduate; John is in his second year at McMaster. The \"first year\", \"third year\" designation also applies to Canadian law school students, as opposed to the common American usage of \"1L\", \"2L\" and \"3L\".\n\nCanadian students use the term marks (more common in England) or grades (more common in the US) to refer to their results; usage is very mixed.\n\nUnits of measurement\n\nUnlike in the United States, use of metric units within a majority of industries (but not all) is standard in Canada, as a result of the national adoption of the metric system during the mid-to-late 1970s; this has spawned some colloquial usages such as klick for kilometre (as also heard in the U.S. military). Nonetheless, Imperial units are still used in many situations. For example, English Canadians state their weight and height in pounds and feet/inches, respectively. Distances while playing golf are always marked and discussed in yards, though official scorecards may also show metres. Temperatures for cooking are often given in Fahrenheit, while the weather is given in Celsius. Directions in the Prairie provinces are sometimes given using miles, because the country roads generally follow the mile-based grid of the Dominion Land Survey. Canadians measure property, both residential and commercial, in square feet exclusively.  Fuel efficiency is less frequently discussed in miles per gallon, more often the metric L/100 km. The Letter paper size of 8.5 inches × 11 inches is used instead of the international and metric A4 size of 210 mm × 297 mm.\n\nTransportation\n\n* Although Canadian lexicon features both railway and railroad, railway is the usual term in naming (witness Canadian National Railway and Canadian Pacific Railway), though railroad can be heard fairly frequently in some regions; most rail terminology in Canada, however, follows American usage (for example, ties and cars rather than sleepers and carriages).\n* A two-way ticket can be either a round-trip (American term) or a return (British term).\n* The terms highway (for example, Trans-Canada Highway), expressway (Central Canada, as in the Gardiner Expressway) and freeway (Sherwood Park Freeway, Edmonton) are often used to describe various high speed roads with varying levels of access control. Generally, but not exclusively, highway refers to any provincially funded road regardless of its access control. Often such roads will be numbered. Similar to the US, the terms expressway and freeway are often used interchangeably to refer to controlled-access highways, that is, divided highways with access only at grade-separated interchanges (for example, a 400-Series Highway in Ontario).\n\nHowever, expressway may also refer to a limited-access road that has control of access but has at-grade junctions, railway crossings (for example, the Harbour Expressway in Thunder Bay.) Sometimes the term Parkway is also used (for example, the Hanlon Parkway in Guelph). In Saskatchewan, the term 'grid road' is used to refer to minor highways or rural roads, usually gravel, referring to the 'grid' upon which they were originally designed. In Quebec, freeways and expressways are called autoroutes.\n\nIn Alberta, the generic Trail is often used to describe a freeway, expressway or major urban street (for example, Deerfoot Trail, Macleod Trail or Crowchild Trail in Calgary, Yellowhead Trail in Edmonton). The British term motorway is not used. The American terms turnpike and tollway for a toll road are not common. The term throughway or thruway was used for first tolled limited-access highways (for example, the Deas Island Throughway, now Highway 99, from Vancouver, BC, to Blaine, Washington, USA or the Saint John Throughway (Highway 1) in Saint John, NB), but this term is not common anymore. In everyday speech, when a particular roadway is not being specified, the term highway is generally or exclusively used.\n* A railway at-grade junction can be called a level crossing, as well as the term grade crossing, which is commonly used in the US.\n* A railway or highway crossing overhead is an overpass or underpass, depending on which part of the crossing is referred to (the two are used more or less interchangeably); the British term flyover is sometimes used in Ontario, and in the Maritimes as well as on occasion in the prairies (such as the 4th avenue flyover in Calgary, Alberta), subway is also used.\n* In Quebec, English speakers often use the word \"Metro\" to mean subway. Non-native Anglophones of Quebec will also use the designated proper title \"Metro\" to describe the Montréal subway system.\n* The term Texas gate refers to the type of metal grid called a cattle guard in American English or a cattle grid in British English.\n*Depending on the region, large trucks used to transport and deliver goods are referred to as 'transport trucks' (E.g. used in Ontario and Alberta) or 'transfer trucks' (E.g. used in Prince Edward Island)\n\nPolitics\n\n* While in standard usage the terms prime minister and premier are interchangeable terms for the head of an elected parliamentary government, Canadian English today generally follows a usage convention of reserving the title prime minister for the federal first minister and referring to provincial or territorial leaders as premiers. However, because Canadian French does not have separate terms for the two positions, using premier ministre for both, the title prime minister is sometimes seen in reference to a provincial leader when a francophone is speaking or writing English. Also, until the 1970s the leader of the Ontario provincial government was officially styled prime minister.\n* When a majority of the elected members of the House of Commons or a provincial legislature are not members of the same party as the government, the situation is referred to as a minority government rather than a hung Parliament.\n* To table a document in Canada is to present it (as in Britain), whereas in the U.S. it means to withdraw it from consideration. (However in non-governmental meetings using Robert's Rules of Order to table a document can be to postpone consideration until a later date.)\n* Several political terms are more in use in Canada than elsewhere, including riding (as a general term for a parliamentary constituency or electoral district). The term reeve was at one time common for the equivalent of a mayor in some smaller municipalities in British Columbia and Ontario, but is now falling into disuse. The title is still used for the leader of a rural municipality in Saskatchewan, parts of Alberta, and Manitoba.\n* The term Tory, used in Britain with a similar meaning, denotes a supporter of the federal Conservative Party of Canada, the historic federal or provincial Progressive Conservative Party. The term Red Tory is also used to denote the more socially liberal wings of the Tory parties. Blue Tory is less commonly used, and refers to more strict fiscal (rather than social) conservatism. The U.S. use of Tory to mean the Loyalists in the time of the American Revolution is not used in Canada, where they are called United Empire Loyalists, or simply Loyalists.\n* Members of the Liberal Party of Canada or a provincial Liberal party are sometimes referred to as Grits. Historically, the term comes from the phrase Clear Grit, used in Victorian times in Canada to denote an object of quality or a truthful person. The term was assumed as a nickname by Liberals by the 1850s.\n* Members of the Bloc Québécois are sometimes referred to as Bloquistes. At the purely provincial level, members of Quebec's Parti Québécois are often referred to as Péquistes, and members of the Quebec provincial Action démocratique du Québec as Adéquistes.\n* The term \"Socred\" is no longer common due to its namesake party's decline, but referred to members of the Social Credit Party, and was particularly common in British Columbia. It was not used for Social Credit members from Quebec, nor generally used for the federal caucus of that party; in both cases Créditiste, the French term, was used in English.\n* Members of the Senate are referred to by the title \"Senator\" preceding their name, as in the United States. Members of the Canadian House of Commons, following British parliamentary nomenclature, are termed \"Members of Parliament\", and are referred to as \"Jennifer Jones, MP\" during their term of office only. Senators, and members of the Privy Council are styled \"The Honourable\" for life, and the Prime Minister of Canada is styled \"The Right Honourable\" for life, as is the Chief Justice of the Supreme Court and the Governor General. This honorific may also be bestowed by Parliament, as it was to retiring deputy prime minister Herb Gray in 1996. Members of provincial legislatures do not have a pre-nominal style, except in certain provinces, such as Nova Scotia where members of the Queen's Executive Council of Nova Scotia are styled \"The Honourable\" for life, and are entitled to the use of the post-nominal letters \"ECNS\". The Cabinet of Ontario serves concurrently (and not for life) as the Executive Council of Ontario, while serving members are styled \"The Honourable\", but are not entitled to post-nominal letters.\n* Members of provincial/territorial legislative assemblies are called MLAs in all provinces and territories except: Ontario, where they have been called Members of Provincial Parliament (MPPs) since 1938; Quebec, where they have been called Members of the National Assembly (MNAs) since 1968; and Newfoundland and Labrador, where they are called Members of the House of Assembly (MHAs).\n\nLaw\n\nLawyers in all parts of Canada, except Quebec, which has its own civil law system, are called \"barristers and solicitors\" because any lawyer licensed in any of the common law provinces and territories must pass bar exams for, and is permitted to engage in, both types of legal practice in contrast to other common-law jurisdictions such as England, Wales and Ireland where the two are traditionally separated (i.e., Canada has a fused legal profession). The words lawyer and counsel (not counsellor) predominate in everyday contexts; the word attorney refers to any personal representative. Canadian lawyers generally do not refer to themselves as \"attorneys\", a term which is common in the United States.\n\nThe equivalent of an American district attorney, meaning the barrister representing the state in criminal proceedings, is called a crown attorney (in Ontario), crown counsel (in British Columbia), crown prosecutor or the crown, on account of Canada's status as a constitutional monarchy in which the Crown is the locus of state power.\n\nThe words advocate and notary – two distinct professions in Quebec civil law – are used to refer to that province's equivalent of barrister and solicitor, respectively. In Canada's common law provinces and territories, the word notary means strictly a notary public.\n\nWithin the Canadian legal community itself, the word solicitor is often used to refer to any Canadian lawyer in general (much like the way the word attorney is used in the United States to refer to any American lawyer in general). Despite the conceptual distinction between barrister and solicitor, Canadian court documents would contain a phrase such as \"John Smith, solicitor for the Plaintiff\" even though \"John Smith\" may well himself be the barrister who argues the case in court. In a letter introducing him/herself to an opposing lawyer, a Canadian lawyer normally writes something like \"I am the solicitor for Mr. Tom Jones.\"\n\nThe word litigator is also used by lawyers to refer to a fellow lawyer who specializes in lawsuits even though the more traditional word barrister is still employed to denote the same specialization.\n\nJudges of Canada's superior courts (which exist at the provincial and territorial levels) are traditionally addressed as \"My Lord\" or \"My Lady\", however there are some variances across certain jurisdictions, with some superior court judges preferring the titles \"Mister Justice\" or \"Madam Justice\" to \"Lordship\".\n\nMasters are addressed as \"Mr. Master\" or simply \"Sir.\" In British Columbia, masters are addressed as \"Your Honour.\"\n\nJudges of provincial or inferior courts are traditionally referred to in person as \"Your Honour\". Judges of the Supreme Court of Canada and of the federal-level courts prefer the use of \"Mister/Madam (Chief) Justice\". Justices of The Peace are addressed as \"Your Worship\". \"Your Honour\" is also the correct form of address for a Lieutenant Governor.\n\nA serious crime is called an indictable offence, while a less-serious crime is called a summary offence. The older words felony and misdemeanour, which are still used in the United States, are not used in Canada's current Criminal Code (R.S.C. 1985, c. C-46) or by today's Canadian legal system. As noted throughout the Criminal Code, a person accused of a crime is called the accused and not the defendant, a term used instead in civil lawsuits.\n\nIn Canada,  visible minority refers to a non-aboriginal person or group visibly not one of the majority race in a given population. The term comes from the Canadian Employment Equity Act, which defines such people as \"persons, other than Aboriginal people, who are non-Caucasian in race or non-white in colour.\"[http://www12.statcan.ca/english/census06/reference/reportsandguides/visible-minorities.cfm  Visible Minority Population and Population Group Reference Guide, 2006 Census] from StatsCan  The term is used as a demographic category by Statistics Canada.  The qualifier \"visible\" is used to distinguish such minorities from the \"invisible\" minorities determined by language (English vs. French) and  certain distinctions in religion (Catholics vs. Protestants).\n\nA county in British Columbia means only a regional jurisdiction of the courts and justice system and is not otherwise connected to governance as with counties in other provinces and in the United States. The rough equivalent to \"county\" as used elsewhere is a \"Regional District\".\n\nPlaces\n\nDistinctive Canadianisms are:\n* bachelor: bachelor apartment, an apartment all in a single room, with a small bathroom attached (\"They have a bachelor for rent\").Oxford Advanced Learner's Dictionary, \"bachelor\". The usual American term is studio. In Quebec, this is known as a one-and-a-half apartment; some Canadians, especially in Prince Edward Island, call it a loft.Boberg 2005.\n* camp: in Northern Ontario, it refers to what is called a cottage in the rest of Ontario and a cabin in the West.Boberg 2005, p. 38. It is also used, to a lesser extent, in New Brunswick, Nova Scotia, as well as in parts of New England. It generally refers to vacation houses in rural areas.\n* fire hall: fire station, firehouse.\n* height of land: a drainage divide. Originally American.Webster's New World College Dictionary, Wiley, 2004.\n* parkade: a parking garage, especially in the West.\n* washroom: the general term for what is normally named public toilet or lavatory in Britain. In the United States (where it originated) the word was mostly replaced by restroom in the 20th century. Generally used only as a technical or commercial term outside of Canada. The word bathroom is also used.\n* Indian reserve, rather than the U.S. term \"federal Indian reservation.\" Often shortened to reserve, especially when the meaning is clear from context; another slang variant of this term is the shortened res or rez.\n* rancherie: the residential area of a First Nation reserve, used in BC only.\n* quiggly hole and/or quiggly: the depression in the ground left by a kekuli or pithouse. Groups of them are called \"quiggly hole towns\". Used in the BC Interior only.\n* gas bar: a filling station (gas station) with a central island, having pumps under a fixed metal or concrete awning.\n* booze can: an after-hours establishment where alcohol is served, often illegally.\n* dépanneur, or the diminutive form dep, is often used by English speakers in Quebec. This is because convenience stores are called dépanneurs in Canadian French.\n* snye, a side-stream channel that rejoins a larger river, creating an island.\n\nDaily life\n\nTerms common in Canada, Britain and Ireland but less frequent or nonexistent in the United States are:\n* tin (as in tin of tuna), for can, especially among older speakers. Among younger speakers, can is more common, with tin referring to a can which is wider than it is tall as in \"a tin of sardines\" as opposed to a \"can of soup\".\n* cutlery, for silverware or flatware, where the material of which the utensil is made is not of consequence to the context in which it is used.\n* serviette, especially in Eastern Canada, for a paper table napkin.\n* tap, conspicuously more common than faucet in everyday usage.\n\nThe following are more or less distinctively Canadian:\n* ABM, bank machine: synonymous with ATM (which is also used).Oxford Advanced Learner's Dictionary, ABM; Boberg 2005.\n* BFI bin: Dumpster, after a prominent Canadian waste management company, BFI Canada (which was eventually bought out and became Progressive Waste Solutions) in provinces where that company does business; compare to other generic trademarks such as Kleenex, Xerox, and even Dumpster itself.\n* converter: Remote control. Likely derived from a popular line of cable converters manufactured by Phillips Canada in the early 1980s, which were early users of IR remote controls.\n* chesterfield: originally British and internationally used (as in classic furnishing terminology) to refer to a sofa whose arms are the same height as the back, it is a term for any couch or sofa in Canada (and, to some extent, Northern California).[http://www.oup.com/oald-bin/web_getald7index1a.pl OUP.com]  Once a hallmark of CanE, chesterfield as with settee and davenport, is now largely in decline among younger generations in the western and central regions.[http://www.chass.utoronto.ca/~chambers/couch.html Utoronto.ca] J.K. Chambers, \"The Canada-U.S. border as a vanishing isogloss: the evidence of chesterfield.\" Journal of English Linguistics 23 (1995): 156-66. Couch is now the most common term; sofa is also used.\n* dart: cigarette, used primarily by adolescents and young adults.\n* dressing gown or housecoat: in the United States, called a bathrobe.\n* eavestrough: rain gutter. Also used, especially in the past, in the Northern and Western United States; the first recorded usage is in Herman Melville's Moby-Dick: \"The tails tapering down that way, serve to carry off the water, d'ye see. Same with cocked hats; the cocks form gable-end eave-troughs , Flask.\"Oxford Advanced Learner's Dictionary, eavestrough; Oxford English Dictionary; American Heritage Dictionary.\n* flush: toilet, used primarily by older speakers throughout the Maritimes.\n* garburator: (rhymes with carburetor) a garbage disposal.According to the Canadian Oxford Dictionary (second edition), garburator is \"Canadian\" and garbage disposal is \"North American.\"\n* homogenized milk or homo milk: milk containing 3.25% milk fat, typically called \"whole milk\" in the United States.\n* hydro: a common synonym for electrical service, used primarily in New Brunswick, Quebec, Ontario, Manitoba and British Columbia. Most of the power in these provinces is hydroelectricity, and suppliers' company names incorporate the term \"Hydro\". Usage: \"I didn't pay my hydro bill so they shut off my lights.\" Hence hydrofield, a line of electricity transmission towers, usually in groups cutting across a city, and hydro lines/poles, electrical transmission lines/poles.Oxford Advanced Learner's Dictionary, hydro. These usages of hydro are also standard in the Australian state of Tasmania. Also in slang usage can refer to hydroponically grown marijuana.\n* loonie: the Canadian one-dollar coin; derived from the use of the common loon on the reverse. The toonie (less commonly spelled tooney, twooney, twoonie) is the two-dollar coin. Loonie is also used to refer to the Canadian currency, particularly when discussing the exchange rate with the U.S. dollar; \"loonie\" and \"toonie\" describe coinage specifically. (for example, I have a dollar in pennies versus \"I have three loonies in my pocket\").\n* pencil crayon: coloured pencil.\n* pogie or pogey: term referring to unemployment insurance, which is now officially called Employment Insurance in Canada. Derived from the use of pogey as a term for a poorhouse. Not used for welfare, in which case the term is \"the dole\", as in \"he's on the dole, eh?\".\n\nApparel\n\nThe following are common in Canada, but not in the United States or the United Kingdom.\n* runners:Oxford Advanced Learner's Dictionary, runner. running shoes, especially in Western Canada.American Speech 80.1 (2005). Also used in Australian EnglishCambridge Advanced Learner's Dictionary. and Irish English.[http://www.irishtimes.com/newspaper/health/2009/0106/1230936690382.html Sometimes the gym doesn't fix it], The Irish Times, Tuesday, January 06, 2009[http://www.irishtimes.com/newspaper/magazine/2008/0322/1206024702849.html?via=me Machismo . . . or masochism?], The Irish Times – Saturday March 22, 2008[http://www.irishtimes.com/newspaper/health/2008/1007/1222959451495.html Stars in the running], The Irish Times, Tuesday October 7, 2008 Atlantic Canada prefers sneakers while central Canada (including Quebec and Ontario) prefers \"running shoes\".American Speech 80.1 (2005), p. 36.\n* tuque (also spelled toque or touque): a knitted winter hat. A similar hat would be called a beanie in the western United States and a watch cap in the eastern United States, though these forms are generally closer-fitting, and may lack a brim as well as a pompom. There seems to be no exact equivalent outside Canada, since the tuque is of French Canadian origin.\n* bunnyhug: a hooded sweatshirt, with or without a zipper. Used mainly in Saskatchewan.\n\nFood and beverage\n\n* Most Canadians as well as Americans in the Northwest, North Central, Prairie and Inland North prefer pop over soda to refer to a carbonated beverage (though neither term is dominant in British English). Soft drink is also extremely common throughout Canada.\n* What Americans call Canadian bacon is named back bacon in Canada, or, if it is coated in cornmeal or ground peas, cornmeal bacon or peameal bacon.\n* What most Americans call a candy bar is usually known as a chocolate bar (as in the United Kingdom). In certain areas surrounding the Bay of Fundy, it is sometimes known as a nut bar; however, this use is more popular amongst older generations.  Legally only bars made of solid chocolate may be labelled chocolate bars, others must be labelled as candy bars.\n* Even though the terms French fries and fries are used by Canadians, some speakers use the word chips (and its diminutive, chippies) (chips is always used when referring to fish and chips, as elsewhere).\n* whole-wheat bread is often referred to as brown bread, as in \"Would you like white or brown bread for your toast?\"\n* An expiry date is the term used for the date when a perishable product will go bad (similar to the UK Use By date). The term expiration date is more common in the United States (where expiry date is seen mostly on the packaging of Asian food products). The term Best Before also sees common use, where although not spoiled, the product may not taste \"as good\".\n* double-double: a cup of coffee with two measures of cream and two of sugar, most commonly associated with the Tim Hortons chain of coffee shops.\n* Canadianisms relating to alcohol:\n** mickey: a 375 mL bottle of hard liquor (informally called a pint in the Maritimes and the United States). In Newfoundland, this is almost exclusively referred to as a \"flask\". In the United States, \"mickey\", or \"Mickey Finn\", refers to a drink laced with drugs.\n** two-six, twenty-sixer, twixer: a 750 mL bottle of hard liquor (called a quart in the Maritimes). The word handle is less common. Similarly, a  bottle of hard liquor is known as a forty and a  bottle is known as a sixty or half gallon in Nova Scotia.\n** Texas mickey (especially in Saskatchewan, New Brunswick and Nova Scotia; more often a \"Saskatchewan mickey\" in western Canada): a 3 L bottle of hard liquor. (Despite the name, Texas mickeys are generally unavailable outside of Canada.)\n** two-four: a case of 24 beers, also known as a case in Eastern Canada, or a flat in Western Canada (referencing that cans of beer are often sold in packages of six, with four packages to a flat box for shipping and stacking purposes).\n** six-pack, half-sack, half-case, or poverty-pack: a case of six beers\n* poutine: a snack of french fries topped with cheese curds and hot gravy.\n* There are also genericized trademarks used in Canada:\n** cheezies: cheese puffs. The name is a genericized trademark based on a brand of crunchy cheese snack sold in Canada.\n**Kraft Dinner or \"KD\": for any packaged dry macaroni and cheese mix, even when it is not produced by Kraft.\n* freezie: A frozen flavoured sugar water snack common worldwide, but known by this name exclusively in Canada.\n* dainty: a fancy cookie, pastry, or square served at a social event (usually plural). Used in western Canada.\n* Smarties: a bean-sized, small candy covered chocolate, similar to plain M&M's. This is also seen in British English. Smarties in the United States refer to small tart powdered disc sold in rolls; in Canada these tart candies are sold as \"Rockets\".\n\nPrairies (Manitoba, Saskatchewan and Alberta)\n\nA strong Canadian raising exists in the prairie regions together with certain older usages such as chesterfield and front room also associated with the Maritimes. Aboriginal Canadians are a larger and more conspicuous population in prairie cities than elsewhere in the country and certain elements of aboriginal speech in English are sometimes to be heard. Similarly, the linguistic legacy, mostly intonation but also speech patterns and syntax, of the Scandinavian, Slavic and German settlers – who are far more numerous and historically important in the Prairies than in Ontario or the Maritimes – can be heard in the general milieu. Again, the large Métis population in Saskatchewan and Manitoba also carries with it certain linguistic traits inherited from French, Aboriginal and Celtic forebears.\nSome terms are derived from immigrant groups or are just local inventions:\n* bluff: small group of trees isolated by prairie\n* bunny hug: elsewhere hoodie or hooded sweat shirt (mainly in Saskatchewan, but also in Manitoba)\n* ginch/gonch/gitch/gotch: underwear (usually men's or boys' underwear, more specifically briefs; whereas women's underwear are gotchies), probably of Eastern European or Ukrainian origin. Gitch and gotch are primarily used in Saskatchewan and Manitoba while the variants with an n are common in Alberta and British Columbia.[http://www.doubletongued.org/index.php/dictionary/gonch/ Doubletongued.org], reference for gonch.\n* jam buster: jelly-filled doughnut.\n* porch climber: moonshine or homemade alcohol. Porch climber has a slightly distinguished meaning in Ontario where it refers to a beverage mixed of beer, vodka, and lemonade.\n* slough: pond – usually a pond on a farm\n* Vi-Co: occasionally used in Saskatchewan instead of chocolate milk. Formerly a brand of chocolate milk.\n\nIn farming communities with substantial Ukrainian, German or Mennonite populations, accents, sentence structure and vocabulary influenced by these languages is common. These communities are most common in the Saskatchewan Valley region of Saskatchewan and Red River Valley region of Manitoba.\n\nBritish Columbia\n\nBritish Columbian English has several words still in current use borrowed from the Chinook Jargon although the use of such vocabulary is observably decreasing. The most famous and widely used of these terms are skookum and saltchuck. However, among young British Columbians, almost no one uses this vocabulary, and only a small percentage is even familiar with the meaning of such words. In the Yukon, cheechako is used for newcomers or greenhorns.\n\nNorthern Ontario\n\nNorthern Ontario English has several distinct qualities stemming from its large Franco-Ontarian population. As a result several French and English words are used interchangeably. A number of phrases and expressions may also be found in Northern Ontario that are not present in the rest of the province, such as the use of camp for a summer home where Southern Ontario speakers would idiomatically use cottage.\n\nInformal speech\n\nA rubber in the U.S. and Canada is slang for a condom; however, in Canada it is sometimes (rarely except for Newfoundland and South Western Ontario) another term for an eraser (as it is in the United Kingdom and Ireland).\n\nThe word bum can refer either to the buttocks (as in Britain), or, derogatorily, to a homeless person (as in the U.S.). However, the \"buttocks\" sense does not have the indecent character it retains in British use, as it and \"butt\" are commonly used as a polite or childish euphemism for ruder words such as arse (commonly used in Atlantic Canada and among older people in Ontario and to the west) or ass, or mitiss (used in the Prairie Provinces, especially in northern and central Saskatchewan; probably originally a Cree loanword). Older Canadians may see \"bum\" as more polite than \"butt\", which before the 1980s was often considered rude.\n\nSimilarly the word pissed can refer either to being drunk (as in Britain), or being angry (as in the U.S.), though anger is more often said as pissed off, while piss drunk or pissed up is said to describe inebriation (though piss drunk is sometimes also used in the US, especially in the northern states).\n\nOne of the most distinctive Canadian phrases is the spoken interrogation or tag eh. The only usage of eh exclusive to Canada, according to the Canadian Oxford Dictionary, is for \"ascertaining the comprehension, continued interest, agreement, etc., of the person or persons addressed\" as in, \"It's four kilometres away, eh, so I have to go by bike.\" In that case, eh? is used to confirm the attention of the listener and to invite a supportive noise such as mm or oh or okay. This usage is also common in Queensland, Australia and New Zealand. Other uses of eh – for instance, in place of huh? or what? meaning \"please repeat or say again\" – are also found in parts of the British Isles and Australia. It is common in Northern/Central Ontario, the Maritimes and the Prairie provinces. The word eh is used quite frequently in the North Central dialect, so a Canadian accent is often perceived in people from North Dakota, Michigan, Minnesota, and Wisconsin.\n\nThe term Canuck simply means Canadian in its demonymic form, and, as a term used even by Canadians themselves, it is not considered derogatory. In the 19th century and early 20th century it tended to refer to French-Canadians, while the only Canadian-built version of the popular World War I-era American Curtiss JN-4 Jenny training biplane aircraft, the JN-4C, got the \"Canuck\" nickname, 1,260 of which were built. The nickname Janey Canuck was used by Anglophone women's rights writer Emily Murphy in the 1920s and the Johnny Canuck comic book character of the 1940s. Throughout the 1970s, Canada's winning World Cup men's downhill ski team was called the \"Crazy Canucks\" for their fearlessness on the slopes. It is also the name of the Vancouver Canucks, the National Hockey League team of Vancouver, British Columbia.\n\nThe term hoser, popularized by Bob & Doug McKenzie, typically refers to an uncouth, beer-swilling male and is a euphemism for \"loser\" coming from the earlier days of hockey played on an outdoor rink and the losing team would have to hose down the ice after the game so it refreezes smooth. Bob & Doug also popularized the use of Beauty, eh, another western slang term which may be used in variety of ways. This describes something as being of interest, of note, signals approval or simply draws attention to it. \n\nA Newf or Newfie is someone from Newfoundland and Labrador; sometimes considered derogatory. In Newfoundland, the term Mainlander refers to any Canadian (sometimes American, occasionally Labradorian) not from the island of Newfoundland. Mainlander is also occasionally used derogatorily.\n\nIn the Maritimes, a Caper or \"Cape Bretoner\" is someone from Cape Breton Island, a Bluenoser is someone with a thick, usually southern Nova Scotia accent or as a general term for a Nova Scotian (Including Cape Bretoners), while an Islander is someone from Prince Edward Island (the same term is used in British Columbia for people from Vancouver Island, or the numerous islands along it). A Haligonian refers to someone from the city of Halifax.\n\nOther Canadianisms\n\n* The alphanumeric code appended to mail addresses (the equivalent of the similar British postcode and the numeric-only American ZIP code) is called a postal code.\n* The term First Nations is often used in Canada to refer to what are called American Indians or Native Americans in the United States. This term does  include the Métis and Inuit, however; the term aboriginal peoples (and sometimes spelled with a capital \"A\": \"Aboriginal peoples\") is preferred when all three groups are included. The term Eskimo has been replaced by the term Inuit in the past few decades. It is now considered offensive to use the term Eskimo, but is still used commonly (without pejorative intent) by those born in the early-mid-20th century.\n* \"Going camping\" still refers to staying in a tent in a campground or wilderness area, while \"going out to camp\" may refer to a summer cottage or home in a rural area. \"Going to camp\" refers to children's summer camps. In British Columbia, \"camp\" was used as a reference for certain company towns (for example, Bridge River). It is used in western Canada to refer to logging and mining camps such as Juskatla Camp. It is also a synonym for a mining district; the latter occurs in names such as Camp McKinney and usages such as \"Cariboo gold camp\" and \"Slocan mining camp\" for the Cariboo goldfields and Slocan silver-galena mining district, respectively. A \"cottage\" in British Columbia is generally a small house, perhaps with an English design or flavour, while in southern Ontario it more likely means a second home on a lake. Similarly, \"chalet\" – originally a term for a small warming hut – can mean a second home of any size, but refers to one located in a ski resort. In Northern Ontario, these second homes tend to be called \"camps\".  In Western Canada, these second homes tend to be called \"cabins\".  A \"bunkie\" is a secondary building at these second homes that are small enough to require no building permits and house extra guests visiting.\n* A stagette is a female bachelorette party (US) or hen party (UK).\n* A \"shag\" is thought, erroneously, to be derived from \"shower\" and \"stag\", and describes a dance where alcohol, entry tickets, raffle tickets, and so on, are sold to raise money for the engaged couple's wedding. Normally a Northwest Ontario, Northern Ontario and sometimes Manitoba term, a \"stag and doe\" or \"buck and doe\" is used elsewhere in Ontario. The more common term for this type of event in Manitoba is a \"social\".\n* The humidex is a measurement used by meteorologists to reflect the combined effect of heat and humidity (vs. US term heat index quantifying the apparent temperature).\n* The States: Commonly used to refer to the United States or almost as often the U.S., much less often U.S.A. or America which are commonly used in other countries, the latter more often used in other English-speaking nations.\n* Drop the gloves: to begin a fight. A reference to a practice in hockey of removing gloves prior to fighting, and the idiom \"throw down the gauntlet\".\n* Back east typically means 'Ontario or possibly Quebec' whereas Down East instead refers to the Maritimes\n\nAttitudes towards Canadian English\n\nIn 2011, just under 21.5 million Canadians, representing 65% of the population, spoke English most of the time at home, while 58% declared it their mother language. English is the major language everywhere in Canada except Quebec, and most Canadians (85%) can speak English. While English is not the preferred language in Quebec, 36.1% of Québécois can speak English. Nationally, Francophones are five times more likely to speak English than Anglophones are to speak French – 44% and 9% respectively.Marmen, Louise and Corbeil, Jean-Pierre, \"New Canadian Perspectives, Languages in Canada 2001 Census,\" Library and Archives Canada Cataloguing in Publication, Statistics Canada Cat. No. Ch3-2/8-2004, (Canadian Heritage, 2004), pg. 60. Only 3.2% of Canada's English-speaking population resides in Quebec—mostly in Montreal.\n\nMore Canadians know how to speak English than speak it at home.\n\nAttitude studies on Canadian English are somewhat rare. A perceptual study on Albertan and Ontarians existsMcKinnie, Meghan and Jennifer Dailey-O’Cain. 2002. A perceptual dialectology of Anglophone Canada from the perspective of young Albertans and Ontarians. In Handbook of Perceptual Dialectology. Vol. 2, ed. by Daniel Long, 277-94. Amsterdam: Benjamins. in combination with older literature from the 1970/80s. Sporadic reports can be found in the literature, e.g. on Vancouver English, in which more than 80% believe in a \"Canadian way of speaking\", with those with a university education reporting higher than those without.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Canadian English" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=6340" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Canadian English (CanE, CE, en-CAen-CA is the language code for Canadian English, as defined by ISO standards (see ISO 639-1 and ISO 3166-1 alpha-2) and Internet standards (see IETF language tag).) is the set of varieties of the English language native to Canada. According to the 2011 census, English was the first language of approximately 19 million Canadians, or 57% of the population; the remainder of the population were native speakers of French Canadian (22%) or other languages (allophones, 21%). A larger number, 28 million people, reported using English as their dominant language. 82% of Canadians outside the province of Quebec reported speaking English natively, but within Quebec the figure was just 7.7% as most of its residents are native speakers of Québécois.\n\nCanadian English contains major elements of both British English and American English, as well as many uniquely Canadian characteristics.Dollinger, Stefan (2008).\"New-Dialect Formation in Canada.\"  Amsterdam: Benjamins, 978 90 272 31068 6. p. 25.\" While, broadly speaking, Canadian English tends to be closest to American English in terms of linguistic distance,Boberg, Charles (2004) [https://books.google.com/books?id\ngZV7AAAAQBAJ&dqStandard Canadian English].\" In Raymond Hickey. Standards of English: Codified Varieties Around the World. Cambridge University Press. p. 159.Labov, p. 222. the precise influence of American English, British English and other sources on Canadian English varieties has been the ongoing focus of systematic studies since the 1950s.\n\nPhonologically, Canadian and American English are classified together as North American English, emphasizing the fact that the vast majority of outsiders, even other native English speakers, cannot distinguish the typical accents of the two countries by sound alone. There are minor disagreements over the degree to which even Canadians and Americans themselves can differentiate their own two accents, and there is even evidence that some Western American English (Pacific Northwest and California English, for example) is undergoing a vowel shift partially coinciding with the one first reported in mainland Canadian English in the early 1990s.Harbeck, James (2014) \"[http://theweek.com/articles/453616/why-difficult-tell-canadian-accent-from-californian Why It's Difficult to Tell a Canadian Accent from a Californian One].\" The Week. The Week Publications, Inc.\n\nHistory\n\nThe term \"Canadian English\" is first attested in a speech by the Reverend A. Constable Geikie in an address to the Canadian Institute in 1857 (see [http://www.dchp.ca/DCHP-1/ DCHP-1 Online], s.v  \"Canadian English\", Avis et al. 1967). Geikie, a Scottish-born Canadian, reflected the Anglocentric attitude that would be prevalent in Canada for the next hundred years when he referred to the language as \"a corrupt dialect\", in comparison with what he considered the proper English spoken by immigrants from Britain.Chambers, p. xi.\n\nCanadian English is the product of five waves of immigration and settlement over a period of more than two centuries. The first large wave of permanent English-speaking settlement in Canada, and linguistically the most important, was the influx of Loyalists fleeing the American Revolution, chiefly from the Mid-Atlantic States – as such, Canadian English is believed by some scholars to have derived from northern American English.\"[https://books.google.com/books?idia5tHVtQPn8C&pg\nPA268&dq=%22northern+american+english%22#PPA422,M1 Canadian English].\" Brinton, Laurel J., and Fee, Marjery, ed. (2005). Ch. 12. in The Cambridge history of the English language. Volume VI: English in North America., Algeo, John, ed., pp. 422–440. Cambridge, UK: Cambridge University Press, 1992.\n. On p. 422: \"It is now generally agreed that Canadian English originated as a variant of northern American English (the speech of New England, New York, New Jersey, and Pennsylvania).\"\"Canadian English.\" McArthur, T., ed. (2005). Concise Oxford companion to the English language, pp. 96–102. Oxford, UK: Oxford University Press. . On p. 97: \"Because Canadian English and American English are so alike, some scholars have argued that in linguistic terms Canadian English is no more or less than a variety of (Northern) American English. The historical development of Canadian English is underexplored, but recent studies suggest that Canadian English has been developing features of its own since the early 19th century,Dollinger, Stefan. (2008).\"New-Dialect Formation in Canada.\" Amsterdam: Benjamins, 978 90 272 31068 6. p. 279.\" while recent studies have shown the emergence of Canadian English features.\"Labov, Ash, Boberg. 2006. The Atlas of North American English. Berlin: Mouton, ch. 15. The second wave from Britain and Ireland was encouraged to settle in Canada after the War of 1812 by the governors of Canada, who were worried about American dominance and influence among its citizens. Further waves of immigration from around the globe peaked in 1910, 1960 and at the present time had a lesser influence, but they did make Canada a multicultural country, ready to accept linguistic change from around the world during the current period of globalization.Chambers, p. xi–xii.\n\nThe languages of Aboriginal peoples in Canada started to influence European languages used in Canada even before widespread settlement took place, and the French of Lower Canada provided vocabulary to the English of Upper Canada.\n\nHistorical linguistics\n\nStudies on earlier forms of English in Canada are rare, yet connections with other work to historical linguistics can be forged. An overview of diachronic work on Canadian English, or diachronically-relevant work, is Dollinger (2012, updated to 2017).Dollinger, Stefan. 2012. [https://www.academia.edu/4001676/Varieties_of_English_Canadian_English_in_real-time_perspective Canadian English in real-time perspective]. In: English Historical Linguistics: An International Handbook. Vol. II. (HSK 34.2), ed. by Alexander Bergs & Laurel Brinton, 1858-1880. Berlin, New York: Mouton de Gruyter. UPDATED version, for 2017, is found here: https://www.academia.edu/35010966/Varieties_of_English_Canadian_English_in_real-time_perspective_2017_updated_version_of_2012_paper_ Until the 2000s, basically all commentators on the history of CanE have argued from the \"language-external\" history, i.e. social and political history (e.g.,Bloomfield, Morton W. 1948. Bloomfield, Morton W. 1948. Canadian English and its relation to eighteenth century American speech. Journal of English and Germanic Philology 47: 59-66Scargill, Matthew H. 1957. Sources of Canadian English. Journal of English and Germanic Philology 56: 611-614). An exception has been in the area of lexis, where Avis et al's (1967) Dictionary of Canadianisms on Historical Principles, offered real-time historical data through its quotations. Recently, historical linguists have started to study earlier Canadian English on historical linguistic data. DCHP-1 is now available in open access.Dollinger, Stefan (ed.-in-chief), Laurel J. Brinton and Margery Fee (eds). 2013. [http://www.dchp.ca/DCHP-1/ DCHP-1 Online: A Dictionary of Canadianisms on Historical Principles Online]. Based on Walter S. Avis et al. (1967). Vancouver, BC: University of British Columbia.) Most notably, [https://www.academia.edu/4006034/New-Dialect_Formation_in_Canada_Evidence_from_the_English_Modal_Auxiliaries Dollinger (2008)] pioneered the historical corpus linguistic approach for English in Canada with CONTE (Corpus of Early Ontario English, 1776-1849) and offers a developmental scenario for 18th- and 19th-century Ontario. Recently, Reuter (2015),Reuter, David. 2015.Newspaper, politics, and Canadian English: a corpus-based analysis of selected linguistic variables in early nineteenth-century Ontario newspapers. Ph.D. thesis. University of Kiel, Germany. with a 19th-century newspaper corpus from Ontario, has confirmed the scenario laid out in Dollinger (2008).\n\nHistorically, Canadian English included a class-based sociolect known as Canadian dainty.[http://www.cbc.ca/news/canada/toronto/canadian-dainty-accent-canada-day-1.4167610 \"Some Canadians used to speak with a quasi-British accent called Canadian Dainty\"]. CBC News, July 1, 2017. Treated as a marker of upper-class prestige in the 19th century and the early part of the 20th, Canadian dainty was marked by the use of some features of British English pronunciation, resulting in an accent similar to the Mid-Atlantic accent known in the United States. This accent faded in prominence following World War II, when it became stigmatized as pretentious, and is now almost never heard in contemporary Canadian life outside of archival recordings used in film, television or radio documentaries.\n\nSpelling tendencies\n\nCanadian spelling of the English language combines British and American conventions.\n\n* Words such as realize and paralyze are usually spelled with -ize or -yze rather than -ise or -yse. (The etymological convention that verbs derived from Greek roots are spelled with -ize and those from Latin with -ise is preserved in that practice.Sir Ernest Gowers, ed., Fowler's Modern English Usage, 2nd ed. (Oxford: OUP, 1965), 314.)\n* French-derived words that in American English end with -or and -er, such as color or center, often retain British spellings (colour and centre). \n* While the United States uses the Anglo-French spelling defense and offense (noun), most Canadians use the British spellings defence and offence. (Note that defensive and offensive are universal.)\n* Some nouns, as in British English, take -ice while matching verbs take -ise – for example, practice and licence are nouns while practise and license are the respective corresponding verbs. (Note that advice and advise are universal across all forms of English in this respect.)\n* Canadian spelling sometimes retains the British practice of doubling consonants when adding suffixes to words even when the final syllable (before the suffix) is not stressed. Compare Canadian (and British) travelled, counselling, and marvellous (more often than not in Canadian while always doubled in British) to American traveled, counseling, and marvelous. In American English, such consonants are only doubled when stressed; thus, for instance, controllable and enthralling are universal. (Note that both Canadian and British English use balloted and profiting.)\n* In other cases, Canadians and Americans differ from British spelling, such as in the case of nouns like curb and tire, which in British English are spelled kerb and tyre. \n\nCanadian spelling conventions can be partly explained by Canada's trade history. For instance, the British spelling of the word cheque probably relates to Canada's once-important ties to British financial institutions. Canada's automobile industry, on the other hand, has been dominated by American firms from its inception, explaining why Canadians use the American spelling of tire (hence, \"Canadian Tire\") and American terminology for automobiles and their parts (for example, truck instead of lorry, gasoline instead of petrol, trunk instead of boot).\n\nCanada's political history has also had an influence on Canadian spelling. Canada's first prime minister, John A. Macdonald, once directed the Governor General of Canada to issue an order-in-council directing that government papers be written in the British style.Richard Gwyn, John A.: The Man Who Made Us, ([Place of publication not listed]: Random House Canada), 2007, pp. 3–4.\n\nA contemporary reference for formal Canadian spelling is the spelling used for Hansard transcripts of the Parliament of Canada . Many Canadian editors, though, use the Canadian Oxford Dictionary, often along with the chapter on spelling in Editing Canadian English, and, where necessary (depending on context), one or more other references. \n\nThroughout part of the 20th century, some Canadian newspapers adopted American spellings, for example, color as opposed to the British-based colour. Some of the most substantial historical spelling data can be found in [https://www.academia.edu/23083415/New_data_for_an_English_usage_puzzle_the_long_history_of_spelling_variation_in_Canadian_English_and_its_linguistic_implications Dollinger (2010)] and Grue (2013). The use of such spellings was the long-standing practice of the Canadian Press perhaps since that news agency's inception, but visibly the norm prior to World War II. The practice of dropping the letter u in such words was also considered a labour-saving technique during the early days of printing in which movable type was set manually. Canadian newspapers also received much of their international content from American press agencies, therefore it was much easier for editorial staff to leave the spellings from the wire services as provided.\n\nIn the 1990s, Canadian newspapers began to adopt the British spelling variants such as -our endings, notably with The Globe and Mail changing its spelling policy in October 1990. Other Canadian newspapers adopted similar changes later that decade, such as the Southam newspaper chain's conversion in September 1998. The Toronto Star adopted this new spelling policy in September 1997 after that publication's ombudsman discounted the issue earlier in 1997. The Star had always avoided using recognized Canadian spelling, citing the Gage Canadian Dictionary in their defence. Controversy around this issue was frequent. When the Gage Dictionary finally adopted standard Canadian spelling, the Star followed suit. Some publishers, e.g. Maclean's, continue to prefer American spellings.\n\nDictionaries of Canadian English\n\nThe first Canadian dictionaries of Canadian English were edited by Walter Spencer Avis and published by Gage Ltd. The Beginner's Dictionary (1962), the Intermediate Dictionary (1964) and, finally, the Senior Dictionary (1967) were milestones in Canadian English lexicography. In November 1967, the flagship dictionary, the scholarly A Dictionary of Canadianisms on Historical Principles (Avis et al. 1967) was published and completed the first edition of Gage Publishing's Dictionary of Canadian English Series (online version accessible [http://www.dchp.ca/dchp1/ here], as Dollinger, Brinton and Fee 2013). Many secondary schools in Canada use the graded dictionaries. The dictionaries have regularly been updated since: the Senior Dictionary was renamed Gage Canadian Dictionary. Its fifth edition was printed beginning in 1997. Gage was acquired by Thomson Nelson around 2003. The latest editions were published in 2009 by HarperCollins. On 17 March 2017, coinciding with the 57th anniversary of founding editor Charles J. Lovell's passing, a second edition of DCHP was presented on the occasion of Canada's sesquicentennial as DCHP-2, which can be accessed [http://www.dchp.ca/dchp2 here] (as Dollinger & Fee 2017). DCHP-2 incorporates the c. 10,000 lexemes from DCHP-1 and adds c. 1300 novel meanings or 1002 lexemes to the documented lexicon of Canadian English, with a number of methodological innovations (see [https://www.academia.edu/20618274/Revising_the_Dictionary_of_Canadianisms_on_Historical_Principles_World_Englishes_and_linguistic_variation_in_real-time_revised_version_ Dollinger In press] [as of June 2017] for a summary of these features).\n\nIn 1997, the ITP Nelson Dictionary of the Canadian English Language was another product, but has not been updated since.\n\nIn 1998, Oxford University Press produced a Canadian English dictionary, after five years of lexicographical research, entitled The Oxford Canadian Dictionary. A second edition, retitled The Canadian Oxford Dictionary, was published in 2004. Just as the older dictionaries it includes uniquely Canadian words and words borrowed from other languages, and surveyed spellings, such as whether colour or color was the more popular choice in common use. Paperback and concise versions (2005, 2006), with minor updates, are available.\n\nThe scholarly Dictionary of Canadianisms on Historical Principles (DCHP) was first published in 1967 by Gage Ltd. It was a partner project of the Senior Dictionary (and appeared only a few weeks apart from it). The DCHP can be considered the \"Canadian OED\", as it documents the historical development of Canadian English words that can be classified as \"Canadianisms\". It therefore includes words such as mukluk, Canuck, bluff and grow op, but does not list common core words such as desk, table or car. It is a specialist, scholarly dictionary, but is not without interest to the general public. A digital edition in open access is now available. In 2006, a second edition (DCHP-2)\nwas commenced at UBC in Vancouver, and is/was launched on 17 March 2017 on www.dchp.ca/dchp2. The principles of DCHP-2, which includes frequency information on items and rationales for each term's assessment as a Canadianism (or not) are explained in the chief editor's account. An example of the Frequency charts, which are normalized internet domain searches, is shown on the right-hand side for the example chip wagon 'food cart for mobile lunches etc.'\n\nPhonology and phonetics\n\nIn terms of the major sound systems (phonologies) of English around the world, Canadian English aligns most closely to American English, both being grouped together under a common North American English sound system; the mainstream Canadian accent (\"Standard Canadian\") is often compared to the very similar and largely overlapping \"General American\" accent, an accent widely spoken throughout the United States and perceived there as being relatively lacking in any noticeable regional features.\n\nThe provinces east of Ontario show the largest dialect diversity. Northern Canada is, according to William Labov, a dialect region in formation, and a homogeneous dialect has not yet formed.Labov, p. 214 A very homogeneous dialect exists in Western and Central Canada, a situation that is similar to that of the Western United States. Labov identifies an inland region that concentrates all of the defining features of the dialect centred on the Prairies, with periphery areas with more variable patterns including the metropolitan areas of Vancouver and Toronto. This dialect forms a dialect continuum with the far Western U.S. English, however it is sharply differentiated from the Inland Northern U.S. English of the central and eastern Great Lakes region.\n\nStandard Canadian English\n\nStandard Canadian English is socially defined. It is the variety spoken, in Chamber's (1998: 252) definition, by Anglophone or multilingual residents, who are second generation or later (i.e. born in Canada) and who live in urban settings.Dollinger, Stefan (2012). \"Varieties of English: Canadian English in real-time perspective.\" In English Historical Linguistics: An International Handbook (HSK 34.2), Alexander Bergs & Laurel J. Brinton (eds), 1858-1880. Berlin: De Gruyter. pp. 1859-1860. Applying this definition, c. 36% of the Canadian population speak Standard Canadian English in the 2006 population, with 38% in the 2011 census.\n\nAlthough Canadian English phonology is part of the greater North American sound system, and therefore similar to U.S. English phonology, the pronunciation of particular words may have British influence, while other pronunciations are uniquely Canadian.[https://books.google.com/books?idia5tHVtQPn8C&printsec\nfrontcover#vonepage&q\nlever&f=false The Cambridge History of the English Language],\nedited by John Algeo, Volume 6, p. 431\n* The name of the letter Z is normally the Anglo-European (and French) zed; the American zee is less common in Canada, and it is often stigmatized; though the latter usage is not uncommon, especially among younger Canadians.\n\n* In the words adult and composite – the emphasis is usually on the first syllable, as in Britain.\n* Canadians side with the British on the pronunciation of shone, often lever, and several other words; been is pronounced by many speakers as rather than; as in Southern England.\n* Furthermore, in accordance with British traditions, schedule can sometimes be; process, progress, and project are occasionally pronounced,, and, respectively; harassment is sometimes pronouncedThe pronunciation with the stress on the second syllable is the most common pronunciation, but is considered incorrect by some people.  - Canadian Oxford Dictionary while leisure is rarely.\n* Again and against are often pronounced rather than.\n* The stressed vowel of words such as borrow, sorry or tomorrow is rather than.\n* Words like semi, anti, and multi tend to be pronounced,, and rather than,, and.\n* Loanwords that have a low central vowel in their language of origin, such as llama, pasta, and pyjamas, as well as place names like Gaza and Vietnam, tend to have rather than (which is the same as due to the father–bother merger, see below); this also applies to older loans like drama or Apache. The word khaki is sometimes pronounced, the preferred pronunciation of the Canadian Army during the Second World War.The pronunciation was the one used by author and veteran Farley Mowat.\n*Like most other North American English dialects, typical Canadian English uses a rhotic accent and has the Mary–marry–merry merger which makes word pairs like Barry/berry, Carrie/Kerry,  hairy/Harry, perish/parish, etc. as well as trios like airable/errable/arable and Mary/merry/marry have identical pronunciations (however, a distinction between the marry and merry sets remains in Montreal); the father–bother merger that makes lager/logger, con/Kahn, etc. sound identical. In addition to that, flapping of intervocalic and to alveolar tap before reduced vowels is ubiquitous, so the words ladder and latter, for example, are mostly or entirely pronounced the same.\n*Perhaps the most recognizable feature of Canadian English is \"Canadian raising\". For the beginning points of the diphthongs (gliding vowels) (as in the words height and mice) and (as in shout and house), the tongue is often more \"raised\" in the mouth when these diphthongs come before voiceless consonants, in comparison with other varieties of English. Before voiceless consonants, becomes; thus, a split between rider as and writer possibly as (). In General American, out is typically, but, with slight Canadian raising, it may sound more like, or, with the strong Canadian raising of the Prairies and Nova Scotia, more like. \n*Almost all Canadians have the cot–caught merger, which also occurs primarily in the Western U.S., but often elsewhere in the U.S., especially recently. Speakers do not distinguish the vowels (as in caught) and (as in cot), which merge.\n*The above merger creates a hole in the short vowel sub-systemMartinet, Andre 1955. Economie des changements phonetiques. Berne: Francke. and triggers a sound change known as the Canadian Shift, which involves the front lax vowels each lowering or retracting away from their original placements.Labov p. 219.\n\nRegional variation\n\nThe literature has for a long time conflated the notions of Standard Canadian English (StCE) and regional variation. While some regional dialects are close with the StCE, they are not identical with it. To the untrained ear, for instance, a BC middle class speaker from a rural setting may sound like a StCE speaker, while, given Chambers' definition, such person, because of the rural provenance, would not be included in the accepted definition (see the previous section). The Atlas of North American English, while being the best source for US regional variation, is not a good source for Canadian regional variation, as its analysis is based on only 33 Canadian speakers. Boberg's (2005, 2008) studies offer the best data for the delimitation of dialect zones. The results for vocabulary (Boberg 2005) and phonetics (Boberg 2008) overlap to a great extent, which has allowed the proposal of dialect zones. Dollinger and Clarke (2012: 459, Table 1), which distinguishes between: \n* West (BC, Alberta, Saskatchewan, Manitoba; with BC a sub zone on the lexical level)\n* Ontario (with Northwestern Ontario a transition zone with the West) \n* Quebec (concerning the c. 500,000 Anglophone speakers in the province, not the francophone speakers of English)\n* Maritimes (PEI, NS, NB, with PEI a subgroup on the lexical level)\n* Newfoundland                             (after [https://www.academia.edu/4001738/On_the_Autonomy_and_Homogeneity_of_Canadian_English_with_Sandra_Clarke_ Dollinger and Clarke 2012]: 459)\n\nBritish Columbia\n\nBritish Columbia English shares dialect features with both Standard Canadian English and the American Pacific Northwest English. In Vancouver, speakers exhibit more vowel retraction of before nasals than people from Toronto, and this retraction may become a regional marker of West Coast English.Erin Hall \"Regional variation in Canadian English vowel backing\" /aeg/ raising (found words such as bag, vague and bagel), a prominent feature in western American speakers, is also found in Vancouver speakers.  Canadian raising (found in words such as \"about\" and \"writer\") is less prominent in BC than other parts of the country and is on the decline further, with many speakers not raising before voiceless consonants. Younger speakers in the Greater Vancouver area do not even raise, causing \"about\" to sound somewhat like \"a boat\".  The \"o\" in such words as holy, goal, load, know, etc. is pronounced as a back and rounded, but not as rounded as in the Prairies where there is a strong Scandinavian, Slavic and German influence.\n\nOntario\n\nCanadian raising is quite strong throughout the province of Ontario, except within the Ottawa Valley. The Canadian Shift is also a common vowel shift found in Ontario. The retraction of was found to be more advanced for women in Ontario than for people from the Prairies or Atlantic Canada and men.\n\nIn Southwestern Ontario (roughly in the line south from Sarnia to St. Catharines), despite the existence of the many characteristics of West/Central Canadian English, many speakers, especially those under 30 speak a dialect which is influenced by the Inland Northern American English dialect found on much of the American regions adjacent to the Great Lakes, though there are minor differences such as Canadian raising (listen to \"ice\" vs \"my\"). Additionally, there is a tendency to round the mouth after pronouncing the vowel \"o\" which is distinct from the General American Accent. Also, the vowel of \"bag\" sounds closer to \"vague\" or \"egg\"; \"right\" sounds like \"rate\"; and the \"ah\" vowel in \"can't\" is drawn out, sounding like \"kee-ant\".\n\nThe subregion of Midwestern Ontario consists of the Counties of Huron, Bruce, Grey, and Perth.  The \"Queen's Bush\" as the area was called, did not experience communication with Southwestern and Central dialects until the early 20th century.  Thus, a strong accent similar to Central Ontarian is heard, yet many different phrasings exist.  It is typical in the area to drop phonetic sounds to make shorter contractions, such as: Prolly (Probably), Goin' (Going), and \"Wuts goin' on tonight?  D'ya wanna do sumthin'?\"  It is particularly strong in the County of Bruce, so much that it is commonly referred to as being the Bruce Cownian (Bruce Countian) accent. Also 'er' sounds are often pronounced 'air', with \"were\" sounding more like \"wear\".\n\nResidents of the Golden Horseshoe (including the Greater Toronto Area) are known to merge the second with the in Toronto, pronouncing the name variously as, or even or. This, however, is not unique to Toronto as Atlanta is often pronounced \"Atlanna\" by residents. In Toronto and the other areas within the Greater Toronto Area, the th sound is often pronounced. Sometimes is elided altogether, resulting in \"Do you want this one er'iss one?\" The word southern is often pronounced with. In the area north of the Regional Municipality of York and south of Parry Sound, notably among those who were born in the surrounding communities, the cutting down of syllables and consonants often heard, e.g. \"probably\" is reduced to \"prolly\", or \"probly\" when used as a response. In Greater Toronto, the diphthong tends to be fronted (as a result the word about is pronounced as or ‘a-beh-oot’).\n\nThe Greater Toronto Area is diverse linguistically with 44 percent of its people holding a mother tongue other than English. As a result Toronto has a distinct variation from other regions.Labov pp. 214–215. In Toronto's ethnic communities there are many words that are distinct; many of which come from the city's large Caribbean community. Although only 1.5% of Torontonians speak French, a relatively low proportion of them (56.2%) are native speakers of English, according to the 2006 Census. As a result Toronto shows a more variable speech pattern.Labov p. 214–215.\n\nIn Eastern Ontario, Canadian raising is not as strong as it is in the rest of the province. In Prescott and Russell, parts of Stormont-Dundas-Glengarry and Eastern Ottawa, French accents are often mixed with English ones due to the high Franco-Ontarian population there. In Lanark County, Western Ottawa and Leeds-Grenville and the rest of Stormont-Dundas-Glengarry, the accent spoken is nearly identical to that spoken in Central Ontario and the Quinte area. Phrases such as \"got it\" is often pronounced as. Okay is often pronounced as, while \"hello\" is often pronounced as.\n\nA linguistic exclave has also formed in the Ottawa Valley, heavily influenced by original Scottish, Irish, and German settlers, and existing along the Ontario-Quebec boundary, has its own distinct accent known as the Ottawa Valley twang or brogue).Henry, Alison. 1992. Infinitives in a For-To Dialect. Natural Language & Linguistic Theory 2, 279. Phonetically, the Ottawa Valley twang is characterized by the lack of Canadian raising as well as the cot–caught merger, two common elements of mainstream Canadian English. However, this accent is quite rare in the region today.Cheshire, Jenny. (ed.) 1991. English Around the World: Sociolinguistic Perspectives. New York: Cambridge University Press, 134.\n\nQuebec\n\nEnglish is a minority language in Quebec (with French in the majority), but has many speakers in Montreal, the Eastern Townships and in the Gatineau-Ottawa region. Uniquely, many people in Montreal distinguish between words like marry versus merry and parish versus perish, which are homophones to most other speakers of Canadian English. Quebec also has French influence.  A person with English mother tongue and still speaking English as the first language is called an Anglophone versus a French speaker, or Francophone.  Quebec Anglophones generally pronounce French street names in Montreal as French words. Pie IX Boulevard is pronounced as in French, not as \"pie nine\", but as \"pee-nuff\". On the other hand, Anglophones do pronounce final d's as in Bernard and Bouchard; the word Montreal is pronounced as an English word and Rue Lambert-Closse is known as Clossy Street.\n\nIn the city of Montreal, especially in some of the western suburbs like Côte-St-Luc and Hampstead, there is a strong Jewish influence in the English spoken in these areas. A large wave of Jewish immigration from Eastern Europe and the former Soviet Union before and after World War II is also evident today. Their English has a strong Yiddish influence; there are some similarities to English spoken in New York. Words used mainly in Quebec and especially in Montreal are:Boberg, p. 36. stage for \"apprenticeship\" or \"internship\", copybook for a notebook, dépanneur or dep for a convenience store, and guichet for an ABM/ATM. It is also common for Anglophones, particularly of Greek or Italian descent, to use translated French words instead of common English equivalents such as \"open\" and \"close\" for \"on\" and \"off\" or \"Open the lights, please\" for \"Turn on the lights, please\".\n\nMaritimes\n\nMany in the Maritime provinces – Nova Scotia, New Brunswick and Prince Edward Island – have an accent that sounds more like Scottish English and, in some places, Irish English than General American. Outside of major communities, dialects can vary markedly from community to community, as well as from province to province, reflecting ethnic origin as well as a past in which there were few roads and many communities, with some villages very isolated. Into the 1980s, residents of villages in northern Nova Scotia could identify themselves by dialects and accents distinctive to their village. The dialects of Prince Edward Island are often considered the most distinct grouping.\n\nThe phonology of Maritimer English has some unique features:\n* Cot-caught merger in effect, but toward a central vowel.\n* No Canadian Shift of the short front vowels\n* Pre-consonantal is sometimes (though rarely) deleted.\n* The flapping of intervocalic and to alveolar tap between vowels, as well as pronouncing it as a glottal stop, is less common in the Maritimes. Therefore, battery is pronounced instead of.\n* Especially among the older generation, and are not merged; that is, the beginning sound of why, white, and which is different from that of witch, with, wear.\n* Like most varieties of CanE, Maritimer English contains Canadian raising.\n\nNewfoundland\n\nThe dialect spoken in the province of Newfoundland and Labrador, an autonomous dominion until March 31, 1949, is often considered the most distinctive Canadian English dialect. Some Newfoundland English differs in vowel pronunciation, morphology, syntax, and preservation of archaic adverbial-intensifiers. The dialect can vary markedly from community to community, as well as from region to region, reflecting ethnic origin as well as a past in which there were few roads and many communities, and fishing villages in particular remained very isolated. A few speakers have a transitional pin–pen merger.\n\nAboriginal north\n\nFirst Nations and Inuit people from Northern Canada speak a version of Canadian English influenced by the phonology of their first languages. European Canadians in these regions are relatively recent arrivals, and have not produced a dialect that is distinct from southern Canadian English.Labov, William; Ash, Sharon; and Boberg, Charles. [https://books.google.com/books?idqa4-dFqi6iMC&pg\nPA216 The Atlas of North American English: Phonetics, Phonology, and Sound Change]. Walter de Gruyter, 2006, p. 216: \"In general, the English spoken in the Canadian North can be viewed as a dialect in formation ... The region's European population is too sparsely settled, too diverse in origin, and too recently arrived to have produced an identifiable, homogeneous dialect distinct from southern Canadian English, while its large Aboriginal population speaks a range of varieties influenced by non-English substrates ...\"\n\nGrammar\n\n* When writing, Canadians may start a sentence with As well, in the sense of \"in addition\"; this construction is a Canadianism.Trudgill and Hannah, International English (4th edition), p. 76.\n* In speech and in writing, Canadian English speakers permit (and often use) a transitive form for some past tense verbs where only an intransitive form is permitted in most other dialects.  Examples include: \"finished something\" (rather than \"finished with something\"), \"done something\" (rather than \"done with something\"), \"graduated university\" (rather than \"graduated from university\").\n\nVocabulary\n\nWhere Canadian English shares vocabulary with other English dialects, it tends to share most with American English, but also has many non-American terms distinctively shared instead with Britain. British and American terms also can coexist in Canadian English to various extents, sometimes with new nuances in meaning; a classic example is holiday (British) often used interchangeably with vacation (American), though, in Canadian speech, the latter can more narrowly mean a trip elsewhere and the former can mean general time off work. In addition, the vocabulary of Canadian English also features some words that are seldom (if ever) found elsewhere. A good resource for these and other words is the Dictionary of Canadianisms on Historical Principles, which is currently being revised at the University of British Columbia in Vancouver, British Columbia. The Canadian public appears to take interest in unique \"Canadianisms\": words that are distinctively characteristic of Canadian English—though perhaps not exclusive to Canada; there is some disagreement about the extent to which \"Canadianism\" means a term actually unique to Canada, with such an understanding possibly overstated by the popular media.\"[https://www.academia.edu/4002053/Uniquely_Canadian_Eh_Review_of_Barber_Katherine._2007._Only_in_Canada_You_Say_A_Treasury_of_Canadian_Language._Oxford_University_Press Uniquely Canadian, Eh?]\" Review of Barber, Katherine by Stefan Dollinger. 2007. Only in Canada You Say: A Treasury of Canadian Language. Oxford University Press.\nAs a member of the Commonwealth of Nations, Canada shares many items of institutional terminology and professional designations with the countries of the former British Empire – for example, constable, for a police officer of the lowest rank, and chartered accountant.\n\nEducation\n\nThe term college, which refers to post-secondary education in general in the U.S., refers in Canada to either a post-secondary technical or vocational institution, or to one of the colleges that exist as federated schools within some Canadian universities. Most often, a college is a community college, not a university. It may also refer to a CEGEP in Quebec. In Canada, college student might denote someone obtaining a diploma in business management while university student is the term for someone earning a bachelor's degree. For that reason, going to college does not have the same meaning as going to university, unless the speaker or context clarifies the specific level of post-secondary education that is meant.\n\nWithin the public school system the chief administrator of a school is generally \"the principal\", as in the United States, but the term is not used preceding his or her name, i.e. \"Principal Smith\". The assistant to the principal is not titled as \"assistant principal\", but rather as \"vice-principal\", although the former is not unknown. This usage is identical to that in Northern Ireland.\n\nCanadian universities publish calendars or schedules, not catalogs as in the U.S.. Canadian students write or take exams (in the U.S., students generally \"take\" exams while teachers \"write\" them); they rarely sit them (standard British usage). Those who supervise students during an exam are sometimes called invigilators as in Britain, or sometimes proctors as in the U.S; usage may depend on the region or even the individual institution.\n\nSuccessive years of school are usually referred to as grade one, grade two, and so on. In Quebec, the speaker (if Francophone) will often say primary one, primary two (a direct translation from the French), and so on; while Anglophones will say grade one, grade two. (Compare American first grade, second grade (sporadically found in Canada), and English/Welsh Year 1, Year 2, Scottish/Nth.Irish Primary 1, Primary 2 or P1, P2, and Sth.Irish First Class, Second Class and so on.).American Speech 80.1 (2005), p. 47. The year of school before grade 1 is usually called \"Kindergarten\", with the exception of Nova Scotia, where it is called \"grade primary\".\n\nIn the U.S., the four years of high school are termed the freshman, sophomore, junior, and senior years (terms also used for college years); in Canada, the specific levels are used instead (i.e., \"grade nine\").American Speech 80.1 (2005), p. 48. As for higher education, only the term freshman (often reduced to frosh) has some currency in Canada. The American usages \"sophomore\", \"junior\" and \"senior\" are not used in Canadian university terminology, or in speech. The specific high-school grades and university years are therefore stated and individualized; for example, the grade 12s failed to graduate; John is in his second year at McMaster. The \"first year\", \"third year\" designation also applies to Canadian law school students, as opposed to the common American usage of \"1L\", \"2L\" and \"3L\".\n\nCanadian students use the term marks (more common in England) or grades (more common in the US) to refer to their results; usage is very mixed.\n\nUnits of measurement\n\nUnlike in the United States, use of metric units within a majority of industries (but not all) is standard in Canada, as a result of the national adoption of the metric system during the mid-to-late 1970s; this has spawned some colloquial usages such as klick for kilometre (as also heard in the U.S. military). Nonetheless, Imperial units are still used in many situations. For example, English Canadians state their weight and height in pounds and feet/inches, respectively. Distances while playing golf are always marked and discussed in yards, though official scorecards may also show metres. Temperatures for cooking are often given in Fahrenheit, while the weather is given in Celsius. Directions in the Prairie provinces are sometimes given using miles, because the country roads generally follow the mile-based grid of the Dominion Land Survey. Canadians measure property, both residential and commercial, in square feet exclusively.  Fuel efficiency is less frequently discussed in miles per gallon, more often the metric L/100 km. The Letter paper size of 8.5 inches × 11 inches is used instead of the international and metric A4 size of 210 mm × 297 mm.\n\nTransportation\n\n* Although Canadian lexicon features both railway and railroad, railway is the usual term in naming (witness Canadian National Railway and Canadian Pacific Railway), though railroad can be heard fairly frequently in some regions; most rail terminology in Canada, however, follows American usage (for example, ties and cars rather than sleepers and carriages).\n* A two-way ticket can be either a round-trip (American term) or a return (British term).\n* The terms highway (for example, Trans-Canada Highway), expressway (Central Canada, as in the Gardiner Expressway) and freeway (Sherwood Park Freeway, Edmonton) are often used to describe various high speed roads with varying levels of access control. Generally, but not exclusively, highway refers to any provincially funded road regardless of its access control. Often such roads will be numbered. Similar to the US, the terms expressway and freeway are often used interchangeably to refer to controlled-access highways, that is, divided highways with access only at grade-separated interchanges (for example, a 400-Series Highway in Ontario).\n\nHowever, expressway may also refer to a limited-access road that has control of access but has at-grade junctions, railway crossings (for example, the Harbour Expressway in Thunder Bay.) Sometimes the term Parkway is also used (for example, the Hanlon Parkway in Guelph). In Saskatchewan, the term 'grid road' is used to refer to minor highways or rural roads, usually gravel, referring to the 'grid' upon which they were originally designed. In Quebec, freeways and expressways are called autoroutes.\n\nIn Alberta, the generic Trail is often used to describe a freeway, expressway or major urban street (for example, Deerfoot Trail, Macleod Trail or Crowchild Trail in Calgary, Yellowhead Trail in Edmonton). The British term motorway is not used. The American terms turnpike and tollway for a toll road are not common. The term throughway or thruway was used for first tolled limited-access highways (for example, the Deas Island Throughway, now Highway 99, from Vancouver, BC, to Blaine, Washington, USA or the Saint John Throughway (Highway 1) in Saint John, NB), but this term is not common anymore. In everyday speech, when a particular roadway is not being specified, the term highway is generally or exclusively used.\n* A railway at-grade junction can be called a level crossing, as well as the term grade crossing, which is commonly used in the US.\n* A railway or highway crossing overhead is an overpass or underpass, depending on which part of the crossing is referred to (the two are used more or less interchangeably); the British term flyover is sometimes used in Ontario, and in the Maritimes as well as on occasion in the prairies (such as the 4th avenue flyover in Calgary, Alberta), subway is also used.\n* In Quebec, English speakers often use the word \"Metro\" to mean subway. Non-native Anglophones of Quebec will also use the designated proper title \"Metro\" to describe the Montréal subway system.\n* The term Texas gate refers to the type of metal grid called a cattle guard in American English or a cattle grid in British English.\n*Depending on the region, large trucks used to transport and deliver goods are referred to as 'transport trucks' (E.g. used in Ontario and Alberta) or 'transfer trucks' (E.g. used in Prince Edward Island)\n\nPolitics\n\n* While in standard usage the terms prime minister and premier are interchangeable terms for the head of an elected parliamentary government, Canadian English today generally follows a usage convention of reserving the title prime minister for the federal first minister and referring to provincial or territorial leaders as premiers. However, because Canadian French does not have separate terms for the two positions, using premier ministre for both, the title prime minister is sometimes seen in reference to a provincial leader when a francophone is speaking or writing English. Also, until the 1970s the leader of the Ontario provincial government was officially styled prime minister.\n* When a majority of the elected members of the House of Commons or a provincial legislature are not members of the same party as the government, the situation is referred to as a minority government rather than a hung Parliament.\n* To table a document in Canada is to present it (as in Britain), whereas in the U.S. it means to withdraw it from consideration. (However in non-governmental meetings using Robert's Rules of Order to table a document can be to postpone consideration until a later date.)\n* Several political terms are more in use in Canada than elsewhere, including riding (as a general term for a parliamentary constituency or electoral district). The term reeve was at one time common for the equivalent of a mayor in some smaller municipalities in British Columbia and Ontario, but is now falling into disuse. The title is still used for the leader of a rural municipality in Saskatchewan, parts of Alberta, and Manitoba.\n* The term Tory, used in Britain with a similar meaning, denotes a supporter of the federal Conservative Party of Canada, the historic federal or provincial Progressive Conservative Party. The term Red Tory is also used to denote the more socially liberal wings of the Tory parties. Blue Tory is less commonly used, and refers to more strict fiscal (rather than social) conservatism. The U.S. use of Tory to mean the Loyalists in the time of the American Revolution is not used in Canada, where they are called United Empire Loyalists, or simply Loyalists.\n* Members of the Liberal Party of Canada or a provincial Liberal party are sometimes referred to as Grits. Historically, the term comes from the phrase Clear Grit, used in Victorian times in Canada to denote an object of quality or a truthful person. The term was assumed as a nickname by Liberals by the 1850s.\n* Members of the Bloc Québécois are sometimes referred to as Bloquistes. At the purely provincial level, members of Quebec's Parti Québécois are often referred to as Péquistes, and members of the Quebec provincial Action démocratique du Québec as Adéquistes.\n* The term \"Socred\" is no longer common due to its namesake party's decline, but referred to members of the Social Credit Party, and was particularly common in British Columbia. It was not used for Social Credit members from Quebec, nor generally used for the federal caucus of that party; in both cases Créditiste, the French term, was used in English.\n* Members of the Senate are referred to by the title \"Senator\" preceding their name, as in the United States. Members of the Canadian House of Commons, following British parliamentary nomenclature, are termed \"Members of Parliament\", and are referred to as \"Jennifer Jones, MP\" during their term of office only. Senators, and members of the Privy Council are styled \"The Honourable\" for life, and the Prime Minister of Canada is styled \"The Right Honourable\" for life, as is the Chief Justice of the Supreme Court and the Governor General. This honorific may also be bestowed by Parliament, as it was to retiring deputy prime minister Herb Gray in 1996. Members of provincial legislatures do not have a pre-nominal style, except in certain provinces, such as Nova Scotia where members of the Queen's Executive Council of Nova Scotia are styled \"The Honourable\" for life, and are entitled to the use of the post-nominal letters \"ECNS\". The Cabinet of Ontario serves concurrently (and not for life) as the Executive Council of Ontario, while serving members are styled \"The Honourable\", but are not entitled to post-nominal letters.\n* Members of provincial/territorial legislative assemblies are called MLAs in all provinces and territories except: Ontario, where they have been called Members of Provincial Parliament (MPPs) since 1938; Quebec, where they have been called Members of the National Assembly (MNAs) since 1968; and Newfoundland and Labrador, where they are called Members of the House of Assembly (MHAs).\n\nLaw\n\nLawyers in all parts of Canada, except Quebec, which has its own civil law system, are called \"barristers and solicitors\" because any lawyer licensed in any of the common law provinces and territories must pass bar exams for, and is permitted to engage in, both types of legal practice in contrast to other common-law jurisdictions such as England, Wales and Ireland where the two are traditionally separated (i.e., Canada has a fused legal profession). The words lawyer and counsel (not counsellor) predominate in everyday contexts; the word attorney refers to any personal representative. Canadian lawyers generally do not refer to themselves as \"attorneys\", a term which is common in the United States.\n\nThe equivalent of an American district attorney, meaning the barrister representing the state in criminal proceedings, is called a crown attorney (in Ontario), crown counsel (in British Columbia), crown prosecutor or the crown, on account of Canada's status as a constitutional monarchy in which the Crown is the locus of state power.\n\nThe words advocate and notary – two distinct professions in Quebec civil law – are used to refer to that province's equivalent of barrister and solicitor, respectively. In Canada's common law provinces and territories, the word notary means strictly a notary public.\n\nWithin the Canadian legal community itself, the word solicitor is often used to refer to any Canadian lawyer in general (much like the way the word attorney is used in the United States to refer to any American lawyer in general). Despite the conceptual distinction between barrister and solicitor, Canadian court documents would contain a phrase such as \"John Smith, solicitor for the Plaintiff\" even though \"John Smith\" may well himself be the barrister who argues the case in court. In a letter introducing him/herself to an opposing lawyer, a Canadian lawyer normally writes something like \"I am the solicitor for Mr. Tom Jones.\"\n\nThe word litigator is also used by lawyers to refer to a fellow lawyer who specializes in lawsuits even though the more traditional word barrister is still employed to denote the same specialization.\n\nJudges of Canada's superior courts (which exist at the provincial and territorial levels) are traditionally addressed as \"My Lord\" or \"My Lady\", however there are some variances across certain jurisdictions, with some superior court judges preferring the titles \"Mister Justice\" or \"Madam Justice\" to \"Lordship\".\n\nMasters are addressed as \"Mr. Master\" or simply \"Sir.\" In British Columbia, masters are addressed as \"Your Honour.\"\n\nJudges of provincial or inferior courts are traditionally referred to in person as \"Your Honour\". Judges of the Supreme Court of Canada and of the federal-level courts prefer the use of \"Mister/Madam (Chief) Justice\". Justices of The Peace are addressed as \"Your Worship\". \"Your Honour\" is also the correct form of address for a Lieutenant Governor.\n\nA serious crime is called an indictable offence, while a less-serious crime is called a summary offence. The older words felony and misdemeanour, which are still used in the United States, are not used in Canada's current Criminal Code (R.S.C. 1985, c. C-46) or by today's Canadian legal system. As noted throughout the Criminal Code, a person accused of a crime is called the accused and not the defendant, a term used instead in civil lawsuits.\n\nIn Canada,  visible minority refers to a non-aboriginal person or group visibly not one of the majority race in a given population. The term comes from the Canadian Employment Equity Act, which defines such people as \"persons, other than Aboriginal people, who are non-Caucasian in race or non-white in colour.\"[http://www12.statcan.ca/english/census06/reference/reportsandguides/visible-minorities.cfm  Visible Minority Population and Population Group Reference Guide, 2006 Census] from StatsCan  The term is used as a demographic category by Statistics Canada.  The qualifier \"visible\" is used to distinguish such minorities from the \"invisible\" minorities determined by language (English vs. French) and  certain distinctions in religion (Catholics vs. Protestants).\n\nA county in British Columbia means only a regional jurisdiction of the courts and justice system and is not otherwise connected to governance as with counties in other provinces and in the United States. The rough equivalent to \"county\" as used elsewhere is a \"Regional District\".\n\nPlaces\n\nDistinctive Canadianisms are:\n* bachelor: bachelor apartment, an apartment all in a single room, with a small bathroom attached (\"They have a bachelor for rent\").Oxford Advanced Learner's Dictionary, \"bachelor\". The usual American term is studio. In Quebec, this is known as a one-and-a-half apartment; some Canadians, especially in Prince Edward Island, call it a loft.Boberg 2005.\n* camp: in Northern Ontario, it refers to what is called a cottage in the rest of Ontario and a cabin in the West.Boberg 2005, p. 38. It is also used, to a lesser extent, in New Brunswick, Nova Scotia, as well as in parts of New England. It generally refers to vacation houses in rural areas.\n* fire hall: fire station, firehouse.\n* height of land: a drainage divide. Originally American.Webster's New World College Dictionary, Wiley, 2004.\n* parkade: a parking garage, especially in the West.\n* washroom: the general term for what is normally named public toilet or lavatory in Britain. In the United States (where it originated) the word was mostly replaced by restroom in the 20th century. Generally used only as a technical or commercial term outside of Canada. The word bathroom is also used.\n* Indian reserve, rather than the U.S. term \"federal Indian reservation.\" Often shortened to reserve, especially when the meaning is clear from context; another slang variant of this term is the shortened res or rez.\n* rancherie: the residential area of a First Nation reserve, used in BC only.\n* quiggly hole and/or quiggly: the depression in the ground left by a kekuli or pithouse. Groups of them are called \"quiggly hole towns\". Used in the BC Interior only.\n* gas bar: a filling station (gas station) with a central island, having pumps under a fixed metal or concrete awning.\n* booze can: an after-hours establishment where alcohol is served, often illegally.\n* dépanneur, or the diminutive form dep, is often used by English speakers in Quebec. This is because convenience stores are called dépanneurs in Canadian French.\n* snye, a side-stream channel that rejoins a larger river, creating an island.\n\nDaily life\n\nTerms common in Canada, Britain and Ireland but less frequent or nonexistent in the United States are:\n* tin (as in tin of tuna), for can, especially among older speakers. Among younger speakers, can is more common, with tin referring to a can which is wider than it is tall as in \"a tin of sardines\" as opposed to a \"can of soup\".\n* cutlery, for silverware or flatware, where the material of which the utensil is made is not of consequence to the context in which it is used.\n* serviette, especially in Eastern Canada, for a paper table napkin.\n* tap, conspicuously more common than faucet in everyday usage.\n\nThe following are more or less distinctively Canadian:\n* ABM, bank machine: synonymous with ATM (which is also used).Oxford Advanced Learner's Dictionary, ABM; Boberg 2005.\n* BFI bin: Dumpster, after a prominent Canadian waste management company, BFI Canada (which was eventually bought out and became Progressive Waste Solutions) in provinces where that company does business; compare to other generic trademarks such as Kleenex, Xerox, and even Dumpster itself.\n* converter: Remote control. Likely derived from a popular line of cable converters manufactured by Phillips Canada in the early 1980s, which were early users of IR remote controls.\n* chesterfield: originally British and internationally used (as in classic furnishing terminology) to refer to a sofa whose arms are the same height as the back, it is a term for any couch or sofa in Canada (and, to some extent, Northern California).[http://www.oup.com/oald-bin/web_getald7index1a.pl OUP.com]  Once a hallmark of CanE, chesterfield as with settee and davenport, is now largely in decline among younger generations in the western and central regions.[http://www.chass.utoronto.ca/~chambers/couch.html Utoronto.ca] J.K. Chambers, \"The Canada-U.S. border as a vanishing isogloss: the evidence of chesterfield.\" Journal of English Linguistics 23 (1995): 156-66. Couch is now the most common term; sofa is also used.\n* dart: cigarette, used primarily by adolescents and young adults.\n* dressing gown or housecoat: in the United States, called a bathrobe.\n* eavestrough: rain gutter. Also used, especially in the past, in the Northern and Western United States; the first recorded usage is in Herman Melville's Moby-Dick: \"The tails tapering down that way, serve to carry off the water, d'ye see. Same with cocked hats; the cocks form gable-end eave-troughs , Flask.\"Oxford Advanced Learner's Dictionary, eavestrough; Oxford English Dictionary; American Heritage Dictionary.\n* flush: toilet, used primarily by older speakers throughout the Maritimes.\n* garburator: (rhymes with carburetor) a garbage disposal.According to the Canadian Oxford Dictionary (second edition), garburator is \"Canadian\" and garbage disposal is \"North American.\"\n* homogenized milk or homo milk: milk containing 3.25% milk fat, typically called \"whole milk\" in the United States.\n* hydro: a common synonym for electrical service, used primarily in New Brunswick, Quebec, Ontario, Manitoba and British Columbia. Most of the power in these provinces is hydroelectricity, and suppliers' company names incorporate the term \"Hydro\". Usage: \"I didn't pay my hydro bill so they shut off my lights.\" Hence hydrofield, a line of electricity transmission towers, usually in groups cutting across a city, and hydro lines/poles, electrical transmission lines/poles.Oxford Advanced Learner's Dictionary, hydro. These usages of hydro are also standard in the Australian state of Tasmania. Also in slang usage can refer to hydroponically grown marijuana.\n* loonie: the Canadian one-dollar coin; derived from the use of the common loon on the reverse. The toonie (less commonly spelled tooney, twooney, twoonie) is the two-dollar coin. Loonie is also used to refer to the Canadian currency, particularly when discussing the exchange rate with the U.S. dollar; \"loonie\" and \"toonie\" describe coinage specifically. (for example, I have a dollar in pennies versus \"I have three loonies in my pocket\").\n* pencil crayon: coloured pencil.\n* pogie or pogey: term referring to unemployment insurance, which is now officially called Employment Insurance in Canada. Derived from the use of pogey as a term for a poorhouse. Not used for welfare, in which case the term is \"the dole\", as in \"he's on the dole, eh?\".\n\nApparel\n\nThe following are common in Canada, but not in the United States or the United Kingdom.\n* runners:Oxford Advanced Learner's Dictionary, runner. running shoes, especially in Western Canada.American Speech 80.1 (2005). Also used in Australian EnglishCambridge Advanced Learner's Dictionary. and Irish English.[http://www.irishtimes.com/newspaper/health/2009/0106/1230936690382.html Sometimes the gym doesn't fix it], The Irish Times, Tuesday, January 06, 2009[http://www.irishtimes.com/newspaper/magazine/2008/0322/1206024702849.html?via=me Machismo . . . or masochism?], The Irish Times – Saturday March 22, 2008[http://www.irishtimes.com/newspaper/health/2008/1007/1222959451495.html Stars in the running], The Irish Times, Tuesday October 7, 2008 Atlantic Canada prefers sneakers while central Canada (including Quebec and Ontario) prefers \"running shoes\".American Speech 80.1 (2005), p. 36.\n* tuque (also spelled toque or touque): a knitted winter hat. A similar hat would be called a beanie in the western United States and a watch cap in the eastern United States, though these forms are generally closer-fitting, and may lack a brim as well as a pompom. There seems to be no exact equivalent outside Canada, since the tuque is of French Canadian origin.\n* bunnyhug: a hooded sweatshirt, with or without a zipper. Used mainly in Saskatchewan.\n\nFood and beverage\n\n* Most Canadians as well as Americans in the Northwest, North Central, Prairie and Inland North prefer pop over soda to refer to a carbonated beverage (though neither term is dominant in British English). Soft drink is also extremely common throughout Canada.\n* What Americans call Canadian bacon is named back bacon in Canada, or, if it is coated in cornmeal or ground peas, cornmeal bacon or peameal bacon.\n* What most Americans call a candy bar is usually known as a chocolate bar (as in the United Kingdom). In certain areas surrounding the Bay of Fundy, it is sometimes known as a nut bar; however, this use is more popular amongst older generations.  Legally only bars made of solid chocolate may be labelled chocolate bars, others must be labelled as candy bars.\n* Even though the terms French fries and fries are used by Canadians, some speakers use the word chips (and its diminutive, chippies) (chips is always used when referring to fish and chips, as elsewhere).\n* whole-wheat bread is often referred to as brown bread, as in \"Would you like white or brown bread for your toast?\"\n* An expiry date is the term used for the date when a perishable product will go bad (similar to the UK Use By date). The term expiration date is more common in the United States (where expiry date is seen mostly on the packaging of Asian food products). The term Best Before also sees common use, where although not spoiled, the product may not taste \"as good\".\n* double-double: a cup of coffee with two measures of cream and two of sugar, most commonly associated with the Tim Hortons chain of coffee shops.\n* Canadianisms relating to alcohol:\n** mickey: a 375 mL bottle of hard liquor (informally called a pint in the Maritimes and the United States). In Newfoundland, this is almost exclusively referred to as a \"flask\". In the United States, \"mickey\", or \"Mickey Finn\", refers to a drink laced with drugs.\n** two-six, twenty-sixer, twixer: a 750 mL bottle of hard liquor (called a quart in the Maritimes). The word handle is less common. Similarly, a  bottle of hard liquor is known as a forty and a  bottle is known as a sixty or half gallon in Nova Scotia.\n** Texas mickey (especially in Saskatchewan, New Brunswick and Nova Scotia; more often a \"Saskatchewan mickey\" in western Canada): a 3 L bottle of hard liquor. (Despite the name, Texas mickeys are generally unavailable outside of Canada.)\n** two-four: a case of 24 beers, also known as a case in Eastern Canada, or a flat in Western Canada (referencing that cans of beer are often sold in packages of six, with four packages to a flat box for shipping and stacking purposes).\n** six-pack, half-sack, half-case, or poverty-pack: a case of six beers\n* poutine: a snack of french fries topped with cheese curds and hot gravy.\n* There are also genericized trademarks used in Canada:\n** cheezies: cheese puffs. The name is a genericized trademark based on a brand of crunchy cheese snack sold in Canada.\n**Kraft Dinner or \"KD\": for any packaged dry macaroni and cheese mix, even when it is not produced by Kraft.\n* freezie: A frozen flavoured sugar water snack common worldwide, but known by this name exclusively in Canada.\n* dainty: a fancy cookie, pastry, or square served at a social event (usually plural). Used in western Canada.\n* Smarties: a bean-sized, small candy covered chocolate, similar to plain M&M's. This is also seen in British English. Smarties in the United States refer to small tart powdered disc sold in rolls; in Canada these tart candies are sold as \"Rockets\".\n\nPrairies (Manitoba, Saskatchewan and Alberta)\n\nA strong Canadian raising exists in the prairie regions together with certain older usages such as chesterfield and front room also associated with the Maritimes. Aboriginal Canadians are a larger and more conspicuous population in prairie cities than elsewhere in the country and certain elements of aboriginal speech in English are sometimes to be heard. Similarly, the linguistic legacy, mostly intonation but also speech patterns and syntax, of the Scandinavian, Slavic and German settlers – who are far more numerous and historically important in the Prairies than in Ontario or the Maritimes – can be heard in the general milieu. Again, the large Métis population in Saskatchewan and Manitoba also carries with it certain linguistic traits inherited from French, Aboriginal and Celtic forebears.\nSome terms are derived from immigrant groups or are just local inventions:\n* bluff: small group of trees isolated by prairie\n* bunny hug: elsewhere hoodie or hooded sweat shirt (mainly in Saskatchewan, but also in Manitoba)\n* ginch/gonch/gitch/gotch: underwear (usually men's or boys' underwear, more specifically briefs; whereas women's underwear are gotchies), probably of Eastern European or Ukrainian origin. Gitch and gotch are primarily used in Saskatchewan and Manitoba while the variants with an n are common in Alberta and British Columbia.[http://www.doubletongued.org/index.php/dictionary/gonch/ Doubletongued.org], reference for gonch.\n* jam buster: jelly-filled doughnut.\n* porch climber: moonshine or homemade alcohol. Porch climber has a slightly distinguished meaning in Ontario where it refers to a beverage mixed of beer, vodka, and lemonade.\n* slough: pond – usually a pond on a farm\n* Vi-Co: occasionally used in Saskatchewan instead of chocolate milk. Formerly a brand of chocolate milk.\n\nIn farming communities with substantial Ukrainian, German or Mennonite populations, accents, sentence structure and vocabulary influenced by these languages is common. These communities are most common in the Saskatchewan Valley region of Saskatchewan and Red River Valley region of Manitoba.\n\nBritish Columbia\n\nBritish Columbian English has several words still in current use borrowed from the Chinook Jargon although the use of such vocabulary is observably decreasing. The most famous and widely used of these terms are skookum and saltchuck. However, among young British Columbians, almost no one uses this vocabulary, and only a small percentage is even familiar with the meaning of such words. In the Yukon, cheechako is used for newcomers or greenhorns.\n\nNorthern Ontario\n\nNorthern Ontario English has several distinct qualities stemming from its large Franco-Ontarian population. As a result several French and English words are used interchangeably. A number of phrases and expressions may also be found in Northern Ontario that are not present in the rest of the province, such as the use of camp for a summer home where Southern Ontario speakers would idiomatically use cottage.\n\nInformal speech\n\nA rubber in the U.S. and Canada is slang for a condom; however, in Canada it is sometimes (rarely except for Newfoundland and South Western Ontario) another term for an eraser (as it is in the United Kingdom and Ireland).\n\nThe word bum can refer either to the buttocks (as in Britain), or, derogatorily, to a homeless person (as in the U.S.). However, the \"buttocks\" sense does not have the indecent character it retains in British use, as it and \"butt\" are commonly used as a polite or childish euphemism for ruder words such as arse (commonly used in Atlantic Canada and among older people in Ontario and to the west) or ass, or mitiss (used in the Prairie Provinces, especially in northern and central Saskatchewan; probably originally a Cree loanword). Older Canadians may see \"bum\" as more polite than \"butt\", which before the 1980s was often considered rude.\n\nSimilarly the word pissed can refer either to being drunk (as in Britain), or being angry (as in the U.S.), though anger is more often said as pissed off, while piss drunk or pissed up is said to describe inebriation (though piss drunk is sometimes also used in the US, especially in the northern states).\n\nOne of the most distinctive Canadian phrases is the spoken interrogation or tag eh. The only usage of eh exclusive to Canada, according to the Canadian Oxford Dictionary, is for \"ascertaining the comprehension, continued interest, agreement, etc., of the person or persons addressed\" as in, \"It's four kilometres away, eh, so I have to go by bike.\" In that case, eh? is used to confirm the attention of the listener and to invite a supportive noise such as mm or oh or okay. This usage is also common in Queensland, Australia and New Zealand. Other uses of eh – for instance, in place of huh? or what? meaning \"please repeat or say again\" – are also found in parts of the British Isles and Australia. It is common in Northern/Central Ontario, the Maritimes and the Prairie provinces. The word eh is used quite frequently in the North Central dialect, so a Canadian accent is often perceived in people from North Dakota, Michigan, Minnesota, and Wisconsin.\n\nThe term Canuck simply means Canadian in its demonymic form, and, as a term used even by Canadians themselves, it is not considered derogatory. In the 19th century and early 20th century it tended to refer to French-Canadians, while the only Canadian-built version of the popular World War I-era American Curtiss JN-4 Jenny training biplane aircraft, the JN-4C, got the \"Canuck\" nickname, 1,260 of which were built. The nickname Janey Canuck was used by Anglophone women's rights writer Emily Murphy in the 1920s and the Johnny Canuck comic book character of the 1940s. Throughout the 1970s, Canada's winning World Cup men's downhill ski team was called the \"Crazy Canucks\" for their fearlessness on the slopes. It is also the name of the Vancouver Canucks, the National Hockey League team of Vancouver, British Columbia.\n\nThe term hoser, popularized by Bob & Doug McKenzie, typically refers to an uncouth, beer-swilling male and is a euphemism for \"loser\" coming from the earlier days of hockey played on an outdoor rink and the losing team would have to hose down the ice after the game so it refreezes smooth. Bob & Doug also popularized the use of Beauty, eh, another western slang term which may be used in variety of ways. This describes something as being of interest, of note, signals approval or simply draws attention to it. \n\nA Newf or Newfie is someone from Newfoundland and Labrador; sometimes considered derogatory. In Newfoundland, the term Mainlander refers to any Canadian (sometimes American, occasionally Labradorian) not from the island of Newfoundland. Mainlander is also occasionally used derogatorily.\n\nIn the Maritimes, a Caper or \"Cape Bretoner\" is someone from Cape Breton Island, a Bluenoser is someone with a thick, usually southern Nova Scotia accent or as a general term for a Nova Scotian (Including Cape Bretoners), while an Islander is someone from Prince Edward Island (the same term is used in British Columbia for people from Vancouver Island, or the numerous islands along it). A Haligonian refers to someone from the city of Halifax.\n\nOther Canadianisms\n\n* The alphanumeric code appended to mail addresses (the equivalent of the similar British postcode and the numeric-only American ZIP code) is called a postal code.\n* The term First Nations is often used in Canada to refer to what are called American Indians or Native Americans in the United States. This term does  include the Métis and Inuit, however; the term aboriginal peoples (and sometimes spelled with a capital \"A\": \"Aboriginal peoples\") is preferred when all three groups are included. The term Eskimo has been replaced by the term Inuit in the past few decades. It is now considered offensive to use the term Eskimo, but is still used commonly (without pejorative intent) by those born in the early-mid-20th century.\n* \"Going camping\" still refers to staying in a tent in a campground or wilderness area, while \"going out to camp\" may refer to a summer cottage or home in a rural area. \"Going to camp\" refers to children's summer camps. In British Columbia, \"camp\" was used as a reference for certain company towns (for example, Bridge River). It is used in western Canada to refer to logging and mining camps such as Juskatla Camp. It is also a synonym for a mining district; the latter occurs in names such as Camp McKinney and usages such as \"Cariboo gold camp\" and \"Slocan mining camp\" for the Cariboo goldfields and Slocan silver-galena mining district, respectively. A \"cottage\" in British Columbia is generally a small house, perhaps with an English design or flavour, while in southern Ontario it more likely means a second home on a lake. Similarly, \"chalet\" – originally a term for a small warming hut – can mean a second home of any size, but refers to one located in a ski resort. In Northern Ontario, these second homes tend to be called \"camps\".  In Western Canada, these second homes tend to be called \"cabins\".  A \"bunkie\" is a secondary building at these second homes that are small enough to require no building permits and house extra guests visiting.\n* A stagette is a female bachelorette party (US) or hen party (UK).\n* A \"shag\" is thought, erroneously, to be derived from \"shower\" and \"stag\", and describes a dance where alcohol, entry tickets, raffle tickets, and so on, are sold to raise money for the engaged couple's wedding. Normally a Northwest Ontario, Northern Ontario and sometimes Manitoba term, a \"stag and doe\" or \"buck and doe\" is used elsewhere in Ontario. The more common term for this type of event in Manitoba is a \"social\".\n* The humidex is a measurement used by meteorologists to reflect the combined effect of heat and humidity (vs. US term heat index quantifying the apparent temperature).\n* The States: Commonly used to refer to the United States or almost as often the U.S., much less often U.S.A. or America which are commonly used in other countries, the latter more often used in other English-speaking nations.\n* Drop the gloves: to begin a fight. A reference to a practice in hockey of removing gloves prior to fighting, and the idiom \"throw down the gauntlet\".\n* Back east typically means 'Ontario or possibly Quebec' whereas Down East instead refers to the Maritimes\n\nAttitudes towards Canadian English\n\nIn 2011, just under 21.5 million Canadians, representing 65% of the population, spoke English most of the time at home, while 58% declared it their mother language. English is the major language everywhere in Canada except Quebec, and most Canadians (85%) can speak English. While English is not the preferred language in Quebec, 36.1% of Québécois can speak English. Nationally, Francophones are five times more likely to speak English than Anglophones are to speak French – 44% and 9% respectively.Marmen, Louise and Corbeil, Jean-Pierre, \"New Canadian Perspectives, Languages in Canada 2001 Census,\" Library and Archives Canada Cataloguing in Publication, Statistics Canada Cat. No. Ch3-2/8-2004, (Canadian Heritage, 2004), pg. 60. Only 3.2% of Canada's English-speaking population resides in Quebec—mostly in Montreal.\n\nMore Canadians know how to speak English than speak it at home.\n\nAttitude studies on Canadian English are somewhat rare. A perceptual study on Albertan and Ontarians existsMcKinnie, Meghan and Jennifer Dailey-O’Cain. 2002. A perceptual dialectology of Anglophone Canada from the perspective of young Albertans and Ontarians. In Handbook of Perceptual Dialectology. Vol. 2, ed. by Daniel Long, 277-94. Amsterdam: Benjamins. in combination with older literature from the 1970/80s. Sporadic reports can be found in the literature, e.g. on Vancouver English, in which more than 80% believe in a \"Canadian way of speaking\", with those with a university education reporting higher than those without. Canadian English. http://en.wikipedia.org/?curid=6340."
  }
}
