{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14361",
  "eid" : "141077c0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778542908,
  "textBody" : "Honey is a sweet, viscous food substance produced by bees and some related insects. Bees produce honey from the sugary secretions of plants (floral nectar) or other insects (aphid honeydew) through regurgitation, enzymatic activity, and water evaporation. Honey is stored in wax structures called honeycombs. The variety of honey produced by honey bees (the genus Apis) is the best-known, due to its worldwide commercial production and human consumption. Honey is collected from wild bee colonies, or from hives of domesticated bees, a practice known as beekeeping.\n\nHoney gets its sweetness from the monosaccharides fructose and glucose, and has about the same relative sweetness as granulated sugar.National Honey Board. [http://www.honey.com/images/downloads/carb.pdf \"Carbohydrates and the Sweetness of Honey\"]. Last accessed 1 June 2012.Oregon State University [https://web.archive.org/web/20121101092211/http://food.oregonstate.edu/learn/faq/faq_sugar53.html \"What is the relative sweetness of different sugars and sugar substitutes?\"]. Retrieved 1 June 2012. It has attractive chemical properties for baking and a distinctive flavor when used as a sweetener. Most microorganisms do not grow in honey, so sealed honey does not spoil, even after thousands of years.\n\nHoney provides 64 calories in a serving of one tablespoon (15 ml) equivalent to 1272 kJ per 100 g. Honey is generally safe, but may have various, potentially adverse effects or interactions upon excessive consumption, existing disease conditions, or use of prescription drugs.\n\nHoney use and production have a long and varied history as an ancient activity, depicted in Valencia, Spain, by a cave painting of humans foraging for honey at least 8,000 years ago.\n\nFormation\n\nHoney is produced by bees collecting nectar for use as sugars consumed to support metabolism of muscle activity during foraging or to be stored as a long-term food supply. During foraging, bees access part of the nectar collected to support metabolic activity of flight muscles, with the majority of collected nectar destined for regurgitation, digestion, and storage as honey. In cold weather or when other food sources are scarce, adult and larval bees use stored honey as food. National Honey Board\n\nBy contriving for bee swarms to nest in human-made hives, people have been able to semidomesticate the insects and harvest excess honey. In the hive or in a wild nest, the three types of bees are:\n* a single female queen bee\n* a seasonally variable number of male drone bees to fertilize new queens\n* 20,000 to 40,000 female worker bees\n\nLeaving the hive, foraging bees collect sugar-rich flower nectar and return to the hive where they use their \"honey stomachs\" to ingest and regurgitate the nectar repeatedly until it is partially digested. Bee digestive enzymes – invertase, amylase, and diastase – along with gastric acid hydrolyze sucrose to a mixture of glucose and fructose. The bees work together as a group with the regurgitation and digestion for as long as 20 minutes until the product reaches storage quality. It is then placed in honeycomb cells left unsealed while still high in water content (about 20%) and natural yeasts, which, unchecked, would cause the sugars in the newly formed honey to ferment. The process continues as hive bees flutter their wings constantly to circulate air and evaporate water from the honey to a content around 18%, raising the sugar concentration, and preventing fermentation. The bees then cap the cells with wax to seal them. As removed from the hive by a beekeeper, honey has a long shelf life and will not ferment if properly sealed.\n\nAnother source of honey is from a number of wasp species, such as the wasps Brachygastra lecheguana and Brachygastra mellifica, which are found in South and Central America. These species are known to feed on nectar and produce honey.\n\nSome wasps, such as the Polistes versicolor, even consume honey themselves, switching from feeding on pollen in the middle of their lifecycles to feeding on honey, which can better provide for their energy needs.\n\nProduction\n\nCollection\n\nHoney is collected from wild bee colonies, or from domesticated beehives. The honey is stored in honeycombs.  Wild bee nests are sometimes located by following a honeyguide bird.  The bees may first be pacified by using smoke from a bee smoker.  The smoke triggers a feeding instinct (an attempt to save the resources of the hive from a possible fire), making them less aggressive and the smoke obscures the pheromones the bees use to communicate.\n\nThe honeycomb is removed from the hive and the honey may be extracted from that, either by crushing or by using a honey extractor. The honey is then usually filtered to remove beeswax and other debris.\n\nBefore the invention of removable frames, bee colonies were often sacrificed to conduct the harvest.  The harvester would take all the available honey and replace the entire colony the next spring.  Since the invention of removable frames, the principles of husbandry lead most beekeepers to ensure that their bees  have enough stores to survive the winter, either by leaving some honey in the beehive or by providing the colony with a honey substitute such as sugar water or crystalline sugar (often in the form of a \"candyboard\").  The amount of food necessary to survive the winter depends on the variety of bees and on the length and severity of local winters.\n\nA wide range of species other than humans are attracted to wild or domestic sources of honey.\n\nPreservation\n\nBecause of its unique composition and chemical properties, honey is suitable for long-term storage, and is easily assimilated even after long preservation. Honey, and objects immersed in honey, have been preserved for centuries.\"[https://books.google.com/books?idi0hNLjVL49oC&pg\nPA83 The History of the Origin and Development of Museums]\". Dr. M. A. Hagen. The American naturalist, Volume 10. 1876.1894. [https://books.google.com/books?id=ZuYqAAAAYAAJ The Mummy: A Handbook of Egyptian Funerary Archaeology]. 2nd ed. Cambridge: Cambridge University Press. (Reprinted New York: Dover Publications, 1989) The key to preservation is limiting access to humidity. In its cured state, honey has a sufficiently high sugar content to inhibit fermentation. If exposed to moist air, its hydrophilic properties pull moisture into the honey, eventually diluting it to the point that fermentation can begin.\n\nLong shelf life of honey is attributed to an enzyme found in the stomach of bees. The bees mix Glucose oxidase with expelled nectar they previously consumed, which then creates two by-products: gluconic acid and hydrogen peroxide, responsible for honey's acidity and ability to suppress bacterial growth.\n\nAdulteration \n\nAdulteration of honey is the addition of other sugars, syrups, or compounds into honey to change its flavor or viscosity, make it cheaper to produce, or increase the fructose content to stave off crystallization. According to the Codex Alimentarius of the United Nations, any product labeled as honey or pure honey must be a wholly natural product, although different nations have their own laws concerning labeling. Adulteration of honey is sometimes used as a method of deception when buyers are led to believe that the honey is pure. The practice was common dating back to ancient times, when crystallized honey was often mixed with flour or other fillers, hiding the adulteration from buyers until the honey was liquefied. In modern times, the most common adulteration-ingredient became clear, almost-flavorless corn syrup, which, when mixed with honey, is often very difficult to distinguish from unadulterated honey.The Hive: The Story of the Honeybee and Us By Bee Wilson --St. Martins Press 2004 Page 167\n\nIsotope ratio mass spectrometry can be used to detect addition of corn syrup and cane sugar by the carbon isotopic signature. Addition of sugars originating from corn or sugar cane (C4 plants, unlike the plants used by bees, and also sugar beet, which are predominantly C3 plants) skews the isotopic ratio of sugars present in honey, but does not influence the isotopic ratio of proteins. In an unadulterated honey, the carbon isotopic ratios of sugars and proteins should match. Levels as low as 7% of addition can be detected.\n\nIn the United States, according to the National Honey Board (a USDA-overseen organization), \"honey stipulates a pure product that does not allow for the addition of any other substance... this includes, but is not limited to, water or other sweeteners\".[https://www.bjcp.org/mead/honeydefs.pdfCategory: Definition of honey and honey products]. (PDF). Retrieved on 7 January 2018.\n\nWorldwide production\n\n \n\nIn 2014, 1.5 million tonnes of honey were produced worldwide, with China alone accounting for 31% of the world total (table). The next four largest producers – Turkey, United States, Ukraine, and Russia – accounted collectively for 22% of the world total.\n\nModern uses\n\nFood\n\nOver its history as a food, the main uses of honey are in cooking, baking, desserts, such as mel i mató, as a spread on bread, as an addition to various beverages, such as tea, and as a sweetener in some commercial beverages. Honey barbecue and honey mustard are other common flavors used in sauces.\n\nFermentation\n\nPossibly the world's oldest fermented beverage dating to 9,000 years agoPatrick E. McGovern, Juzhong Zhang, Jigen Tang, Zhiqing Zhang, Gretchen R. Hall, Robert A. Moreau, Alberto Nuñez, Eric D. Butrym, Michael P. Richards, Chen-shan Wang, Guangsheng Cheng, Zhijun Zhao and Changsui Wang\nPNAS 2004 December, 101 (51) 17593-17598. \"Fermented beverages of pre- and proto-historic China\" http://www.pnas.org/content/101/51/17593; Chemical analyses of ancient organics absorbed into pottery jars from the early Neolithic village of Jiahu in Henan province in China have revealed that a mixed fermented beverage of rice, honey, and fruit (hawthorn fruit and/or grape) was being produced as early as the seventh millennium before Christ (B.C.)., mead (\"honey wine\") is the alcoholic product made by adding yeast to the honey–water must, followed by weeks or months of fermentation. In modern mead production, the yeast, Saccharomyces cerevisiae, is commonly used.\n\nPrimary fermentation usually takes 2856 days, after which the must is placed in a secondary fermentation vessel for 6–9 months of aging. Durations of primary and secondary fermentation producing satisfactory mead may vary considerably according to numerous factors, such as floral origin of the honey and its natural sugar and microorganism contents, must water percentage, pH, additives used, and strain of yeast, among others. Although supplementation of the must with nitrogen, salt or vitamins has been tested to improve mead qualities, there is no evidence that adding nutrients reduced fermentation time or improved quality. Cell immobilization methods, however, proved effective for enhancing mead quality.\n\nMead varieties include drinks called metheglin (with spices or herbs), melomel (with fruit juices, such as grape, specifically called pyment), hippocras (with cinnamon), and sack mead (high concentration of honey), many of which have been developed as commercial products numbering in the hundreds in the United States as of 2014. Honey is also used to make mead beer, called \"braggot\".\n\nPhysical and chemical properties\n\nThe physical properties of honey vary, depending on water content, the type of flora used to produce it (pasturage), temperature, and the proportion of the specific sugars it contains. Fresh honey is a supersaturated liquid, containing more sugar than the water can typically dissolve at ambient temperatures. At room temperature, honey is a supercooled liquid, in which the glucose will precipitate into solid granules. This forms a semisolid solution of precipitated glucose crystals in a solution of fructose and other ingredients.\n\nAt the temperature of 20 °C, density of honey typically ranges between 1.38 and 1.45 kg/l.\n\nPhase transitions\n\nThe melting point of crystallized honey is between 40 and, depending on its composition. Below this temperature, honey can be either in a metastable state, meaning that it will not crystallize until a seed crystal is added, or, more often, it is in a \"labile\" state, being saturated with enough sugars to crystallize spontaneously.Root, p. 355 The rate of crystallization is affected by many factors, but the primary factor is the ratio of the main sugars: fructose to glucose. Honeys that are supersaturated with a very high percentage of glucose, such as brassica honey,  crystallize almost immediately after harvesting, while honeys with a low percentage of glucose, such as chestnut or tupelo honey, do not crystallize. Some types of honey may produce very large but few crystals, while others produce many small crystals.Tomasik, Piotr (2004) Chemical and functional properties of food saccharides, CRC Press, p. 74, \n\nCrystallization is also affected by water content, because a high percentage of water inhibits crystallization, as does a high dextrin content. Temperature also affects the rate of crystallization, with the fastest growth occurring between 13 and. Crystal nuclei (seeds) tend to form more readily if the honey is disturbed, by stirring, shaking, or agitating, rather than if left at rest. However, the nucleation of microscopic seed-crystals is greatest between 5 and. Therefore, larger but fewer crystals tend to form at higher temperatures, while smaller but more-numerous crystals usually form at lower temperatures. Below 5 °C, the honey will not crystallize, thus the original texture and flavor can be preserved indefinitely.\n\nSince honey normally exists below its melting point, it is a supercooled liquid. At very low temperatures, honey does not freeze solid. Instead, as the temperatures become lower, the viscosity of honey increases. Like most viscous liquids, the honey  becomes thick and sluggish with decreasing temperature. At , honey may appear or even feel solid, but it continues to flow at very low rates. Honey has a glass transition between . Below this temperature, honey enters a glassy state and  becomes an amorphous solid (noncrystalline).\n\nViscosity\n\nThe viscosity of honey is affected greatly by both temperature and water content. The higher the water percentage, the more easily honey flows. Above its melting point, however, water has little effect on viscosity. Aside from water content, the composition of honey also has little effect on viscosity, with the exception of a few types. At 25 C, honey with 14% water content generally has a viscosity around 400 poise, while a honey containing 20% water has a viscosity around 20 poise. Viscosity increase due to temperature occurs very slowly at first. A honey containing 16% water, at 70 C, has a viscosity around 2 poise, while at 30 C, the viscosity is around 70 poise. As cooling progresses, honey becomes more viscous at an increasingly rapid rate, reaching 600 poise around 14 C. However, while honey is very viscous, it has rather low surface tension.\n\nA few types of honey have unusual viscous properties. Honeys from heather or manuka display thixotropic properties. These types of honey enter a gel-like state when motionless, but then liquify when stirred.Krell, pp. 5–6\n\nElectrical and optical properties\n\nBecause honey contains electrolytes, in the form of acids and minerals, it exhibits varying degrees of electrical conductivity. Measurements of the electrical conductivity are used to determine the quality of honey in terms of ash content.\n\nThe effect honey has on light is useful for determining the type and quality. Variations in the water content alter the refractive index of honey. Water content can easily be measured with a refractometer. Typically, the refractive index for honey ranges from 1.504 at 13% water content to 1.474 at 25%. Honey also has an effect on polarized light, in that it rotates the polarization plane. The fructose gives a negative rotation, while the glucose gives a positive one. The overall rotation can be used to measure the ratio of the mixture.Root, p. 348 Honey may vary in color between pale yellow and dark brown, but other bright colors may occasionally be found, depending on the source of the sugar harvested by the bees.\n\nHygroscopy and fermentation\n\nHoney has the ability to absorb moisture directly from the air, a phenomenon called hygroscopy. The amount of water the honey absorbs is dependent on the relative humidity of the air. Because honey contains yeast, this hygroscopic nature requires that honey be stored in sealed containers to prevent fermentation, which usually begins if the honey's water content rises much above 25%. Honey tends to absorb more water in this manner than the individual sugars allow on their own, which may be due to other ingredients it contains.\n\nFermentation of honey usually occurs after crystallization, because without the glucose, the liquid portion of the honey primarily consists of a concentrated mixture of fructose, acids, and water, providing the yeast with enough of an increase in the water percentage for growth. Honey that is to be stored at room temperature for long periods of time is often pasteurized, to kill any yeast, by heating it above 70 C.\n\nThermal characteristics\n\nLike all sugar compounds, honey caramelizes if heated sufficiently, becoming darker in color, and eventually burns. However, honey contains fructose, which caramelizes at lower temperatures than glucose.Hans-Dieter Belitz, Werner Grosch, Peter Schieberle [https://books.google.com/books?idxteiARU46SQC&printsec\nfrontcover Food chemistry] Springer Verlag, Berlin-Heidelberg 2004 p. 884  The temperature at which caramelization begins varies, depending on the composition, but is typically between 70 and. Honey also contains acids, which act as catalysts for caramelization. The specific types of acids and their amounts play a primary role in determining the exact temperature.Zdzisław E. Sikorski Chemical and functional properties of food components CRC Press 2007 p. 121  Of these acids, the amino acids, which occur in very small amounts, play an important role in the darkening of honey. The amino acids form darkened compounds called melanoidins, during a Maillard reaction. The Maillard reaction occurs slowly at room temperature, taking from a few to several months to show visible darkening, but speeds up dramatically with increasing temperatures. However, the reaction can also be slowed by storing the honey at colder temperatures.Root, p. 350\n\nUnlike many other liquids, honey has very poor thermal conductivity, taking a long time to reach thermal equilibrium. Melting crystallized honey can easily result in localized caramelization if the heat source is too hot, or if it is not evenly distributed. However, honey takes substantially longer to liquify when just above the melting point than at elevated temperatures. Melting 20 kg of crystallized honey, at 40 C, can take up to 24 hours, while 50 kg may take twice as long. These times can be cut nearly in half by heating at 50 C. However, many of the minor substances in honey can be affected greatly by heating, changing the flavor, aroma, or other properties, so heating is usually done at the lowest temperature possible for the shortest amount of time.Krell, pp. 40–43\n\nAcid content and flavor effects\n\nThe average pH of honey is 3.9, but can range from 3.4 to 6.1. Honey contains many kinds of acids, both organic and amino. However, the different types and their amounts vary considerably, depending on the type of honey. These acids may be aromatic or aliphatic (nonaromatic). The aliphatic acids contribute greatly to the flavor of honey by interacting with the flavors of other ingredients.\n\nOrganic acids comprise most of the acids in honey, accounting for 0.17–1.17% of the mixture, with gluconic acid formed by the actions of an enzyme called glucose oxidase as the most prevalent. Other organic acids are minor, consisting of formic, acetic, butyric, citric, lactic, malic, pyroglutamic, propionic, valeric, capronic, palmitic, and succinic, among many others.\n\nClassification\n\nHoney is classified by its floral source, and divisions are made according to the packaging and processing used. Also, regional honeys are identified. In the USA, honey is also graded on its color and optical density by USDA standards, graded on the Pfund scale, which ranges from 0 for \"water white\" honey to more than 114 for \"dark amber\" honey.[http://www.fao.org/docrep/w0076E/w0076e04.htm Value-added products from beekeeping. Chapter 2]. Fao.org. Retrieved on 14 April 2011.\n\nFloral source\n\nGenerally, honey is classified by the floral source of the nectar from which it was made. Honeys can be from specific types of flower nectars or can be blended after collection. The pollen in honey is traceable to floral source and therefore region of origin. The rheological and melissopalynological properties of honey can be used to identify the major plant nectar source used in its production.\n\nBlended\n\nMost commercially available honey is blended, meaning it is a mixture of two or more honeys differing in floral source, color, flavor, density, or geographic origin.\n\nPolyfloral\n\nPolyfloral honey, also known as wildflower honey, is derived from the nectar of many types of flowers.\n\nThe taste may vary from year to year, and the aroma and the flavor can be more or less intense, depending on which bloomings are prevalent.[http://www.mieliditalia.it/colori/inglese/m20/m20.htm Mountain Wildflower Honey]. Mieliditalia.it. Retrieved on 6 February 2011.\n\nMonofloral\n\nMonofloral honey is made primarily from the nectar of one type of flower. Different monofloral honeys have a distinctive flavor and color because of differences between their principal nectar sources.[http://www.mieliditalia.it/colori/inglese/home.htm The Colours Of Honey]. Mieliditalia.it. Retrieved on 6 February 2011. To produce monofloral honey, beekeepers keep beehives in an area where the bees have access to only one type of flower. In practice, because of the difficulties in containing bees, a small proportion of any honey will be from additional nectar from other flower types. Typical examples of North American monofloral honeys are clover, orange blossom, blueberry, sage, tupelo, buckwheat, fireweed, mesquite, and sourwood. Some typical European examples include thyme, thistle, heather, acacia, dandelion, sunflower, lavender, honeysuckle, and varieties from lime and chestnut trees. In North Africa (e.g. Egypt), examples include clover, cotton, and citrus (mainly orange blossoms). The unique flora of Australia yields a number of distinctive honeys, with some of the most popular being yellow box, blue gum, ironbark, bush mallee, Tasmanian leatherwood, and macadamia.\n\nHoneydew honey\n\nInstead of taking nectar, bees can take honeydew, the sweet secretions of aphids or other plant sap-sucking insects. Honeydew honey is very dark brown in color, with a rich fragrance of stewed fruit or fig jam, and is not as sweet as nectar honeys. Germany's Black Forest is a well known source of honeydew-based honeys, as well as some regions in Bulgaria, Tara (mountain) in Serbia, and Northern California in the United States. In Greece, pine honey (a type of honeydew honey) constitutes 60–65% of the annual honey production. Honeydew honey is popular in some areas, but in other areas, beekeepers have difficulty selling the stronger-flavored product.\n\nThe production of honeydew honey has some complications and dangers. This honey has a much larger proportion of indigestibles than light floral honeys, thus causing dysentery to the bees, resulting in the death of colonies in areas with cold winters. Good beekeeping management requires the removal of honeydew prior to winter in colder areas. Bees collecting this resource also have to be fed protein supplements, as honeydew lacks the protein-rich pollen accompaniment gathered from flowers.\n\nClassification by packaging and processing\n\nGenerally, honey is bottled in its familiar liquid form. However, honey is sold in other forms, and can be subjected to a variety of processing methods.\n\n* Crystallized honey occurs when some of the glucose content has spontaneously crystallized from solution as the monohydrate. It is also called \"granulated honey\" or \"candied honey\". Honey that has crystallized (or commercially purchased crystallized) can be returned to a liquid state by warming.\n* Pasteurized honey has been heated in a pasteurization process which requires temperatures of 161 F or higher. Pasteurization destroys yeast cells. It also liquefies any microcrystals in the honey, which delays the onset of visible crystallization. However, excessive heat exposure also results in product deterioration, as it increases the level of hydroxymethylfurfural (HMF) and reduces enzyme (e.g. diastase) activity. Heat also affects appearance (darkens the natural honey color), taste, and fragrance.\n* Raw honey is as it exists in the beehive or as obtained by extraction, settling, or straining, without adding heat (although some honey that has been \"minimally processed\" is often labeled as raw honey). Raw honey contains some pollen and may contain small particles of wax.\n* Strained honey has been passed through a mesh material to remove particulate material (pieces of wax, propolis, other defects) without removing pollen, minerals, or enzymes.\n* Filtered honey of any type has been filtered to the extent that all or most of the fine particles, pollen grains, air bubbles, or other materials normally found in suspension, have been removed. The process typically heats honey to 150 – to more easily pass through the filter. Filtered honey is very clear and will not crystallize as quickly, making it preferred by the supermarket trade.\n* Ultrasonicated honey has been processed by ultrasonication, a nonthermal processing alternative for honey. When honey is exposed to ultrasonication, most of the yeast cells are destroyed. Those cells that survive sonication generally lose their ability to grow, which reduces the rate of honey fermentation substantially. Ultrasonication also eliminates existing crystals and inhibits further crystallization in honey. Ultrasonically aided liquefaction can work at substantially lower temperatures around 95 F and can reduce liquefaction time to less than 30 seconds.[http://www.hielscher.com/ultrasonics/honey_01.htm Ultrasonic Honey Processing]. Hielscher.com. Retrieved on 6 February 2011.\n* Creamed honey, also called whipped honey, spun honey, churned honey, honey fondant, and (in the UK) set honey, has been processed to control crystallization. Creamed honey contains a large number of small crystals, which prevent the formation of larger crystals that can occur in unprocessed honey. The processing also produces a honey with a smooth, spreadable consistency.\n* Dried honey has the moisture extracted from liquid honey to create completely solid, nonsticky granules. This process may or may not include the use of drying and anticaking agents. Dried honey is used in baked goods, and to garnish desserts.\n* Comb honey is still in the honeybees' wax comb. It is traditionally collected using standard wooden frames in honey supers. The frames are collected and the comb is cut out in chunks before packaging. As an alternative to this labor-intensive method, plastic rings or cartridges can be used that do not require manual cutting of the comb, and speed packaging. Comb honey harvested in the traditional manner is also referred to as \"cut-comb honey\".[http://www.beeworks.com/informationcentre/honey_processing.html Honey Processing]. Beeworks.com. Retrieved on 6 February 2011.\n* Chunk honey is packed in widemouth containers consisting of one or more pieces of comb honey immersed in extracted liquid honey.\n* Honey decoctions are made from honey or honey byproducts which have been dissolved in water, then reduced (usually by means of boiling). Other ingredients may then be added. (For example, abbamele has added citrus.) The resulting product may be similar to molasses.\n* Baker's honey is outside the normal specification for honey, due to a \"foreign\" taste or odor, or because it has begun to ferment or has been overheated.  It is generally used as an ingredient in food processing.  Additional requirements exist for labeling baker's honey, including that it may not be sold labelled simply as \"honey\".[http://www.food.gov.uk/sites/default/files/multimedia/pdfs/honeyguidance.pdf Honey Regulations 2003], UK Food Standards Agency.  Section 2.5 (p 8), section 4.2 (pp 12-14).\n\nGrading\n\nIn the US, honey grading is performed voluntarily (USDA does offer inspection and grading \"as on-line (in-plant) or lot inspection...upon application, on a fee-for-service basis.\") based upon USDA standards. Honey is graded based upon a number of factors, including water content, flavor and aroma, absence of defects, and clarity. Honey is also classified by color, though it is not a factor in the grading scale.\nThe honey grade scale is:\n\nOther countries may have differing standards on the grading of honey. India, for example, certifies honey grades based on additional factors, such as the Fiehe's test, and other empirical measurements.[http://agmarknet.nic.in/honeygmr.pdf NOTIFICATION], MINISTRY OF AGRICULTURE (Department of Agriculture and Co-operation) New Delhi, 24 December 2008\n\nIndicators of quality\n\nHigh-quality honey can be distinguished by fragrance, taste, and consistency. Ripe, freshly collected, high-quality honey at 20 °C should flow from a knife in a straight stream, without breaking into separate drops. After falling down, the honey should form a bead. The honey, when poured, should form small, temporary layers that disappear fairly quickly, indicating high viscosity. If not, it indicates excessive water content (over 20%)\nof the product. Honey with excessive water content is not suitable for long-term preservation.\n\nIn jars, fresh honey should appear as a pure, consistent fluid, and should not set in layers. Within a few weeks to a few months of extraction, many varieties of honey crystallize into a cream-colored solid. Some varieties of honey, including tupelo, acacia, and sage, crystallize less regularly. Honey may be heated during bottling at temperatures of 40 – to delay or inhibit crystallization. Overheating is indicated by change in enzyme levels, for instance, diastase activity, which can be determined with the Schade or the Phadebas methods. A fluffy film on the surface of the honey (like a white foam), or marble-colored or white-spotted crystallization on a container's sides, is formed by air bubbles trapped during the bottling process.\n\nA 2008 Italian study determined nuclear magnetic resonance spectroscopy can be used to distinguish between different honey types, and can be used to pinpoint the area where it was produced. Researchers were able to identify differences in acacia and polyfloral honeys by the differing proportions of fructose and sucrose, as well as differing levels of aromatic amino acids phenylalanine and tyrosine. This ability allows greater ease of selecting compatible stocks.\n\nNutritional and sugar profile\n\nIn a 100-gram serving, honey provides 304 kilocalories with no essential nutrients in significant content. Composed of 17% water and 82% carbohydrates, honey has low content of fat, dietary fiber, and protein.\n\nA mixture of sugars and other carbohydrates, honey is mainly fructose (about 38%) and glucose (about 32%), with remaining sugars including maltose, sucrose, and other complex carbohydrates. Its glycemic index ranges from 31 to 78, depending on the variety.Arcot, Jayashree and Brand-Miller, Jennie (March 2005) [https://rirdc.infoservices.com.au/downloads/05-027 A Preliminary Assessment of the Glycemic Index of Honey]. A report for the Rural Industries Research and Development Corporation. RIRDC Publication No 05/027. rirdc.infoservices.com.au The specific composition, color, aroma, and flavor of any batch of honey depend on the flowers foraged by bees that produced the honey.\n\nOne 1980 study found that mixed floral honey from several United States regions typically contains:\n* Fructose: 38.2%\n* Glucose: 31.3%\n* Maltose: 7.1%\n* Sucrose: 1.3%\n* Water: 17.2%\n* Higher sugars: 1.5%\n* Ash: 0.2%\n* Other/undetermined: 3.2%\n\nA 2013 NMR spectroscopy study of 20 different honeys from Germany found that their sugar contents comprised:\n* Fructose: 28% to 41%\n* Glucose: 22% to 35%\nThe average ratio was 56% fructose to 44% glucose, but the ratios in the individual honeys ranged from a high of 64% fructose and 36% glucose (one type of flower honey; table 3 in reference) to a low of 50% fructose and 50% glucose (a different floral source). This NMR method was not able to quantify maltose, galactose, and the other minor sugars as compared to fructose and glucose.\n\nMedical\n\nWounds and burns \n\nSome evidence shows that honey may help healing in skin wounds after surgery and mild (partial thickness) burns when used in a dressing, but in general, the evidence for the use of honey in wound treatment is of such low quality that firm conclusions cannot be drawn. Evidence does not support the use of honey-based products in the treatment of venous stasis ulcers or ingrown toenail.\n\nAntibiotic\n\nComponents of honey under preliminary research for their potential antibacterial properties include methylglyoxal, hydrogen peroxide, and royalisin (also called defensin-1).\n\nCough\n\nFor chronic and acute coughs, a Cochrane review found no strong evidence for or against the use of honey. For treating children, the study concluded that honey possibly helps more than no treatment.\n\nThe UK Medicines and Healthcare Products Regulatory Agency recommends avoiding giving over the counter cough and common cold medication to children under six, and suggests \"a homemade remedy containing honey and lemon is likely to be just as useful and safer to take\", but warns that honey should not be given to babies because of the risk of infant botulism. The World Health Organization recommends honey as a treatment for coughs and sore throats, including for children, stating that no reason exists to believe it is less effective than a commercial remedy. Honey is recommended by one Canadian physician for children over the age of one for the treatment of coughs, as it is deemed as effective as dextromethorphan and more effective than diphenhydramine.\n\nOther\n\nNo evidence shows the benefit of using honey to treat cancer, although honey may be useful for controlling side effects of radiation therapy or chemotherapy applied in cancer treatment.\n\nConsumption is sometimes advocated as a treatment for seasonal allergies due to pollen, but  scientific evidence to support the claim is inconclusive. Honey is generally considered ineffective for the treatment of allergic conjunctivitis.\n\nAlthough the majority of calories in honey is from fructose, honey does not cause increased weight gain and fructose by itself is not an independent factor for weight gain.  \n\nHealth hazards\n\nAlthough honey is generally safe when taken in typical food amounts, there are various, potential adverse effects or interactions it may have in combination with excessive consumption, existing disease conditions or drugs. Included among these are mild reactions to high intake, such as anxiety, insomnia, or hyperactivity in about 10% of children, according to one study. No symptoms of anxiety, insomnia, or hyperactivity were detected with honey consumption compared to placebo, according to another study. Honey consumption may interact adversely with existing allergies, high blood sugar levels (as in diabetes), or anticoagulants used to control bleeding, among other clinical conditions.\n\nPeople who have a weakened immune system may be at risk of bacterial or fungal infection from eating honey, although there is no high-quality clinical evidence that this occurs commonly.\n\nBotulism\n\nInfants can develop botulism after consuming honey contaminated with Clostridium botulinum endospores.\n\nInfantile botulism shows geographical variation. In the UK, only six cases have been reported between 1976 and 2006, yet the U.S. has much higher rates: 1.9 per 100,000 live births, 47.2% of which are in California.[https://www.cdc.gov/ncidod/dbmd/diseaseinfo/files/botulism.PDF Botulism in the United States, 1899–1996], Handbook for Epidemiologists, Clinicians, and Laboratory Workers, Atlanta, GA. Centers for Disease Control and Prevention (1998) While the risk honey poses to infant health is small, taking the risk is not recommended until after one year of age, and then giving honey is considered safe.[http://edis.ifas.ufl.edu/AA142 Infant Botulism and Honey]. Edis.ifas.ufl.edu. Retrieved on 9 January 2012.\n\nToxic honey\n\nMad honey intoxication is a result of eating honey containing grayanotoxins. Honey produced from flowers of rhododendrons, mountain laurels, sheep laurel, and azaleas may cause honey intoxication. Symptoms include dizziness, weakness, excessive perspiration, nausea, and vomiting. Less commonly, low blood pressure, shock, heart rhythm irregularities, and convulsions may occur, with rare cases resulting in death. Honey intoxication is more likely when using \"natural\" unprocessed honey and honey from farmers who may have a small number of hives. Commercial processing, with pooling of honey from numerous sources, is thought to dilute any toxins.[https://web.archive.org/web/20130308010321/http://www.fda.gov/Food/FoodSafety/FoodborneIllness/FoodborneIllnessFoodbornePathogensNaturalToxins/BadBugBook/ucm071128.htm] in the Foodborne Pathogenic Microorganisms and Natural Toxins Handbook, FDA Center for Food Safety and Applied Nutrition.\n\nToxic honey may also result when bees are proximate to tutu bushes (Coriaria arborea) and the vine hopper insect (Scolypopa australis). Both are found throughout New Zealand. Bees gather honeydew produced by the vine hopper insects feeding on the tutu plant. This introduces the poison tutin into honey. Only a few areas in New Zealand (the Coromandel Peninsula, Eastern Bay of Plenty and the Marlborough Sounds) frequently produce toxic honey. Symptoms of tutin poisoning include vomiting, delirium, giddiness, increased excitability, stupor, coma, and violent convulsions. To reduce the risk of tutin poisoning, humans should not eat honey taken from feral hives in the risk areas of New Zealand. Since December 2001, New Zealand beekeepers have been required to reduce the risk of producing toxic honey by closely monitoring tutu, vine hopper, and foraging conditions within 3 km of their apiary.  Intoxication is rarely dangerous.\n\nHistory and culture\n\nHoney use and production has a long and varied history. In many cultures, honey has associations that go beyond its use as a food. It is frequently used as a talisman and symbol of sweetness.\n\nAncient times\n\nHoney collection is an ancient activity. Humans apparently began hunting for honey at least 8,000 years ago, as evidenced by a cave painting in Valencia, Spain.Crane, Eva (1983) The Archaeology of Beekeeping, Cornell University Press,  The painting is a Mesolithic rock painting, showing two honey hunters collecting honey and honeycomb from a wild bee nest. The figures are depicted carrying baskets or gourds, and using a ladder or series of ropes to reach the wild nest.\n\nThe greater honeyguide bird guides humans to wild bee hives and this behavior may have evolved with early hominids.Short, Lester, Horne, Jennifer and Diamond, A. W. (2003). \"Honeyguides\". In Christopher Perrins (Ed.). Firefly Encyclopedia of Birds. Firefly Books. pp. 396–397. .\n\nThe oldest known honey remains were found in the country of Georgia. Archaeologists found honey remains on the inner surface of clay vessels unearthed in an ancient tomb, dating back some 4,700–5,500 years.[http://www.cncworld.tv/news/v_show/23243_Georgian_ancient_honey.shtml Georgian ancient honey]. cncworld.tv (31 March 2012). Retrieved on 10 July 2012.[http://www.eurasianet.org/node/65204 Report: Georgia Unearths the World’s Oldest Honey]. EurasiaNet (30 March 2012). Retrieved on 3 July 2015. In ancient Georgia, several types of honey were buried with a person for their journey into the afterlife, including linden, berry, and meadow-flower varieties.[http://guildofscientifictroubadours.com/2012/04/02/the-worlds-first-winemakers-were-the-worlds-first-beekeepers/ The world's first winemakers were the world's first beekeepers.] guildofscientifictroubadours.com (2 April 2012). Retrieved on 10 July 2012.\n\nIn ancient Egypt, honey was used to sweeten cakes and biscuits, and was used in many other dishes. Ancient Egyptian and Middle Eastern peoples also used honey for embalming the dead.Larry Gonick The Cartoon History of the Universe Vol.2 The fertility god of Egypt, Min, was offered honey.\n\nIn ancient Greece, honey was produced from the Archaic to the Hellenistic periods. In 594 BC, beekeeping around Athens was so widespread that Solon passed a law about it: \"He who sets up hives of bees must put them 300 ft away from those already installed by another\". Greek archaeological excavations of pottery located ancient hives. According to Columella, Greek beekeepers of the Hellenistic period did not hesitate to move their hives over rather long distances to maximise production, taking advantage of the different vegetative cycles in different regions.\n\nIn the absence of sugar, honey was an integral sweetening ingredient in Greek and Roman cuisine. During Roman times, honey was part of many recipes and it is mentioned in the work of many authors, such as Virgil, Pliny, Cicero, and others.\n\nThe spiritual and therapeutic use of honey in ancient India is documented in both the Vedas and the Ayurveda texts, which were both composed at least 4,000 years ago.\n\nBeekeeping in ancient China has existed since ancient times and appears to be untraceable to its origin. In the book Golden Rules of Business Success written by Fan Li (or Tao Zhu Gong) during the Spring and Autumn period, some parts mention the art of beekeeping and the importance of the quality of the wooden box for beekeeping that can affect the quality of its honey.\n\nHoney was also cultivated in ancient Mesoamerica. The Maya used honey from the stingless bee for culinary purposes, and continue to do so today. The Maya also regard the bee as sacred (see Mayan stingless bees of Central America).\n\nSome cultures believed honey had many practical health uses. It was used as an ointment for rashes and burns, and to help soothe sore throats when no other practices were available.\n\nFolk medicine and wound research\n\nIn myths and folk medicine, honey has been used both orally and topically to treat various ailments including gastric disturbances, ulcers, skin wounds, and skin burns by ancient Greeks and Egyptians, and in Ayurveda and traditional Chinese medicine.\n\nProposed for treating wounds and burns, honey may have antimicrobial properties as first reported in 1892 and be useful as a safe, improvisational wound treatment. Though its supposed antimicrobial properties may be due to high osmolarity even when diluted with water, it is more effective than plain sugar water of a similar viscosity. Definitive clinical conclusions about the efficacy and safety of treating wounds, however, are not possible from this limited research.\n\nThe flora that bees use to make the honey may have a role in its properties, particularly by bees foraging from the manuka myrtle,  Leptospermum scoparium, as proposed in one study.\n\nReligious significance\n\nAncient Greeks Religion\nIn ancient Greek religion, the food of Zeus and the 12 Gods of Olympus was honey in the form of nectar and ambrosia.\n\nHinduism \nIn Hinduism, honey (Madhu) is one of the five elixirs of immortality (Panchamrita). In temples, honey is poured over the deities in a ritual called Madhu abhisheka. The Vedas and other ancient literature mention the use of honey as a great medicinal and health food.[http://www.fjnet.com/english/society/t20061117_41041.htm A Meaningful Story of Buddha, Elephant and Monkey]  by Marguerite Theophil, United Press International, 16 November 2006, accessed 9 August 2008\n\nJudaism \nIn Jewish tradition, honey is a symbol for the new year, Rosh Hashanah. At the traditional meal for that holiday, apple slices are dipped in honey and eaten to bring a sweet new year. Some Rosh Hashanah greetings show honey and an apple, symbolizing the feast. In some congregations, small straws of honey are given out to usher in the new year.\n\nThe Hebrew Bible contains many references to honey. In the Book of Judges, Samson found a swarm of bees and honey in the carcass of a lion (14:8). In Old Testament law, offerings were made in the temple to God. The Book of Leviticus says that \"Every grain offering you bring to the Lord must be made without yeast, for you are not to burn any yeast or honey in a food offering presented to the Lord\" (2:11). In the Books of Samuel, Jonathan is forced into a confrontation with his father King Saul after eating honey in violation of a rash oath Saul has made (). Proverbs 16:24 in the JPS Tanakh 1917 version says \"Pleasant words are as a honeycomb, Sweet to the soul, and health to the bones.\" Book of Exodus famously describes the Promised Land as a \"land flowing with milk and honey\" (33:3). However, most Biblical commentators write that the original Hebrew in the Bible (דבש devash) refers to the sweet syrup produced from the juice of dates (silan).Berel, Rabbi. (24 September 2005) [http://www.aish.com/h/hh/rh/48959531.html Apples and Honey]. Aish.com. Retrieved on 6 February 2011. In 2005 an apiary dating from the 10th century B.C. was found in Tel Rehov, Israel that contained 100 hives and is estimated to produce half a ton of honey annually. Pure honey is considered kosher, though it is produced by a flying insect, a non-kosher creature; other products of non-kosher animals are not kosher.[http://www.chabad.org/library/article_cdo/aid/712032/jewish/Why-Is-honey-kosher.htm \"Why is honey kosher?\"] Chabad.org. Retrieved 30 November 2010.\n\nBuddhism \nIn Buddhism, honey plays an important role in the festival of Madhu Purnima, celebrated in India and Bangladesh. The day commemorates Buddha's making peace among his disciples by retreating into the wilderness. The legend has it that while he was there, a monkey brought him honey to eat. On Madhu Purnima, Buddhists remember this act by giving honey to monks. The monkey's gift is frequently depicted in Buddhist art.\n\nChristianity \nIn the Christian New Testament, Matthew 3:4, John the Baptist is said to have lived for a long period of time in the wilderness on a diet consisting of locusts and wild honey.\n\nIslam\nIn Islam,  an entire chapter (Surah) in the Qur'an is called an-Nahl (the Bees). According to his teachings (hadith), Muhammad strongly recommended honey for healing purposes.Sahih Bukhari vol. 7, book 71, number 584, 585, 588 and 603. The Qur'an promotes honey as a nutritious and healthy food. Below is the English translation of those specific verses:",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Honey" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14361" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Honey is a sweet, viscous food substance produced by bees and some related insects. Bees produce honey from the sugary secretions of plants (floral nectar) or other insects (aphid honeydew) through regurgitation, enzymatic activity, and water evaporation. Honey is stored in wax structures called honeycombs. The variety of honey produced by honey bees (the genus Apis) is the best-known, due to its worldwide commercial production and human consumption. Honey is collected from wild bee colonies, or from hives of domesticated bees, a practice known as beekeeping.\n\nHoney gets its sweetness from the monosaccharides fructose and glucose, and has about the same relative sweetness as granulated sugar.National Honey Board. [http://www.honey.com/images/downloads/carb.pdf \"Carbohydrates and the Sweetness of Honey\"]. Last accessed 1 June 2012.Oregon State University [https://web.archive.org/web/20121101092211/http://food.oregonstate.edu/learn/faq/faq_sugar53.html \"What is the relative sweetness of different sugars and sugar substitutes?\"]. Retrieved 1 June 2012. It has attractive chemical properties for baking and a distinctive flavor when used as a sweetener. Most microorganisms do not grow in honey, so sealed honey does not spoil, even after thousands of years.\n\nHoney provides 64 calories in a serving of one tablespoon (15 ml) equivalent to 1272 kJ per 100 g. Honey is generally safe, but may have various, potentially adverse effects or interactions upon excessive consumption, existing disease conditions, or use of prescription drugs.\n\nHoney use and production have a long and varied history as an ancient activity, depicted in Valencia, Spain, by a cave painting of humans foraging for honey at least 8,000 years ago.\n\nFormation\n\nHoney is produced by bees collecting nectar for use as sugars consumed to support metabolism of muscle activity during foraging or to be stored as a long-term food supply. During foraging, bees access part of the nectar collected to support metabolic activity of flight muscles, with the majority of collected nectar destined for regurgitation, digestion, and storage as honey. In cold weather or when other food sources are scarce, adult and larval bees use stored honey as food. National Honey Board\n\nBy contriving for bee swarms to nest in human-made hives, people have been able to semidomesticate the insects and harvest excess honey. In the hive or in a wild nest, the three types of bees are:\n* a single female queen bee\n* a seasonally variable number of male drone bees to fertilize new queens\n* 20,000 to 40,000 female worker bees\n\nLeaving the hive, foraging bees collect sugar-rich flower nectar and return to the hive where they use their \"honey stomachs\" to ingest and regurgitate the nectar repeatedly until it is partially digested. Bee digestive enzymes – invertase, amylase, and diastase – along with gastric acid hydrolyze sucrose to a mixture of glucose and fructose. The bees work together as a group with the regurgitation and digestion for as long as 20 minutes until the product reaches storage quality. It is then placed in honeycomb cells left unsealed while still high in water content (about 20%) and natural yeasts, which, unchecked, would cause the sugars in the newly formed honey to ferment. The process continues as hive bees flutter their wings constantly to circulate air and evaporate water from the honey to a content around 18%, raising the sugar concentration, and preventing fermentation. The bees then cap the cells with wax to seal them. As removed from the hive by a beekeeper, honey has a long shelf life and will not ferment if properly sealed.\n\nAnother source of honey is from a number of wasp species, such as the wasps Brachygastra lecheguana and Brachygastra mellifica, which are found in South and Central America. These species are known to feed on nectar and produce honey.\n\nSome wasps, such as the Polistes versicolor, even consume honey themselves, switching from feeding on pollen in the middle of their lifecycles to feeding on honey, which can better provide for their energy needs.\n\nProduction\n\nCollection\n\nHoney is collected from wild bee colonies, or from domesticated beehives. The honey is stored in honeycombs.  Wild bee nests are sometimes located by following a honeyguide bird.  The bees may first be pacified by using smoke from a bee smoker.  The smoke triggers a feeding instinct (an attempt to save the resources of the hive from a possible fire), making them less aggressive and the smoke obscures the pheromones the bees use to communicate.\n\nThe honeycomb is removed from the hive and the honey may be extracted from that, either by crushing or by using a honey extractor. The honey is then usually filtered to remove beeswax and other debris.\n\nBefore the invention of removable frames, bee colonies were often sacrificed to conduct the harvest.  The harvester would take all the available honey and replace the entire colony the next spring.  Since the invention of removable frames, the principles of husbandry lead most beekeepers to ensure that their bees  have enough stores to survive the winter, either by leaving some honey in the beehive or by providing the colony with a honey substitute such as sugar water or crystalline sugar (often in the form of a \"candyboard\").  The amount of food necessary to survive the winter depends on the variety of bees and on the length and severity of local winters.\n\nA wide range of species other than humans are attracted to wild or domestic sources of honey.\n\nPreservation\n\nBecause of its unique composition and chemical properties, honey is suitable for long-term storage, and is easily assimilated even after long preservation. Honey, and objects immersed in honey, have been preserved for centuries.\"[https://books.google.com/books?idi0hNLjVL49oC&pg\nPA83 The History of the Origin and Development of Museums]\". Dr. M. A. Hagen. The American naturalist, Volume 10. 1876.1894. [https://books.google.com/books?id=ZuYqAAAAYAAJ The Mummy: A Handbook of Egyptian Funerary Archaeology]. 2nd ed. Cambridge: Cambridge University Press. (Reprinted New York: Dover Publications, 1989) The key to preservation is limiting access to humidity. In its cured state, honey has a sufficiently high sugar content to inhibit fermentation. If exposed to moist air, its hydrophilic properties pull moisture into the honey, eventually diluting it to the point that fermentation can begin.\n\nLong shelf life of honey is attributed to an enzyme found in the stomach of bees. The bees mix Glucose oxidase with expelled nectar they previously consumed, which then creates two by-products: gluconic acid and hydrogen peroxide, responsible for honey's acidity and ability to suppress bacterial growth.\n\nAdulteration \n\nAdulteration of honey is the addition of other sugars, syrups, or compounds into honey to change its flavor or viscosity, make it cheaper to produce, or increase the fructose content to stave off crystallization. According to the Codex Alimentarius of the United Nations, any product labeled as honey or pure honey must be a wholly natural product, although different nations have their own laws concerning labeling. Adulteration of honey is sometimes used as a method of deception when buyers are led to believe that the honey is pure. The practice was common dating back to ancient times, when crystallized honey was often mixed with flour or other fillers, hiding the adulteration from buyers until the honey was liquefied. In modern times, the most common adulteration-ingredient became clear, almost-flavorless corn syrup, which, when mixed with honey, is often very difficult to distinguish from unadulterated honey.The Hive: The Story of the Honeybee and Us By Bee Wilson --St. Martins Press 2004 Page 167\n\nIsotope ratio mass spectrometry can be used to detect addition of corn syrup and cane sugar by the carbon isotopic signature. Addition of sugars originating from corn or sugar cane (C4 plants, unlike the plants used by bees, and also sugar beet, which are predominantly C3 plants) skews the isotopic ratio of sugars present in honey, but does not influence the isotopic ratio of proteins. In an unadulterated honey, the carbon isotopic ratios of sugars and proteins should match. Levels as low as 7% of addition can be detected.\n\nIn the United States, according to the National Honey Board (a USDA-overseen organization), \"honey stipulates a pure product that does not allow for the addition of any other substance... this includes, but is not limited to, water or other sweeteners\".[https://www.bjcp.org/mead/honeydefs.pdfCategory: Definition of honey and honey products]. (PDF). Retrieved on 7 January 2018.\n\nWorldwide production\n\n \n\nIn 2014, 1.5 million tonnes of honey were produced worldwide, with China alone accounting for 31% of the world total (table). The next four largest producers – Turkey, United States, Ukraine, and Russia – accounted collectively for 22% of the world total.\n\nModern uses\n\nFood\n\nOver its history as a food, the main uses of honey are in cooking, baking, desserts, such as mel i mató, as a spread on bread, as an addition to various beverages, such as tea, and as a sweetener in some commercial beverages. Honey barbecue and honey mustard are other common flavors used in sauces.\n\nFermentation\n\nPossibly the world's oldest fermented beverage dating to 9,000 years agoPatrick E. McGovern, Juzhong Zhang, Jigen Tang, Zhiqing Zhang, Gretchen R. Hall, Robert A. Moreau, Alberto Nuñez, Eric D. Butrym, Michael P. Richards, Chen-shan Wang, Guangsheng Cheng, Zhijun Zhao and Changsui Wang\nPNAS 2004 December, 101 (51) 17593-17598. \"Fermented beverages of pre- and proto-historic China\" http://www.pnas.org/content/101/51/17593; Chemical analyses of ancient organics absorbed into pottery jars from the early Neolithic village of Jiahu in Henan province in China have revealed that a mixed fermented beverage of rice, honey, and fruit (hawthorn fruit and/or grape) was being produced as early as the seventh millennium before Christ (B.C.)., mead (\"honey wine\") is the alcoholic product made by adding yeast to the honey–water must, followed by weeks or months of fermentation. In modern mead production, the yeast, Saccharomyces cerevisiae, is commonly used.\n\nPrimary fermentation usually takes 2856 days, after which the must is placed in a secondary fermentation vessel for 6–9 months of aging. Durations of primary and secondary fermentation producing satisfactory mead may vary considerably according to numerous factors, such as floral origin of the honey and its natural sugar and microorganism contents, must water percentage, pH, additives used, and strain of yeast, among others. Although supplementation of the must with nitrogen, salt or vitamins has been tested to improve mead qualities, there is no evidence that adding nutrients reduced fermentation time or improved quality. Cell immobilization methods, however, proved effective for enhancing mead quality.\n\nMead varieties include drinks called metheglin (with spices or herbs), melomel (with fruit juices, such as grape, specifically called pyment), hippocras (with cinnamon), and sack mead (high concentration of honey), many of which have been developed as commercial products numbering in the hundreds in the United States as of 2014. Honey is also used to make mead beer, called \"braggot\".\n\nPhysical and chemical properties\n\nThe physical properties of honey vary, depending on water content, the type of flora used to produce it (pasturage), temperature, and the proportion of the specific sugars it contains. Fresh honey is a supersaturated liquid, containing more sugar than the water can typically dissolve at ambient temperatures. At room temperature, honey is a supercooled liquid, in which the glucose will precipitate into solid granules. This forms a semisolid solution of precipitated glucose crystals in a solution of fructose and other ingredients.\n\nAt the temperature of 20 °C, density of honey typically ranges between 1.38 and 1.45 kg/l.\n\nPhase transitions\n\nThe melting point of crystallized honey is between 40 and, depending on its composition. Below this temperature, honey can be either in a metastable state, meaning that it will not crystallize until a seed crystal is added, or, more often, it is in a \"labile\" state, being saturated with enough sugars to crystallize spontaneously.Root, p. 355 The rate of crystallization is affected by many factors, but the primary factor is the ratio of the main sugars: fructose to glucose. Honeys that are supersaturated with a very high percentage of glucose, such as brassica honey,  crystallize almost immediately after harvesting, while honeys with a low percentage of glucose, such as chestnut or tupelo honey, do not crystallize. Some types of honey may produce very large but few crystals, while others produce many small crystals.Tomasik, Piotr (2004) Chemical and functional properties of food saccharides, CRC Press, p. 74, \n\nCrystallization is also affected by water content, because a high percentage of water inhibits crystallization, as does a high dextrin content. Temperature also affects the rate of crystallization, with the fastest growth occurring between 13 and. Crystal nuclei (seeds) tend to form more readily if the honey is disturbed, by stirring, shaking, or agitating, rather than if left at rest. However, the nucleation of microscopic seed-crystals is greatest between 5 and. Therefore, larger but fewer crystals tend to form at higher temperatures, while smaller but more-numerous crystals usually form at lower temperatures. Below 5 °C, the honey will not crystallize, thus the original texture and flavor can be preserved indefinitely.\n\nSince honey normally exists below its melting point, it is a supercooled liquid. At very low temperatures, honey does not freeze solid. Instead, as the temperatures become lower, the viscosity of honey increases. Like most viscous liquids, the honey  becomes thick and sluggish with decreasing temperature. At , honey may appear or even feel solid, but it continues to flow at very low rates. Honey has a glass transition between . Below this temperature, honey enters a glassy state and  becomes an amorphous solid (noncrystalline).\n\nViscosity\n\nThe viscosity of honey is affected greatly by both temperature and water content. The higher the water percentage, the more easily honey flows. Above its melting point, however, water has little effect on viscosity. Aside from water content, the composition of honey also has little effect on viscosity, with the exception of a few types. At 25 C, honey with 14% water content generally has a viscosity around 400 poise, while a honey containing 20% water has a viscosity around 20 poise. Viscosity increase due to temperature occurs very slowly at first. A honey containing 16% water, at 70 C, has a viscosity around 2 poise, while at 30 C, the viscosity is around 70 poise. As cooling progresses, honey becomes more viscous at an increasingly rapid rate, reaching 600 poise around 14 C. However, while honey is very viscous, it has rather low surface tension.\n\nA few types of honey have unusual viscous properties. Honeys from heather or manuka display thixotropic properties. These types of honey enter a gel-like state when motionless, but then liquify when stirred.Krell, pp. 5–6\n\nElectrical and optical properties\n\nBecause honey contains electrolytes, in the form of acids and minerals, it exhibits varying degrees of electrical conductivity. Measurements of the electrical conductivity are used to determine the quality of honey in terms of ash content.\n\nThe effect honey has on light is useful for determining the type and quality. Variations in the water content alter the refractive index of honey. Water content can easily be measured with a refractometer. Typically, the refractive index for honey ranges from 1.504 at 13% water content to 1.474 at 25%. Honey also has an effect on polarized light, in that it rotates the polarization plane. The fructose gives a negative rotation, while the glucose gives a positive one. The overall rotation can be used to measure the ratio of the mixture.Root, p. 348 Honey may vary in color between pale yellow and dark brown, but other bright colors may occasionally be found, depending on the source of the sugar harvested by the bees.\n\nHygroscopy and fermentation\n\nHoney has the ability to absorb moisture directly from the air, a phenomenon called hygroscopy. The amount of water the honey absorbs is dependent on the relative humidity of the air. Because honey contains yeast, this hygroscopic nature requires that honey be stored in sealed containers to prevent fermentation, which usually begins if the honey's water content rises much above 25%. Honey tends to absorb more water in this manner than the individual sugars allow on their own, which may be due to other ingredients it contains.\n\nFermentation of honey usually occurs after crystallization, because without the glucose, the liquid portion of the honey primarily consists of a concentrated mixture of fructose, acids, and water, providing the yeast with enough of an increase in the water percentage for growth. Honey that is to be stored at room temperature for long periods of time is often pasteurized, to kill any yeast, by heating it above 70 C.\n\nThermal characteristics\n\nLike all sugar compounds, honey caramelizes if heated sufficiently, becoming darker in color, and eventually burns. However, honey contains fructose, which caramelizes at lower temperatures than glucose.Hans-Dieter Belitz, Werner Grosch, Peter Schieberle [https://books.google.com/books?idxteiARU46SQC&printsec\nfrontcover Food chemistry] Springer Verlag, Berlin-Heidelberg 2004 p. 884  The temperature at which caramelization begins varies, depending on the composition, but is typically between 70 and. Honey also contains acids, which act as catalysts for caramelization. The specific types of acids and their amounts play a primary role in determining the exact temperature.Zdzisław E. Sikorski Chemical and functional properties of food components CRC Press 2007 p. 121  Of these acids, the amino acids, which occur in very small amounts, play an important role in the darkening of honey. The amino acids form darkened compounds called melanoidins, during a Maillard reaction. The Maillard reaction occurs slowly at room temperature, taking from a few to several months to show visible darkening, but speeds up dramatically with increasing temperatures. However, the reaction can also be slowed by storing the honey at colder temperatures.Root, p. 350\n\nUnlike many other liquids, honey has very poor thermal conductivity, taking a long time to reach thermal equilibrium. Melting crystallized honey can easily result in localized caramelization if the heat source is too hot, or if it is not evenly distributed. However, honey takes substantially longer to liquify when just above the melting point than at elevated temperatures. Melting 20 kg of crystallized honey, at 40 C, can take up to 24 hours, while 50 kg may take twice as long. These times can be cut nearly in half by heating at 50 C. However, many of the minor substances in honey can be affected greatly by heating, changing the flavor, aroma, or other properties, so heating is usually done at the lowest temperature possible for the shortest amount of time.Krell, pp. 40–43\n\nAcid content and flavor effects\n\nThe average pH of honey is 3.9, but can range from 3.4 to 6.1. Honey contains many kinds of acids, both organic and amino. However, the different types and their amounts vary considerably, depending on the type of honey. These acids may be aromatic or aliphatic (nonaromatic). The aliphatic acids contribute greatly to the flavor of honey by interacting with the flavors of other ingredients.\n\nOrganic acids comprise most of the acids in honey, accounting for 0.17–1.17% of the mixture, with gluconic acid formed by the actions of an enzyme called glucose oxidase as the most prevalent. Other organic acids are minor, consisting of formic, acetic, butyric, citric, lactic, malic, pyroglutamic, propionic, valeric, capronic, palmitic, and succinic, among many others.\n\nClassification\n\nHoney is classified by its floral source, and divisions are made according to the packaging and processing used. Also, regional honeys are identified. In the USA, honey is also graded on its color and optical density by USDA standards, graded on the Pfund scale, which ranges from 0 for \"water white\" honey to more than 114 for \"dark amber\" honey.[http://www.fao.org/docrep/w0076E/w0076e04.htm Value-added products from beekeeping. Chapter 2]. Fao.org. Retrieved on 14 April 2011.\n\nFloral source\n\nGenerally, honey is classified by the floral source of the nectar from which it was made. Honeys can be from specific types of flower nectars or can be blended after collection. The pollen in honey is traceable to floral source and therefore region of origin. The rheological and melissopalynological properties of honey can be used to identify the major plant nectar source used in its production.\n\nBlended\n\nMost commercially available honey is blended, meaning it is a mixture of two or more honeys differing in floral source, color, flavor, density, or geographic origin.\n\nPolyfloral\n\nPolyfloral honey, also known as wildflower honey, is derived from the nectar of many types of flowers.\n\nThe taste may vary from year to year, and the aroma and the flavor can be more or less intense, depending on which bloomings are prevalent.[http://www.mieliditalia.it/colori/inglese/m20/m20.htm Mountain Wildflower Honey]. Mieliditalia.it. Retrieved on 6 February 2011.\n\nMonofloral\n\nMonofloral honey is made primarily from the nectar of one type of flower. Different monofloral honeys have a distinctive flavor and color because of differences between their principal nectar sources.[http://www.mieliditalia.it/colori/inglese/home.htm The Colours Of Honey]. Mieliditalia.it. Retrieved on 6 February 2011. To produce monofloral honey, beekeepers keep beehives in an area where the bees have access to only one type of flower. In practice, because of the difficulties in containing bees, a small proportion of any honey will be from additional nectar from other flower types. Typical examples of North American monofloral honeys are clover, orange blossom, blueberry, sage, tupelo, buckwheat, fireweed, mesquite, and sourwood. Some typical European examples include thyme, thistle, heather, acacia, dandelion, sunflower, lavender, honeysuckle, and varieties from lime and chestnut trees. In North Africa (e.g. Egypt), examples include clover, cotton, and citrus (mainly orange blossoms). The unique flora of Australia yields a number of distinctive honeys, with some of the most popular being yellow box, blue gum, ironbark, bush mallee, Tasmanian leatherwood, and macadamia.\n\nHoneydew honey\n\nInstead of taking nectar, bees can take honeydew, the sweet secretions of aphids or other plant sap-sucking insects. Honeydew honey is very dark brown in color, with a rich fragrance of stewed fruit or fig jam, and is not as sweet as nectar honeys. Germany's Black Forest is a well known source of honeydew-based honeys, as well as some regions in Bulgaria, Tara (mountain) in Serbia, and Northern California in the United States. In Greece, pine honey (a type of honeydew honey) constitutes 60–65% of the annual honey production. Honeydew honey is popular in some areas, but in other areas, beekeepers have difficulty selling the stronger-flavored product.\n\nThe production of honeydew honey has some complications and dangers. This honey has a much larger proportion of indigestibles than light floral honeys, thus causing dysentery to the bees, resulting in the death of colonies in areas with cold winters. Good beekeeping management requires the removal of honeydew prior to winter in colder areas. Bees collecting this resource also have to be fed protein supplements, as honeydew lacks the protein-rich pollen accompaniment gathered from flowers.\n\nClassification by packaging and processing\n\nGenerally, honey is bottled in its familiar liquid form. However, honey is sold in other forms, and can be subjected to a variety of processing methods.\n\n* Crystallized honey occurs when some of the glucose content has spontaneously crystallized from solution as the monohydrate. It is also called \"granulated honey\" or \"candied honey\". Honey that has crystallized (or commercially purchased crystallized) can be returned to a liquid state by warming.\n* Pasteurized honey has been heated in a pasteurization process which requires temperatures of 161 F or higher. Pasteurization destroys yeast cells. It also liquefies any microcrystals in the honey, which delays the onset of visible crystallization. However, excessive heat exposure also results in product deterioration, as it increases the level of hydroxymethylfurfural (HMF) and reduces enzyme (e.g. diastase) activity. Heat also affects appearance (darkens the natural honey color), taste, and fragrance.\n* Raw honey is as it exists in the beehive or as obtained by extraction, settling, or straining, without adding heat (although some honey that has been \"minimally processed\" is often labeled as raw honey). Raw honey contains some pollen and may contain small particles of wax.\n* Strained honey has been passed through a mesh material to remove particulate material (pieces of wax, propolis, other defects) without removing pollen, minerals, or enzymes.\n* Filtered honey of any type has been filtered to the extent that all or most of the fine particles, pollen grains, air bubbles, or other materials normally found in suspension, have been removed. The process typically heats honey to 150 – to more easily pass through the filter. Filtered honey is very clear and will not crystallize as quickly, making it preferred by the supermarket trade.\n* Ultrasonicated honey has been processed by ultrasonication, a nonthermal processing alternative for honey. When honey is exposed to ultrasonication, most of the yeast cells are destroyed. Those cells that survive sonication generally lose their ability to grow, which reduces the rate of honey fermentation substantially. Ultrasonication also eliminates existing crystals and inhibits further crystallization in honey. Ultrasonically aided liquefaction can work at substantially lower temperatures around 95 F and can reduce liquefaction time to less than 30 seconds.[http://www.hielscher.com/ultrasonics/honey_01.htm Ultrasonic Honey Processing]. Hielscher.com. Retrieved on 6 February 2011.\n* Creamed honey, also called whipped honey, spun honey, churned honey, honey fondant, and (in the UK) set honey, has been processed to control crystallization. Creamed honey contains a large number of small crystals, which prevent the formation of larger crystals that can occur in unprocessed honey. The processing also produces a honey with a smooth, spreadable consistency.\n* Dried honey has the moisture extracted from liquid honey to create completely solid, nonsticky granules. This process may or may not include the use of drying and anticaking agents. Dried honey is used in baked goods, and to garnish desserts.\n* Comb honey is still in the honeybees' wax comb. It is traditionally collected using standard wooden frames in honey supers. The frames are collected and the comb is cut out in chunks before packaging. As an alternative to this labor-intensive method, plastic rings or cartridges can be used that do not require manual cutting of the comb, and speed packaging. Comb honey harvested in the traditional manner is also referred to as \"cut-comb honey\".[http://www.beeworks.com/informationcentre/honey_processing.html Honey Processing]. Beeworks.com. Retrieved on 6 February 2011.\n* Chunk honey is packed in widemouth containers consisting of one or more pieces of comb honey immersed in extracted liquid honey.\n* Honey decoctions are made from honey or honey byproducts which have been dissolved in water, then reduced (usually by means of boiling). Other ingredients may then be added. (For example, abbamele has added citrus.) The resulting product may be similar to molasses.\n* Baker's honey is outside the normal specification for honey, due to a \"foreign\" taste or odor, or because it has begun to ferment or has been overheated.  It is generally used as an ingredient in food processing.  Additional requirements exist for labeling baker's honey, including that it may not be sold labelled simply as \"honey\".[http://www.food.gov.uk/sites/default/files/multimedia/pdfs/honeyguidance.pdf Honey Regulations 2003], UK Food Standards Agency.  Section 2.5 (p 8), section 4.2 (pp 12-14).\n\nGrading\n\nIn the US, honey grading is performed voluntarily (USDA does offer inspection and grading \"as on-line (in-plant) or lot inspection...upon application, on a fee-for-service basis.\") based upon USDA standards. Honey is graded based upon a number of factors, including water content, flavor and aroma, absence of defects, and clarity. Honey is also classified by color, though it is not a factor in the grading scale.\nThe honey grade scale is:\n\nOther countries may have differing standards on the grading of honey. India, for example, certifies honey grades based on additional factors, such as the Fiehe's test, and other empirical measurements.[http://agmarknet.nic.in/honeygmr.pdf NOTIFICATION], MINISTRY OF AGRICULTURE (Department of Agriculture and Co-operation) New Delhi, 24 December 2008\n\nIndicators of quality\n\nHigh-quality honey can be distinguished by fragrance, taste, and consistency. Ripe, freshly collected, high-quality honey at 20 °C should flow from a knife in a straight stream, without breaking into separate drops. After falling down, the honey should form a bead. The honey, when poured, should form small, temporary layers that disappear fairly quickly, indicating high viscosity. If not, it indicates excessive water content (over 20%)\nof the product. Honey with excessive water content is not suitable for long-term preservation.\n\nIn jars, fresh honey should appear as a pure, consistent fluid, and should not set in layers. Within a few weeks to a few months of extraction, many varieties of honey crystallize into a cream-colored solid. Some varieties of honey, including tupelo, acacia, and sage, crystallize less regularly. Honey may be heated during bottling at temperatures of 40 – to delay or inhibit crystallization. Overheating is indicated by change in enzyme levels, for instance, diastase activity, which can be determined with the Schade or the Phadebas methods. A fluffy film on the surface of the honey (like a white foam), or marble-colored or white-spotted crystallization on a container's sides, is formed by air bubbles trapped during the bottling process.\n\nA 2008 Italian study determined nuclear magnetic resonance spectroscopy can be used to distinguish between different honey types, and can be used to pinpoint the area where it was produced. Researchers were able to identify differences in acacia and polyfloral honeys by the differing proportions of fructose and sucrose, as well as differing levels of aromatic amino acids phenylalanine and tyrosine. This ability allows greater ease of selecting compatible stocks.\n\nNutritional and sugar profile\n\nIn a 100-gram serving, honey provides 304 kilocalories with no essential nutrients in significant content. Composed of 17% water and 82% carbohydrates, honey has low content of fat, dietary fiber, and protein.\n\nA mixture of sugars and other carbohydrates, honey is mainly fructose (about 38%) and glucose (about 32%), with remaining sugars including maltose, sucrose, and other complex carbohydrates. Its glycemic index ranges from 31 to 78, depending on the variety.Arcot, Jayashree and Brand-Miller, Jennie (March 2005) [https://rirdc.infoservices.com.au/downloads/05-027 A Preliminary Assessment of the Glycemic Index of Honey]. A report for the Rural Industries Research and Development Corporation. RIRDC Publication No 05/027. rirdc.infoservices.com.au The specific composition, color, aroma, and flavor of any batch of honey depend on the flowers foraged by bees that produced the honey.\n\nOne 1980 study found that mixed floral honey from several United States regions typically contains:\n* Fructose: 38.2%\n* Glucose: 31.3%\n* Maltose: 7.1%\n* Sucrose: 1.3%\n* Water: 17.2%\n* Higher sugars: 1.5%\n* Ash: 0.2%\n* Other/undetermined: 3.2%\n\nA 2013 NMR spectroscopy study of 20 different honeys from Germany found that their sugar contents comprised:\n* Fructose: 28% to 41%\n* Glucose: 22% to 35%\nThe average ratio was 56% fructose to 44% glucose, but the ratios in the individual honeys ranged from a high of 64% fructose and 36% glucose (one type of flower honey; table 3 in reference) to a low of 50% fructose and 50% glucose (a different floral source). This NMR method was not able to quantify maltose, galactose, and the other minor sugars as compared to fructose and glucose.\n\nMedical\n\nWounds and burns \n\nSome evidence shows that honey may help healing in skin wounds after surgery and mild (partial thickness) burns when used in a dressing, but in general, the evidence for the use of honey in wound treatment is of such low quality that firm conclusions cannot be drawn. Evidence does not support the use of honey-based products in the treatment of venous stasis ulcers or ingrown toenail.\n\nAntibiotic\n\nComponents of honey under preliminary research for their potential antibacterial properties include methylglyoxal, hydrogen peroxide, and royalisin (also called defensin-1).\n\nCough\n\nFor chronic and acute coughs, a Cochrane review found no strong evidence for or against the use of honey. For treating children, the study concluded that honey possibly helps more than no treatment.\n\nThe UK Medicines and Healthcare Products Regulatory Agency recommends avoiding giving over the counter cough and common cold medication to children under six, and suggests \"a homemade remedy containing honey and lemon is likely to be just as useful and safer to take\", but warns that honey should not be given to babies because of the risk of infant botulism. The World Health Organization recommends honey as a treatment for coughs and sore throats, including for children, stating that no reason exists to believe it is less effective than a commercial remedy. Honey is recommended by one Canadian physician for children over the age of one for the treatment of coughs, as it is deemed as effective as dextromethorphan and more effective than diphenhydramine.\n\nOther\n\nNo evidence shows the benefit of using honey to treat cancer, although honey may be useful for controlling side effects of radiation therapy or chemotherapy applied in cancer treatment.\n\nConsumption is sometimes advocated as a treatment for seasonal allergies due to pollen, but  scientific evidence to support the claim is inconclusive. Honey is generally considered ineffective for the treatment of allergic conjunctivitis.\n\nAlthough the majority of calories in honey is from fructose, honey does not cause increased weight gain and fructose by itself is not an independent factor for weight gain.  \n\nHealth hazards\n\nAlthough honey is generally safe when taken in typical food amounts, there are various, potential adverse effects or interactions it may have in combination with excessive consumption, existing disease conditions or drugs. Included among these are mild reactions to high intake, such as anxiety, insomnia, or hyperactivity in about 10% of children, according to one study. No symptoms of anxiety, insomnia, or hyperactivity were detected with honey consumption compared to placebo, according to another study. Honey consumption may interact adversely with existing allergies, high blood sugar levels (as in diabetes), or anticoagulants used to control bleeding, among other clinical conditions.\n\nPeople who have a weakened immune system may be at risk of bacterial or fungal infection from eating honey, although there is no high-quality clinical evidence that this occurs commonly.\n\nBotulism\n\nInfants can develop botulism after consuming honey contaminated with Clostridium botulinum endospores.\n\nInfantile botulism shows geographical variation. In the UK, only six cases have been reported between 1976 and 2006, yet the U.S. has much higher rates: 1.9 per 100,000 live births, 47.2% of which are in California.[https://www.cdc.gov/ncidod/dbmd/diseaseinfo/files/botulism.PDF Botulism in the United States, 1899–1996], Handbook for Epidemiologists, Clinicians, and Laboratory Workers, Atlanta, GA. Centers for Disease Control and Prevention (1998) While the risk honey poses to infant health is small, taking the risk is not recommended until after one year of age, and then giving honey is considered safe.[http://edis.ifas.ufl.edu/AA142 Infant Botulism and Honey]. Edis.ifas.ufl.edu. Retrieved on 9 January 2012.\n\nToxic honey\n\nMad honey intoxication is a result of eating honey containing grayanotoxins. Honey produced from flowers of rhododendrons, mountain laurels, sheep laurel, and azaleas may cause honey intoxication. Symptoms include dizziness, weakness, excessive perspiration, nausea, and vomiting. Less commonly, low blood pressure, shock, heart rhythm irregularities, and convulsions may occur, with rare cases resulting in death. Honey intoxication is more likely when using \"natural\" unprocessed honey and honey from farmers who may have a small number of hives. Commercial processing, with pooling of honey from numerous sources, is thought to dilute any toxins.[https://web.archive.org/web/20130308010321/http://www.fda.gov/Food/FoodSafety/FoodborneIllness/FoodborneIllnessFoodbornePathogensNaturalToxins/BadBugBook/ucm071128.htm] in the Foodborne Pathogenic Microorganisms and Natural Toxins Handbook, FDA Center for Food Safety and Applied Nutrition.\n\nToxic honey may also result when bees are proximate to tutu bushes (Coriaria arborea) and the vine hopper insect (Scolypopa australis). Both are found throughout New Zealand. Bees gather honeydew produced by the vine hopper insects feeding on the tutu plant. This introduces the poison tutin into honey. Only a few areas in New Zealand (the Coromandel Peninsula, Eastern Bay of Plenty and the Marlborough Sounds) frequently produce toxic honey. Symptoms of tutin poisoning include vomiting, delirium, giddiness, increased excitability, stupor, coma, and violent convulsions. To reduce the risk of tutin poisoning, humans should not eat honey taken from feral hives in the risk areas of New Zealand. Since December 2001, New Zealand beekeepers have been required to reduce the risk of producing toxic honey by closely monitoring tutu, vine hopper, and foraging conditions within 3 km of their apiary.  Intoxication is rarely dangerous.\n\nHistory and culture\n\nHoney use and production has a long and varied history. In many cultures, honey has associations that go beyond its use as a food. It is frequently used as a talisman and symbol of sweetness.\n\nAncient times\n\nHoney collection is an ancient activity. Humans apparently began hunting for honey at least 8,000 years ago, as evidenced by a cave painting in Valencia, Spain.Crane, Eva (1983) The Archaeology of Beekeeping, Cornell University Press,  The painting is a Mesolithic rock painting, showing two honey hunters collecting honey and honeycomb from a wild bee nest. The figures are depicted carrying baskets or gourds, and using a ladder or series of ropes to reach the wild nest.\n\nThe greater honeyguide bird guides humans to wild bee hives and this behavior may have evolved with early hominids.Short, Lester, Horne, Jennifer and Diamond, A. W. (2003). \"Honeyguides\". In Christopher Perrins (Ed.). Firefly Encyclopedia of Birds. Firefly Books. pp. 396–397. .\n\nThe oldest known honey remains were found in the country of Georgia. Archaeologists found honey remains on the inner surface of clay vessels unearthed in an ancient tomb, dating back some 4,700–5,500 years.[http://www.cncworld.tv/news/v_show/23243_Georgian_ancient_honey.shtml Georgian ancient honey]. cncworld.tv (31 March 2012). Retrieved on 10 July 2012.[http://www.eurasianet.org/node/65204 Report: Georgia Unearths the World’s Oldest Honey]. EurasiaNet (30 March 2012). Retrieved on 3 July 2015. In ancient Georgia, several types of honey were buried with a person for their journey into the afterlife, including linden, berry, and meadow-flower varieties.[http://guildofscientifictroubadours.com/2012/04/02/the-worlds-first-winemakers-were-the-worlds-first-beekeepers/ The world's first winemakers were the world's first beekeepers.] guildofscientifictroubadours.com (2 April 2012). Retrieved on 10 July 2012.\n\nIn ancient Egypt, honey was used to sweeten cakes and biscuits, and was used in many other dishes. Ancient Egyptian and Middle Eastern peoples also used honey for embalming the dead.Larry Gonick The Cartoon History of the Universe Vol.2 The fertility god of Egypt, Min, was offered honey.\n\nIn ancient Greece, honey was produced from the Archaic to the Hellenistic periods. In 594 BC, beekeeping around Athens was so widespread that Solon passed a law about it: \"He who sets up hives of bees must put them 300 ft away from those already installed by another\". Greek archaeological excavations of pottery located ancient hives. According to Columella, Greek beekeepers of the Hellenistic period did not hesitate to move their hives over rather long distances to maximise production, taking advantage of the different vegetative cycles in different regions.\n\nIn the absence of sugar, honey was an integral sweetening ingredient in Greek and Roman cuisine. During Roman times, honey was part of many recipes and it is mentioned in the work of many authors, such as Virgil, Pliny, Cicero, and others.\n\nThe spiritual and therapeutic use of honey in ancient India is documented in both the Vedas and the Ayurveda texts, which were both composed at least 4,000 years ago.\n\nBeekeeping in ancient China has existed since ancient times and appears to be untraceable to its origin. In the book Golden Rules of Business Success written by Fan Li (or Tao Zhu Gong) during the Spring and Autumn period, some parts mention the art of beekeeping and the importance of the quality of the wooden box for beekeeping that can affect the quality of its honey.\n\nHoney was also cultivated in ancient Mesoamerica. The Maya used honey from the stingless bee for culinary purposes, and continue to do so today. The Maya also regard the bee as sacred (see Mayan stingless bees of Central America).\n\nSome cultures believed honey had many practical health uses. It was used as an ointment for rashes and burns, and to help soothe sore throats when no other practices were available.\n\nFolk medicine and wound research\n\nIn myths and folk medicine, honey has been used both orally and topically to treat various ailments including gastric disturbances, ulcers, skin wounds, and skin burns by ancient Greeks and Egyptians, and in Ayurveda and traditional Chinese medicine.\n\nProposed for treating wounds and burns, honey may have antimicrobial properties as first reported in 1892 and be useful as a safe, improvisational wound treatment. Though its supposed antimicrobial properties may be due to high osmolarity even when diluted with water, it is more effective than plain sugar water of a similar viscosity. Definitive clinical conclusions about the efficacy and safety of treating wounds, however, are not possible from this limited research.\n\nThe flora that bees use to make the honey may have a role in its properties, particularly by bees foraging from the manuka myrtle,  Leptospermum scoparium, as proposed in one study.\n\nReligious significance\n\nAncient Greeks Religion\nIn ancient Greek religion, the food of Zeus and the 12 Gods of Olympus was honey in the form of nectar and ambrosia.\n\nHinduism \nIn Hinduism, honey (Madhu) is one of the five elixirs of immortality (Panchamrita). In temples, honey is poured over the deities in a ritual called Madhu abhisheka. The Vedas and other ancient literature mention the use of honey as a great medicinal and health food.[http://www.fjnet.com/english/society/t20061117_41041.htm A Meaningful Story of Buddha, Elephant and Monkey]  by Marguerite Theophil, United Press International, 16 November 2006, accessed 9 August 2008\n\nJudaism \nIn Jewish tradition, honey is a symbol for the new year, Rosh Hashanah. At the traditional meal for that holiday, apple slices are dipped in honey and eaten to bring a sweet new year. Some Rosh Hashanah greetings show honey and an apple, symbolizing the feast. In some congregations, small straws of honey are given out to usher in the new year.\n\nThe Hebrew Bible contains many references to honey. In the Book of Judges, Samson found a swarm of bees and honey in the carcass of a lion (14:8). In Old Testament law, offerings were made in the temple to God. The Book of Leviticus says that \"Every grain offering you bring to the Lord must be made without yeast, for you are not to burn any yeast or honey in a food offering presented to the Lord\" (2:11). In the Books of Samuel, Jonathan is forced into a confrontation with his father King Saul after eating honey in violation of a rash oath Saul has made (). Proverbs 16:24 in the JPS Tanakh 1917 version says \"Pleasant words are as a honeycomb, Sweet to the soul, and health to the bones.\" Book of Exodus famously describes the Promised Land as a \"land flowing with milk and honey\" (33:3). However, most Biblical commentators write that the original Hebrew in the Bible (דבש devash) refers to the sweet syrup produced from the juice of dates (silan).Berel, Rabbi. (24 September 2005) [http://www.aish.com/h/hh/rh/48959531.html Apples and Honey]. Aish.com. Retrieved on 6 February 2011. In 2005 an apiary dating from the 10th century B.C. was found in Tel Rehov, Israel that contained 100 hives and is estimated to produce half a ton of honey annually. Pure honey is considered kosher, though it is produced by a flying insect, a non-kosher creature; other products of non-kosher animals are not kosher.[http://www.chabad.org/library/article_cdo/aid/712032/jewish/Why-Is-honey-kosher.htm \"Why is honey kosher?\"] Chabad.org. Retrieved 30 November 2010.\n\nBuddhism \nIn Buddhism, honey plays an important role in the festival of Madhu Purnima, celebrated in India and Bangladesh. The day commemorates Buddha's making peace among his disciples by retreating into the wilderness. The legend has it that while he was there, a monkey brought him honey to eat. On Madhu Purnima, Buddhists remember this act by giving honey to monks. The monkey's gift is frequently depicted in Buddhist art.\n\nChristianity \nIn the Christian New Testament, Matthew 3:4, John the Baptist is said to have lived for a long period of time in the wilderness on a diet consisting of locusts and wild honey.\n\nIslam\nIn Islam,  an entire chapter (Surah) in the Qur'an is called an-Nahl (the Bees). According to his teachings (hadith), Muhammad strongly recommended honey for healing purposes.Sahih Bukhari vol. 7, book 71, number 584, 585, 588 and 603. The Qur'an promotes honey as a nutritious and healthy food. Below is the English translation of those specific verses:. Honey. http://en.wikipedia.org/?curid=14361."
  }
}
