{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=5920",
  "eid" : "d8b72390-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778443337,
  "textBody" : "The Celtic languages (usually pronounced but sometimes) are descended from Proto-Celtic, or \"Common Celtic\"; a branch of the greater Indo-European language family.The Celtic languages:an overview, Donald MacAulay, The Celtic Languages, ed. Donald MacAulay, (Cambridge University Press, 1992), 3. The term \"Celtic\" was first used to describe this language group by Edward Lhuyd in 1707,Cunliffe, Barry W. 2003. The Celts: a very short introduction. pg.48 following Paul-Yves Pezron who had already made the explicit link between the Celts described by classical writers and the Welsh and Breton languages.The Celts, Alice Roberts, (Heron Books 2015)\n\nModern Celtic languages are mostly spoken on the north-western edge of Europe, notably in Ireland, Scotland, Wales, Brittany, Cornwall, and the Isle of Man. There are also a substantial number of Welsh speakers in the Patagonia area of Argentina and some speakers of Scottish Gaelic on Cape Breton Island in Nova Scotia. Some people speak Celtic languages in the other Celtic diaspora areas of the United States,[http://www.mla.org/map_data_states&mode\nlang_tops&lang_id=636 \"Language by State – Scottish Gaelic\"]  on Modern Language Association website. Retrieved 27 December 2007 Canada, Australia,[http://www.omi.wa.gov.au/WAPeople%5CSect1%5CTable%201p04%20Aust.pdf \"Languages Spoken At Home\"]  from Australian Government Office of Multicultural Interests website. Retrieved 27 December 2007; G. Leitner, Australia's Many Voices: Australian English--The National Language, 2004, pg. 74 and New Zealand.[https://web.archive.org/web/20070927232047/http://www.stats.govt.nz/NR/rdonlyres/1C81F07B-28C6-4DDD-8EBA-80C592E8022A/0/20languagespokentotalresponse.xls Languages Spoken:Total Responses] from Statistics New Zealand website. Retrieved 5 August 2008 In all these areas, the Celtic languages are now only spoken by minorities though there are continuing efforts at revitalisation. Welsh is the only Celtic language not classified as \"endangered\" by UNESCO.\n\nDuring the 1st millennium BC, they were spoken across much of Europe, in the Iberian Peninsula, from the Atlantic and North Sea coastlines, up to the Rhine valley and down the Danube valley to the Black Sea, the northern Balkan Peninsula and in central Asia Minor. The spread to Cape Breton and Patagonia occurred in modern times.\n\nLiving languages\n\nSIL Ethnologue lists six living Celtic languages, of which four have retained a substantial number of native speakers. These are the Goidelic languages (i.e. Irish and Scottish Gaelic, which are both descended from Middle Irish) and the Brittonic languages (i.e. Welsh and Breton, which are both descended from Common Brittonic).\n\nThe other two, Cornish (a Brittonic language) and Manx (a Goidelic language), died in modern times with their presumed last native speakers in 1777 and 1974 respectively. For both these languages, however, revitalisation movements have led to the adoption of these languages by adults and children and produced some native speakers.\n\nTaken together, there were roughly one million native speakers of Celtic languages as of the 2000s. In 2010, there were more than 1.4 million speakers of Celtic languages.\n\nDemographics\n\nMixed languages\n\n* Shelta, based largely on Irish with influence from an undocumented source (some 86,000 speakers in 2009).\n* Some forms of Welsh-Romani or Kååle also combined Romany itself with Welsh language and English language forms (extinct).\n* Beurla-reagaird, Highland travellers' language\n\nClassification\n\nCeltic is divided into various branches:\n\n* Lepontic, the oldest attested Celtic language (from the 6th century BC). Anciently spoken in Switzerland and in Northern-Central Italy, from the Alps to Umbria. Coins with Lepontic inscriptions have been found in Noricum and Gallia Narbonensis.MORANDI 2004, pp. 702-703, n. 277\n\n* Northeastern Hispano-Celtic/Eastern Hispano-Celtic or Celtiberian, anciently spoken in the Iberian peninsula,  in the eastern part of Old Castile and south of Aragon. Modern provinces of Segovia, Burgos, Soria, Guadalajara, Cuenca, Zaragoza and Teruel. The relationship of Celtiberian with Gallaecian, in the northwest of the peninsula, is uncertain.Villar F., B. M. Prósper. (2005). Vascos, Celtas e Indoeuropeos: genes y lenguas. Ediciones Universidad de Salamanca. pgs. 333–350. .\n* Northwestern Hispano-Celtic/Western Hispano-Celtic, anciently spoken in the northwest of the peninsula (modern northern Portugal, Galicia, Asturias, Cantabria and parts of modern Old Castile).\"In the northwest of the Iberian Peninula, and more specifically between the west and north Atlantic coasts and an imaginary line running north-south and linking Oviedo and Merida, there is a corpus of Latin inscriptions with particular characteristics of its own. This corpus contains some linguistic features that are clearly Celtic and others that in our opinion are not Celtic. The former we shall group, for the moment, under the label northwestern Hispano-Celtic. The latter are the same features found in well-documented contemporary inscriptions in the region occupied by the Lusitanians, and therefore belonging to the variety known as LUSITANIAN, or more broadly as GALLO-LUSITANIAN. As we have already said, we do not consider this variety to belong to the Celtic language family.\" Jordán Colera 2007: p.750\n* Gaulish languages, including Galatian and possibly Noric. These languages were once spoken in a wide arc from Belgium to Turkey. They are now all extinct.\n* Brittonic, including the living languages Breton, Cornish, and Welsh, and the extinct languages Cumbric and Pictish though Pictish may be a sister language rather than a daughter of Common Brittonic.Kenneth H. Jackson suggested that there were two Pictish languages, a pre-Indo-European one and a Pritenic Celtic one. This has been challenged by some scholars. See Katherine Forsyth's \"Language in Pictland: the case against 'non-Indo-European Pictish'\"   . See also the introduction by James & Taylor to the \"Index of Celtic and Other Elements in W. J. Watson's 'The History of the Celtic Place-names of Scotland'\"  . Compare also the treatment of Pictish in Price's The Languages of Britain (1984) with his Languages in Britain & Ireland (2000). Before the arrival of Scotti on the Isle of Man in the 9th century, there may have been a Brittonic language in the Isle of Man.\n* Goidelic, including the living languages Irish, Manx, and Scottish Gaelic.\n\nScholarly handling of the Celtic languages has been rather argumentative owing to scarceness of primary source data. Some scholars (such as Cowgill 1975; McCone 1991, 1992; and Schrijver 1995) distinguish Continental Celtic and Insular Celtic, arguing that the differences between the Goidelic and Brittonic languages arose after these split off from the Continental Celtic languages. Other scholars (such as Schmidt 1988) distinguish between P-Celtic and Q-Celtic, putting most of the Gaulish and Brittonic languages in the former group and the Goidelic and Celtiberian languages in the latter. The P-Celtic languages (also called Gallo-Brittonic) are sometimes seen (for example by Koch 1992) as a central innovating area as opposed to the more conservative peripheral Q-Celtic languages.\n\nThe Breton language is Brittonic, not Gaulish, though there may be some input from the latter, having been introduced from Southwestern regions of Britain in the post-Roman era and having evolved into Breton – still partially intelligible by modern Welsh and Cornish speakers.\n\nIn the P/Q classification schema, the first language to split off from Proto-Celtic was Gaelic. It has characteristics that some scholars see as archaic, but others see as also being in the Brittonic languages (see Schmidt). In the Insular/Continental classification schema, the split of the former into Gaelic and Brittonic is seen as being late.\n\nThe distinction of Celtic into these four sub-families most likely occurred about 900 BC according to Gray and Atkinson but, because of estimation uncertainty, it could be any time between 1200 and 800 BC. However, they only considered Gaelic and Brythonic. The controversial paper by Forster and Toth included Gaulish and put the break-up much earlier at 3200 BC ± 1500 years. They support the Insular Celtic hypothesis. The early Celts were commonly associated with the archaeological Urnfield culture, the Hallstatt culture, and the La Tène culture, though the earlier assumption of association between language and culture is now considered to be less strong.r\n\nThere are legitimate scholarly arguments in favour of both the Insular Celtic hypothesis and the P-Celtic/Q-Celtic hypothesis. Proponents of each schema dispute the accuracy and usefulness of the other's categories. However, since the 1970s the division into Insular and Continental Celtic has become the more widely held view (Cowgill 1975; McCone 1991, 1992; Schrijver 1995), but in the middle of the 1980s, the P-Celtic/Q-Celtic hypothesis found new supporters (Lambert 1994), because of the inscription on the Larzac piece of lead (1983), the analysis of which reveals another common phonetical innovation -nm- > -nu (Gaelic ainm / Gaulish anuana, Old Welsh enuein \"names\"), that is less accidental than only one. The discovery of a third common innovation, would allow the specialists to come to the conclusion of a Gallo-Brittonic dialect (Schmidt 1986; Fleuriot 1986).\n\nThe interpretation of this and further evidence is still quite contested, and the main argument in favour of Insular Celtic is connected with the development of the verbal morphology and the syntax in Irish and British Celtic, which Schumacher regards as convincing, while he considers the P-Celtic/Q-Celtic division unimportant and treats Gallo-Brittonic as an outdated hypothesis. Stifter affirms that the Gallo-Brittonic view is \"out of favour\" in the scholarly community as of 2008 and the Insular Celtic hypothesis \"widely accepted\".\n\nWhen referring only to the modern Celtic languages, since no Continental Celtic language has living descendants, \"Q-Celtic\" is equivalent to \"Goidelic\" and \"P-Celtic\" is equivalent to \"Brittonic\".\n\nWithin the Indo-European family, the Celtic languages have sometimes been placed with the Italic languages in a common Italo-Celtic subfamily, a hypothesis that is now largely discarded, in favour of the assumption of language contact between pre-Celtic and pre-Italic communities.\n\nHow the family tree of the Celtic languages is ordered depends on which hypothesis is used:\n\n\"Insular Celtic hypothesis\"\n* Proto-Celtic\n** Continental Celtic\n*** Celtiberian\n*** Gallaecian\n*** Gaulish\n** Insular Celtic\n*** Brittonic\n*** Goidelic\n\n\"P-Celtic hypothesis\"\n* Proto-Celtic\n** Q-Celtic\n*** Celtiberian\n*** Gallaecian\n*** Goidelic\n** P-Celtic\n*** Gaulish\n*** Brittonic\n\nEska (2010)\n\nEska (2010)Joseph F. Eska (2010) \"The emergence of the Celtic languages\". In Martin J. Ball and Nicole Müller (eds.), The Celtic languages. Routledge. evaluates the evidence as supporting the following tree, based on shared innovations, though it is not always clear that the innovations are not areal features.  It seems likely that Celtiberian split off before Cisalpine Celtic, but the evidence for this is not robust.  On the other hand, the unity of Gaulish, Goidelic, and Brittonic is reasonably secure.  Schumacher (2004, p. 86) had already cautiously considered this grouping to be likely genetic, based, among others, on the shared reformation of the sentence-initial, fully inflecting relative pronoun *i̯os, *i̯ā, *i̯od into an uninflected enclitic particle.  Eska sees Cisalpine Gaulish as more akin to Lepontic than to Transalpine Gaulish.\n\n* Celtic\n** Celtiberian\n** Gallaecian\n** Nuclear Celtic?\n*** Cisalpine Celtic: Lepontic → Cisalpine Gaulish\n*** Transalpine–Goidelic–Brittonic (secure)\n**** Transalpine Gaulish (\"Transalpine Celtic\")\n**** Insular Celtic\n***** Goidelic\n***** Brittonic\n\nEska considers a division of Transalpine–Goidelic–Brittonic into Transalpine and Insular Celtic to be most probable because of the greater number of innovations in Insular Celtic than in P-Celtic, and because the Insular Celtic languages were probably not in great enough contact for those innovations to spread as part of a sprachbund.  However, if they have another explanation (such as an SOV substratum language), then it is possible that P-Celtic is a valid clade, and the top branching would be:\n\n* Transalpine–Goidelic–Brittonic (P-Celtic hypothesis)\n** Goidelic\n** Gallo-Brittonic\n*** Transalpine Gaulish (\"Transalpine Celtic\")\n*** Brittonic\n\nCharacteristics\n\nAlthough there are many differences between the individual Celtic languages, they do show many family resemblances.\n\n* consonant mutations (Insular Celtic only)\n* inflected prepositions (Insular Celtic only)\n* two grammatical genders (modern Insular Celtic only; Old Irish and the Continental languages had three genders)\n* a vigesimal number system (counting by twenties)\n** Cornish ' \"fifty-six\" (literally \"sixteen and two twenty\")\n* verb–subject–object (VSO) word order (probably Insular Celtic only)\n* an interplay between the subjunctive, future, imperfect, and habitual, to the point that some tenses and moods have ousted others\n* an impersonal or autonomous verb form serving as a passive or intransitive\n** Welsh ' \"I teach\" vs. ' \"is taught, one teaches\"\n** Irish ' \"I teach\" vs. ' \"is taught, one teaches\"\n* no infinitives, replaced by a quasi-nominal verb form called the verbal noun or verbnoun\n* frequent use of vowel mutation as a morphological device, e.g. formation of plurals, verbal stems, etc.\n* use of preverbal particles to signal either subordination or illocutionary force of the following clause\n** mutation-distinguished subordinators/relativisers\n** particles for negation, interrogation, and occasionally for affirmative declarations\n* infixed pronouns positioned between particles and verbs\n* lack of simple verb for the imperfective \"have\" process, with possession conveyed by a composite structure, usually BE + preposition\n** Cornish ' \"I have a cat\", literally \"there is a cat to me\"\n* use of periphrastic constructions to express verbal tense, voice, or aspectual distinctions\n* distinction by function of the two versions of BE verbs traditionally labelled substantive (or existential) and copula\n* bifurcated demonstrative structure\n* suffixed pronominal supplements, called confirming or supplementary pronouns\n* use of singulars or special forms of counted nouns, and use of a singulative suffix to make singular forms from plurals, where older singulars have disappeared\n\nExamples:\n: (Literal translation) Don't bother with son the beggar's and not will-bother son the beggar's with-you.\n* ' is the genitive of '. The ' the result of affection; the ' is the lenited form of '.\n* ' is the second person singular inflected form of the preposition '.\n* The order is verb–subject–object (VSO) in the second half. Compare this to English or French (and possibly Continental Celtic) which are normally subject–verb–object in word order.\n\n: (Literally) four on fifteen and four twenties\n* ' is a mutated form of ', which is ' (\"five\") plus ' (\"ten\"). Likewise, ' is a mutated form of '.\n* The multiples of ten are '.*\n\nComparison table\n\nExamples\n\nArticle 1 of the Universal Declaration of Human Rights:\n\nAll human beings are born free and equal in dignity and rights. They are endowed with reason and conscience and should act towards one another in a spirit of brotherhood.\n* \n* \n* \n* \n* \n* \n\nPossibly Celtic languages\n\nIt has been suggested that several poorly-documented languages may possibly have been Celtic.\n\n* Camunic is an extinct language which was spoken in the first millennium BC in the Valcamonica and Valtellina valleys of the Central Alps. It has most recently been proposed to be a Celtic language.\n* Ligurian was spoken in the Northern Mediterranean Coast straddling the southeast French and northwest Italian coasts, including parts of Tuscany, Elba island and Corsica. Xavier Delamarre argues that Ligurian was a Celtic language, similar to, but not the same as Gaulish. The Ligurian-Celtic question is also discussed by Barruol (1999). Ancient Ligurian is either listed as Celtic (epigraphic), or Para-Celtic (onomastic).\n* Lusitanian was spoken in the area between the Douro and Tagus rivers of western Iberia (a region straddling the present border of Portugal and Spain). It is known from only five inscriptions and various place names. It is an Indo-European language and some scholars have proposed that it may be a para-Celtic language, which evolved alongside Celtic or formed a dialect continuum or sprachbund with Tartessian and Gallaecian. This is tied to a theory of an Iberian origin for the Celtic languages.\nIt is also possible that the Q-Celtic languages alone, including Goidelic, originated in western Iberia (a theory that was first put forward by Edward Lhuyd in 1707) or shared a common linguistic ancestor with Lusitanian.[https://books.google.com/books?idfDYyBwAAQBAJ&pg\nPA8&lpgPA8&dq\nedward+lhuyd+lusitanian+celtic&sourcebl&ots\np9NxkvOEqy&sigslJhEQWgllehbW7lzwuuJasMBds&hl\npt-PT&saX&ved\n0CDsQ6AEwA2oVChMIyt-c0-D2xgIVCyDbCh3uzQps#vonepage&q\nedward%20lhuyd%20lusitanian%20celtic&ffalse Unity in Diversity, Volume 2: Cultural and Linguistic Markers of the Concept] Editors: Sabine Asmus and Barbara Braid. Google Books. Secondary evidence for this hypothesis has been found in research by biological scientists, who have identified (firstly) deep-rooted similarities in human DNA found precisely in both the former Lusitania and Ireland, and; (secondly) the so-called \"Lusitanian distribution\" of animals and plants unique to western Iberia and Ireland.  Both of these phenomena are now generally believed to have resulted from human emigration from Iberia to Ireland, during the late Paleolithic or early Mesolithic eras.\nOther scholars see greater linguistic affinities between Lusitanian, proto-Italic and Old European.The inscription of Cabeço das Fráguas revisited. Lusitanian and Alteuropäisch populations in the West of the Iberian Peninsula Transactions of the Philological Society vol. 97 (2003)\n* Pictish was for a long time thought to be a pre-Celtic, non-Indo-European language of Scotland. Some believe it was an Insular Celtic language allied to the P-Celtic language Brittonic (descendants Welsh, Cornish, Cumbric, Breton).; ; ; \n* Rhaetian was spoken in central parts of present-day Switzerland, Tyrol in Austria, and the Alpine regions of northeastern Italy. It is documented by a limited number of short inscriptions (found through Northern Italy and Western Austria) in two variants of the Etruscan alphabet. Its linguistic categorization is not clearly established, and it presents a confusing mixture of what appear to be Etruscan, Indo-European, and uncertain other elements. Howard Hayes Scullard argues that Rhaetian was also a Celtic language.\n* Tartessian, spoken in the southwest of the Iberia Peninsula (mainly southern Portugal and southwestern Spain). Tartessian is known by 95 inscriptions, with the longest having 82 readable signs. John T. Koch argues that Tartessian was also a Celtic language.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Celtic languages" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=5920" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Celtic languages (usually pronounced but sometimes) are descended from Proto-Celtic, or \"Common Celtic\"; a branch of the greater Indo-European language family.The Celtic languages:an overview, Donald MacAulay, The Celtic Languages, ed. Donald MacAulay, (Cambridge University Press, 1992), 3. The term \"Celtic\" was first used to describe this language group by Edward Lhuyd in 1707,Cunliffe, Barry W. 2003. The Celts: a very short introduction. pg.48 following Paul-Yves Pezron who had already made the explicit link between the Celts described by classical writers and the Welsh and Breton languages.The Celts, Alice Roberts, (Heron Books 2015)\n\nModern Celtic languages are mostly spoken on the north-western edge of Europe, notably in Ireland, Scotland, Wales, Brittany, Cornwall, and the Isle of Man. There are also a substantial number of Welsh speakers in the Patagonia area of Argentina and some speakers of Scottish Gaelic on Cape Breton Island in Nova Scotia. Some people speak Celtic languages in the other Celtic diaspora areas of the United States,[http://www.mla.org/map_data_states&mode\nlang_tops&lang_id=636 \"Language by State – Scottish Gaelic\"]  on Modern Language Association website. Retrieved 27 December 2007 Canada, Australia,[http://www.omi.wa.gov.au/WAPeople%5CSect1%5CTable%201p04%20Aust.pdf \"Languages Spoken At Home\"]  from Australian Government Office of Multicultural Interests website. Retrieved 27 December 2007; G. Leitner, Australia's Many Voices: Australian English--The National Language, 2004, pg. 74 and New Zealand.[https://web.archive.org/web/20070927232047/http://www.stats.govt.nz/NR/rdonlyres/1C81F07B-28C6-4DDD-8EBA-80C592E8022A/0/20languagespokentotalresponse.xls Languages Spoken:Total Responses] from Statistics New Zealand website. Retrieved 5 August 2008 In all these areas, the Celtic languages are now only spoken by minorities though there are continuing efforts at revitalisation. Welsh is the only Celtic language not classified as \"endangered\" by UNESCO.\n\nDuring the 1st millennium BC, they were spoken across much of Europe, in the Iberian Peninsula, from the Atlantic and North Sea coastlines, up to the Rhine valley and down the Danube valley to the Black Sea, the northern Balkan Peninsula and in central Asia Minor. The spread to Cape Breton and Patagonia occurred in modern times.\n\nLiving languages\n\nSIL Ethnologue lists six living Celtic languages, of which four have retained a substantial number of native speakers. These are the Goidelic languages (i.e. Irish and Scottish Gaelic, which are both descended from Middle Irish) and the Brittonic languages (i.e. Welsh and Breton, which are both descended from Common Brittonic).\n\nThe other two, Cornish (a Brittonic language) and Manx (a Goidelic language), died in modern times with their presumed last native speakers in 1777 and 1974 respectively. For both these languages, however, revitalisation movements have led to the adoption of these languages by adults and children and produced some native speakers.\n\nTaken together, there were roughly one million native speakers of Celtic languages as of the 2000s. In 2010, there were more than 1.4 million speakers of Celtic languages.\n\nDemographics\n\nMixed languages\n\n* Shelta, based largely on Irish with influence from an undocumented source (some 86,000 speakers in 2009).\n* Some forms of Welsh-Romani or Kååle also combined Romany itself with Welsh language and English language forms (extinct).\n* Beurla-reagaird, Highland travellers' language\n\nClassification\n\nCeltic is divided into various branches:\n\n* Lepontic, the oldest attested Celtic language (from the 6th century BC). Anciently spoken in Switzerland and in Northern-Central Italy, from the Alps to Umbria. Coins with Lepontic inscriptions have been found in Noricum and Gallia Narbonensis.MORANDI 2004, pp. 702-703, n. 277\n\n* Northeastern Hispano-Celtic/Eastern Hispano-Celtic or Celtiberian, anciently spoken in the Iberian peninsula,  in the eastern part of Old Castile and south of Aragon. Modern provinces of Segovia, Burgos, Soria, Guadalajara, Cuenca, Zaragoza and Teruel. The relationship of Celtiberian with Gallaecian, in the northwest of the peninsula, is uncertain.Villar F., B. M. Prósper. (2005). Vascos, Celtas e Indoeuropeos: genes y lenguas. Ediciones Universidad de Salamanca. pgs. 333–350. .\n* Northwestern Hispano-Celtic/Western Hispano-Celtic, anciently spoken in the northwest of the peninsula (modern northern Portugal, Galicia, Asturias, Cantabria and parts of modern Old Castile).\"In the northwest of the Iberian Peninula, and more specifically between the west and north Atlantic coasts and an imaginary line running north-south and linking Oviedo and Merida, there is a corpus of Latin inscriptions with particular characteristics of its own. This corpus contains some linguistic features that are clearly Celtic and others that in our opinion are not Celtic. The former we shall group, for the moment, under the label northwestern Hispano-Celtic. The latter are the same features found in well-documented contemporary inscriptions in the region occupied by the Lusitanians, and therefore belonging to the variety known as LUSITANIAN, or more broadly as GALLO-LUSITANIAN. As we have already said, we do not consider this variety to belong to the Celtic language family.\" Jordán Colera 2007: p.750\n* Gaulish languages, including Galatian and possibly Noric. These languages were once spoken in a wide arc from Belgium to Turkey. They are now all extinct.\n* Brittonic, including the living languages Breton, Cornish, and Welsh, and the extinct languages Cumbric and Pictish though Pictish may be a sister language rather than a daughter of Common Brittonic.Kenneth H. Jackson suggested that there were two Pictish languages, a pre-Indo-European one and a Pritenic Celtic one. This has been challenged by some scholars. See Katherine Forsyth's \"Language in Pictland: the case against 'non-Indo-European Pictish'\"   . See also the introduction by James & Taylor to the \"Index of Celtic and Other Elements in W. J. Watson's 'The History of the Celtic Place-names of Scotland'\"  . Compare also the treatment of Pictish in Price's The Languages of Britain (1984) with his Languages in Britain & Ireland (2000). Before the arrival of Scotti on the Isle of Man in the 9th century, there may have been a Brittonic language in the Isle of Man.\n* Goidelic, including the living languages Irish, Manx, and Scottish Gaelic.\n\nScholarly handling of the Celtic languages has been rather argumentative owing to scarceness of primary source data. Some scholars (such as Cowgill 1975; McCone 1991, 1992; and Schrijver 1995) distinguish Continental Celtic and Insular Celtic, arguing that the differences between the Goidelic and Brittonic languages arose after these split off from the Continental Celtic languages. Other scholars (such as Schmidt 1988) distinguish between P-Celtic and Q-Celtic, putting most of the Gaulish and Brittonic languages in the former group and the Goidelic and Celtiberian languages in the latter. The P-Celtic languages (also called Gallo-Brittonic) are sometimes seen (for example by Koch 1992) as a central innovating area as opposed to the more conservative peripheral Q-Celtic languages.\n\nThe Breton language is Brittonic, not Gaulish, though there may be some input from the latter, having been introduced from Southwestern regions of Britain in the post-Roman era and having evolved into Breton – still partially intelligible by modern Welsh and Cornish speakers.\n\nIn the P/Q classification schema, the first language to split off from Proto-Celtic was Gaelic. It has characteristics that some scholars see as archaic, but others see as also being in the Brittonic languages (see Schmidt). In the Insular/Continental classification schema, the split of the former into Gaelic and Brittonic is seen as being late.\n\nThe distinction of Celtic into these four sub-families most likely occurred about 900 BC according to Gray and Atkinson but, because of estimation uncertainty, it could be any time between 1200 and 800 BC. However, they only considered Gaelic and Brythonic. The controversial paper by Forster and Toth included Gaulish and put the break-up much earlier at 3200 BC ± 1500 years. They support the Insular Celtic hypothesis. The early Celts were commonly associated with the archaeological Urnfield culture, the Hallstatt culture, and the La Tène culture, though the earlier assumption of association between language and culture is now considered to be less strong.r\n\nThere are legitimate scholarly arguments in favour of both the Insular Celtic hypothesis and the P-Celtic/Q-Celtic hypothesis. Proponents of each schema dispute the accuracy and usefulness of the other's categories. However, since the 1970s the division into Insular and Continental Celtic has become the more widely held view (Cowgill 1975; McCone 1991, 1992; Schrijver 1995), but in the middle of the 1980s, the P-Celtic/Q-Celtic hypothesis found new supporters (Lambert 1994), because of the inscription on the Larzac piece of lead (1983), the analysis of which reveals another common phonetical innovation -nm- > -nu (Gaelic ainm / Gaulish anuana, Old Welsh enuein \"names\"), that is less accidental than only one. The discovery of a third common innovation, would allow the specialists to come to the conclusion of a Gallo-Brittonic dialect (Schmidt 1986; Fleuriot 1986).\n\nThe interpretation of this and further evidence is still quite contested, and the main argument in favour of Insular Celtic is connected with the development of the verbal morphology and the syntax in Irish and British Celtic, which Schumacher regards as convincing, while he considers the P-Celtic/Q-Celtic division unimportant and treats Gallo-Brittonic as an outdated hypothesis. Stifter affirms that the Gallo-Brittonic view is \"out of favour\" in the scholarly community as of 2008 and the Insular Celtic hypothesis \"widely accepted\".\n\nWhen referring only to the modern Celtic languages, since no Continental Celtic language has living descendants, \"Q-Celtic\" is equivalent to \"Goidelic\" and \"P-Celtic\" is equivalent to \"Brittonic\".\n\nWithin the Indo-European family, the Celtic languages have sometimes been placed with the Italic languages in a common Italo-Celtic subfamily, a hypothesis that is now largely discarded, in favour of the assumption of language contact between pre-Celtic and pre-Italic communities.\n\nHow the family tree of the Celtic languages is ordered depends on which hypothesis is used:\n\n\"Insular Celtic hypothesis\"\n* Proto-Celtic\n** Continental Celtic\n*** Celtiberian\n*** Gallaecian\n*** Gaulish\n** Insular Celtic\n*** Brittonic\n*** Goidelic\n\n\"P-Celtic hypothesis\"\n* Proto-Celtic\n** Q-Celtic\n*** Celtiberian\n*** Gallaecian\n*** Goidelic\n** P-Celtic\n*** Gaulish\n*** Brittonic\n\nEska (2010)\n\nEska (2010)Joseph F. Eska (2010) \"The emergence of the Celtic languages\". In Martin J. Ball and Nicole Müller (eds.), The Celtic languages. Routledge. evaluates the evidence as supporting the following tree, based on shared innovations, though it is not always clear that the innovations are not areal features.  It seems likely that Celtiberian split off before Cisalpine Celtic, but the evidence for this is not robust.  On the other hand, the unity of Gaulish, Goidelic, and Brittonic is reasonably secure.  Schumacher (2004, p. 86) had already cautiously considered this grouping to be likely genetic, based, among others, on the shared reformation of the sentence-initial, fully inflecting relative pronoun *i̯os, *i̯ā, *i̯od into an uninflected enclitic particle.  Eska sees Cisalpine Gaulish as more akin to Lepontic than to Transalpine Gaulish.\n\n* Celtic\n** Celtiberian\n** Gallaecian\n** Nuclear Celtic?\n*** Cisalpine Celtic: Lepontic → Cisalpine Gaulish\n*** Transalpine–Goidelic–Brittonic (secure)\n**** Transalpine Gaulish (\"Transalpine Celtic\")\n**** Insular Celtic\n***** Goidelic\n***** Brittonic\n\nEska considers a division of Transalpine–Goidelic–Brittonic into Transalpine and Insular Celtic to be most probable because of the greater number of innovations in Insular Celtic than in P-Celtic, and because the Insular Celtic languages were probably not in great enough contact for those innovations to spread as part of a sprachbund.  However, if they have another explanation (such as an SOV substratum language), then it is possible that P-Celtic is a valid clade, and the top branching would be:\n\n* Transalpine–Goidelic–Brittonic (P-Celtic hypothesis)\n** Goidelic\n** Gallo-Brittonic\n*** Transalpine Gaulish (\"Transalpine Celtic\")\n*** Brittonic\n\nCharacteristics\n\nAlthough there are many differences between the individual Celtic languages, they do show many family resemblances.\n\n* consonant mutations (Insular Celtic only)\n* inflected prepositions (Insular Celtic only)\n* two grammatical genders (modern Insular Celtic only; Old Irish and the Continental languages had three genders)\n* a vigesimal number system (counting by twenties)\n** Cornish ' \"fifty-six\" (literally \"sixteen and two twenty\")\n* verb–subject–object (VSO) word order (probably Insular Celtic only)\n* an interplay between the subjunctive, future, imperfect, and habitual, to the point that some tenses and moods have ousted others\n* an impersonal or autonomous verb form serving as a passive or intransitive\n** Welsh ' \"I teach\" vs. ' \"is taught, one teaches\"\n** Irish ' \"I teach\" vs. ' \"is taught, one teaches\"\n* no infinitives, replaced by a quasi-nominal verb form called the verbal noun or verbnoun\n* frequent use of vowel mutation as a morphological device, e.g. formation of plurals, verbal stems, etc.\n* use of preverbal particles to signal either subordination or illocutionary force of the following clause\n** mutation-distinguished subordinators/relativisers\n** particles for negation, interrogation, and occasionally for affirmative declarations\n* infixed pronouns positioned between particles and verbs\n* lack of simple verb for the imperfective \"have\" process, with possession conveyed by a composite structure, usually BE + preposition\n** Cornish ' \"I have a cat\", literally \"there is a cat to me\"\n* use of periphrastic constructions to express verbal tense, voice, or aspectual distinctions\n* distinction by function of the two versions of BE verbs traditionally labelled substantive (or existential) and copula\n* bifurcated demonstrative structure\n* suffixed pronominal supplements, called confirming or supplementary pronouns\n* use of singulars or special forms of counted nouns, and use of a singulative suffix to make singular forms from plurals, where older singulars have disappeared\n\nExamples:\n: (Literal translation) Don't bother with son the beggar's and not will-bother son the beggar's with-you.\n* ' is the genitive of '. The ' the result of affection; the ' is the lenited form of '.\n* ' is the second person singular inflected form of the preposition '.\n* The order is verb–subject–object (VSO) in the second half. Compare this to English or French (and possibly Continental Celtic) which are normally subject–verb–object in word order.\n\n: (Literally) four on fifteen and four twenties\n* ' is a mutated form of ', which is ' (\"five\") plus ' (\"ten\"). Likewise, ' is a mutated form of '.\n* The multiples of ten are '.*\n\nComparison table\n\nExamples\n\nArticle 1 of the Universal Declaration of Human Rights:\n\nAll human beings are born free and equal in dignity and rights. They are endowed with reason and conscience and should act towards one another in a spirit of brotherhood.\n* \n* \n* \n* \n* \n* \n\nPossibly Celtic languages\n\nIt has been suggested that several poorly-documented languages may possibly have been Celtic.\n\n* Camunic is an extinct language which was spoken in the first millennium BC in the Valcamonica and Valtellina valleys of the Central Alps. It has most recently been proposed to be a Celtic language.\n* Ligurian was spoken in the Northern Mediterranean Coast straddling the southeast French and northwest Italian coasts, including parts of Tuscany, Elba island and Corsica. Xavier Delamarre argues that Ligurian was a Celtic language, similar to, but not the same as Gaulish. The Ligurian-Celtic question is also discussed by Barruol (1999). Ancient Ligurian is either listed as Celtic (epigraphic), or Para-Celtic (onomastic).\n* Lusitanian was spoken in the area between the Douro and Tagus rivers of western Iberia (a region straddling the present border of Portugal and Spain). It is known from only five inscriptions and various place names. It is an Indo-European language and some scholars have proposed that it may be a para-Celtic language, which evolved alongside Celtic or formed a dialect continuum or sprachbund with Tartessian and Gallaecian. This is tied to a theory of an Iberian origin for the Celtic languages.\nIt is also possible that the Q-Celtic languages alone, including Goidelic, originated in western Iberia (a theory that was first put forward by Edward Lhuyd in 1707) or shared a common linguistic ancestor with Lusitanian.[https://books.google.com/books?idfDYyBwAAQBAJ&pg\nPA8&lpgPA8&dq\nedward+lhuyd+lusitanian+celtic&sourcebl&ots\np9NxkvOEqy&sigslJhEQWgllehbW7lzwuuJasMBds&hl\npt-PT&saX&ved\n0CDsQ6AEwA2oVChMIyt-c0-D2xgIVCyDbCh3uzQps#vonepage&q\nedward%20lhuyd%20lusitanian%20celtic&ffalse Unity in Diversity, Volume 2: Cultural and Linguistic Markers of the Concept] Editors: Sabine Asmus and Barbara Braid. Google Books. Secondary evidence for this hypothesis has been found in research by biological scientists, who have identified (firstly) deep-rooted similarities in human DNA found precisely in both the former Lusitania and Ireland, and; (secondly) the so-called \"Lusitanian distribution\" of animals and plants unique to western Iberia and Ireland.  Both of these phenomena are now generally believed to have resulted from human emigration from Iberia to Ireland, during the late Paleolithic or early Mesolithic eras.\nOther scholars see greater linguistic affinities between Lusitanian, proto-Italic and Old European.The inscription of Cabeço das Fráguas revisited. Lusitanian and Alteuropäisch populations in the West of the Iberian Peninsula Transactions of the Philological Society vol. 97 (2003)\n* Pictish was for a long time thought to be a pre-Celtic, non-Indo-European language of Scotland. Some believe it was an Insular Celtic language allied to the P-Celtic language Brittonic (descendants Welsh, Cornish, Cumbric, Breton).; ; ; \n* Rhaetian was spoken in central parts of present-day Switzerland, Tyrol in Austria, and the Alpine regions of northeastern Italy. It is documented by a limited number of short inscriptions (found through Northern Italy and Western Austria) in two variants of the Etruscan alphabet. Its linguistic categorization is not clearly established, and it presents a confusing mixture of what appear to be Etruscan, Indo-European, and uncertain other elements. Howard Hayes Scullard argues that Rhaetian was also a Celtic language.\n* Tartessian, spoken in the southwest of the Iberia Peninsula (mainly southern Portugal and southwestern Spain). Tartessian is known by 95 inscriptions, with the longest having 82 readable signs. John T. Koch argues that Tartessian was also a Celtic language. Celtic languages. http://en.wikipedia.org/?curid=5920."
  }
}
