{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15797",
  "eid" : "1eaf6e70-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778560727,
  "textBody" : "Events\n\n*1158 – Munich is founded by Henry the Lion on the banks of the river Isar.\n*1216 – First Barons' War: Prince Louis of France captures the city of Winchester and soon conquers over half of the Kingdom of England.\n*1276 – While taking exile in Fuzhou in southern China, away from the advancing Mongol invaders, the remnants of the Song dynasty court hold the coronation ceremony for the young prince Zhao Shi, making him Emperor Duanzong.\n*1285 – Second Mongol invasion of Vietnam: Forces led by Prince Trần Quang Khải of the Trần dynasty destroy most of the invading Mongol naval fleet in a battle at Chuong Duong.\n*1287 –  Kublai Khan defeats the force of Nayan and other traditionalist Borjigin princes in East Mongolia and Manchuria.\n*1381 – Richard II of England meets leaders of Peasants' Revolt on Blackheath. The Tower of London is stormed by rebels who enter without resistance.\n*1404 – Welsh rebel leader Owain Glyndŵr, having declared himself Prince of Wales, allies himself with the French against King Henry IV of England.\n*1618 – Joris Veseler prints the first Dutch newspaper Courante uyt Italien, Duytslandt, &c. in Amsterdam (approximate date).\n*1645 – English Civil War: Battle of Naseby: Twelve thousand Royalist forces are beaten by 15,000 Parliamentarian soldiers.\n*1667 – The Raid on the Medway by the Dutch fleet in the Second Anglo-Dutch War ends. It had lasted for five days and resulted in the worst ever defeat of the Royal Navy. \n*1690 – King William III of England (William of Orange) lands in Ireland to confront the former King James II.\n*1775 – American Revolutionary War: the Continental Army is established by the Continental Congress, marking the birth of the United States Army.\n*1777 – The Stars and Stripes is adopted by Congress as the Flag of the United States.\n*1789 – Mutiny on the Bounty:  mutiny survivors including Captain William Bligh and 18 others reach Timor after a nearly  journey in an open boat.\n*1800 – The French Army of First Consul Napoleon Bonaparte defeats the Austrians at the Battle of Marengo in Northern Italy and re-conquers Italy.\n*1807 – Emperor Napoleon's French Grande Armée defeats the Russian Army at the Battle of Friedland in Poland (modern Russian  Kaliningrad Oblast) ending the War of the Fourth Coalition.\n*1821 – Badi VII, king of Sennar, surrenders his throne and realm to Isma'il Pasha, general of the Ottoman Empire, ending the existence of that Sudanese kingdom.\n*1822 – Charles Babbage proposes a difference engine in a paper to the Royal Astronomical Society entitled \"Note on the application of machinery to the computation of astronomical and mathematical tables\".\n*1830 – Beginning of the French colonization of Algeria: Thirty-four thousand French soldiers begin their invasion of Algiers, landing 27 kilometers west at Sidi Fredj.\n*1839 – Henley Royal Regatta: the village of Henley-on-Thames, on the River Thames in Oxfordshire, stages its first regatta.\n*1846 – Bear Flag Revolt begins: Anglo settlers in Sonoma, California, start a rebellion against Mexico and proclaim the California Republic.\n*1863 – American Civil War: Second Battle of Winchester: A Union garrison is defeated by the Army of Northern Virginia in the Shenandoah Valley town of Winchester, Virginia.\n*  1863   – Second Assault on the Confederate works at the Siege of Port Hudson during the American Civil War.\n*1872 – Trade unions are legalized in Canada.\n*1881 – The White Rajahs territories become the British protectorate of Sarawak.\n*1900 – Hawaii becomes a United States territory.\n*  1900   – The Reichstag approves a second law that allows the expansion of the German navy.\n*1907 – Norway grants women the right to vote.\n*1919 – John Alcock and Arthur Whitten Brown depart from St. John's, Newfoundland on the first nonstop transatlantic flight.\n*1926 – Brazil leaves the League of Nations\n*1937 – Pennsylvania becomes the first (and only) state of the United States to celebrate Flag Day officially as a state holiday.\n\n*  1937   – U.S. House of Representatives passes the Marihuana Tax Act.\n*1940 – World War II: As part of Germany's Fall Rot, Paris is occupied and Allied forces retreat.\n*  1940   – The Soviet Union presents an ultimatum to Lithuania resulting in Lithuanian loss of independence.\n*  1940   – Seven hundred twenty-eight Polish political prisoners from Tarnów become the first inmates of the Auschwitz concentration camp.\n*1941 – June deportation: the first major wave of Soviet mass deportations and murder of Estonians, Latvians and Lithuanians, begins.\n*1944 – World War II: After several failed attempts, the British Army abandons Operation Perch, its plan to capture the German-occupied town of Caen.\n*1945 – World War II: Filipino troops of the 15th, 66th and 121st Infantry Regiment, Philippine Commonwealth Army, USAFIP-NL liberate the captured in Ilocos Sur and start the Battle of Bessang Pass in Northern Luzon.\n*1949 – Albert II, a rhesus monkey, rides a V-2 rocket to an altitude of 134 km (83 mi), thereby becoming the first monkey in space.\n*1949 – Uttarakhand Mahaparishad, an NGO was formed by Govind Ballabh Pant in India with the main objective to solve social and economic problems of the hill region of Uttarkhand.\n*1951 – UNIVAC I is dedicated by the U.S. Census Bureau.\n*1954 – U.S. President Dwight D. Eisenhower signs a bill into law that places the words \"under God\" into the United States Pledge of Allegiance.\n*1955 – Chile becomes a signatory to the Buenos Aires copyright treaty.\n*1958 – The Alice in Wonderland ride opens at Disneyland\n*1959 – Disneyland Monorail System, the first daily operating monorail system in the Western Hemisphere, opens to the public in Anaheim, California.\n*1959 – Matterhorn Bobsleds, opens to the public in Anaheim, California.\n*  1959   – A group of Dominican exiles depart from Cuba and land in the Dominican Republic with the intent of overthrowing the totalitarian government of Rafael Trujillo. All but four are killed or executed.\n*1962 – The European Space Research Organisation is established in Paris – later becoming the European Space Agency.\n*1966 – The Vatican announces the abolition of the Index Librorum Prohibitorum (\"index of prohibited books\"), which was originally instituted in 1557.\n*1967 – Mariner program: Mariner 5 is launched towards Venus.\n*  1967   – China tests its first hydrogen bomb.\n*1982 – Falklands War: Argentine forces in the capital Stanley conditionally surrender to British forces.\n*1986 – The Mindbender derails and kills three riders at Galaxyland.\n*1994 – The 1994 Vancouver Stanley Cup riot occurs after the New York Rangers win the Stanley Cup from Vancouver, causing an estimated 1.1 million, leading to 200 arrests and injuries. \n*2002 – Near-Earth asteroid 2002 MN misses the Earth by 75000 mi, about one-third of the distance between the Earth and the Moon.\n*2014 – A Ukraine military Ilyushin Il-76 airlifter is shot down, killing all 49 people on board.\n*2017 – London: A fire in a high-rise apartment building in North Kensington leaves at least 80 people dead and another 74 injured.\n\nBirths\n\n*1444 – Nilakantha Somayaji, Indian astronomer and mathematician (d. 1544)\n*1463 – Henry IV, Duke of Brunswick-Lüneburg (d. 1514)\n*1479 – Giglio Gregorio Giraldi, Italian poet and scholar (d. 1552)\n*1529 – Ferdinand II, Archduke of Austria (d. 1595)\n*1627 – Johann Abraham Ihle, German astronomer (d. 1699)\n*1691 – Jan Francisci, Slovak organist and composer (d. 1758)\n*1726 – Thomas Pennant, Welsh ornithologist and historian (d. 1798)\n*1730 – Antonio Sacchini, Italian composer and educator (d. 1786)\n*1736 – Charles-Augustin de Coulomb, French physicist and engineer (d. 1806)\n*1763 – Simon Mayr, German composer and educator (d. 1845)\n*1780 – Henry Salt, English historian and diplomat, British Consul-General in Egypt (d. 1827)\n*1796 – Nikolai Brashman, Czech-Russian mathematician and academic (d. 1866)\n*1798 – František Palacký, Czech historian and politician (d. 1876)\n*1801 – Heber C. Kimball, American religious leader (d. 1868)\n*1811 – Harriet Beecher Stowe, American author and activist (d. 1896)\n*1812 – Fernando Wood, American merchant and politician, 73rd Mayor of New York City (d. 1881)\n*1819 – Henry Gardner, American merchant and politician, 23rd Governor of Massachusetts (d. 1892)\n*1820 – John Bartlett, American author and publisher (d. 1905)\n*1829 – Bernard Petitjean, French Roman Catholic missionary to Japan (d. 1884)\n*1838 – Yamagata Aritomo, Japanese Field Marshal and politician, 3rd and 9th Prime Minister of Japan (d. 1922)\n*1840 – William F. Nast, American businessman (d. 1893)\n*1848 – Bernard Bosanquet, English philosopher and theorist (d. 1923)\n*  1848   – Max Erdmannsdörfer, German conductor and composer (d. 1905)\n*1855 – Robert M. La Follette Sr., American lawyer and politician, 20th Governor of Wisconsin (d. 1925)\n*1856 – Andrey Markov, Russian mathematician and theorist (d. 1922)\n*1862 – John Ulric Nef, Swiss-American chemist and academic (d. 1915)\n*1864 – Alois Alzheimer, German psychiatrist and neuropathologist (d. 1915)\n*1868 – Karl Landsteiner, Austrian biologist and physician, Nobel Prize laureate (d. 1943)\n*1870 – Sophia of Prussia (d. 1932)\n*1871 – Hermanus Brockmann, Dutch rower (d. 1936)\n*  1871   – Jacob Ellehammer, Danish mechanic and engineer (d. 1946)\n*1872 – János Szlepecz, Slovene priest and author (d. 1936)\n*1877 – Jane Bathori, French soprano (d. 1970)\n*1878 – Léon Thiébaut, French fencer (d. 1943)\n*1879 – Arthur Duffey, American sprinter and coach (d. 1955)\n*1884 – John McCormack, Irish tenor and actor (d. 1945)\n*  1884   – Georg Zacharias, German swimmer (d. 1953)\n*1890 – May Allison, American actress (d. 1989)\n*1894 – Marie-Adélaïde, Grand Duchess of Luxembourg (d. 1924)\n*1894 – José Carlos Mariátegui (d. 1930)\n*  1894   – W. W. E. Ross, Canadian geophysicist and poet (d. 1966)\n*1895 – Jack Adams, Canadian-American ice hockey player, coach, and manager (d. 1968)\n*1900 – Ruth Nanda Anshen, American writer, editor, and philosopher (d. 2003)\n*  1900   – June Walker, American stage and film actress (d. 1966)\n*1903 – Alonzo Church, American mathematician and logician (d. 1995)\n*  1903   – Rose Rand, Austrian-American logician and philosopher from the Vienna Circle (d. 1980)\n*1904 – Margaret Bourke-White, American photographer and journalist (d. 1971)\n*1905 – Steve Broidy, American businessman (d. 1991)  \n*  1905   – Arthur Davis, American animator and director (d. 2000)\n*1907 – Nicolas Bentley, English author and illustrator (d. 1978)\n*  1907   – René Char, French poet and author (d. 1988)\n*1909 – Burl Ives, American actor and singer (d. 1995)\n*1910 – Rudolf Kempe, German pianist and conductor (d. 1976)\n*1913 – Joe Morris, English-Canadian lieutenant and trade union leader (d. 1996)\n*1916 – Dorothy McGuire, American actress (d. 2001)\n*1917 – Lise Nørgaard, Danish journalist, author, and screenwriter\n*  1917   – Gilbert Prouteau, French poet and director (d. 2012)\n*  1917   – Atle Selberg, Norwegian-American mathematician and academic (d. 2007)\n*1918 – Fred Baur, American chemist and founder of Pringles (d. 2008)\n*1919 – Gene Barry, American actor (d. 2009)\n*  1919   – Sam Wanamaker, American actor and director (d. 1993)\n*1921 – Martha Greenhouse, American actress (d. 2013)\n*1923 – Judith Kerr, German-English author and illustrator\n*  1923   – Green Wix Unthank, American soldier, lawyer, and judge (d. 2013)\n*1924 – James Black, Scottish pharmacologist and academic, Nobel Prize laureate (d. 2010)\n*1925 – Pierre Salinger, American journalist and politician, 11th White House Press Secretary (d. 2004)\n*1926 – Don Newcombe, American baseball player\n*1928 – Ernesto \"Che\" Guevara, Argentinian-Cuban physician, author, guerrilla leader and politician (d. 1967)\n*1929 – Cy Coleman, American pianist and composer (d. 2004)\n*  1929   – Alan Davidson, Australian cricketer\n*  1929   – Johnny Wilson, Canadian-American ice hockey player and coach (d. 2011)\n*1931 – Marla Gibbs, American actress and comedian\n*  1931   – Ross Higgins, Australian actor (d. 2016)\n*  1931   – Junior Walker, American saxophonist (d. 1995)\n*1932 – Joe Arpaio, American police officer and sheriff\n*1933 – Jerzy Kosiński, Polish-American novelist and screenwriter (d. 1991)\n*  1933   – Vladislav Rastorotsky, Russian gymnast and coach\n*1936 – Renaldo Benson, American singer-songwriter (d. 2005)\n*  1936   – Irmelin Sandman Lilius, Finnish author, poet, and translator\n*1938 – Julie Felix, American-English singer-songwriter and guitarist\n*1939 – Steny Hoyer, American lawyer and politician\n*  1939   – Peter Mayle, English author and screenwriter (d. 2018)\n*  1939   – Colin Thubron, English journalist and author\n*1942 – Jonathan Raban, English author and academic\n*1943 – Barry Burman, English painter and academic (d. 2001)\n*  1943   – Jennifer Gretton, Baroness Gretton, English politician, Lord Lieutenant of Leicestershire\n*  1943   – John Miles, English race car driver and journalist\n*  1943   – Harold Wheeler, American composer, conductor, and producer\n*1944 – Laurie Colwin, American novelist and short story writer (d. 1992)\n*1945 – Rod Argent, English singer-songwriter and keyboard player \n*  1945   – Carlos Reichenbach, Brazilian director and producer (d. 2012)\n*  1945   – Richard Stebbins, American sprinter and educator \n*1946 – Robert Louis-Dreyfus, French-Swiss businessman (d. 2009)\n*  1946   – Tõnu Sepp, Estonian instrument maker and educator\n*  1946   – Donald Trump, American businessman, television personality and 45th President of the United States\n*1947 – Roger Liddle, Baron Liddle, English politician\n*  1947   – Barry Melton, American singer-songwriter and guitarist \n*  1947   – Paul Rudolph, Canadian singer, guitarist, and cyclist \n*1948 – Laurence Yep, American author and playwright\n*1949 – Jim Lea, English singer-songwriter, bass player, and producer \n*  1949  –  Roger Powell, English-Australian scientist and academic\n*  1949   – Antony Sher, South African-British actor, director, and screenwriter\n*  1949   – Harry Turtledove, American historian and author\n*  1949   – Alan White, English drummer and songwriter \n*1950 – Rowan Williams, Welsh archbishop and theologian\n*1951 – Paul Boateng, English lawyer and politician, British High Commissioner to South Africa\n*  1951   – Danny Edwards, American golfer\n*1952 – Robert Lepikson, Estonian race car driver and politician, Estonian Minister of the Interior (d. 2006)\n*  1952   – Pat Summitt, American basketball player and coach (d. 2016)\n*  1952   – Leon Wieseltier, American philosopher, journalist, and critic\n*1953 – Janet Mackey, New Zealand lawyer and politician\n*1954 – Will Patton, American actor\n*1955 – Michael D. Duvall, American businessman and politician\n*  1955   – Paul O'Grady, English television host, producer, and drag performer \n*1956 – Fred Funk, American golfer and coach\n*1956 – King Diamond (Kim Bendix Petersen), heavy metal musician\n*1957 – Suzanne Nora Johnson, American lawyer and businesswoman\n*  1957   – Mona Simpson, American novelist\n*1958 – Pamela Geller, American activist and blogger\n*1959 – Marcus Miller, American bass player, composer, and producer \n*1960 – Tonie Campbell, American hurdler\n*  1960   – Mike Laga, American baseball player\n*1961 – Boy George, English singer-songwriter and producer \n*  1961   – Dušan Kojić, Serbian singer-songwriter and bass player \n*  1961   – Sam Perkins, American basketball player\n*1963 – Grant Kenny, Australian iron man and canoeist\n*1964 – Peter Gilliver, English lexicographer and academic\n*1967 – Dedrick Dodge, American football player and coach\n*1968 – Campbell Brown, American journalist\n*  1968   – Faizon Love, Cuban-American actor and screenwriter\n*1969 – Éric Desjardins, Canadian ice hockey player and coach\n*  1969   – Steffi Graf, German tennis player\n*1970 – Heather McDonald, American comedian, actress, and author\n*1971 – Bruce Bowen, American basketball player and sportscaster\n*  1971   – Ramon Vega, Swiss footballer\n*1972 – Rick Brunson, American basketball player and coach\n*  1972   – Matthias Ettrich, German computer scientist and engineer, founded KDE\n*  1972   – Dominic Brown, English guitarist and songwriter \n*  1972   – Claude Henderson, South African cricketer\n*  1972   – Danny McFarlane, Jamaican hurdler and sprinter\n*1973 – Sami Kapanen, Finnish-American ice hockey player and manager\n*1976 – Alan Carr, English comedian, actor, and screenwriter\n*  1976   – Massimo Oddo, Italian footballer and manager\n*1977 – Boeta Dippenaar, South African cricketer\n*  1977   – Chris McAlister, American football player\n*  1977   – Joe Worsley, English rugby player and coach\n*1978 – Steve Bégin, Canadian ice hockey player\n*  1978   – Diablo Cody, American director, producer, and screenwriter\n*  1978   – Annia Hatch, Cuban-American gymnast and coach \n*  1978   – Nikola Vujčić, Croatian former professional basketball player \n*1979 – Shannon Hegarty, Australian rugby league player\n*1981 – Elano, Brazilian footballer and manager \n*1982 – Jamie Green, English race car driver\n*  1982   – Nicole Irving, Australian swimmer\n*  1982   – Lang Lang, Chinese pianist\n*1983 – Trevor Barry, Bahamian high jumper\n*  1983   – Louis Garrel, French actor, director, and screenwriter\n*1984 – Lorenzo Booker, American football player\n*  1984   – Mark Cosgrove, Australian cricketer\n*  1984   – Siobhán Donaghy, English singer-songwriter \n*  1984   – Yury Prilukov, Russian swimmer\n*1985 – Oleg Medvedev. Russian luger\n*  1985   – Andy Soucek, Spanish race car driver\n*1986 – Matt Read, Canadian ice hockey player\n*1987 – Andrew Cogliano, Canadian ice hockey player\n*  1987   – Mohamed Diamé, Senegalese footballer\n*1988 – Adrián Aldrete, Mexican footballer\n*1989 – Lucy Hale, American actress and singer-songwriter\n*  1989   – Brad Takairangi, Australian-Cook Islands rugby league player\n*1990 – Patrice Cormier, Canadian ice hockey player\n*  1990   – Stephen McLaughlin, Irish footballer\n*1991 – Kostas Manolas, Greek footballer\n*1992 – Devante Smith-Pelly, Canadian ice hockey player\n*1993 – Gurinder Sandhu, Australian cricketer\n*1999 – Chou Tzu-yu, Taiwanese singer (Twice)\n\nDeaths\n\n* 767 – Abu Hanifa, Iraqi scholar and educator (b. 699)\n* 809 – Ōtomo no Otomaro, Japanese general (b. 731)\n* 847 – Methodius I, patriarch of Constantinople\n* 957 – Guadamir, bishop of Vic (Spain)\n* 976 – Aron, Bulgarian nobleman\n*1161 – Emperor Qinzong of the Song dynasty (b. 1100)\n*1205 – Walter III, Count of Brienne\n*1349 – Günther von Schwarzburg, German king (b. 1304)\n*1381 – Simon Sudbury, English archbishop (b. 1316)\n*1497 – Giovanni Borgia, 2nd Duke of Gandia, Italian son of Pope Alexander VI (b. 1474)\n*1516 – John III of Navarre (b. 1469)\n*1544 – Antoine, Duke of Lorraine (b. 1489)\n*1548 – Carpentras, French composer (b. 1470)\n*1583 – Shibata Katsuie, Japanese samurai (b. 1522)\n*1594 – Orlande de Lassus, Flemish composer and educator (b. 1532)\n*1662 – Henry Vane the Younger, English-American politician, Governor of the Massachusetts Bay Colony (b. 1613)\n*1674 – Marin le Roy de Gomberville, French author and poet (b. 1600)\n*1746 – Colin Maclaurin, Scottish mathematician (b. 1698)\n*1794 – Francis Seymour-Conway, 1st Marquess of Hertford, English courtier and politician, Lord Lieutenant of Ireland (b. 1718)\n*1800 – Louis Desaix, French general (b. 1768)\n*  1800   – Jean-Baptiste Kléber, French general (b. 1753)\n*1801 – Benedict Arnold, American general during the American Revolution later turned British spy (b. 1741)\n*1825 – Pierre Charles L'Enfant, French-American architect and engineer, designed Washington, D.C.  (b. 1754)\n*1837 – Giacomo Leopardi, Italian poet and philosopher (b. 1798)\n*1864 – Leonidas Polk, American general and bishop (b. 1806)\n*1887 – Mary Carpenter, English educational and social reformer (b. 1807)\n*1883 – Edward FitzGerald, English poet and author (b. 1809)\n*1886 – Alexander Ostrovsky, Russian director and playwright (b. 1823)\n*1907 – William Le Baron Jenney, American architect and engineer, designed the Home Insurance Building  (b. 1832)\n*  1907   – Bartolomé Masó, Cuban soldier and politician (b. 1830)\n*1908 – Frederick Stanley, 16th Earl of Derby, English captain and politician, 6th Governor General of Canada (b. 1841)\n*1914 – Adlai Stevenson I, American lawyer and politician, 23rd Vice President of the United States (b. 1835)\n*1916 – João Simões Lopes Neto, Brazilian author (b. 1865)\n*1920 – Max Weber, German sociologist and economist (b. 1864)\n*1923 – Isabelle Bogelot, French philanthropist (b. 1838)\n*1926 – Mary Cassatt, American-French painter (b. 1843)\n*1927 – Ottavio Bottecchia, Italian cyclist (b. 1894)\n*  1927   – Jerome K. Jerome, English author (b. 1859)\n*1928 – Emmeline Pankhurst, English activist and academic (b. 1857)\n*1932 – Dorimène Roy Desjardins, Canadian businesswoman, co-founded Desjardins Group (b. 1858)\n*1933 – Justinien de Clary, French target shooter (b. 1860)\n*1936 – G. K. Chesterton, English essayist, poet, playwright, and novelist (b. 1874)\n*  1936   – Hans Poelzig, German architect, painter, and designer, designed the IG Farben Building (b. 1869)\n*1946 – John Logie Baird, Scottish-English physicist and engineer (b. 1888)\n*  1946   – Jorge Ubico, 21st President of Guatemala (b. 1878)\n*1953 – Tom Cole, Welsh-American racing driver (b. 1922)\n*1968 – Salvatore Quasimodo, Italian novelist and poet, Nobel Prize Laureate (b. 1901)\n*1972 – Dündar Taşer, Turkish soldier and politician (b. 1925)\n*1977 – Robert Middleton, American actor (b. 1911)\n*  1977   – Alan Reed, American actor, original voice of Fred Flintstone (b.1907)\n*1979 – Ahmad Zahir, Afghan singer-songwriter (b. 1946)\n*1980 – Charles Miller, American saxophonist and flute player (b. 1939)\n*1986 – Jorge Luis Borges,  Argentine short-story writer, essayist, poet and translator (b. 1899)\n*  1986   – Alan Jay Lerner, American composer and songwriter (b. 1918)\n*1987 – Stanisław Bareja, Polish actor, director, and screenwriter (b. 1929)\n*1990 – Erna Berger, German soprano and actress (b. 1900)\n*1991 – Peggy Ashcroft, English actress (b. 1907)\n*1994 – Lionel Grigson, English pianist, composer, and educator (b. 1942)\n*  1994   – Henry Mancini, American composer and conductor (b. 1924)\n*  1994   – Marcel Mouloudji, French singer and actor (b. 1922)\n*1995 – Els Aarne, Ukrainian-Estonian pianist, composer, and educator (b. 1917)\n*  1995   – Rory Gallagher, Irish singer-songwriter, guitarist, and producer (b. 1949)\n*  1995   – Roger Zelazny, American author and poet (b. 1937)\n*1996 – Noemí Gerstein, Argentinian sculptor and illustrator (b. 1908)\n*1997 – Richard Jaeckel, American actor (b. 1926)\n*1999 – Bernie Faloney, American-Canadian football player and sportscaster (b. 1932)\n*2000 – Attilio Bertolucci, Italian poet and author (b. 1911)\n*2002 – June Jordan, American author and activist (b. 1936)\n*2003 – Dale Whittington, American race car driver (b. 1959)\n*2004 – Ulrich Inderbinen, Swiss mountaineer and guide (b. 1900)\n*2005 – Carlo Maria Giulini, Italian conductor and director (b. 1914)\n*  2005   – Mimi Parent, Canadian-Swiss painter (b. 1924)\n*2006 – Monty Berman, English director, producer, and cinematographer (b. 1905)\n*  2006   – Jean Roba, Belgian author and illustrator (b. 1930)\n*2007 – Ruth Graham, Chinese-American author, poet, and painter (b. 1920)\n*  2007   – Robin Olds, American general and pilot (b. 1922)\n*  2007   – Kurt Waldheim, Austrian politician and war criminal, 9th President of Austria (b. 1918)\n*2009 – Bob Bogle, American musician (The Ventures) (b. 1934)\n*  2009   – William McIntyre, Canadian soldier, lawyer, and judge (b. 1918)\n*2012 – Peter Archer, Baron Archer of Sandwell, English lawyer and politician, Solicitor General for England and Wales (b. 1926)\n*  2012   – Bob Chappuis, American football player and soldier (b. 1923)\n*  2012   – Margie Hyams, American pianist and vibraphone player (b. 1920)\n*  2012   – Karl-Heinz Kämmerling, German pianist and academic (b. 1930)\n*  2012   – Carlos Reichenbach, Brazilian director and producer (b. 1945)\n*  2012   – Gitta Sereny, Austrian-English historian, journalist, and author (b. 1921) \n*2013 – Elroy Schwartz, American screenwriter and producer (b. 1923)\n*2014 – Alberto Cañas Escalante, Costa Rican journalist and politician (b. 1920)\n*  2014   – Isabelle Collin Dufresne, French actress (b. 1935)\n*  2014   – Robert Lebeck, German photographer and journalist (b. 1929)\n*  2014   – James E. Rogers, American lawyer, businessman, and academic (b. 1938)\n*2015 – Richard Cotton, Australian geneticist and academic (b. 1940)\n*  2015   – Anne Nicol Gaylor, American activist, co-founded the Freedom From Religion Foundation (b. 1926)\n*  2015   – Qiao Shi, Chinese politician (b. 1924)\n*2016 – Ann Morgan Guilbert, American actress and singer (b. 1928)\n*  2016   – Gilles Lamontagne, Canadian politician, 24th Lieutenant Governor of Quebec (b. 1919)\n\nHolidays and observances\n\n*Christian feast day:\n**Burchard of Meissen\n**Caomhán of Inisheer\n**Elisha (Roman Catholic and Lutheran)\n**Blessed Francisca de Paula de Jesus (Nhá Chica)\n**Joseph the Hymnographer (Roman Catholic:  Orthodox April 3)\n**Methodios I of Constantinople\n**Quintian of Rodez (Rodez)\n**Richard Baxter (Church of England)\n**Valerius and Rufinus\n**June 14 (Eastern Orthodox liturgics)\n*Commemoration of the Soviet Deportation related observances:\n**Baltic Freedom Day (United States) \n**Mourning and Commemoration Day or Leinapäev (Estonia)\n**Mourning and Hope Day (Lithuania)\n*Day of Memory for Repressed People (Armenia)\n*Flag Day (United States)\n*Freedom Day (Malawi)\n*Liberation Day (Falkland Islands and South Georgia and the South Sandwich Islands)\n*World Blood Donor Day",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "June 14" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15797" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n*1158 – Munich is founded by Henry the Lion on the banks of the river Isar.\n*1216 – First Barons' War: Prince Louis of France captures the city of Winchester and soon conquers over half of the Kingdom of England.\n*1276 – While taking exile in Fuzhou in southern China, away from the advancing Mongol invaders, the remnants of the Song dynasty court hold the coronation ceremony for the young prince Zhao Shi, making him Emperor Duanzong.\n*1285 – Second Mongol invasion of Vietnam: Forces led by Prince Trần Quang Khải of the Trần dynasty destroy most of the invading Mongol naval fleet in a battle at Chuong Duong.\n*1287 –  Kublai Khan defeats the force of Nayan and other traditionalist Borjigin princes in East Mongolia and Manchuria.\n*1381 – Richard II of England meets leaders of Peasants' Revolt on Blackheath. The Tower of London is stormed by rebels who enter without resistance.\n*1404 – Welsh rebel leader Owain Glyndŵr, having declared himself Prince of Wales, allies himself with the French against King Henry IV of England.\n*1618 – Joris Veseler prints the first Dutch newspaper Courante uyt Italien, Duytslandt, &c. in Amsterdam (approximate date).\n*1645 – English Civil War: Battle of Naseby: Twelve thousand Royalist forces are beaten by 15,000 Parliamentarian soldiers.\n*1667 – The Raid on the Medway by the Dutch fleet in the Second Anglo-Dutch War ends. It had lasted for five days and resulted in the worst ever defeat of the Royal Navy. \n*1690 – King William III of England (William of Orange) lands in Ireland to confront the former King James II.\n*1775 – American Revolutionary War: the Continental Army is established by the Continental Congress, marking the birth of the United States Army.\n*1777 – The Stars and Stripes is adopted by Congress as the Flag of the United States.\n*1789 – Mutiny on the Bounty:  mutiny survivors including Captain William Bligh and 18 others reach Timor after a nearly  journey in an open boat.\n*1800 – The French Army of First Consul Napoleon Bonaparte defeats the Austrians at the Battle of Marengo in Northern Italy and re-conquers Italy.\n*1807 – Emperor Napoleon's French Grande Armée defeats the Russian Army at the Battle of Friedland in Poland (modern Russian  Kaliningrad Oblast) ending the War of the Fourth Coalition.\n*1821 – Badi VII, king of Sennar, surrenders his throne and realm to Isma'il Pasha, general of the Ottoman Empire, ending the existence of that Sudanese kingdom.\n*1822 – Charles Babbage proposes a difference engine in a paper to the Royal Astronomical Society entitled \"Note on the application of machinery to the computation of astronomical and mathematical tables\".\n*1830 – Beginning of the French colonization of Algeria: Thirty-four thousand French soldiers begin their invasion of Algiers, landing 27 kilometers west at Sidi Fredj.\n*1839 – Henley Royal Regatta: the village of Henley-on-Thames, on the River Thames in Oxfordshire, stages its first regatta.\n*1846 – Bear Flag Revolt begins: Anglo settlers in Sonoma, California, start a rebellion against Mexico and proclaim the California Republic.\n*1863 – American Civil War: Second Battle of Winchester: A Union garrison is defeated by the Army of Northern Virginia in the Shenandoah Valley town of Winchester, Virginia.\n*  1863   – Second Assault on the Confederate works at the Siege of Port Hudson during the American Civil War.\n*1872 – Trade unions are legalized in Canada.\n*1881 – The White Rajahs territories become the British protectorate of Sarawak.\n*1900 – Hawaii becomes a United States territory.\n*  1900   – The Reichstag approves a second law that allows the expansion of the German navy.\n*1907 – Norway grants women the right to vote.\n*1919 – John Alcock and Arthur Whitten Brown depart from St. John's, Newfoundland on the first nonstop transatlantic flight.\n*1926 – Brazil leaves the League of Nations\n*1937 – Pennsylvania becomes the first (and only) state of the United States to celebrate Flag Day officially as a state holiday.\n\n*  1937   – U.S. House of Representatives passes the Marihuana Tax Act.\n*1940 – World War II: As part of Germany's Fall Rot, Paris is occupied and Allied forces retreat.\n*  1940   – The Soviet Union presents an ultimatum to Lithuania resulting in Lithuanian loss of independence.\n*  1940   – Seven hundred twenty-eight Polish political prisoners from Tarnów become the first inmates of the Auschwitz concentration camp.\n*1941 – June deportation: the first major wave of Soviet mass deportations and murder of Estonians, Latvians and Lithuanians, begins.\n*1944 – World War II: After several failed attempts, the British Army abandons Operation Perch, its plan to capture the German-occupied town of Caen.\n*1945 – World War II: Filipino troops of the 15th, 66th and 121st Infantry Regiment, Philippine Commonwealth Army, USAFIP-NL liberate the captured in Ilocos Sur and start the Battle of Bessang Pass in Northern Luzon.\n*1949 – Albert II, a rhesus monkey, rides a V-2 rocket to an altitude of 134 km (83 mi), thereby becoming the first monkey in space.\n*1949 – Uttarakhand Mahaparishad, an NGO was formed by Govind Ballabh Pant in India with the main objective to solve social and economic problems of the hill region of Uttarkhand.\n*1951 – UNIVAC I is dedicated by the U.S. Census Bureau.\n*1954 – U.S. President Dwight D. Eisenhower signs a bill into law that places the words \"under God\" into the United States Pledge of Allegiance.\n*1955 – Chile becomes a signatory to the Buenos Aires copyright treaty.\n*1958 – The Alice in Wonderland ride opens at Disneyland\n*1959 – Disneyland Monorail System, the first daily operating monorail system in the Western Hemisphere, opens to the public in Anaheim, California.\n*1959 – Matterhorn Bobsleds, opens to the public in Anaheim, California.\n*  1959   – A group of Dominican exiles depart from Cuba and land in the Dominican Republic with the intent of overthrowing the totalitarian government of Rafael Trujillo. All but four are killed or executed.\n*1962 – The European Space Research Organisation is established in Paris – later becoming the European Space Agency.\n*1966 – The Vatican announces the abolition of the Index Librorum Prohibitorum (\"index of prohibited books\"), which was originally instituted in 1557.\n*1967 – Mariner program: Mariner 5 is launched towards Venus.\n*  1967   – China tests its first hydrogen bomb.\n*1982 – Falklands War: Argentine forces in the capital Stanley conditionally surrender to British forces.\n*1986 – The Mindbender derails and kills three riders at Galaxyland.\n*1994 – The 1994 Vancouver Stanley Cup riot occurs after the New York Rangers win the Stanley Cup from Vancouver, causing an estimated 1.1 million, leading to 200 arrests and injuries. \n*2002 – Near-Earth asteroid 2002 MN misses the Earth by 75000 mi, about one-third of the distance between the Earth and the Moon.\n*2014 – A Ukraine military Ilyushin Il-76 airlifter is shot down, killing all 49 people on board.\n*2017 – London: A fire in a high-rise apartment building in North Kensington leaves at least 80 people dead and another 74 injured.\n\nBirths\n\n*1444 – Nilakantha Somayaji, Indian astronomer and mathematician (d. 1544)\n*1463 – Henry IV, Duke of Brunswick-Lüneburg (d. 1514)\n*1479 – Giglio Gregorio Giraldi, Italian poet and scholar (d. 1552)\n*1529 – Ferdinand II, Archduke of Austria (d. 1595)\n*1627 – Johann Abraham Ihle, German astronomer (d. 1699)\n*1691 – Jan Francisci, Slovak organist and composer (d. 1758)\n*1726 – Thomas Pennant, Welsh ornithologist and historian (d. 1798)\n*1730 – Antonio Sacchini, Italian composer and educator (d. 1786)\n*1736 – Charles-Augustin de Coulomb, French physicist and engineer (d. 1806)\n*1763 – Simon Mayr, German composer and educator (d. 1845)\n*1780 – Henry Salt, English historian and diplomat, British Consul-General in Egypt (d. 1827)\n*1796 – Nikolai Brashman, Czech-Russian mathematician and academic (d. 1866)\n*1798 – František Palacký, Czech historian and politician (d. 1876)\n*1801 – Heber C. Kimball, American religious leader (d. 1868)\n*1811 – Harriet Beecher Stowe, American author and activist (d. 1896)\n*1812 – Fernando Wood, American merchant and politician, 73rd Mayor of New York City (d. 1881)\n*1819 – Henry Gardner, American merchant and politician, 23rd Governor of Massachusetts (d. 1892)\n*1820 – John Bartlett, American author and publisher (d. 1905)\n*1829 – Bernard Petitjean, French Roman Catholic missionary to Japan (d. 1884)\n*1838 – Yamagata Aritomo, Japanese Field Marshal and politician, 3rd and 9th Prime Minister of Japan (d. 1922)\n*1840 – William F. Nast, American businessman (d. 1893)\n*1848 – Bernard Bosanquet, English philosopher and theorist (d. 1923)\n*  1848   – Max Erdmannsdörfer, German conductor and composer (d. 1905)\n*1855 – Robert M. La Follette Sr., American lawyer and politician, 20th Governor of Wisconsin (d. 1925)\n*1856 – Andrey Markov, Russian mathematician and theorist (d. 1922)\n*1862 – John Ulric Nef, Swiss-American chemist and academic (d. 1915)\n*1864 – Alois Alzheimer, German psychiatrist and neuropathologist (d. 1915)\n*1868 – Karl Landsteiner, Austrian biologist and physician, Nobel Prize laureate (d. 1943)\n*1870 – Sophia of Prussia (d. 1932)\n*1871 – Hermanus Brockmann, Dutch rower (d. 1936)\n*  1871   – Jacob Ellehammer, Danish mechanic and engineer (d. 1946)\n*1872 – János Szlepecz, Slovene priest and author (d. 1936)\n*1877 – Jane Bathori, French soprano (d. 1970)\n*1878 – Léon Thiébaut, French fencer (d. 1943)\n*1879 – Arthur Duffey, American sprinter and coach (d. 1955)\n*1884 – John McCormack, Irish tenor and actor (d. 1945)\n*  1884   – Georg Zacharias, German swimmer (d. 1953)\n*1890 – May Allison, American actress (d. 1989)\n*1894 – Marie-Adélaïde, Grand Duchess of Luxembourg (d. 1924)\n*1894 – José Carlos Mariátegui (d. 1930)\n*  1894   – W. W. E. Ross, Canadian geophysicist and poet (d. 1966)\n*1895 – Jack Adams, Canadian-American ice hockey player, coach, and manager (d. 1968)\n*1900 – Ruth Nanda Anshen, American writer, editor, and philosopher (d. 2003)\n*  1900   – June Walker, American stage and film actress (d. 1966)\n*1903 – Alonzo Church, American mathematician and logician (d. 1995)\n*  1903   – Rose Rand, Austrian-American logician and philosopher from the Vienna Circle (d. 1980)\n*1904 – Margaret Bourke-White, American photographer and journalist (d. 1971)\n*1905 – Steve Broidy, American businessman (d. 1991)  \n*  1905   – Arthur Davis, American animator and director (d. 2000)\n*1907 – Nicolas Bentley, English author and illustrator (d. 1978)\n*  1907   – René Char, French poet and author (d. 1988)\n*1909 – Burl Ives, American actor and singer (d. 1995)\n*1910 – Rudolf Kempe, German pianist and conductor (d. 1976)\n*1913 – Joe Morris, English-Canadian lieutenant and trade union leader (d. 1996)\n*1916 – Dorothy McGuire, American actress (d. 2001)\n*1917 – Lise Nørgaard, Danish journalist, author, and screenwriter\n*  1917   – Gilbert Prouteau, French poet and director (d. 2012)\n*  1917   – Atle Selberg, Norwegian-American mathematician and academic (d. 2007)\n*1918 – Fred Baur, American chemist and founder of Pringles (d. 2008)\n*1919 – Gene Barry, American actor (d. 2009)\n*  1919   – Sam Wanamaker, American actor and director (d. 1993)\n*1921 – Martha Greenhouse, American actress (d. 2013)\n*1923 – Judith Kerr, German-English author and illustrator\n*  1923   – Green Wix Unthank, American soldier, lawyer, and judge (d. 2013)\n*1924 – James Black, Scottish pharmacologist and academic, Nobel Prize laureate (d. 2010)\n*1925 – Pierre Salinger, American journalist and politician, 11th White House Press Secretary (d. 2004)\n*1926 – Don Newcombe, American baseball player\n*1928 – Ernesto \"Che\" Guevara, Argentinian-Cuban physician, author, guerrilla leader and politician (d. 1967)\n*1929 – Cy Coleman, American pianist and composer (d. 2004)\n*  1929   – Alan Davidson, Australian cricketer\n*  1929   – Johnny Wilson, Canadian-American ice hockey player and coach (d. 2011)\n*1931 – Marla Gibbs, American actress and comedian\n*  1931   – Ross Higgins, Australian actor (d. 2016)\n*  1931   – Junior Walker, American saxophonist (d. 1995)\n*1932 – Joe Arpaio, American police officer and sheriff\n*1933 – Jerzy Kosiński, Polish-American novelist and screenwriter (d. 1991)\n*  1933   – Vladislav Rastorotsky, Russian gymnast and coach\n*1936 – Renaldo Benson, American singer-songwriter (d. 2005)\n*  1936   – Irmelin Sandman Lilius, Finnish author, poet, and translator\n*1938 – Julie Felix, American-English singer-songwriter and guitarist\n*1939 – Steny Hoyer, American lawyer and politician\n*  1939   – Peter Mayle, English author and screenwriter (d. 2018)\n*  1939   – Colin Thubron, English journalist and author\n*1942 – Jonathan Raban, English author and academic\n*1943 – Barry Burman, English painter and academic (d. 2001)\n*  1943   – Jennifer Gretton, Baroness Gretton, English politician, Lord Lieutenant of Leicestershire\n*  1943   – John Miles, English race car driver and journalist\n*  1943   – Harold Wheeler, American composer, conductor, and producer\n*1944 – Laurie Colwin, American novelist and short story writer (d. 1992)\n*1945 – Rod Argent, English singer-songwriter and keyboard player \n*  1945   – Carlos Reichenbach, Brazilian director and producer (d. 2012)\n*  1945   – Richard Stebbins, American sprinter and educator \n*1946 – Robert Louis-Dreyfus, French-Swiss businessman (d. 2009)\n*  1946   – Tõnu Sepp, Estonian instrument maker and educator\n*  1946   – Donald Trump, American businessman, television personality and 45th President of the United States\n*1947 – Roger Liddle, Baron Liddle, English politician\n*  1947   – Barry Melton, American singer-songwriter and guitarist \n*  1947   – Paul Rudolph, Canadian singer, guitarist, and cyclist \n*1948 – Laurence Yep, American author and playwright\n*1949 – Jim Lea, English singer-songwriter, bass player, and producer \n*  1949  –  Roger Powell, English-Australian scientist and academic\n*  1949   – Antony Sher, South African-British actor, director, and screenwriter\n*  1949   – Harry Turtledove, American historian and author\n*  1949   – Alan White, English drummer and songwriter \n*1950 – Rowan Williams, Welsh archbishop and theologian\n*1951 – Paul Boateng, English lawyer and politician, British High Commissioner to South Africa\n*  1951   – Danny Edwards, American golfer\n*1952 – Robert Lepikson, Estonian race car driver and politician, Estonian Minister of the Interior (d. 2006)\n*  1952   – Pat Summitt, American basketball player and coach (d. 2016)\n*  1952   – Leon Wieseltier, American philosopher, journalist, and critic\n*1953 – Janet Mackey, New Zealand lawyer and politician\n*1954 – Will Patton, American actor\n*1955 – Michael D. Duvall, American businessman and politician\n*  1955   – Paul O'Grady, English television host, producer, and drag performer \n*1956 – Fred Funk, American golfer and coach\n*1956 – King Diamond (Kim Bendix Petersen), heavy metal musician\n*1957 – Suzanne Nora Johnson, American lawyer and businesswoman\n*  1957   – Mona Simpson, American novelist\n*1958 – Pamela Geller, American activist and blogger\n*1959 – Marcus Miller, American bass player, composer, and producer \n*1960 – Tonie Campbell, American hurdler\n*  1960   – Mike Laga, American baseball player\n*1961 – Boy George, English singer-songwriter and producer \n*  1961   – Dušan Kojić, Serbian singer-songwriter and bass player \n*  1961   – Sam Perkins, American basketball player\n*1963 – Grant Kenny, Australian iron man and canoeist\n*1964 – Peter Gilliver, English lexicographer and academic\n*1967 – Dedrick Dodge, American football player and coach\n*1968 – Campbell Brown, American journalist\n*  1968   – Faizon Love, Cuban-American actor and screenwriter\n*1969 – Éric Desjardins, Canadian ice hockey player and coach\n*  1969   – Steffi Graf, German tennis player\n*1970 – Heather McDonald, American comedian, actress, and author\n*1971 – Bruce Bowen, American basketball player and sportscaster\n*  1971   – Ramon Vega, Swiss footballer\n*1972 – Rick Brunson, American basketball player and coach\n*  1972   – Matthias Ettrich, German computer scientist and engineer, founded KDE\n*  1972   – Dominic Brown, English guitarist and songwriter \n*  1972   – Claude Henderson, South African cricketer\n*  1972   – Danny McFarlane, Jamaican hurdler and sprinter\n*1973 – Sami Kapanen, Finnish-American ice hockey player and manager\n*1976 – Alan Carr, English comedian, actor, and screenwriter\n*  1976   – Massimo Oddo, Italian footballer and manager\n*1977 – Boeta Dippenaar, South African cricketer\n*  1977   – Chris McAlister, American football player\n*  1977   – Joe Worsley, English rugby player and coach\n*1978 – Steve Bégin, Canadian ice hockey player\n*  1978   – Diablo Cody, American director, producer, and screenwriter\n*  1978   – Annia Hatch, Cuban-American gymnast and coach \n*  1978   – Nikola Vujčić, Croatian former professional basketball player \n*1979 – Shannon Hegarty, Australian rugby league player\n*1981 – Elano, Brazilian footballer and manager \n*1982 – Jamie Green, English race car driver\n*  1982   – Nicole Irving, Australian swimmer\n*  1982   – Lang Lang, Chinese pianist\n*1983 – Trevor Barry, Bahamian high jumper\n*  1983   – Louis Garrel, French actor, director, and screenwriter\n*1984 – Lorenzo Booker, American football player\n*  1984   – Mark Cosgrove, Australian cricketer\n*  1984   – Siobhán Donaghy, English singer-songwriter \n*  1984   – Yury Prilukov, Russian swimmer\n*1985 – Oleg Medvedev. Russian luger\n*  1985   – Andy Soucek, Spanish race car driver\n*1986 – Matt Read, Canadian ice hockey player\n*1987 – Andrew Cogliano, Canadian ice hockey player\n*  1987   – Mohamed Diamé, Senegalese footballer\n*1988 – Adrián Aldrete, Mexican footballer\n*1989 – Lucy Hale, American actress and singer-songwriter\n*  1989   – Brad Takairangi, Australian-Cook Islands rugby league player\n*1990 – Patrice Cormier, Canadian ice hockey player\n*  1990   – Stephen McLaughlin, Irish footballer\n*1991 – Kostas Manolas, Greek footballer\n*1992 – Devante Smith-Pelly, Canadian ice hockey player\n*1993 – Gurinder Sandhu, Australian cricketer\n*1999 – Chou Tzu-yu, Taiwanese singer (Twice)\n\nDeaths\n\n* 767 – Abu Hanifa, Iraqi scholar and educator (b. 699)\n* 809 – Ōtomo no Otomaro, Japanese general (b. 731)\n* 847 – Methodius I, patriarch of Constantinople\n* 957 – Guadamir, bishop of Vic (Spain)\n* 976 – Aron, Bulgarian nobleman\n*1161 – Emperor Qinzong of the Song dynasty (b. 1100)\n*1205 – Walter III, Count of Brienne\n*1349 – Günther von Schwarzburg, German king (b. 1304)\n*1381 – Simon Sudbury, English archbishop (b. 1316)\n*1497 – Giovanni Borgia, 2nd Duke of Gandia, Italian son of Pope Alexander VI (b. 1474)\n*1516 – John III of Navarre (b. 1469)\n*1544 – Antoine, Duke of Lorraine (b. 1489)\n*1548 – Carpentras, French composer (b. 1470)\n*1583 – Shibata Katsuie, Japanese samurai (b. 1522)\n*1594 – Orlande de Lassus, Flemish composer and educator (b. 1532)\n*1662 – Henry Vane the Younger, English-American politician, Governor of the Massachusetts Bay Colony (b. 1613)\n*1674 – Marin le Roy de Gomberville, French author and poet (b. 1600)\n*1746 – Colin Maclaurin, Scottish mathematician (b. 1698)\n*1794 – Francis Seymour-Conway, 1st Marquess of Hertford, English courtier and politician, Lord Lieutenant of Ireland (b. 1718)\n*1800 – Louis Desaix, French general (b. 1768)\n*  1800   – Jean-Baptiste Kléber, French general (b. 1753)\n*1801 – Benedict Arnold, American general during the American Revolution later turned British spy (b. 1741)\n*1825 – Pierre Charles L'Enfant, French-American architect and engineer, designed Washington, D.C.  (b. 1754)\n*1837 – Giacomo Leopardi, Italian poet and philosopher (b. 1798)\n*1864 – Leonidas Polk, American general and bishop (b. 1806)\n*1887 – Mary Carpenter, English educational and social reformer (b. 1807)\n*1883 – Edward FitzGerald, English poet and author (b. 1809)\n*1886 – Alexander Ostrovsky, Russian director and playwright (b. 1823)\n*1907 – William Le Baron Jenney, American architect and engineer, designed the Home Insurance Building  (b. 1832)\n*  1907   – Bartolomé Masó, Cuban soldier and politician (b. 1830)\n*1908 – Frederick Stanley, 16th Earl of Derby, English captain and politician, 6th Governor General of Canada (b. 1841)\n*1914 – Adlai Stevenson I, American lawyer and politician, 23rd Vice President of the United States (b. 1835)\n*1916 – João Simões Lopes Neto, Brazilian author (b. 1865)\n*1920 – Max Weber, German sociologist and economist (b. 1864)\n*1923 – Isabelle Bogelot, French philanthropist (b. 1838)\n*1926 – Mary Cassatt, American-French painter (b. 1843)\n*1927 – Ottavio Bottecchia, Italian cyclist (b. 1894)\n*  1927   – Jerome K. Jerome, English author (b. 1859)\n*1928 – Emmeline Pankhurst, English activist and academic (b. 1857)\n*1932 – Dorimène Roy Desjardins, Canadian businesswoman, co-founded Desjardins Group (b. 1858)\n*1933 – Justinien de Clary, French target shooter (b. 1860)\n*1936 – G. K. Chesterton, English essayist, poet, playwright, and novelist (b. 1874)\n*  1936   – Hans Poelzig, German architect, painter, and designer, designed the IG Farben Building (b. 1869)\n*1946 – John Logie Baird, Scottish-English physicist and engineer (b. 1888)\n*  1946   – Jorge Ubico, 21st President of Guatemala (b. 1878)\n*1953 – Tom Cole, Welsh-American racing driver (b. 1922)\n*1968 – Salvatore Quasimodo, Italian novelist and poet, Nobel Prize Laureate (b. 1901)\n*1972 – Dündar Taşer, Turkish soldier and politician (b. 1925)\n*1977 – Robert Middleton, American actor (b. 1911)\n*  1977   – Alan Reed, American actor, original voice of Fred Flintstone (b.1907)\n*1979 – Ahmad Zahir, Afghan singer-songwriter (b. 1946)\n*1980 – Charles Miller, American saxophonist and flute player (b. 1939)\n*1986 – Jorge Luis Borges,  Argentine short-story writer, essayist, poet and translator (b. 1899)\n*  1986   – Alan Jay Lerner, American composer and songwriter (b. 1918)\n*1987 – Stanisław Bareja, Polish actor, director, and screenwriter (b. 1929)\n*1990 – Erna Berger, German soprano and actress (b. 1900)\n*1991 – Peggy Ashcroft, English actress (b. 1907)\n*1994 – Lionel Grigson, English pianist, composer, and educator (b. 1942)\n*  1994   – Henry Mancini, American composer and conductor (b. 1924)\n*  1994   – Marcel Mouloudji, French singer and actor (b. 1922)\n*1995 – Els Aarne, Ukrainian-Estonian pianist, composer, and educator (b. 1917)\n*  1995   – Rory Gallagher, Irish singer-songwriter, guitarist, and producer (b. 1949)\n*  1995   – Roger Zelazny, American author and poet (b. 1937)\n*1996 – Noemí Gerstein, Argentinian sculptor and illustrator (b. 1908)\n*1997 – Richard Jaeckel, American actor (b. 1926)\n*1999 – Bernie Faloney, American-Canadian football player and sportscaster (b. 1932)\n*2000 – Attilio Bertolucci, Italian poet and author (b. 1911)\n*2002 – June Jordan, American author and activist (b. 1936)\n*2003 – Dale Whittington, American race car driver (b. 1959)\n*2004 – Ulrich Inderbinen, Swiss mountaineer and guide (b. 1900)\n*2005 – Carlo Maria Giulini, Italian conductor and director (b. 1914)\n*  2005   – Mimi Parent, Canadian-Swiss painter (b. 1924)\n*2006 – Monty Berman, English director, producer, and cinematographer (b. 1905)\n*  2006   – Jean Roba, Belgian author and illustrator (b. 1930)\n*2007 – Ruth Graham, Chinese-American author, poet, and painter (b. 1920)\n*  2007   – Robin Olds, American general and pilot (b. 1922)\n*  2007   – Kurt Waldheim, Austrian politician and war criminal, 9th President of Austria (b. 1918)\n*2009 – Bob Bogle, American musician (The Ventures) (b. 1934)\n*  2009   – William McIntyre, Canadian soldier, lawyer, and judge (b. 1918)\n*2012 – Peter Archer, Baron Archer of Sandwell, English lawyer and politician, Solicitor General for England and Wales (b. 1926)\n*  2012   – Bob Chappuis, American football player and soldier (b. 1923)\n*  2012   – Margie Hyams, American pianist and vibraphone player (b. 1920)\n*  2012   – Karl-Heinz Kämmerling, German pianist and academic (b. 1930)\n*  2012   – Carlos Reichenbach, Brazilian director and producer (b. 1945)\n*  2012   – Gitta Sereny, Austrian-English historian, journalist, and author (b. 1921) \n*2013 – Elroy Schwartz, American screenwriter and producer (b. 1923)\n*2014 – Alberto Cañas Escalante, Costa Rican journalist and politician (b. 1920)\n*  2014   – Isabelle Collin Dufresne, French actress (b. 1935)\n*  2014   – Robert Lebeck, German photographer and journalist (b. 1929)\n*  2014   – James E. Rogers, American lawyer, businessman, and academic (b. 1938)\n*2015 – Richard Cotton, Australian geneticist and academic (b. 1940)\n*  2015   – Anne Nicol Gaylor, American activist, co-founded the Freedom From Religion Foundation (b. 1926)\n*  2015   – Qiao Shi, Chinese politician (b. 1924)\n*2016 – Ann Morgan Guilbert, American actress and singer (b. 1928)\n*  2016   – Gilles Lamontagne, Canadian politician, 24th Lieutenant Governor of Quebec (b. 1919)\n\nHolidays and observances\n\n*Christian feast day:\n**Burchard of Meissen\n**Caomhán of Inisheer\n**Elisha (Roman Catholic and Lutheran)\n**Blessed Francisca de Paula de Jesus (Nhá Chica)\n**Joseph the Hymnographer (Roman Catholic:  Orthodox April 3)\n**Methodios I of Constantinople\n**Quintian of Rodez (Rodez)\n**Richard Baxter (Church of England)\n**Valerius and Rufinus\n**June 14 (Eastern Orthodox liturgics)\n*Commemoration of the Soviet Deportation related observances:\n**Baltic Freedom Day (United States) \n**Mourning and Commemoration Day or Leinapäev (Estonia)\n**Mourning and Hope Day (Lithuania)\n*Day of Memory for Repressed People (Armenia)\n*Flag Day (United States)\n*Freedom Day (Malawi)\n*Liberation Day (Falkland Islands and South Georgia and the South Sandwich Islands)\n*World Blood Donor Day. June 14. http://en.wikipedia.org/?curid=15797."
  }
}
