{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13546",
  "eid" : "0ae70a10-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778527537,
  "textBody" : "Henry Fielding (22 April 1707 – 8 October 1754) was an English novelist and dramatist known for his rich, earthy humour and satirical prowess, and as the author of the picaresque novel Tom Jones. Additionally, he holds a significant place in the history of law enforcement, having used his authority as a magistrate to found (with his half-brother John) what some have called London's first police force, the Bow Street Runners. His younger sister, Sarah, also became a successful writer.\n\nDramatist and novelist\n\nFielding was born at Sharpham, Somerset, and educated at Eton College, where he established a lifelong friendship with William Pitt the Elder. When Henry was 11, his mother died. A suit for custody was brought by his grandmother against his charming but irresponsible father, Lt. Gen. Edmund Fielding. The settlement placed Henry in his grandmother's care, although he continued to see his father in London.  In 1725, Henry tried to abduct his cousin, Sarah Andrews, while she was on her way to church. To avoid prosecution, he fled.  In 1728, he travelled to Leiden to study classics and law at the university. However, lack of money obliged him to return to London and he began writing for the theatre. Some of his work was savagely critical of the government of Prime Minister Sir Robert Walpole.\n\nThe Theatrical Licensing Act of 1737 is alleged to be a direct response to his activities. The particular play that triggered the Licensing Act was the unproduced, anonymously authored, The Golden Rump, but Fielding's dramatic satires had set the tone. Once the act was passed, political satire on the stage became virtually impossible, and playwrights whose works were staged were viewed as suspect. Fielding therefore retired from the theatre and resumed his career in law in order to support his wife Charlotte Craddock and two children, by becoming a barrister.\n\nFielding's lack of financial acumen meant he and his family often endured periods of poverty, but he was helped by Ralph Allen, a wealthy benefactor, on whom Squire Allworthy in Tom Jones was later based. Allen went on to provide for the education and support of Fielding's children after the writer's death.\n\nFielding never stopped writing political satire and satires of current arts and letters. The Tragedy of Tragedies (for which Hogarth designed the frontispiece) was, for example, quite successful as a printed play. He also contributed a number of works to journals of the day. \n\nFrom 1734 until 1739 he wrote anonymously for the leading Tory periodical, The Craftsman, against the Prime Minister, Sir Robert Walpole.Martin C. Battestin, 'Introduction', New Essays by Henry Fielding: His Contributions to the Craftsman (1734–1739) and Other Early Journalism (Charlottesville: The University Press of Virginia,\n1991), p. xvi. Fielding's patron was the opposition Whig MP (and his boyhood friend from Eton) George Lyttelton. Lyttelton followed his leader Lord Cobham in forming a Whig opposition to Walpole's government, called the Cobhamites (who also included Fielding's other Eton friend, William Pitt).Battestin, p. xx. In the Craftsman, Fielding articulated the opposition's attack on bribery and corruption in British politics.Battestin, p. xiii. Although writing for the opposition to Walpole that included Tories as well as Whigs, Fielding was \"unshakably a Whig\" and often praised Whig heroes such as the Duke of Marlborough and Gilbert Burnet.Battestin, p. 61.\n\nFielding dedicated his play Don Quixote in England to the opposition Whig leader Lord Chesterfield and it was published on 17 April 1734, the same day writs were issued for the general election.Battestin, p. xxiii. He dedicated his 1735 play The Universal Gallant to Charles Spencer, 3rd Duke of Marlborough, a political follower of Chesterfield.Battestin, p. xxv. The other prominent opposition newspaper, Common Sense, was named after a character in Fielding's Pasquin (1736) and was founded by Chesterfield and Lyttelton. Fielding wrote at least two articles it in 1737 and 1738.Battestin, p. 299, n. 62.\n\nFielding continued to air his political views in satirical articles and newspapers in the late 1730s and early 1740s. He became the chief writer for the Whig government of Henry Pelham.Battestin, p. 4.\n\nHe took to writing novels in 1741, angered by Samuel Richardson's success with Pamela. His first big success was an anonymous parody of that: Shamela. This satire follows the model of the famous Tory satirists of the previous generation, Jonathan Swift and John Gay, in particular.\n\nFielding followed this with Joseph Andrews (1742), an original work supposedly dealing with Pamela's brother, Joseph. His purpose in this book, however, was more than parody, for he intended, as he announced in the preface, a \"kind of writing which I do not remember to have seen hithereto attempted in our language.\" In this new kind of writing, which Fielding called a \"comic epic poem in prouse,\" he creatively blended two classical traditions: that of the epic, which had been poetic, and that of the drama, but emphasizing the comic rather than the tragic. Another distinction of Joseph Andrews and of the novels to come was the use of everyday reality of character and action as opposed to the fables of the past. Although begun as a parody, it developed into an accomplished novel in its own right and is considered to mark Fielding's debut as a serious novelist. In 1743, he published a novel in the Miscellanies volume III (which was the first volume of the Miscellanies): The History of the Life of the Late Mr Jonathan Wild the Great, which is sometimes counted as his first, as he almost certainly began it before he wrote Shamela and Joseph Andrews. It is a satire of Walpole that draws a parallel between him and Jonathan Wild, the infamous gang leader and highwayman. He implicitly compares the Whig party in Parliament with a gang of thieves being run by Walpole, whose constant desire to be a \"Great Man\" (a common epithet for Walpole) ought to culminate in the antithesis of greatness: being hanged.\n\nHis anonymous The Female Husband (1746) is a fictionalized account of a notorious case in which a female transvestite was tried for duping another woman into marriage; this was one of a number of small pamphlets, and cost sixpence at the time. Though a minor item in Fielding's œuvre, the subject is consistent with his ongoing preoccupation with fraud, shamming and masks. His greatest work was Tom Jones (1749), a meticulously constructed picaresque novel telling the convoluted and hilarious tale of how a foundling came into a fortune. The plot of Tom Jones is too ingeniously complicated for simple summary; its basis is Tom's alienation from his foster father, Squire Allworthy, and his sweetheart, Sophia Western, and his reconciliation with them after lively and dangerous adventures on the road and in London. The triumph of the book is its presentation of English life and character in the mid-18th century. Every social type is represented, and through them every shade of moral behavior. Fielding's varied style tempers the basic seriousness of the novel, and his authorial comment preceding each chapter adds a significant dimension to the conventionally straightforward narrative.\n\nMarriages\n\nFielding married Charlotte Craddock in 1734 at the Church of St Mary in Charlcombe, Somerset. She died in 1744, and he later modelled the heroines of both Tom Jones and Amelia on her. They had five children together; their only daughter Henrietta died at age 23, having already been \"in deep decline\" when she married military engineer James Gabriel Montresor some months before. Three years after Charlotte's death, Fielding disregarded public opinion by marrying her former maid Mary Daniel, who was pregnant. Mary bore five children: three daughters who died young, and sons William and Allen.\n\nJurist and magistrate\n\nDespite this scandal, Fielding's consistent anti-Jacobitism and support for the Church of England led to his being rewarded a year later with the position of London's chief magistrate, while his literary career went from strength to strength. Most of his work was concerned with London's criminal population of thieves, informers, gamblers, and prostitutes. In a corrupt and callous society he became noted for his impartial judgements, incorruptibility, and compassion for those whom social inequities had forced into crime. The income from his office, which he called \"the dirtiest money upon earth,\" dwindled because he refused to take money from the very poor. Joined by his younger half-brother John, he helped found what some have called London's first police force, the Bow Street Runners, in 1749.\n\nAccording to the historian G. M. Trevelyan, they were two of the best magistrates in 18th-century London, who did much to enhance judicial reform and improve prison conditions. Fielding's influential pamphlets and enquiries included a proposal for the abolition of public hangings. This did not, however, imply opposition to capital punishment as such – as is evident, for example, in his presiding in 1751 over the trial of the notorious criminal James Field, finding him guilty in a robbery and sentencing him to hang. John Fielding, despite being blind by then, succeeded his older brother as chief magistrate, becoming known as the \"Blind Beak of Bow Street\" for his ability to recognise criminals by their voices alone..\n\nIn January 1752 Fielding started a fortnightly periodical entitled The Covent-Garden Journal, which he would publish under the pseudonym of \"Sir Alexander Drawcansir, Knt. Censor of Great Britain\" until November of the same year. In this periodical, Fielding directly challenged the \"armies of Grub Street\" and the contemporary periodical writers of the day in a conflict that would eventually become the Paper War of 1752–3.\n\nFielding then published Examples of the Interposition of Providence in the Detection and Punishment of Murder (1752), a treatise in which he rejected the deistic and materialistic visions of the world in favour of belief in God's presence and divine judgement,Fielding, Henry. 1988. An Enquiry Into the Causes of the Late Increase of Robbers and Related Writings. Oxford: Clarendon, 1988. arguing that the murder rate was rising due to neglect of the Christian religion.Valier, Claire. 2005. Crime and Punishment in Contemporary Culture. Routledge. p. 20. In 1753 he wrote Proposals for Making an Effectual Provision for the Poor.\n\nFielding's ardent commitment to the cause of justice as a great humanitarian in the 1750s (for instance, his support of Elizabeth Canning) coincided with rapid deterioration in his health. Gout, asthma, cirrhosis of the liver[http://www.oxforddnb.com/view/article/9400?docPos1 \"Oxford Dictionary of National Biography\"]. and other afflictions made him use crutches. This sent him to Portugal in 1754 in search of a cure, but he died in Lisbon, reportedly in physical pain and mental distress, only two months later. His tomb is in the city's English Cemetery (Cemitério Inglês), which is now the graveyard of St. George's Church, Lisbon.\n\nPartial list of works\n\n*The Masquerade – a poem (Fielding's first publication)\n*Love in Several Masques – play, 1728\n*Rape upon Rape – play, 1730. Adapted by Bernard Miles as Lock Up Your Daughters! in 1959, filmed in 1974\n*The Temple Beau – play, 1730\n*The Author's Farce – play, 1730\n*The Letter Writers - play, 1731\n*The Tragedy of Tragedies; or, The Life and Death of Tom Thumb the Great – play, 1731\n*The Grub Street Opera – play, 1731\n*The Modern Husband – play, 1732\n*The Mock Doctor - play, 1732\n*The Lottery - play, 1732\n*The Covent Garden Tragedy – play, 1732\n*The Miser - play, 1732\n*The Intriguing Chambermaid - play, 1734\n*Don Quixote in England - play, 1734\n*Pasquin – play, 1736\n*Eurydice Hiss'd - play, 1737\n*The Historical Register for the Year 1736 – play, 1737\n*Shamela – novella, 1741\n*The History of the Adventures of Joseph Andrews and his Friend, Mr. Abraham Abrams – novel, 1742\n*The Life and Death of Jonathan Wild, the Great – novel, 1743, ironic treatment of Jonathan Wild, a notorious underworld figure of the time. Published as Volume 3 of Miscellanies.\n*Miscellanies – collection of works, 1743, contained the poem \"Part of Juvenal's Sixth Satire, Modernized in Burlesque Verse\"\n*The Female Husband or the Surprising History of Mrs Mary alias Mr George Hamilton, who was convicted of having married a young woman of Wells and lived with her as her husband, taken from her own mouth since her confinement – pamphlet, fictionalized report, 1746\n*The History of Tom Jones, a Foundling – novel, 1749\n*A Journey from this World to the Next – 1749\n*Amelia – novel, 1751\n*\"[https://archive.org/stream/completeworkshe16henlgoog#page/n189/mode/2up Examples of the interposition of Providence in the Detection and Punishment of Murder containing above thirty cases in which this dreadful crime has been brought to light in the most extraordinary and miraculous manner; collected from various authors, ancient and modern]\" (1752)\n*The Covent-Garden Journal – periodical, 1752\n*Journal of a Voyage to Lisbon – travel narrative, 1755\n*The Fathers: Or, the Good-Natur'd Man – play, published posthumously in 1778",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Henry Fielding" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13546" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Henry Fielding (22 April 1707 – 8 October 1754) was an English novelist and dramatist known for his rich, earthy humour and satirical prowess, and as the author of the picaresque novel Tom Jones. Additionally, he holds a significant place in the history of law enforcement, having used his authority as a magistrate to found (with his half-brother John) what some have called London's first police force, the Bow Street Runners. His younger sister, Sarah, also became a successful writer.\n\nDramatist and novelist\n\nFielding was born at Sharpham, Somerset, and educated at Eton College, where he established a lifelong friendship with William Pitt the Elder. When Henry was 11, his mother died. A suit for custody was brought by his grandmother against his charming but irresponsible father, Lt. Gen. Edmund Fielding. The settlement placed Henry in his grandmother's care, although he continued to see his father in London.  In 1725, Henry tried to abduct his cousin, Sarah Andrews, while she was on her way to church. To avoid prosecution, he fled.  In 1728, he travelled to Leiden to study classics and law at the university. However, lack of money obliged him to return to London and he began writing for the theatre. Some of his work was savagely critical of the government of Prime Minister Sir Robert Walpole.\n\nThe Theatrical Licensing Act of 1737 is alleged to be a direct response to his activities. The particular play that triggered the Licensing Act was the unproduced, anonymously authored, The Golden Rump, but Fielding's dramatic satires had set the tone. Once the act was passed, political satire on the stage became virtually impossible, and playwrights whose works were staged were viewed as suspect. Fielding therefore retired from the theatre and resumed his career in law in order to support his wife Charlotte Craddock and two children, by becoming a barrister.\n\nFielding's lack of financial acumen meant he and his family often endured periods of poverty, but he was helped by Ralph Allen, a wealthy benefactor, on whom Squire Allworthy in Tom Jones was later based. Allen went on to provide for the education and support of Fielding's children after the writer's death.\n\nFielding never stopped writing political satire and satires of current arts and letters. The Tragedy of Tragedies (for which Hogarth designed the frontispiece) was, for example, quite successful as a printed play. He also contributed a number of works to journals of the day. \n\nFrom 1734 until 1739 he wrote anonymously for the leading Tory periodical, The Craftsman, against the Prime Minister, Sir Robert Walpole.Martin C. Battestin, 'Introduction', New Essays by Henry Fielding: His Contributions to the Craftsman (1734–1739) and Other Early Journalism (Charlottesville: The University Press of Virginia,\n1991), p. xvi. Fielding's patron was the opposition Whig MP (and his boyhood friend from Eton) George Lyttelton. Lyttelton followed his leader Lord Cobham in forming a Whig opposition to Walpole's government, called the Cobhamites (who also included Fielding's other Eton friend, William Pitt).Battestin, p. xx. In the Craftsman, Fielding articulated the opposition's attack on bribery and corruption in British politics.Battestin, p. xiii. Although writing for the opposition to Walpole that included Tories as well as Whigs, Fielding was \"unshakably a Whig\" and often praised Whig heroes such as the Duke of Marlborough and Gilbert Burnet.Battestin, p. 61.\n\nFielding dedicated his play Don Quixote in England to the opposition Whig leader Lord Chesterfield and it was published on 17 April 1734, the same day writs were issued for the general election.Battestin, p. xxiii. He dedicated his 1735 play The Universal Gallant to Charles Spencer, 3rd Duke of Marlborough, a political follower of Chesterfield.Battestin, p. xxv. The other prominent opposition newspaper, Common Sense, was named after a character in Fielding's Pasquin (1736) and was founded by Chesterfield and Lyttelton. Fielding wrote at least two articles it in 1737 and 1738.Battestin, p. 299, n. 62.\n\nFielding continued to air his political views in satirical articles and newspapers in the late 1730s and early 1740s. He became the chief writer for the Whig government of Henry Pelham.Battestin, p. 4.\n\nHe took to writing novels in 1741, angered by Samuel Richardson's success with Pamela. His first big success was an anonymous parody of that: Shamela. This satire follows the model of the famous Tory satirists of the previous generation, Jonathan Swift and John Gay, in particular.\n\nFielding followed this with Joseph Andrews (1742), an original work supposedly dealing with Pamela's brother, Joseph. His purpose in this book, however, was more than parody, for he intended, as he announced in the preface, a \"kind of writing which I do not remember to have seen hithereto attempted in our language.\" In this new kind of writing, which Fielding called a \"comic epic poem in prouse,\" he creatively blended two classical traditions: that of the epic, which had been poetic, and that of the drama, but emphasizing the comic rather than the tragic. Another distinction of Joseph Andrews and of the novels to come was the use of everyday reality of character and action as opposed to the fables of the past. Although begun as a parody, it developed into an accomplished novel in its own right and is considered to mark Fielding's debut as a serious novelist. In 1743, he published a novel in the Miscellanies volume III (which was the first volume of the Miscellanies): The History of the Life of the Late Mr Jonathan Wild the Great, which is sometimes counted as his first, as he almost certainly began it before he wrote Shamela and Joseph Andrews. It is a satire of Walpole that draws a parallel between him and Jonathan Wild, the infamous gang leader and highwayman. He implicitly compares the Whig party in Parliament with a gang of thieves being run by Walpole, whose constant desire to be a \"Great Man\" (a common epithet for Walpole) ought to culminate in the antithesis of greatness: being hanged.\n\nHis anonymous The Female Husband (1746) is a fictionalized account of a notorious case in which a female transvestite was tried for duping another woman into marriage; this was one of a number of small pamphlets, and cost sixpence at the time. Though a minor item in Fielding's œuvre, the subject is consistent with his ongoing preoccupation with fraud, shamming and masks. His greatest work was Tom Jones (1749), a meticulously constructed picaresque novel telling the convoluted and hilarious tale of how a foundling came into a fortune. The plot of Tom Jones is too ingeniously complicated for simple summary; its basis is Tom's alienation from his foster father, Squire Allworthy, and his sweetheart, Sophia Western, and his reconciliation with them after lively and dangerous adventures on the road and in London. The triumph of the book is its presentation of English life and character in the mid-18th century. Every social type is represented, and through them every shade of moral behavior. Fielding's varied style tempers the basic seriousness of the novel, and his authorial comment preceding each chapter adds a significant dimension to the conventionally straightforward narrative.\n\nMarriages\n\nFielding married Charlotte Craddock in 1734 at the Church of St Mary in Charlcombe, Somerset. She died in 1744, and he later modelled the heroines of both Tom Jones and Amelia on her. They had five children together; their only daughter Henrietta died at age 23, having already been \"in deep decline\" when she married military engineer James Gabriel Montresor some months before. Three years after Charlotte's death, Fielding disregarded public opinion by marrying her former maid Mary Daniel, who was pregnant. Mary bore five children: three daughters who died young, and sons William and Allen.\n\nJurist and magistrate\n\nDespite this scandal, Fielding's consistent anti-Jacobitism and support for the Church of England led to his being rewarded a year later with the position of London's chief magistrate, while his literary career went from strength to strength. Most of his work was concerned with London's criminal population of thieves, informers, gamblers, and prostitutes. In a corrupt and callous society he became noted for his impartial judgements, incorruptibility, and compassion for those whom social inequities had forced into crime. The income from his office, which he called \"the dirtiest money upon earth,\" dwindled because he refused to take money from the very poor. Joined by his younger half-brother John, he helped found what some have called London's first police force, the Bow Street Runners, in 1749.\n\nAccording to the historian G. M. Trevelyan, they were two of the best magistrates in 18th-century London, who did much to enhance judicial reform and improve prison conditions. Fielding's influential pamphlets and enquiries included a proposal for the abolition of public hangings. This did not, however, imply opposition to capital punishment as such – as is evident, for example, in his presiding in 1751 over the trial of the notorious criminal James Field, finding him guilty in a robbery and sentencing him to hang. John Fielding, despite being blind by then, succeeded his older brother as chief magistrate, becoming known as the \"Blind Beak of Bow Street\" for his ability to recognise criminals by their voices alone..\n\nIn January 1752 Fielding started a fortnightly periodical entitled The Covent-Garden Journal, which he would publish under the pseudonym of \"Sir Alexander Drawcansir, Knt. Censor of Great Britain\" until November of the same year. In this periodical, Fielding directly challenged the \"armies of Grub Street\" and the contemporary periodical writers of the day in a conflict that would eventually become the Paper War of 1752–3.\n\nFielding then published Examples of the Interposition of Providence in the Detection and Punishment of Murder (1752), a treatise in which he rejected the deistic and materialistic visions of the world in favour of belief in God's presence and divine judgement,Fielding, Henry. 1988. An Enquiry Into the Causes of the Late Increase of Robbers and Related Writings. Oxford: Clarendon, 1988. arguing that the murder rate was rising due to neglect of the Christian religion.Valier, Claire. 2005. Crime and Punishment in Contemporary Culture. Routledge. p. 20. In 1753 he wrote Proposals for Making an Effectual Provision for the Poor.\n\nFielding's ardent commitment to the cause of justice as a great humanitarian in the 1750s (for instance, his support of Elizabeth Canning) coincided with rapid deterioration in his health. Gout, asthma, cirrhosis of the liver[http://www.oxforddnb.com/view/article/9400?docPos1 \"Oxford Dictionary of National Biography\"]. and other afflictions made him use crutches. This sent him to Portugal in 1754 in search of a cure, but he died in Lisbon, reportedly in physical pain and mental distress, only two months later. His tomb is in the city's English Cemetery (Cemitério Inglês), which is now the graveyard of St. George's Church, Lisbon.\n\nPartial list of works\n\n*The Masquerade – a poem (Fielding's first publication)\n*Love in Several Masques – play, 1728\n*Rape upon Rape – play, 1730. Adapted by Bernard Miles as Lock Up Your Daughters! in 1959, filmed in 1974\n*The Temple Beau – play, 1730\n*The Author's Farce – play, 1730\n*The Letter Writers - play, 1731\n*The Tragedy of Tragedies; or, The Life and Death of Tom Thumb the Great – play, 1731\n*The Grub Street Opera – play, 1731\n*The Modern Husband – play, 1732\n*The Mock Doctor - play, 1732\n*The Lottery - play, 1732\n*The Covent Garden Tragedy – play, 1732\n*The Miser - play, 1732\n*The Intriguing Chambermaid - play, 1734\n*Don Quixote in England - play, 1734\n*Pasquin – play, 1736\n*Eurydice Hiss'd - play, 1737\n*The Historical Register for the Year 1736 – play, 1737\n*Shamela – novella, 1741\n*The History of the Adventures of Joseph Andrews and his Friend, Mr. Abraham Abrams – novel, 1742\n*The Life and Death of Jonathan Wild, the Great – novel, 1743, ironic treatment of Jonathan Wild, a notorious underworld figure of the time. Published as Volume 3 of Miscellanies.\n*Miscellanies – collection of works, 1743, contained the poem \"Part of Juvenal's Sixth Satire, Modernized in Burlesque Verse\"\n*The Female Husband or the Surprising History of Mrs Mary alias Mr George Hamilton, who was convicted of having married a young woman of Wells and lived with her as her husband, taken from her own mouth since her confinement – pamphlet, fictionalized report, 1746\n*The History of Tom Jones, a Foundling – novel, 1749\n*A Journey from this World to the Next – 1749\n*Amelia – novel, 1751\n*\"[https://archive.org/stream/completeworkshe16henlgoog#page/n189/mode/2up Examples of the interposition of Providence in the Detection and Punishment of Murder containing above thirty cases in which this dreadful crime has been brought to light in the most extraordinary and miraculous manner; collected from various authors, ancient and modern]\" (1752)\n*The Covent-Garden Journal – periodical, 1752\n*Journal of a Voyage to Lisbon – travel narrative, 1755\n*The Fathers: Or, the Good-Natur'd Man – play, published posthumously in 1778. Henry Fielding. http://en.wikipedia.org/?curid=13546."
  }
}
