{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=6112",
  "eid" : "d9eb84e0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778445358,
  "textBody" : "The CN Tower () is a  concrete communications and observation tower in downtown Toronto, Ontario, Canada. Built on the former Railway Lands, it was completed in 1976, and held the record for the world's tallest free-standing structure for 32 years from 1975–2007 and was the world's tallest tower until 2009 being overtaken by Burj Khalifa and Canton Tower, respectively. It is now the third tallest tower in the world and remains the tallest free-standing structure in the Western Hemisphere, a signature icon of Toronto's skyline,[http://www.canada.com/topics/travel/story.html?id\n057d78dc-4964-422f-ba85-361425ea8126&k3499 CN Tower celebrates 30th birthday], Broadcast News/canada.com, June 26, 2006  attracting more than two million international visitors annually.\n\nIts name \"CN\" originally referred to Canadian National, the railway company that built the tower. Following the railway's decision to divest non-core freight railway assets prior to the company's privatization in 1995, it transferred the tower to the Canada Lands Company, a federal Crown corporation responsible for real estate development.\n\nIn 1995, the CN Tower was declared one of the modern Seven Wonders of the World by the American Society of Civil Engineers. It also belongs to the World Federation of Great Towers.\n\nHistory \n\nThe idea of the CN Tower originated in 1968 when the Canadian National Railway wanted to build a large TV and radio communication platform to serve the Toronto area, as well as demonstrate the strength of Canadian industry and CN in particular. These plans evolved over the next few years, and the project became official in 1972.\n\nThe tower would have been part of Metro Centre (see CityPlace), a large development south of Front Street on the Railway Lands, a large railway switching yard that was being made redundant by newer yards outside the city. Key project team members were NCK Engineering as structural engineer; John Andrews Architects; Webb, Zerafa, Menkes, Housden Architects; Foundation Building Construction; and Canron (Eastern Structural Division).\n\nAs Toronto grew rapidly during the late 1960s and early 1970s, multiple skyscrapers were constructed in the downtown core, most notably First Canadian Place. The reflective nature of the new buildings compromised the quality of broadcast signals necessitating new, higher antennas that were at least 300 m tall.\n\nAt the time, most data communications took place over point-to-point microwave links, whose dish antennae covered the roofs of large buildings. As each new skyscraper was added to the downtown, former line-of-sight links were no longer possible. CN intended to rent \"hub\" space for microwave links, visible from almost any building in the Toronto area.\n\nThe CN Tower can be seen from at least as far away as Kennedy Street in Aurora, Ontario, approximately 40 km to the north, 60 km east of Toronto, in Oshawa, and from several points on the south shore of Lake Ontario, 48 km to the south in the U.S. state of New York.\n\nThe original plan for the tower envisioned a tripod consisting of three independent cylindrical \"pillars\" linked at various heights by structural bridges. Had it been built, this design would have been considerably shorter, with the metal antenna located roughly where the concrete section between the main level and the SkyPod lies today. As the design effort continued, it evolved into the current design with a single continuous hexagonal core to the SkyPod, with three support legs blended into the hexagon below the main level, forming a large Y-shape structure at the ground level.\n\nThe idea for the main level in its current form evolved around this time, but the Space Deck (now named SkyPod) was not part of the plans until some time later. One engineer in particular felt that visitors would feel the higher observation deck would be worth paying extra for, and the costs in terms of construction were not prohibitive. It was also some time around this point that it was realized that the tower could become the world's tallest structure, and plans were changed to incorporate subtle modifications throughout the structure to this end.\n\nConstruction \n\nConstruction on the CN Tower began on February 6, 1973, with massive excavations at the tower base for the foundation. By the time the foundation was complete, 56000 t of earth and shale were removed to a depth of 15 m in the centre, and a base incorporating 7000 m3 of concrete with 450 t of rebar and 36 t of steel cable had been built to a thickness of . This portion of the construction was fairly rapid, with only four months needed between the start and the foundation being ready for construction on top.\n\nTo create the main support pillar, workers constructed a hydraulically raised slipform at the base. This was a fairly unprecedented engineering feat on its own, consisting of a large metal platform that raised itself on jacks at about 6 m per day as the concrete below set. Concrete was poured continuously by a team of 1,532 people until February 22, 1974, during which it had already become the tallest structure in Canada, surpassing the recently built Inco Superstack in Sudbury, which was built using similar methods.\n\nIn total, the tower contains 40500 m3 of concrete, all of which was mixed on-site in order to ensure batch consistency. Through the pour, the vertical accuracy of the tower was maintained by comparing the slip form's location to massive plumb bobs hanging from it, observed by small telescopes from the ground. Over the height of the tower, it varies from true vertical accuracy by only 29 mm.\n\nIn August 1974, construction of the main level commenced. Using 45 hydraulic jacks attached to cables strung from a temporary steel crown anchored to the top of the tower, twelve giant steel and wooden bracket forms were slowly raised, ultimately taking about a week to crawl up to their final position. These forms were used to create the brackets that support the main level, as well as a base for the construction of the main level itself. The Space Deck (currently named SkyPod) was built of concrete poured into a wooden frame attached to rebar at the lower level deck, and then reinforced with a large steel compression band around the outside.\n\nThe antenna was originally to be raised by crane as well, but during construction the Sikorsky S-64 Skycrane helicopter became available when the United States Army sold one to civilian operators. The helicopter, named \"Olga\", was first used to remove the crane, and then flew the antenna up in 36 sections.\n\nThe flights of the antenna pieces were a minor tourist attraction of their own, and the schedule was printed in the local newspapers. Use of the helicopter saved months of construction time, with this phase taking only three and a half weeks instead of the planned six months. The tower was topped-off on April 2, 1975, after 26 months of construction, officially capturing the height record from Moscow's Ostankino Tower, and bringing the total mass to 118000 t.\n\nTwo years into the construction, plans for Metro Centre were scrapped, leaving the tower isolated on the Railway Lands in what was then a largely abandoned light-industrial space. This caused serious problems for tourists to access the tower. Ned Baldwin, project architect with John Andrews, wrote at the time that \"All of the logic which dictated the design of the lower accommodation has been upset,\" and that \"Under such ludicrous circumstances Canadian National would hardly have chosen this location to build.\"\n\nPhases of construction \n\nFile:CN Tower footings 1973.jpg|Constructing the base, July 1973\nFile:Cntower1974.jpg|Brackets being raised, August 1974\nFile:CN Tower50 construction skycrane March 1975 01d.jpg|Helicopter lifting part of antenna, March 1975\nFile:CN Tower under construction (April 1975).jpg|Main pod construction, April 1975\nFile:CN Tower under construction.jpg|Nearing completion, December 1975\nFile:CN Tower 1976.jpg|Two months after opening, August 1976\n\nArchitects \n\n*WZMH Architects\n*John Hamilton Andrews\n*Webb Zerafa\n*Menkes Housden with the help of E.R. Baldwin\n\nOpening \n\nThe CN Tower opened to the public on June 26, 1976. The construction costs of approximately  ($ in  dollars) were repaid in fifteen years. Canadian National Railway sold the tower prior to taking the company private in 1995, when it decided to divest all operations not directly related to its core freight shipping businesses.\n\nFrom the mid-1970s to the mid-1980s, the CN Tower was practically the only development along Front Street West; it was still possible to see Lake Ontario from the foot of the CN Tower due to the expansive parking lots and lack of development in the area at the time. As the area around the tower was developed, particularly with the completion of the Metro Toronto Convention Centre in 1984 and the SkyDome in 1989 (renamed Rogers Centre in 2005), the former Railway Lands were redeveloped and the tower became the centre of a newly developing entertainment area. Access was greatly improved with the construction of the SkyWalk in 1989, which connected the tower and SkyDome to the nearby Union Station railway and subway station,  and, in turn, to the city's PATH underground pedestrian system. By the mid-1990s, it was the centre of a thriving tourist district. The entire area continues to be an area of intense building, notably a boom in condominium construction in the first two decades of the 21st century, as well as the 2013 opening of the Ripley's Aquarium by the base of the tower.\n\nEvents \n\n*While still under construction, the CN Tower officially became the world's tallest free-standing structure on March 31, 1975.\n*When the CN Tower opened in 1976, there were three public observation points: the SkyPod (then known as the Space Deck) that stands at 447 m, the Indoor Observation Level (later named Indoor Lookout Level) at 346 m, and the Outdoor Observation Terrace (at the same level as the Glass Floor) at 342 m. One floor above the Indoor Observation Level was the Top of Toronto Restaurant, which completed a revolution once every 90 minutes.\n*Stuntman Dar Robinson jumped off of the CN Tower on two occasions in 1979 and 1980. The first was for a scene from the movie Highpoint, in which Robinson received $250,000 for the stunt. The second was for a personal documentary. Both stunts used a wire decelerator attached to his back.\n*On June 26, 1986, the ten-year anniversary of the tower's opening, high-rise firefighting and rescue advocate Dan Goodwin, in a sponsored publicity event, used his hands and feet to climb the outside of the tower, a feat he performed twice on the same day. Following both ascents, he used multiple rappels to descend to the ground.\n*The Glass Floor, at an elevation of 342 m, opened to the public on June 26, 1994.\n*From 1997 to January 2004, TrizecHahn Corporation managed the tower and instituted several expansion projects including a C$26 million entertainment expansion and revitalization that included the 1997 addition of two new elevators (to a total of six) and the consequential relocation of the staircase from the north side leg to inside the core of the building, a conversion that also added nine stairs to the climb. TrizecHahn also owned the Willis Tower (Sears Tower at the time) in Chicago approximately at the same time.\n*In 2007, light-emitting diode (LED) lights replaced the incandescent lights that lit the CN Tower at night, the reason cited that LED lights are more cost and energy efficient than the incandescent lights. The colour of the LED lights can change, compared to the constant white colour of the incandescent lights.\n*On September 12, 2007, Burj Khalifa, then under construction, surpassed the CN Tower as the world's tallest free-standing structure.\n*In 2008, glass panels were installed in one of the CN Tower elevators, which established a world record (346 m) for highest glass floor panelled elevator in the world.\n*The CN Tower was closed during the G20 summit on June 26–27, 2010, for security reasons, given its proximity to the Metro Toronto Convention Centre.\n*In 2011, EdgeWalk (where at an elevation of 356 m, visitors tethered to an overhead rail system can walk on the roof of the main pod) opened to the public.\n* On July 10, 2015, the CN Tower was incorporated into the opening ceremony of the 2015 Pan American Games. A pre-recorded segment featured Bruny Surin passing the flame to Donovan Bailey on the EdgeWalk and parachuting into Rogers Centre. A fireworks display off the tower served as the ceremony's finale.\n* On July 1, 2017, as part of the nationwide celebrations for Canada 150, fireworks were once again shot from the tower, in a five-minute display coordinated with the tower lights and music broadcast on a local radio station.\n\nStructure \n\nThe CN Tower consists of several substructures. The main portion of the tower is a hollow concrete hexagonal pillar containing the stairwells and power and plumbing connections. The Tower's six elevators are located in the three inverted angles created by the Tower's hexagonal shape (two elevators per angle). Each of the three elevator shafts is lined with glass, allowing for views of the city as the glass-windowed elevators make their way through the Tower. The stairwell was originally located in one of these angles (the one facing north), but was moved into the central hollow of the Tower; the Tower's new fifth and sixth elevators were placed in the hexagonal angle that once contained the stairwell. On top of the main concrete portion of the Tower is a 102 m tall metal broadcast antenna, carrying TV and radio signals. There are three visitor areas: the Glass Floor and Outdoor Observation Terrace which are both located at an elevation of 342 m, the Indoor Lookout Level (formerly known as \"Indoor Observation Level\") located at 346 m, and the higher SkyPod (formerly known as \"Space Deck\") at , just below the metal antenna. The hexagonal shape can be seen between the two areas; however, below the main deck, three large supporting legs give the tower the appearance of a large tripod.\n\nThe main deck level is seven storeys, some of which are open to the public. Below the public areas — at 338 m — is a large white donut-shaped radome containing the structure's microwave receivers. The glass floor and outdoor observation deck are at 342 m. The glass floor has an area of 24 m2 and can withstand a pressure of 4100 kPa. The floor's thermal glass units are 64 mm thick, consisting of a pane of 25 mm laminated glass, 25 mm airspace and a pane of 13 mm laminated glass. Some people experience acrophobia when standing on the glass floor and looking down at the ground 342 m below. In 2008, one elevator was upgraded to add a glass floor panel, believed to have the highest vertical rise of any elevator equipped with this feature.  Both linked pages include a video of the elevator with glass floor in operation.  The Horizons Cafe and the lookout level are at 346 m. The 360 Restaurant, a revolving restaurant that completes a full rotation once every 72 minutes, is at 351 m. When the tower first opened, it also featured a disco named Sparkles (at the Indoor Observation Level), billed as the highest disco and dance floor in the world.Malcolm, Andrew. [https://select.nytimes.com/gst/abstract.html?res=FA0D10F73F5C11728DDDA90994D8415B898BF1D3 \"A New High for Disco in Toronto's Tower\"], The New York Times, October 10, 1979. Accessed February 10, 2011.\n\nThe SkyPod was once the highest public observation deck in the world until it was surpassed by the Shanghai World Financial Center in 2008.\n\nA metal staircase reaches the main deck level after 1,776 steps, and the SkyPod 100 m above after 2,579 steps; it is the tallest metal staircase on Earth. These stairs are intended for emergency use only and are not open to the public, except for twice per year for charity stair-climb events. The average climber takes approximately 30 minutes to climb to the base of the radome, but the fastest climb on record is 7 minutes and 52 seconds in 1989 by Brendan Keenoy, an Ontario Provincial Police officer. In 2002, Canadian Olympian and Paralympic champion Jeff Adams climbed the stairs of the tower in a specially designed wheelchair. The stairs were originally on one of the three sides of the tower (facing north), with a glass view, but these were later replaced with the third elevator pair and the stairs were moved to the inside of the core. Top climbs on the new, windowless stairwell used since around 2003 have generally been over ten minutes.\n\ninsidecntower360.JPG|Inside 360 Restaurant\nToronto - ON - CN Tower Turmkorb.jpg|Main Pod\nCN Tower Turmkorb-Modell-blau.png|Cross-section of Main Pod\nCN Tower Glass Floor Walk.jpg|Standing on glass floor\nCNTowerNastyFall.jpg|View though glass floor\n\nEdgeWalk \n\nOn August 1, 2011, the CN Tower opened the EdgeWalk, an amusement in which thrill-seekers can walk on and around the roof of the main pod of the tower at 356 m, which is directly above the 360 Restaurant. It is the world's highest full-circle, hands-free walk. Visitors are tethered to an overhead rail system and walk around the edge of the CN Tower's main pod above the 360 Restaurant on a  metal floor. The attraction is closed throughout the winter season and during periods of electrical storms and high winds.\n\nOne of the notable guests who visited EdgeWalk includes Canadian comedian Rick Mercer, as featured on his CBC Television news satire show, Rick Mercer Report. He was accompanied by Canadian pop singer Jann Arden.\n\nFalling ice danger \n\nA freezing rain storm on March 2, 2007, resulted in a layer of ice several centimetres thick forming on the side of the tower and other downtown buildings. The sun thawed the ice, and winds of up to 90 km/h blew some of it away from the structure. There were fears that cars and windows of nearby buildings would be smashed by large chunks of ice. In response, police closed some streets surrounding the tower. During morning rush hour on March 5 of the same year, police expanded the area of closed streets to include the Gardiner Expressway 310 m away from the tower, as increased winds blew the ice farther away, as far north as King Street, 490 m away, where a taxicab window was shattered.\n\nSubsequently, on March 6, 2007, the Gardiner Expressway reopened after winds abated.\n\nSafety features \n\nIn August 2000, a fire broke out at the Ostankino Tower in Moscow killing three people and causing extensive damage. The fire was blamed on poor maintenance and outdated equipment. The failure of the fire-suppression systems and the lack of proper equipment for firefighters allowed the fire to destroy most of the interior and spark fears the tower might even collapse.\n\nThe Ostankino Tower was completed nine years before the CN Tower, and is only 13 m shorter. The parallels between the towers led to some concern that the CN Tower could be at risk of a similar tragedy. However, Canadian officials subsequently stated that it is \"highly unlikely\" that a similar disaster could occur at the CN Tower, as it has important safeguards that were not present in the Ostankino Tower. Specifically, officials cited:\n\n* the fireproof building materials used in the tower's construction,\n* frequent and stringent safety inspections,\n* an extensive sprinkler system,\n* a 24-hour emergency monitoring operation,\n* two 68,160-litre (15,000-imperial gallon; 18,006-US gallon) water reservoirs at the top, which are automatically replenished,\n* a fire hose at the base of the structure capable of sending 2725 litres (600 imperial gallons; 720 US Gallon) a minute to any location in the tower,\n* a ban on natural gas appliances anywhere in the tower (including the restaurant in the main pod),\n* an elevator that can be used during a fire as it runs up the outside of the building and can be powered by three emergency generators at the base of the structure (unlike the elevator at the Ostankino Tower, which malfunctioned).\n\nOfficials also noted that the CN Tower has an excellent safety record, although there was an electrical fire in the antennae on August 16, 2017 — the tower's first fire. Moreover, other supertall structures built between 1967 and 1976 — such as the Willis Tower (formerly the Sears Tower), the World Trade Center (until its destruction on September 11, 2001), the Fernsehturm Berlin, the Aon Center, the John Hancock Center, and First Canadian Place — also have excellent safety records, which suggests that the Ostankino Tower accident was a rare safety failure, and that the likelihood of similar events occurring at other supertall structures is extremely low.\n\nLighting \n\nThe CN Tower was originally lit at night with incandescent lights, which were removed in 1997, because they were inefficient and expensive to repair. In June 2007, the tower was outfitted with 1,330 super-bright LED lights inside the elevator shafts, shooting over the main pod and upward to the top of the tower's mast to light the tower from dusk until 2 a.m. The official opening ceremony took place on June 28 before the Canada Day holiday weekend.\n\nThe tower changes its lighting scheme on holidays and to commemorate major events. After the 95th Grey Cup in Toronto, the tower was lit in green and white to represent the colours of the Grey Cup champion Saskatchewan Roughriders. From sundown on August 27, 2011, to sunrise the following day, the tower was lit in orange, the official colour of the New Democratic Party (NDP), to commemorate the death of federal NDP leader and leader of the official opposition Jack Layton. When former South African president Nelson Mandela died, the tower was lit in the colours of the South African flag. When former federal finance minister under Stephen Harper's Conservatives Jim Flaherty died, the tower was lit in green to reflect his Irish Canadian heritage. On the night of the attacks on Paris on November 13, 2015, the tower displayed the colours of the French flag.\n\nProgrammed from a desktop computer with a wireless network interface controller in Burlington, Ontario, the LEDs use less energy to light than the previous incandescent lights (10% less energy than the dimly lit version and 60% less than the brightly lit version). The estimated cost to use the LEDs is $1,000 per month.\n\nDuring the spring and autumn bird migration seasons, the lights would be turned off to comply with the voluntary Fatal Light Awareness Program, which \"encourages buildings to dim unnecessary exterior lighting to mitigate bird mortality during spring and summer migration.\"\n\nHeight comparisons \n\nThe CN Tower is the tallest freestanding structure in the Western Hemisphere. As of 2013, there are only two other freestanding structures in the Western Hemisphere which exceed 500 m in height; the Willis Tower in Chicago, which stands at 527 m when measured to its pinnacle; and the topped-out One World Trade Center in New York City, which has a pinnacle height of , or approximately 12 m shorter than the CN Tower. Due to the symbolism of the number 1776 (the year of the signing of the United States Declaration of Independence), the height of One World Trade Center is unlikely to be increased. The proposed Chicago Spire was expected to exceed the height of the CN Tower, but its construction was halted early due to financial difficulties amid the Great Recession, and was eventually cancelled in 2010.\n\nHeight distinction debate \n\n\"World's Tallest Tower\" title \n\nGuinness World Records has called the CN Tower \"the world's tallest self-supporting tower\" and \"the world's tallest free-standing tower\".\n Reference is on page 275.  Although Guinness did list this description of the CN Tower under the heading \"tallest building\" at least once, it has also listed it under \"tallest tower\", omitting it from its list of \"tallest buildings.\" In 1996, Guinness changed the tower's classification to \"World's Tallest Building and Freestanding Structure\". Emporis and the Council on Tall Buildings and Urban Habitat both listed the CN Tower as the world's tallest free-standing structure on land, and specifically state that the CN Tower is not a true building, thereby awarding the title of world's tallest building to Taipei 101, which is 44 m shorter than the CN Tower. The issue of what was tallest became moot when Burj Khalifa, then under construction, exceeded the height of the CN Tower in 2007 (see below).\n\nAlthough the CN Tower contains a restaurant, a gift shop and multiple observation levels, it does not have floors continuously from the ground, and therefore it is not considered a building by the Council on Tall Buildings and Urban Habitat (CTBUH) or Emporis. CTBUH defines a building as \"a structure that is designed for residential, business, or manufacturing purposes. An essential characteristic of a building is that it has floors.\" The CN Tower and other similar structures—such as the Ostankino Tower in Moscow, Russia; the Oriental Pearl Tower in Shanghai, China; the Stratosphere Tower in Las Vegas, Nevada, USA; and the Eiffel Tower in Paris, France—are categorized as \"towers\", which are free-standing structures that may have observation decks and a few other habitable levels, but do not have floors from the ground up. The CN Tower was the tallest tower by this definition, until 2010 (see below).\n\nTaller than the CN Tower are numerous radio masts and towers, which are held in place by guy-wires, the tallest being the KVLY-TV mast in Blanchard, North Dakota, USA at 628 m tall, leading to a distinction between these and \"free-standing\" structures. Additionally, the Petronius Platform stands 610 m above its base on the bottom of the Gulf of Mexico, but only the top 75 m of this oil and natural gas platform are above water, and the structure is thus partially supported by its buoyancy. Like the CN Tower, none of these taller structures are commonly considered buildings.\n\nOn September 12, 2007, Burj Khalifa, which is a hotel, residential and commercial building in Dubai, United Arab Emirates, and was formerly known as Burj Dubai before opening, passed the CN Tower's 553.33-metre height. The CN Tower held the record of tallest free-standing structure on land for over 30 years.\n\nAfter Burj Khalifa had been formally recognized by the Guinness World Records as the world's tallest freestanding structure, Guinness re-certified CN Tower as the world's tallest freestanding tower. The tower definition used by Guinness was defined by the Council on Tall Buildings and Urban Habitat as 'a building in which less than 50% of the construction is usable floor space'. Guinness World Records editor-in-chief Craig Glenday announced that Burj Khalifa was not classified as a tower because it has too much usable floor space to be considered to be a tower. CN Tower still held world records for highest above ground wine cellar (in 360 Restaurant) at 351 metres, highest above ground restaurant at 346 metres (Horizons Restaurant), and tallest free-standing concrete tower during Guinness's recertification. The CN Tower was surpassed in 2009 by the Canton Tower in Guangzhou, China, which stands at 604 m tall, as the world's tallest tower; which in turn was surpassed by the Tokyo Skytree in 2011, which currently is the tallest tower at  in height. The CN Tower, as of 2017, stands as the eighth-tallest free-standing structure on land in the world and the third-tallest free-standing tower.\n\nHeight records \n\nSince the construction of the tower had been completed, it has gained the following world height records:\n\nUse \n\nThe CN Tower has been and continues to be used as a communications tower for a number of different media and by numerous companies.\n\nTelevision broadcasters \n\nRadio \n\nThere is no AM broadcasting on the CN Tower. The FM antennas are situated 421 m above ground.\n\nCellular and paging providers \n\n* Bell Mobility\n* Motorola\n* Rogers Wireless\n\nCommunications \n\n* Bell Canada\n* Toronto Transit Commission\n* Amateur radio repeaters \"2-Tango\" (VHF) and \"4-Tango\" (440/70 cm UHF) — owned and operated by the Toronto FM Communications Society, under callsign VE3TWR\n\nMascot \n\nThe CN Tower has its own mascot, which resembles the tower itself.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "CN Tower" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=6112" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The CN Tower () is a  concrete communications and observation tower in downtown Toronto, Ontario, Canada. Built on the former Railway Lands, it was completed in 1976, and held the record for the world's tallest free-standing structure for 32 years from 1975–2007 and was the world's tallest tower until 2009 being overtaken by Burj Khalifa and Canton Tower, respectively. It is now the third tallest tower in the world and remains the tallest free-standing structure in the Western Hemisphere, a signature icon of Toronto's skyline,[http://www.canada.com/topics/travel/story.html?id\n057d78dc-4964-422f-ba85-361425ea8126&k3499 CN Tower celebrates 30th birthday], Broadcast News/canada.com, June 26, 2006  attracting more than two million international visitors annually.\n\nIts name \"CN\" originally referred to Canadian National, the railway company that built the tower. Following the railway's decision to divest non-core freight railway assets prior to the company's privatization in 1995, it transferred the tower to the Canada Lands Company, a federal Crown corporation responsible for real estate development.\n\nIn 1995, the CN Tower was declared one of the modern Seven Wonders of the World by the American Society of Civil Engineers. It also belongs to the World Federation of Great Towers.\n\nHistory \n\nThe idea of the CN Tower originated in 1968 when the Canadian National Railway wanted to build a large TV and radio communication platform to serve the Toronto area, as well as demonstrate the strength of Canadian industry and CN in particular. These plans evolved over the next few years, and the project became official in 1972.\n\nThe tower would have been part of Metro Centre (see CityPlace), a large development south of Front Street on the Railway Lands, a large railway switching yard that was being made redundant by newer yards outside the city. Key project team members were NCK Engineering as structural engineer; John Andrews Architects; Webb, Zerafa, Menkes, Housden Architects; Foundation Building Construction; and Canron (Eastern Structural Division).\n\nAs Toronto grew rapidly during the late 1960s and early 1970s, multiple skyscrapers were constructed in the downtown core, most notably First Canadian Place. The reflective nature of the new buildings compromised the quality of broadcast signals necessitating new, higher antennas that were at least 300 m tall.\n\nAt the time, most data communications took place over point-to-point microwave links, whose dish antennae covered the roofs of large buildings. As each new skyscraper was added to the downtown, former line-of-sight links were no longer possible. CN intended to rent \"hub\" space for microwave links, visible from almost any building in the Toronto area.\n\nThe CN Tower can be seen from at least as far away as Kennedy Street in Aurora, Ontario, approximately 40 km to the north, 60 km east of Toronto, in Oshawa, and from several points on the south shore of Lake Ontario, 48 km to the south in the U.S. state of New York.\n\nThe original plan for the tower envisioned a tripod consisting of three independent cylindrical \"pillars\" linked at various heights by structural bridges. Had it been built, this design would have been considerably shorter, with the metal antenna located roughly where the concrete section between the main level and the SkyPod lies today. As the design effort continued, it evolved into the current design with a single continuous hexagonal core to the SkyPod, with three support legs blended into the hexagon below the main level, forming a large Y-shape structure at the ground level.\n\nThe idea for the main level in its current form evolved around this time, but the Space Deck (now named SkyPod) was not part of the plans until some time later. One engineer in particular felt that visitors would feel the higher observation deck would be worth paying extra for, and the costs in terms of construction were not prohibitive. It was also some time around this point that it was realized that the tower could become the world's tallest structure, and plans were changed to incorporate subtle modifications throughout the structure to this end.\n\nConstruction \n\nConstruction on the CN Tower began on February 6, 1973, with massive excavations at the tower base for the foundation. By the time the foundation was complete, 56000 t of earth and shale were removed to a depth of 15 m in the centre, and a base incorporating 7000 m3 of concrete with 450 t of rebar and 36 t of steel cable had been built to a thickness of . This portion of the construction was fairly rapid, with only four months needed between the start and the foundation being ready for construction on top.\n\nTo create the main support pillar, workers constructed a hydraulically raised slipform at the base. This was a fairly unprecedented engineering feat on its own, consisting of a large metal platform that raised itself on jacks at about 6 m per day as the concrete below set. Concrete was poured continuously by a team of 1,532 people until February 22, 1974, during which it had already become the tallest structure in Canada, surpassing the recently built Inco Superstack in Sudbury, which was built using similar methods.\n\nIn total, the tower contains 40500 m3 of concrete, all of which was mixed on-site in order to ensure batch consistency. Through the pour, the vertical accuracy of the tower was maintained by comparing the slip form's location to massive plumb bobs hanging from it, observed by small telescopes from the ground. Over the height of the tower, it varies from true vertical accuracy by only 29 mm.\n\nIn August 1974, construction of the main level commenced. Using 45 hydraulic jacks attached to cables strung from a temporary steel crown anchored to the top of the tower, twelve giant steel and wooden bracket forms were slowly raised, ultimately taking about a week to crawl up to their final position. These forms were used to create the brackets that support the main level, as well as a base for the construction of the main level itself. The Space Deck (currently named SkyPod) was built of concrete poured into a wooden frame attached to rebar at the lower level deck, and then reinforced with a large steel compression band around the outside.\n\nThe antenna was originally to be raised by crane as well, but during construction the Sikorsky S-64 Skycrane helicopter became available when the United States Army sold one to civilian operators. The helicopter, named \"Olga\", was first used to remove the crane, and then flew the antenna up in 36 sections.\n\nThe flights of the antenna pieces were a minor tourist attraction of their own, and the schedule was printed in the local newspapers. Use of the helicopter saved months of construction time, with this phase taking only three and a half weeks instead of the planned six months. The tower was topped-off on April 2, 1975, after 26 months of construction, officially capturing the height record from Moscow's Ostankino Tower, and bringing the total mass to 118000 t.\n\nTwo years into the construction, plans for Metro Centre were scrapped, leaving the tower isolated on the Railway Lands in what was then a largely abandoned light-industrial space. This caused serious problems for tourists to access the tower. Ned Baldwin, project architect with John Andrews, wrote at the time that \"All of the logic which dictated the design of the lower accommodation has been upset,\" and that \"Under such ludicrous circumstances Canadian National would hardly have chosen this location to build.\"\n\nPhases of construction \n\nFile:CN Tower footings 1973.jpg|Constructing the base, July 1973\nFile:Cntower1974.jpg|Brackets being raised, August 1974\nFile:CN Tower50 construction skycrane March 1975 01d.jpg|Helicopter lifting part of antenna, March 1975\nFile:CN Tower under construction (April 1975).jpg|Main pod construction, April 1975\nFile:CN Tower under construction.jpg|Nearing completion, December 1975\nFile:CN Tower 1976.jpg|Two months after opening, August 1976\n\nArchitects \n\n*WZMH Architects\n*John Hamilton Andrews\n*Webb Zerafa\n*Menkes Housden with the help of E.R. Baldwin\n\nOpening \n\nThe CN Tower opened to the public on June 26, 1976. The construction costs of approximately  ($ in  dollars) were repaid in fifteen years. Canadian National Railway sold the tower prior to taking the company private in 1995, when it decided to divest all operations not directly related to its core freight shipping businesses.\n\nFrom the mid-1970s to the mid-1980s, the CN Tower was practically the only development along Front Street West; it was still possible to see Lake Ontario from the foot of the CN Tower due to the expansive parking lots and lack of development in the area at the time. As the area around the tower was developed, particularly with the completion of the Metro Toronto Convention Centre in 1984 and the SkyDome in 1989 (renamed Rogers Centre in 2005), the former Railway Lands were redeveloped and the tower became the centre of a newly developing entertainment area. Access was greatly improved with the construction of the SkyWalk in 1989, which connected the tower and SkyDome to the nearby Union Station railway and subway station,  and, in turn, to the city's PATH underground pedestrian system. By the mid-1990s, it was the centre of a thriving tourist district. The entire area continues to be an area of intense building, notably a boom in condominium construction in the first two decades of the 21st century, as well as the 2013 opening of the Ripley's Aquarium by the base of the tower.\n\nEvents \n\n*While still under construction, the CN Tower officially became the world's tallest free-standing structure on March 31, 1975.\n*When the CN Tower opened in 1976, there were three public observation points: the SkyPod (then known as the Space Deck) that stands at 447 m, the Indoor Observation Level (later named Indoor Lookout Level) at 346 m, and the Outdoor Observation Terrace (at the same level as the Glass Floor) at 342 m. One floor above the Indoor Observation Level was the Top of Toronto Restaurant, which completed a revolution once every 90 minutes.\n*Stuntman Dar Robinson jumped off of the CN Tower on two occasions in 1979 and 1980. The first was for a scene from the movie Highpoint, in which Robinson received $250,000 for the stunt. The second was for a personal documentary. Both stunts used a wire decelerator attached to his back.\n*On June 26, 1986, the ten-year anniversary of the tower's opening, high-rise firefighting and rescue advocate Dan Goodwin, in a sponsored publicity event, used his hands and feet to climb the outside of the tower, a feat he performed twice on the same day. Following both ascents, he used multiple rappels to descend to the ground.\n*The Glass Floor, at an elevation of 342 m, opened to the public on June 26, 1994.\n*From 1997 to January 2004, TrizecHahn Corporation managed the tower and instituted several expansion projects including a C$26 million entertainment expansion and revitalization that included the 1997 addition of two new elevators (to a total of six) and the consequential relocation of the staircase from the north side leg to inside the core of the building, a conversion that also added nine stairs to the climb. TrizecHahn also owned the Willis Tower (Sears Tower at the time) in Chicago approximately at the same time.\n*In 2007, light-emitting diode (LED) lights replaced the incandescent lights that lit the CN Tower at night, the reason cited that LED lights are more cost and energy efficient than the incandescent lights. The colour of the LED lights can change, compared to the constant white colour of the incandescent lights.\n*On September 12, 2007, Burj Khalifa, then under construction, surpassed the CN Tower as the world's tallest free-standing structure.\n*In 2008, glass panels were installed in one of the CN Tower elevators, which established a world record (346 m) for highest glass floor panelled elevator in the world.\n*The CN Tower was closed during the G20 summit on June 26–27, 2010, for security reasons, given its proximity to the Metro Toronto Convention Centre.\n*In 2011, EdgeWalk (where at an elevation of 356 m, visitors tethered to an overhead rail system can walk on the roof of the main pod) opened to the public.\n* On July 10, 2015, the CN Tower was incorporated into the opening ceremony of the 2015 Pan American Games. A pre-recorded segment featured Bruny Surin passing the flame to Donovan Bailey on the EdgeWalk and parachuting into Rogers Centre. A fireworks display off the tower served as the ceremony's finale.\n* On July 1, 2017, as part of the nationwide celebrations for Canada 150, fireworks were once again shot from the tower, in a five-minute display coordinated with the tower lights and music broadcast on a local radio station.\n\nStructure \n\nThe CN Tower consists of several substructures. The main portion of the tower is a hollow concrete hexagonal pillar containing the stairwells and power and plumbing connections. The Tower's six elevators are located in the three inverted angles created by the Tower's hexagonal shape (two elevators per angle). Each of the three elevator shafts is lined with glass, allowing for views of the city as the glass-windowed elevators make their way through the Tower. The stairwell was originally located in one of these angles (the one facing north), but was moved into the central hollow of the Tower; the Tower's new fifth and sixth elevators were placed in the hexagonal angle that once contained the stairwell. On top of the main concrete portion of the Tower is a 102 m tall metal broadcast antenna, carrying TV and radio signals. There are three visitor areas: the Glass Floor and Outdoor Observation Terrace which are both located at an elevation of 342 m, the Indoor Lookout Level (formerly known as \"Indoor Observation Level\") located at 346 m, and the higher SkyPod (formerly known as \"Space Deck\") at , just below the metal antenna. The hexagonal shape can be seen between the two areas; however, below the main deck, three large supporting legs give the tower the appearance of a large tripod.\n\nThe main deck level is seven storeys, some of which are open to the public. Below the public areas — at 338 m — is a large white donut-shaped radome containing the structure's microwave receivers. The glass floor and outdoor observation deck are at 342 m. The glass floor has an area of 24 m2 and can withstand a pressure of 4100 kPa. The floor's thermal glass units are 64 mm thick, consisting of a pane of 25 mm laminated glass, 25 mm airspace and a pane of 13 mm laminated glass. Some people experience acrophobia when standing on the glass floor and looking down at the ground 342 m below. In 2008, one elevator was upgraded to add a glass floor panel, believed to have the highest vertical rise of any elevator equipped with this feature.  Both linked pages include a video of the elevator with glass floor in operation.  The Horizons Cafe and the lookout level are at 346 m. The 360 Restaurant, a revolving restaurant that completes a full rotation once every 72 minutes, is at 351 m. When the tower first opened, it also featured a disco named Sparkles (at the Indoor Observation Level), billed as the highest disco and dance floor in the world.Malcolm, Andrew. [https://select.nytimes.com/gst/abstract.html?res=FA0D10F73F5C11728DDDA90994D8415B898BF1D3 \"A New High for Disco in Toronto's Tower\"], The New York Times, October 10, 1979. Accessed February 10, 2011.\n\nThe SkyPod was once the highest public observation deck in the world until it was surpassed by the Shanghai World Financial Center in 2008.\n\nA metal staircase reaches the main deck level after 1,776 steps, and the SkyPod 100 m above after 2,579 steps; it is the tallest metal staircase on Earth. These stairs are intended for emergency use only and are not open to the public, except for twice per year for charity stair-climb events. The average climber takes approximately 30 minutes to climb to the base of the radome, but the fastest climb on record is 7 minutes and 52 seconds in 1989 by Brendan Keenoy, an Ontario Provincial Police officer. In 2002, Canadian Olympian and Paralympic champion Jeff Adams climbed the stairs of the tower in a specially designed wheelchair. The stairs were originally on one of the three sides of the tower (facing north), with a glass view, but these were later replaced with the third elevator pair and the stairs were moved to the inside of the core. Top climbs on the new, windowless stairwell used since around 2003 have generally been over ten minutes.\n\ninsidecntower360.JPG|Inside 360 Restaurant\nToronto - ON - CN Tower Turmkorb.jpg|Main Pod\nCN Tower Turmkorb-Modell-blau.png|Cross-section of Main Pod\nCN Tower Glass Floor Walk.jpg|Standing on glass floor\nCNTowerNastyFall.jpg|View though glass floor\n\nEdgeWalk \n\nOn August 1, 2011, the CN Tower opened the EdgeWalk, an amusement in which thrill-seekers can walk on and around the roof of the main pod of the tower at 356 m, which is directly above the 360 Restaurant. It is the world's highest full-circle, hands-free walk. Visitors are tethered to an overhead rail system and walk around the edge of the CN Tower's main pod above the 360 Restaurant on a  metal floor. The attraction is closed throughout the winter season and during periods of electrical storms and high winds.\n\nOne of the notable guests who visited EdgeWalk includes Canadian comedian Rick Mercer, as featured on his CBC Television news satire show, Rick Mercer Report. He was accompanied by Canadian pop singer Jann Arden.\n\nFalling ice danger \n\nA freezing rain storm on March 2, 2007, resulted in a layer of ice several centimetres thick forming on the side of the tower and other downtown buildings. The sun thawed the ice, and winds of up to 90 km/h blew some of it away from the structure. There were fears that cars and windows of nearby buildings would be smashed by large chunks of ice. In response, police closed some streets surrounding the tower. During morning rush hour on March 5 of the same year, police expanded the area of closed streets to include the Gardiner Expressway 310 m away from the tower, as increased winds blew the ice farther away, as far north as King Street, 490 m away, where a taxicab window was shattered.\n\nSubsequently, on March 6, 2007, the Gardiner Expressway reopened after winds abated.\n\nSafety features \n\nIn August 2000, a fire broke out at the Ostankino Tower in Moscow killing three people and causing extensive damage. The fire was blamed on poor maintenance and outdated equipment. The failure of the fire-suppression systems and the lack of proper equipment for firefighters allowed the fire to destroy most of the interior and spark fears the tower might even collapse.\n\nThe Ostankino Tower was completed nine years before the CN Tower, and is only 13 m shorter. The parallels between the towers led to some concern that the CN Tower could be at risk of a similar tragedy. However, Canadian officials subsequently stated that it is \"highly unlikely\" that a similar disaster could occur at the CN Tower, as it has important safeguards that were not present in the Ostankino Tower. Specifically, officials cited:\n\n* the fireproof building materials used in the tower's construction,\n* frequent and stringent safety inspections,\n* an extensive sprinkler system,\n* a 24-hour emergency monitoring operation,\n* two 68,160-litre (15,000-imperial gallon; 18,006-US gallon) water reservoirs at the top, which are automatically replenished,\n* a fire hose at the base of the structure capable of sending 2725 litres (600 imperial gallons; 720 US Gallon) a minute to any location in the tower,\n* a ban on natural gas appliances anywhere in the tower (including the restaurant in the main pod),\n* an elevator that can be used during a fire as it runs up the outside of the building and can be powered by three emergency generators at the base of the structure (unlike the elevator at the Ostankino Tower, which malfunctioned).\n\nOfficials also noted that the CN Tower has an excellent safety record, although there was an electrical fire in the antennae on August 16, 2017 — the tower's first fire. Moreover, other supertall structures built between 1967 and 1976 — such as the Willis Tower (formerly the Sears Tower), the World Trade Center (until its destruction on September 11, 2001), the Fernsehturm Berlin, the Aon Center, the John Hancock Center, and First Canadian Place — also have excellent safety records, which suggests that the Ostankino Tower accident was a rare safety failure, and that the likelihood of similar events occurring at other supertall structures is extremely low.\n\nLighting \n\nThe CN Tower was originally lit at night with incandescent lights, which were removed in 1997, because they were inefficient and expensive to repair. In June 2007, the tower was outfitted with 1,330 super-bright LED lights inside the elevator shafts, shooting over the main pod and upward to the top of the tower's mast to light the tower from dusk until 2 a.m. The official opening ceremony took place on June 28 before the Canada Day holiday weekend.\n\nThe tower changes its lighting scheme on holidays and to commemorate major events. After the 95th Grey Cup in Toronto, the tower was lit in green and white to represent the colours of the Grey Cup champion Saskatchewan Roughriders. From sundown on August 27, 2011, to sunrise the following day, the tower was lit in orange, the official colour of the New Democratic Party (NDP), to commemorate the death of federal NDP leader and leader of the official opposition Jack Layton. When former South African president Nelson Mandela died, the tower was lit in the colours of the South African flag. When former federal finance minister under Stephen Harper's Conservatives Jim Flaherty died, the tower was lit in green to reflect his Irish Canadian heritage. On the night of the attacks on Paris on November 13, 2015, the tower displayed the colours of the French flag.\n\nProgrammed from a desktop computer with a wireless network interface controller in Burlington, Ontario, the LEDs use less energy to light than the previous incandescent lights (10% less energy than the dimly lit version and 60% less than the brightly lit version). The estimated cost to use the LEDs is $1,000 per month.\n\nDuring the spring and autumn bird migration seasons, the lights would be turned off to comply with the voluntary Fatal Light Awareness Program, which \"encourages buildings to dim unnecessary exterior lighting to mitigate bird mortality during spring and summer migration.\"\n\nHeight comparisons \n\nThe CN Tower is the tallest freestanding structure in the Western Hemisphere. As of 2013, there are only two other freestanding structures in the Western Hemisphere which exceed 500 m in height; the Willis Tower in Chicago, which stands at 527 m when measured to its pinnacle; and the topped-out One World Trade Center in New York City, which has a pinnacle height of , or approximately 12 m shorter than the CN Tower. Due to the symbolism of the number 1776 (the year of the signing of the United States Declaration of Independence), the height of One World Trade Center is unlikely to be increased. The proposed Chicago Spire was expected to exceed the height of the CN Tower, but its construction was halted early due to financial difficulties amid the Great Recession, and was eventually cancelled in 2010.\n\nHeight distinction debate \n\n\"World's Tallest Tower\" title \n\nGuinness World Records has called the CN Tower \"the world's tallest self-supporting tower\" and \"the world's tallest free-standing tower\".\n Reference is on page 275.  Although Guinness did list this description of the CN Tower under the heading \"tallest building\" at least once, it has also listed it under \"tallest tower\", omitting it from its list of \"tallest buildings.\" In 1996, Guinness changed the tower's classification to \"World's Tallest Building and Freestanding Structure\". Emporis and the Council on Tall Buildings and Urban Habitat both listed the CN Tower as the world's tallest free-standing structure on land, and specifically state that the CN Tower is not a true building, thereby awarding the title of world's tallest building to Taipei 101, which is 44 m shorter than the CN Tower. The issue of what was tallest became moot when Burj Khalifa, then under construction, exceeded the height of the CN Tower in 2007 (see below).\n\nAlthough the CN Tower contains a restaurant, a gift shop and multiple observation levels, it does not have floors continuously from the ground, and therefore it is not considered a building by the Council on Tall Buildings and Urban Habitat (CTBUH) or Emporis. CTBUH defines a building as \"a structure that is designed for residential, business, or manufacturing purposes. An essential characteristic of a building is that it has floors.\" The CN Tower and other similar structures—such as the Ostankino Tower in Moscow, Russia; the Oriental Pearl Tower in Shanghai, China; the Stratosphere Tower in Las Vegas, Nevada, USA; and the Eiffel Tower in Paris, France—are categorized as \"towers\", which are free-standing structures that may have observation decks and a few other habitable levels, but do not have floors from the ground up. The CN Tower was the tallest tower by this definition, until 2010 (see below).\n\nTaller than the CN Tower are numerous radio masts and towers, which are held in place by guy-wires, the tallest being the KVLY-TV mast in Blanchard, North Dakota, USA at 628 m tall, leading to a distinction between these and \"free-standing\" structures. Additionally, the Petronius Platform stands 610 m above its base on the bottom of the Gulf of Mexico, but only the top 75 m of this oil and natural gas platform are above water, and the structure is thus partially supported by its buoyancy. Like the CN Tower, none of these taller structures are commonly considered buildings.\n\nOn September 12, 2007, Burj Khalifa, which is a hotel, residential and commercial building in Dubai, United Arab Emirates, and was formerly known as Burj Dubai before opening, passed the CN Tower's 553.33-metre height. The CN Tower held the record of tallest free-standing structure on land for over 30 years.\n\nAfter Burj Khalifa had been formally recognized by the Guinness World Records as the world's tallest freestanding structure, Guinness re-certified CN Tower as the world's tallest freestanding tower. The tower definition used by Guinness was defined by the Council on Tall Buildings and Urban Habitat as 'a building in which less than 50% of the construction is usable floor space'. Guinness World Records editor-in-chief Craig Glenday announced that Burj Khalifa was not classified as a tower because it has too much usable floor space to be considered to be a tower. CN Tower still held world records for highest above ground wine cellar (in 360 Restaurant) at 351 metres, highest above ground restaurant at 346 metres (Horizons Restaurant), and tallest free-standing concrete tower during Guinness's recertification. The CN Tower was surpassed in 2009 by the Canton Tower in Guangzhou, China, which stands at 604 m tall, as the world's tallest tower; which in turn was surpassed by the Tokyo Skytree in 2011, which currently is the tallest tower at  in height. The CN Tower, as of 2017, stands as the eighth-tallest free-standing structure on land in the world and the third-tallest free-standing tower.\n\nHeight records \n\nSince the construction of the tower had been completed, it has gained the following world height records:\n\nUse \n\nThe CN Tower has been and continues to be used as a communications tower for a number of different media and by numerous companies.\n\nTelevision broadcasters \n\nRadio \n\nThere is no AM broadcasting on the CN Tower. The FM antennas are situated 421 m above ground.\n\nCellular and paging providers \n\n* Bell Mobility\n* Motorola\n* Rogers Wireless\n\nCommunications \n\n* Bell Canada\n* Toronto Transit Commission\n* Amateur radio repeaters \"2-Tango\" (VHF) and \"4-Tango\" (440/70 cm UHF) — owned and operated by the Toronto FM Communications Society, under callsign VE3TWR\n\nMascot \n\nThe CN Tower has its own mascot, which resembles the tower itself. CN Tower. http://en.wikipedia.org/?curid=6112."
  }
}
