{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18881",
  "eid" : "358b2d50-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778599077,
  "textBody" : "Mathematical induction is a mathematical proof technique, a form of direct proof, usually done in two steps. It is used to prove a given statement about any well-ordered set. Most commonly, the well-ordered set is the set of natural numbers.  The first step, called the base case or basis, proves that the theorem is true for the number one.  The second step, called the inductive step, proves that, if the theorem is true for a given number, then it is also true for the next number.  These two steps establish the theorem for all natural numbers.[https://www.mathsisfun.com/algebra/mathematical-induction.html Mathematical Induction] at www.mathisfun.com  The fact that these two steps prove that a theorem is true in an infinite number of cases is called the Principle of mathematical induction.\n\nMetaphors can be informally used to understand the concept of mathematical induction, such as the dominoes falling in a line, or climbing a ladder:\n\nThe method can be extended to prove statements about more general well-founded structures, such as trees; this generalization, known as structural induction, is used in mathematical logic and computer science.  Mathematical induction in this extended sense is closely related to recursion. Mathematical induction, in some form, is the foundation of all correctness proofs for computer programs.\n\nAlthough its name may suggest otherwise, mathematical induction should not be misconstrued as a form of inductive reasoning (also see Problem of induction). Mathematical induction is an inference rule used in proofs. Proofs by mathematical induction are, in fact, examples of deductive reasoning.\n\nHistory\n\nIn 370 BC, Plato's Parmenides may have contained an early example of an implicit inductive proof. The earliest implicit traces of mathematical induction may be found in Euclid's proof that the number of primes is infinite and in Bhaskara's \"cyclic method\". An opposite iterated technique, counting down rather than up, is found in the Sorites paradox, where it was argued that if 1,000,000 grains of sand formed a heap, and removing one grain from a heap left it a heap, then a single grain of sand (or even no grains) forms a heap.\n\nAn implicit proof by mathematical induction for arithmetic sequences was introduced in the al-Fakhri written by al-Karaji around 1000 AD,  who used it to prove the binomial theorem and properties of Pascal's triangle.\n\nNone of these ancient mathematicians, however, explicitly stated the induction hypothesis. Another similar case (contrary to what Vacca has written, as Freudenthal carefully showed) was that of Francesco Maurolico in his Arithmeticorum libri duo (1575), who used the technique to prove that the sum of the first n odd integers is n2. The first explicit formulation of the principle of induction was given by Pascal in his Traité du triangle arithmétique (1665). Another Frenchman, Fermat, made ample use of a related principle, indirect proof by infinite descent. The induction hypothesis was also employed by the Swiss Jakob Bernoulli, and from then on it became more or less well known. The modern rigorous and systematic treatment of the principle came only in the 19th century, with George Boole,\"It is sometimes required to prove a theorem which shall be true whenever a certain quantity n which it involves shall be an integer or whole number and the method of proof is usually of the following kind. 1st. The theorem is proved to be true when n  1. 2ndly. It is proved that if the theorem is true when n is a given whole number, it will be true if n is the next greater integer. Hence the theorem is true universally. . .. This species of argument may be termed a continued sorites\" (Boole circa 1849 Elementary Treatise on Logic not mathematical pages 40–41 reprinted in Grattan-Guinness, Ivor and Bornet, Gérard (1997), George Boole: Selected Manuscripts on Logic and its Philosophy, Birkhäuser Verlag, Berlin, ) Augustus de Morgan, Charles Sanders Peirce, Reprinted (CP 3.252-88), (W 4:299-309). Giuseppe Peano, and Richard Dedekind.\n\nDescription\n\nThe simplest and most common form of mathematical induction infers that a statement involving a natural number n holds for all values of n. The proof consists of two steps:\n# The base case: prove that the statement holds for the first natural number n. Usually, n 0 or n \n 1, rarely, n =  –1 (although not a natural number, the extension of the natural numbers to –1 is still a well-ordered set).\n# The inductive step: prove that, if the statement holds for some natural number n, then the statement holds for n + 1.\nThe hypothesis in the inductive step that the statement holds for some n is called the induction hypothesis (or inductive hypothesis). To perform the inductive step, one assumes the induction hypothesis and then uses this assumption to prove the statement for n + 1.\n\nWhether n  0 or n \n 1 depends on the definition of the natural numbers. If 0 is considered a natural number, as is common in the fields of combinatorics and mathematical logic, the base case is given by n  0. If, on the other hand, 1 is taken as the first natural number, then the base case is given by n \n 1.\n\nExamples\n\nMathematical induction can be used to prove that the following statement, P(n), holds for all natural numbers n.\n\n0 + 1 + 2 + \\cdots + n = \\frac{n(n + 1)}{2}.\n\nP(n) gives a formula for the sum of the natural numbers less than or equal to number n. The proof that P(n) is true for each natural number n proceeds as follows.\n\nBase case: Show that the statement holds for n = 0. \nP(0) is easily seen to be true:\n0 = \\frac{0\\cdot(0 + 1)}{2}\\,.\nInductive step: Show that if P(k) holds, then also  holds. This can be done as follows.\n\nAssume P(k) holds (for some unspecified value of k). It must then be shown that  holds, that is:\n(0 + 1 + 2 + \\cdots + k )+ (k+1) = \\frac{(k+1)((k+1) + 1)}{2}.\nUsing the induction hypothesis that P(k) holds, the left-hand side can be rewritten to:\n\n\\frac{k(k + 1)}{2} + (k+1)\\,.\n\nAlgebraically:\n\n\\begin{align}\n\\frac{k(k + 1)}{2} + (k+1) & = \\frac {k(k+1)+2(k+1)} 2 \\\\\n& = \\frac{(k+1)(k+2)}{2} \\\\\n& = \\frac{(k+1)((k+1) + 1)}{2}\n\\end{align}\n\nthereby showing that indeed   holds.\n\nSince both the base case and the inductive step have been performed, by mathematical induction, the statement P(n) holds for all natural numbers n. Q.E.D.\n\nFormalization\n\nIn second-order logic, induction on natural numbers can be formalized as an axiom:\n\n\\forall P ( P(0) \\land \\forall k ( P(k) \\Rightarrow P(k+1) ) \\Rightarrow \\forall n (P(n))),\n\nwhere P is any predicate and k and n are both natural numbers.\n\nIn words, the base case P(0) and the inductive step (namely, that the induction hypothesis P(k) implies P(k + 1)) together imply that P(n) for any natural number n. The axiom of induction asserts that the validity of inferring that P(n) holds for any natural number n from the base case and the inductive step.\n\nNote that the first quantifier in the axiom ranges over predicates rather than over individual numbers.  This is a second-order quantifier, which means that this axiom is stated in second-order logic.  Axiomatizing arithmetic induction in first-order logic requires an axiom schema containing a separate axiom for each possible predicate.  The article Peano axioms contains further discussion of this issue.\n\nIn first-order ZFC set theory, quantification over predicates is not allowed, but we can still phrase induction by quantification over sets:\n\n\\forall A ( 0 \\in A \\land \\forall k \\in \\mathbb{N} ( k \\in A \\Rightarrow (k+1) \\in A ) \\Rightarrow \\mathbb{N}\\subseteq A)\n\nThis is not an axiom, but a theorem, given sets and numbers are defined.\n\nVariants\n\nIn practice, proofs by induction are often structured differently, depending on the exact nature of the property to be proved.n\n\nInduction basis other than 0 or 1\n\nIf one wishes to prove a statement not for all natural numbers but only for all numbers n greater than or equal to a certain number b, then the proof by induction consists of:\n# Showing that the statement holds when n = b.\n# Showing that if the statement holds for some n ≥ b then the same statement also holds for n + 1.\nThis can be used, for example, to show that n2 ≥ 3n for n ≥ 3.\n\nIn this way, one can prove that some statement P(n) holds for all n ≥ 1, or even n ≥ −5.  This form of mathematical induction is actually a special case of the previous form, because if the statement to be proved is P(n) then proving it with these two rules is equivalent with proving P(n + b) for all natural numbers n with an induction base case 0.Ted Sundstrom, Mathematical Reasoning, p. 190, Pearson, 2006, \n\nExample: forming dollar amounts by coins \n\nAssume an infinite supply of 4- and 5-dollar coins. Induction can be used to prove that any whole amount of dollars greater than 12 can be formed by a combination of such coins. The amount n is chosen to begin on 12 as the statement does not hold true for every lower number; in particular, it is violated for n=11.\n\nIn more precise terms, we wish to show that for any amount n\\geq12 there exist natural numbers a,b such that n=4a+5b, where 0 is included as a natural number. The statement to be shown is thus:\n\nS(n): \\,\\, n\\geq12 \\Rightarrow \\exists\\, a,b\\in\\mathbb{N}.\\,\\, n=4a+5b\n\nBase case: Showing that S(k) holds for k12 is trivial: let a\n3 and b0. Then, 4 \\cdot 3+5 \\cdot 0\n12.\n\nInductive step: Given that S(k) holds for some value of k \\geq 12 (induction hypothesis), prove that S(k+1) holds, too. That is, given that k4a+5b for some natural numbers a,b, prove that there exist natural numbers a_1,b_1 such that k+1\n4a_1+5b_1.\n\nHere we need to consider two cases.\n\nFor the first case, assume that a\\geq 1. By some algebraic manipulation and by assumption, we see that in that case\n\n\\begin{align}\nk&=4a+5b\\\\\nk+1&=4a+5b+1\\\\\n&=4a+5b-4+5\\\\\n&=4(a-1)+5(b+1)\\\\\n&=4a_1+5b_1\n\\end{align}\n\nwhere a_1a-1 and b_1\nb+1 are natural numbers.\n\nThis shows that to add 1 to the total amount—any amount whatsoever, so long as it is greater than 12—it is sufficient to remove a single 4-dollar coin while adding a 5-dollar coin. However, this construction fails in the case that a=0, or in words, when there is no 4-dollar coin. \n\nSo it remains to prove the case a0. Then k\n5b \\geq 12, which implies that b \\geq 3.\n\n\\begin{align}\nk&=5b\\\\\nk+1&=5b+1\\\\\n&=5b-15+16\\\\\n&=5(b-3)+4\\cdot4\\\\\n&=4\\cdot4+5(b-3)\\\\\n&=4a_1+5b_1\n\\end{align}\n\nwhere a_14 and b_1\nb-3 are again natural numbers.\n\nThe above calculation shows that in the case there are no 4-dollar coins, we can add 1 to the amount by removing three 5-dollar coins while adding four 4-dollar coins.\n\nThus, with the inductive step, we have shown that S(k) implies S(k+1) for all natural numbers k \\geq 12, and the proof is complete. Q.E.D.\n\nInduction on more than one counter\n\nIt is sometimes desirable to prove a statement involving two natural numbers, n and m, by iterating the induction process. That is, one proves a base case and an inductive step for n, and in each of those proves a base case and an inductive step for m. See, for example, the proof of commutativity accompanying addition of natural numbers. More complicated arguments involving three or more counters are also possible.\n\nInfinite descent\n\nThe method of infinite descent was one of Pierre de Fermat's favorites. It is used to show that some statement Q(n) is false for all natural numbers n. Its traditional form consists of showing that if Q(n) is true for some natural number n, it also holds for some strictly smaller natural number m. Using mathematical induction (implicitly) on the statement P(n) defined as \"Q(m) is false for all natural numbers m less than or equal to n\", it follows that P(n) holds for all n, which means that Q(n) is false for any natural number n.\n\nPrefix induction\n\nThe most common form of proof by mathematical induction requires proving in the inductive step that\n\n\\forall k (P(k) \\to P(k+1))\n\nwhereupon the induction principle \"automates\" n applications of this step in getting from P(0) to P(n).  This could be called \"predecessor induction\" because each step proves something about a number from something about that number's predecessor.\n\nA variant of interest in computational complexity is \"prefix induction\", in which one needs to prove\n\n\\forall k (P(k) \\to P(2k) \\land P(2k+1))\n\nor equivalently\n\n\\forall k \\left( P \\left(\\left\\lfloor \\frac{k}{2} \\right\\rfloor \\right) \\to P(k) \\right)\n\nThe induction principle then \"automates\" log n applications of this inference in getting from P(0) to P(n).  (It is called \"prefix induction\" because each step proves something about a number from something about the \"prefix\" of that number formed by truncating the low bit of its binary representation. It can be viewed as an application of traditional induction on the length of that binary representation.)\n\nIf traditional predecessor induction is interpreted computationally as an n-step loop, prefix induction corresponds to a log n-step loop, and thus proofs using prefix induction are \"more feasibly constructive\" than proofs using predecessor induction.\n\nPredecessor induction can trivially simulate prefix induction on the same statement.  Prefix induction can simulate predecessor induction, but only at the cost of making the statement more syntactically complex (adding a bounded universal quantifier), so the interesting results relating prefix induction to polynomial-time computation depend on excluding unbounded quantifiers entirely, and limiting the alternation of bounded universal and existential quantifiers allowed in the statement.\n\nOne can take the idea a step further: one must prove\n\n\\forall k \\left( P \\left( \\left\\lfloor \\sqrt{k} \\right\\rfloor \\right) \\to P(k) \\right)\n\nwhereupon the induction principle \"automates\" log log n applications of this inference in getting from P(0) to P(n).  This form of induction has been used, analogously, to study log-time parallel computation.\n\nCourse-of-values induction\n\nAnother variant is called course-of-values induction. It should not be confused with the term  \"Wertverlaufsrekursion\" coined by Bernays and Peter regarding definition of recursive functions. It is sometimes called \"strong induction\" in contrast to which the basic form of induction defined above is sometimes known as \"weak induction\" (although it is not weaker at all, see Peter's textbook  and most other sources on mathematical induction). To call both variants of this principle \"complete induction\" may be a good idea, because this is the literal translation of the German term \"vollständige Induktion\" (which introduced \"induction\" as a term for this form of mathematical reasoning in the 19th century); it is very common in German not to discriminate explicitly between these two equivalent forms of weak or strong induction.\n\nCourse-of-values induction makes the inductive step easier to prove by using a stronger induction hypothesis:\none proves the statement  under the assumption that P(m) holds for all natural m strictly less than ;\nby contrast, the basic form only assumes the immediate predecessor of n in the inductive step.\nIn this form of course-of-values induction one does not need to prove the base case P(0) separately, but it may nevertheless be necessary to make a case distinction and consider several special cases whose proof does not depend on the induction hypothesis, as in the example below of the Fibonacci number Fn. This is very similar to the role of the base case in ordinary induction.\n\nCourse-of-values induction is equivalent to ordinary mathematical induction as described above, in the sense that a proof by one method can be transformed into a proof by the other. Suppose there is a proof of P(n) by course-of-values induction. Let Q(n) mean \"P(m) holds for all m such that \".  Then Q(n) holds for all n if and only if P(n) holds for all n, and the proof of P(n) by course-of-values induction is easily transformed into a proof of Q(n) by ordinary induction. If, on the other hand, P(n) had been proven by ordinary induction, the proof would already effectively be one by course-of-values induction with a case distinction: P(0) is proved in the base case, using no assumptions, and  is proved in the inductive step, in which one may assume all earlier cases but need only use the case P(n).\n\nExample: Fibonacci numbers\n\nComplete induction is most useful when several instances of the induction hypothesis are required for each inductive step.  For example, complete induction can be used to show that\n F_n = \\frac{\\varphi^n - \\psi^n}{\\varphi - \\psi}\nwhere Fn is the nth Fibonacci number,  (the golden ratio) and  are the roots of the polynomial . The identity is easily  verified in the two special cases  and . By using the fact that  for each , the identity above can be verified for the remaining cases by direct calculation for , using the induction hypothesis that it holds for both Fn+1 and Fn.\n\nExample: prime factorization\n\nAnother proof by complete induction uses the hypothesis that the statement holds for all smaller m more thoroughly.  Consider the statement that \"every natural number greater than 1 is a product of (one or more) prime numbers\", which is the \"existence\" part of the fundamental theorem of arithmetic. For proving the inductive step, the induction hyposthesis is that for a given  the statement holds for all smaller .  If n is prime then it is certainly a product of primes, and if not, then by definition it can be written in the form of a product , where neither of the factors is equal to 1; hence neither is equal to n, and so both are smaller than n.  The induction hypothesis now applies to m1 and m2, so each one is a product of primes.  So n is the product of two products of primes, and thus itself a product of primes.\n\nExample: dollar amounts revisited \n\nWe shall look to prove the same example as above, this time with complete induction. The statement remains the same:\n\nS(n): \\,\\,n\\geq12 \\implies \\,\\exists\\, a,b\\in\\mathbb{N}. \\,\\, n=4a+5b.\n\nThe induction hypothesis is then:\nS(m) holds for all m with 12\\leq m\n\nTo start, we need to distinguish some special cases.\n\n;Special cases\nWe show that S(k) holds for k=12,13,14,15.\n\n\\begin{align}\n12 = 4 \\cdot 3+5 \\cdot 0;\\\\\n13 = 4 \\cdot 2+5 \\cdot 1;\\\\\n14 = 4 \\cdot 1+5 \\cdot 2;\\\\\n15 = 4 \\cdot 0+5 \\cdot 3.\n\\end{align}\n\nThe base case holds.\n\n;Remaining cases\nChoosing m=n-4, and observing that 15, we conclude by the induction hypothesis that S(n-4) holds. That is, the amount n-4 can be formed by some combination of 4- and 5-dollar coins. Then, simply adding a 4-dollar coin to that combination yields the amount n. That is, S(n) holds. Q.E.D.\n\nTransfinite induction\n\nThe principle of complete induction is not only valid for statements about natural numbers, but for statements about elements of any well-founded set, that is, a set with an irreflexive relation . Reprinted in A Random Walk in Science (R. L. Weber, ed.), Crane, Russak & Co., 1973.\n*Base case: In a set of only one horse, there is only one color.\n*Inductive step: Assume as induction hypothesis that within any set of n horses, there is only one color.  Now look at any set of n + 1 horses.  Number them: 1, 2, 3, ..., n, n + 1.  Consider the sets {1, 2, 3, ..., n} and {2, 3, 4, ..., n + 1}.  Each is a set of only n horses, therefore within each there is only one color.  But the two sets overlap, so there must be only one color among all n + 1 horses.\n\nThe base case n  1 is trivial (as any horse is the same color as itself), and the inductive step is correct in all cases n > 1. However, the logic of the inductive step is incorrect for n \n 1, because the statement that \"the two sets overlap\" is false (there are only n + 1 = 2 horses prior to either removal, and after removal the sets of one horse each do not overlap).",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Mathematical induction" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18881" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Mathematical induction is a mathematical proof technique, a form of direct proof, usually done in two steps. It is used to prove a given statement about any well-ordered set. Most commonly, the well-ordered set is the set of natural numbers.  The first step, called the base case or basis, proves that the theorem is true for the number one.  The second step, called the inductive step, proves that, if the theorem is true for a given number, then it is also true for the next number.  These two steps establish the theorem for all natural numbers.[https://www.mathsisfun.com/algebra/mathematical-induction.html Mathematical Induction] at www.mathisfun.com  The fact that these two steps prove that a theorem is true in an infinite number of cases is called the Principle of mathematical induction.\n\nMetaphors can be informally used to understand the concept of mathematical induction, such as the dominoes falling in a line, or climbing a ladder:\n\nThe method can be extended to prove statements about more general well-founded structures, such as trees; this generalization, known as structural induction, is used in mathematical logic and computer science.  Mathematical induction in this extended sense is closely related to recursion. Mathematical induction, in some form, is the foundation of all correctness proofs for computer programs.\n\nAlthough its name may suggest otherwise, mathematical induction should not be misconstrued as a form of inductive reasoning (also see Problem of induction). Mathematical induction is an inference rule used in proofs. Proofs by mathematical induction are, in fact, examples of deductive reasoning.\n\nHistory\n\nIn 370 BC, Plato's Parmenides may have contained an early example of an implicit inductive proof. The earliest implicit traces of mathematical induction may be found in Euclid's proof that the number of primes is infinite and in Bhaskara's \"cyclic method\". An opposite iterated technique, counting down rather than up, is found in the Sorites paradox, where it was argued that if 1,000,000 grains of sand formed a heap, and removing one grain from a heap left it a heap, then a single grain of sand (or even no grains) forms a heap.\n\nAn implicit proof by mathematical induction for arithmetic sequences was introduced in the al-Fakhri written by al-Karaji around 1000 AD,  who used it to prove the binomial theorem and properties of Pascal's triangle.\n\nNone of these ancient mathematicians, however, explicitly stated the induction hypothesis. Another similar case (contrary to what Vacca has written, as Freudenthal carefully showed) was that of Francesco Maurolico in his Arithmeticorum libri duo (1575), who used the technique to prove that the sum of the first n odd integers is n2. The first explicit formulation of the principle of induction was given by Pascal in his Traité du triangle arithmétique (1665). Another Frenchman, Fermat, made ample use of a related principle, indirect proof by infinite descent. The induction hypothesis was also employed by the Swiss Jakob Bernoulli, and from then on it became more or less well known. The modern rigorous and systematic treatment of the principle came only in the 19th century, with George Boole,\"It is sometimes required to prove a theorem which shall be true whenever a certain quantity n which it involves shall be an integer or whole number and the method of proof is usually of the following kind. 1st. The theorem is proved to be true when n  1. 2ndly. It is proved that if the theorem is true when n is a given whole number, it will be true if n is the next greater integer. Hence the theorem is true universally. . .. This species of argument may be termed a continued sorites\" (Boole circa 1849 Elementary Treatise on Logic not mathematical pages 40–41 reprinted in Grattan-Guinness, Ivor and Bornet, Gérard (1997), George Boole: Selected Manuscripts on Logic and its Philosophy, Birkhäuser Verlag, Berlin, ) Augustus de Morgan, Charles Sanders Peirce, Reprinted (CP 3.252-88), (W 4:299-309). Giuseppe Peano, and Richard Dedekind.\n\nDescription\n\nThe simplest and most common form of mathematical induction infers that a statement involving a natural number n holds for all values of n. The proof consists of two steps:\n# The base case: prove that the statement holds for the first natural number n. Usually, n 0 or n \n 1, rarely, n =  –1 (although not a natural number, the extension of the natural numbers to –1 is still a well-ordered set).\n# The inductive step: prove that, if the statement holds for some natural number n, then the statement holds for n + 1.\nThe hypothesis in the inductive step that the statement holds for some n is called the induction hypothesis (or inductive hypothesis). To perform the inductive step, one assumes the induction hypothesis and then uses this assumption to prove the statement for n + 1.\n\nWhether n  0 or n \n 1 depends on the definition of the natural numbers. If 0 is considered a natural number, as is common in the fields of combinatorics and mathematical logic, the base case is given by n  0. If, on the other hand, 1 is taken as the first natural number, then the base case is given by n \n 1.\n\nExamples\n\nMathematical induction can be used to prove that the following statement, P(n), holds for all natural numbers n.\n\n0 + 1 + 2 + \\cdots + n = \\frac{n(n + 1)}{2}.\n\nP(n) gives a formula for the sum of the natural numbers less than or equal to number n. The proof that P(n) is true for each natural number n proceeds as follows.\n\nBase case: Show that the statement holds for n = 0. \nP(0) is easily seen to be true:\n0 = \\frac{0\\cdot(0 + 1)}{2}\\,.\nInductive step: Show that if P(k) holds, then also  holds. This can be done as follows.\n\nAssume P(k) holds (for some unspecified value of k). It must then be shown that  holds, that is:\n(0 + 1 + 2 + \\cdots + k )+ (k+1) = \\frac{(k+1)((k+1) + 1)}{2}.\nUsing the induction hypothesis that P(k) holds, the left-hand side can be rewritten to:\n\n\\frac{k(k + 1)}{2} + (k+1)\\,.\n\nAlgebraically:\n\n\\begin{align}\n\\frac{k(k + 1)}{2} + (k+1) & = \\frac {k(k+1)+2(k+1)} 2 \\\\\n& = \\frac{(k+1)(k+2)}{2} \\\\\n& = \\frac{(k+1)((k+1) + 1)}{2}\n\\end{align}\n\nthereby showing that indeed   holds.\n\nSince both the base case and the inductive step have been performed, by mathematical induction, the statement P(n) holds for all natural numbers n. Q.E.D.\n\nFormalization\n\nIn second-order logic, induction on natural numbers can be formalized as an axiom:\n\n\\forall P ( P(0) \\land \\forall k ( P(k) \\Rightarrow P(k+1) ) \\Rightarrow \\forall n (P(n))),\n\nwhere P is any predicate and k and n are both natural numbers.\n\nIn words, the base case P(0) and the inductive step (namely, that the induction hypothesis P(k) implies P(k + 1)) together imply that P(n) for any natural number n. The axiom of induction asserts that the validity of inferring that P(n) holds for any natural number n from the base case and the inductive step.\n\nNote that the first quantifier in the axiom ranges over predicates rather than over individual numbers.  This is a second-order quantifier, which means that this axiom is stated in second-order logic.  Axiomatizing arithmetic induction in first-order logic requires an axiom schema containing a separate axiom for each possible predicate.  The article Peano axioms contains further discussion of this issue.\n\nIn first-order ZFC set theory, quantification over predicates is not allowed, but we can still phrase induction by quantification over sets:\n\n\\forall A ( 0 \\in A \\land \\forall k \\in \\mathbb{N} ( k \\in A \\Rightarrow (k+1) \\in A ) \\Rightarrow \\mathbb{N}\\subseteq A)\n\nThis is not an axiom, but a theorem, given sets and numbers are defined.\n\nVariants\n\nIn practice, proofs by induction are often structured differently, depending on the exact nature of the property to be proved.n\n\nInduction basis other than 0 or 1\n\nIf one wishes to prove a statement not for all natural numbers but only for all numbers n greater than or equal to a certain number b, then the proof by induction consists of:\n# Showing that the statement holds when n = b.\n# Showing that if the statement holds for some n ≥ b then the same statement also holds for n + 1.\nThis can be used, for example, to show that n2 ≥ 3n for n ≥ 3.\n\nIn this way, one can prove that some statement P(n) holds for all n ≥ 1, or even n ≥ −5.  This form of mathematical induction is actually a special case of the previous form, because if the statement to be proved is P(n) then proving it with these two rules is equivalent with proving P(n + b) for all natural numbers n with an induction base case 0.Ted Sundstrom, Mathematical Reasoning, p. 190, Pearson, 2006, \n\nExample: forming dollar amounts by coins \n\nAssume an infinite supply of 4- and 5-dollar coins. Induction can be used to prove that any whole amount of dollars greater than 12 can be formed by a combination of such coins. The amount n is chosen to begin on 12 as the statement does not hold true for every lower number; in particular, it is violated for n=11.\n\nIn more precise terms, we wish to show that for any amount n\\geq12 there exist natural numbers a,b such that n=4a+5b, where 0 is included as a natural number. The statement to be shown is thus:\n\nS(n): \\,\\, n\\geq12 \\Rightarrow \\exists\\, a,b\\in\\mathbb{N}.\\,\\, n=4a+5b\n\nBase case: Showing that S(k) holds for k12 is trivial: let a\n3 and b0. Then, 4 \\cdot 3+5 \\cdot 0\n12.\n\nInductive step: Given that S(k) holds for some value of k \\geq 12 (induction hypothesis), prove that S(k+1) holds, too. That is, given that k4a+5b for some natural numbers a,b, prove that there exist natural numbers a_1,b_1 such that k+1\n4a_1+5b_1.\n\nHere we need to consider two cases.\n\nFor the first case, assume that a\\geq 1. By some algebraic manipulation and by assumption, we see that in that case\n\n\\begin{align}\nk&=4a+5b\\\\\nk+1&=4a+5b+1\\\\\n&=4a+5b-4+5\\\\\n&=4(a-1)+5(b+1)\\\\\n&=4a_1+5b_1\n\\end{align}\n\nwhere a_1a-1 and b_1\nb+1 are natural numbers.\n\nThis shows that to add 1 to the total amount—any amount whatsoever, so long as it is greater than 12—it is sufficient to remove a single 4-dollar coin while adding a 5-dollar coin. However, this construction fails in the case that a=0, or in words, when there is no 4-dollar coin. \n\nSo it remains to prove the case a0. Then k\n5b \\geq 12, which implies that b \\geq 3.\n\n\\begin{align}\nk&=5b\\\\\nk+1&=5b+1\\\\\n&=5b-15+16\\\\\n&=5(b-3)+4\\cdot4\\\\\n&=4\\cdot4+5(b-3)\\\\\n&=4a_1+5b_1\n\\end{align}\n\nwhere a_14 and b_1\nb-3 are again natural numbers.\n\nThe above calculation shows that in the case there are no 4-dollar coins, we can add 1 to the amount by removing three 5-dollar coins while adding four 4-dollar coins.\n\nThus, with the inductive step, we have shown that S(k) implies S(k+1) for all natural numbers k \\geq 12, and the proof is complete. Q.E.D.\n\nInduction on more than one counter\n\nIt is sometimes desirable to prove a statement involving two natural numbers, n and m, by iterating the induction process. That is, one proves a base case and an inductive step for n, and in each of those proves a base case and an inductive step for m. See, for example, the proof of commutativity accompanying addition of natural numbers. More complicated arguments involving three or more counters are also possible.\n\nInfinite descent\n\nThe method of infinite descent was one of Pierre de Fermat's favorites. It is used to show that some statement Q(n) is false for all natural numbers n. Its traditional form consists of showing that if Q(n) is true for some natural number n, it also holds for some strictly smaller natural number m. Using mathematical induction (implicitly) on the statement P(n) defined as \"Q(m) is false for all natural numbers m less than or equal to n\", it follows that P(n) holds for all n, which means that Q(n) is false for any natural number n.\n\nPrefix induction\n\nThe most common form of proof by mathematical induction requires proving in the inductive step that\n\n\\forall k (P(k) \\to P(k+1))\n\nwhereupon the induction principle \"automates\" n applications of this step in getting from P(0) to P(n).  This could be called \"predecessor induction\" because each step proves something about a number from something about that number's predecessor.\n\nA variant of interest in computational complexity is \"prefix induction\", in which one needs to prove\n\n\\forall k (P(k) \\to P(2k) \\land P(2k+1))\n\nor equivalently\n\n\\forall k \\left( P \\left(\\left\\lfloor \\frac{k}{2} \\right\\rfloor \\right) \\to P(k) \\right)\n\nThe induction principle then \"automates\" log n applications of this inference in getting from P(0) to P(n).  (It is called \"prefix induction\" because each step proves something about a number from something about the \"prefix\" of that number formed by truncating the low bit of its binary representation. It can be viewed as an application of traditional induction on the length of that binary representation.)\n\nIf traditional predecessor induction is interpreted computationally as an n-step loop, prefix induction corresponds to a log n-step loop, and thus proofs using prefix induction are \"more feasibly constructive\" than proofs using predecessor induction.\n\nPredecessor induction can trivially simulate prefix induction on the same statement.  Prefix induction can simulate predecessor induction, but only at the cost of making the statement more syntactically complex (adding a bounded universal quantifier), so the interesting results relating prefix induction to polynomial-time computation depend on excluding unbounded quantifiers entirely, and limiting the alternation of bounded universal and existential quantifiers allowed in the statement.\n\nOne can take the idea a step further: one must prove\n\n\\forall k \\left( P \\left( \\left\\lfloor \\sqrt{k} \\right\\rfloor \\right) \\to P(k) \\right)\n\nwhereupon the induction principle \"automates\" log log n applications of this inference in getting from P(0) to P(n).  This form of induction has been used, analogously, to study log-time parallel computation.\n\nCourse-of-values induction\n\nAnother variant is called course-of-values induction. It should not be confused with the term  \"Wertverlaufsrekursion\" coined by Bernays and Peter regarding definition of recursive functions. It is sometimes called \"strong induction\" in contrast to which the basic form of induction defined above is sometimes known as \"weak induction\" (although it is not weaker at all, see Peter's textbook  and most other sources on mathematical induction). To call both variants of this principle \"complete induction\" may be a good idea, because this is the literal translation of the German term \"vollständige Induktion\" (which introduced \"induction\" as a term for this form of mathematical reasoning in the 19th century); it is very common in German not to discriminate explicitly between these two equivalent forms of weak or strong induction.\n\nCourse-of-values induction makes the inductive step easier to prove by using a stronger induction hypothesis:\none proves the statement  under the assumption that P(m) holds for all natural m strictly less than ;\nby contrast, the basic form only assumes the immediate predecessor of n in the inductive step.\nIn this form of course-of-values induction one does not need to prove the base case P(0) separately, but it may nevertheless be necessary to make a case distinction and consider several special cases whose proof does not depend on the induction hypothesis, as in the example below of the Fibonacci number Fn. This is very similar to the role of the base case in ordinary induction.\n\nCourse-of-values induction is equivalent to ordinary mathematical induction as described above, in the sense that a proof by one method can be transformed into a proof by the other. Suppose there is a proof of P(n) by course-of-values induction. Let Q(n) mean \"P(m) holds for all m such that \".  Then Q(n) holds for all n if and only if P(n) holds for all n, and the proof of P(n) by course-of-values induction is easily transformed into a proof of Q(n) by ordinary induction. If, on the other hand, P(n) had been proven by ordinary induction, the proof would already effectively be one by course-of-values induction with a case distinction: P(0) is proved in the base case, using no assumptions, and  is proved in the inductive step, in which one may assume all earlier cases but need only use the case P(n).\n\nExample: Fibonacci numbers\n\nComplete induction is most useful when several instances of the induction hypothesis are required for each inductive step.  For example, complete induction can be used to show that\n F_n = \\frac{\\varphi^n - \\psi^n}{\\varphi - \\psi}\nwhere Fn is the nth Fibonacci number,  (the golden ratio) and  are the roots of the polynomial . The identity is easily  verified in the two special cases  and . By using the fact that  for each , the identity above can be verified for the remaining cases by direct calculation for , using the induction hypothesis that it holds for both Fn+1 and Fn.\n\nExample: prime factorization\n\nAnother proof by complete induction uses the hypothesis that the statement holds for all smaller m more thoroughly.  Consider the statement that \"every natural number greater than 1 is a product of (one or more) prime numbers\", which is the \"existence\" part of the fundamental theorem of arithmetic. For proving the inductive step, the induction hyposthesis is that for a given  the statement holds for all smaller .  If n is prime then it is certainly a product of primes, and if not, then by definition it can be written in the form of a product , where neither of the factors is equal to 1; hence neither is equal to n, and so both are smaller than n.  The induction hypothesis now applies to m1 and m2, so each one is a product of primes.  So n is the product of two products of primes, and thus itself a product of primes.\n\nExample: dollar amounts revisited \n\nWe shall look to prove the same example as above, this time with complete induction. The statement remains the same:\n\nS(n): \\,\\,n\\geq12 \\implies \\,\\exists\\, a,b\\in\\mathbb{N}. \\,\\, n=4a+5b.\n\nThe induction hypothesis is then:\nS(m) holds for all m with 12\\leq m\n\nTo start, we need to distinguish some special cases.\n\n;Special cases\nWe show that S(k) holds for k=12,13,14,15.\n\n\\begin{align}\n12 = 4 \\cdot 3+5 \\cdot 0;\\\\\n13 = 4 \\cdot 2+5 \\cdot 1;\\\\\n14 = 4 \\cdot 1+5 \\cdot 2;\\\\\n15 = 4 \\cdot 0+5 \\cdot 3.\n\\end{align}\n\nThe base case holds.\n\n;Remaining cases\nChoosing m=n-4, and observing that 15, we conclude by the induction hypothesis that S(n-4) holds. That is, the amount n-4 can be formed by some combination of 4- and 5-dollar coins. Then, simply adding a 4-dollar coin to that combination yields the amount n. That is, S(n) holds. Q.E.D.\n\nTransfinite induction\n\nThe principle of complete induction is not only valid for statements about natural numbers, but for statements about elements of any well-founded set, that is, a set with an irreflexive relation . Reprinted in A Random Walk in Science (R. L. Weber, ed.), Crane, Russak & Co., 1973.\n*Base case: In a set of only one horse, there is only one color.\n*Inductive step: Assume as induction hypothesis that within any set of n horses, there is only one color.  Now look at any set of n + 1 horses.  Number them: 1, 2, 3, ..., n, n + 1.  Consider the sets {1, 2, 3, ..., n} and {2, 3, 4, ..., n + 1}.  Each is a set of only n horses, therefore within each there is only one color.  But the two sets overlap, so there must be only one color among all n + 1 horses.\n\nThe base case n  1 is trivial (as any horse is the same color as itself), and the inductive step is correct in all cases n > 1. However, the logic of the inductive step is incorrect for n \n 1, because the statement that \"the two sets overlap\" is false (there are only n + 1 = 2 horses prior to either removal, and after removal the sets of one horse each do not overlap). Mathematical induction. http://en.wikipedia.org/?curid=18881."
  }
}
