{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7731",
  "eid" : "e3119730-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778460707,
  "textBody" : "The Christian countercult movement or Christian anti-cult movement is a social movement of certain  Protestant evangelical and fundamentalist and other Christian ministries (\"discernment ministries\"Robert M. Bowman, Orthodoxy and Heresy: A Biblical Guide to Doctrinal Discernment, Grand Rapids: Baker Book House, 1992, pp. 10, 106-107, & 123-124.) and individual activists who oppose religious sects they consider \"cults\".Douglas E Cowan author.  Bearing False Witness? Introduction to the Christian Counter Cult. https://www.amazon.com/dp/0275974596\n\nOverview\n\nChristian countercult activism stems mainly from evangelicalism or fundamentalism. The countercult movement asserts that particular Christian sects whose beliefs they deem to be partially or wholly not in accordance with the Bible are erroneous. It also states that a religious sect can be considered a cult if its beliefs involve a denial of what they view as any of the essential Christian teachings such as salvation, the Trinity, Jesus himself as a person, the ministry and miracles of Jesus, his crucifixion, his resurrection, the Second Coming and the Rapture.Walter R. Martin, The Rise of the Cults, rev.ed. Santa Ana: Vision House, 1978, pp. 11-12.Richard Abanes, Defending the Faith: A Beginner's Guide to Cults and New Religions, Grand Rapids: Baker Book House, 1997, p. 33.H. Wayne House & Gordon Carle, Doctrine Twisting: How Core Biblical Truths are Distorted, Downers Grove: IVP, 2003.\n\nCountercult ministries often concern themselves with religious sects that consider themselves Christian but hold beliefs thought to contradict the Bible, including The Church of Jesus Christ of Latter-day Saints, the Unification Church, Christian Science, and Jehovah's Witnesses. Anti-Catholic movements have led Protestants to classify Catholicism as a cult. John Highham described anti-Catholicism as \"the most luxuriant, tenacious tradition of paranoiac agitation in American history\". Some also denounce non-Christian religions such as Islam, Wicca, Paganism, New Age groups, Buddhism, Hinduism and other religions.\n\nCountercult literature usually expresses doctrinal or theological concerns and a missionary or apologetic purpose.Garry W. Trompf,\"Missiology, Methodology and the Study of New Religious Movements,\" Religious Traditions Volume 10, 1987, pp. 95-106. It presents a rebuttal by emphasizing the teachings of the Bible against the beliefs of non-fundamental Christian sects. Christian countercult activist writers also emphasize the need for Christians to evangelize to followers of cults.Walter R. Martin, The Kingdom of the Cults, rev.ed. Ravi Zacharias ed. Bloomington: Bethany House, 2003, pp.479-493.Ronald Enroth ed. Evangelising the Cults, Milton Keynes: Word, 1990.Norman L Geisler & Ron Rhodes, When Cultists Ask: A Popular Handbook on Cultic Misinterpretations, Grand Rapids: Baker Book House, 1997. Some Christians also share concerns similar to those of the secular anti-cult movement.Paul R. Martin, Cult Proofing Your Kids, Grand Rapids: Zondervan, 1993.Joel A. MacCollam, Carnival of Souls: Religious Cults and Young People, New York: Seabury Press, 1979.\n\nThe movement publishes its views through a variety of media including books, magazines, and newsletters, radio broadcasting; audio and videocassette production, direct mail appeals, proactive evangelistic encounters, professional and avocational websites, as well as lecture series, training workshops and counter cult conferences.Cowan, D.E. 2003. Bearing False Witness?: An Introduction to the Christian Countercult: Praeger.\n\nHistory\n\nPrecursors and pioneers\n\nChristians have applied theological criteria to assess the teachings of non-orthodox movements throughout church history.Saliba, Understanding New Religious Movements, pp.45-74.Harold O. J. Brown, Heresies: The Image of Christ in the Mirror of Heresy and Orthodoxy from the Apostles to the Present, Garden City: Doubleday, 1984.J.W.C.Wand, The Four Great Heresies:Nestorian, Eutychian, Apollinarian, Arian, London: A.R.Mowbray, 1955. The Apostles themselves were involved in challenging the doctrines and claims of various teachers. The Apostle Paul wrote an entire epistle, Galatians, antagonistic to the teachings of a Jewish sect that claimed adherence to the teachings of both Jesus and Moses (cf. Acts 15: & Gal. 1:6-10). The Apostle John devoted his first Epistle to countering early proto-gnostic cults that had arisen in the first century, all claiming to be \"Christian\" (1 Jn. 2:19).\n\nThe early Church in the post-apostolic period was much more involved in \"defending its frontiers against alternative soteriologies — either by defining its own position with greater and greater exactness, or by attacking other religions, and particularly the Hellenistic mysteries.\"Eric J. Sharpe, Comparative Religion: A History, London: Duckworth, 1975, p. 9 In fact, a good deal of the early Christian literature is devoted to the exposure and refutation of unorthodox  theology, mystery religions and Gnostic groups.Brown, Heresies, pp.38-69.Ronald H. Nash, Christianity and the Hellenistic World, Grand Rapids: Zondervan, 1984, pp.213-224. Irenaeus, Tertullian and Hippolytus of Rome were among the greatest early Christian apologetes who engaged in critical analyses of unorthodox theology, Greco-Roman pagan religions, and Gnostic groups.Avery Dulles, A History of Apologetics, Eugene: Wipf & Stock, 1999, pp. 22-58.J.K.S.Reid, Christian Apologetics, Grand Rapids: William Eerdmans, 1970, pp. 36-53.Bengt Hagglund, History of Theology, trans. Gene J. Lund, St. Louis: Concordia Publishing House, 1968, pp.31-105.\n\nIn the Protestant traditions some of the earliest writings opposing unorthodox groups like Swedenborg's teachings, can be traced back to John Wesley, Alexander Campbell and Princeton Theological Seminary theologians like Charles Hodge and B. B. Warfield.Richard G. Kyle, The Religious Fringe: A History of Alternative Religions in America, Downers Grove: IVP, 1993.Philip Jenkins, Mystics and Messiahs: Cults and New Religions in American History, New York: Oxford University Press, 2000. The first known usage of the term \"cult\" by a Protestant apologist to denote a group is heretical or unorthodox is in Anti-Christian Cults by A. H. Barrington, published in 1898.A.H.Barrington, Anti-Christian Cults, Milwaukee: Young Churchman/London: Sampson Low, Marston, 1898.\n\nQuite a few of the pioneering apologists were Baptist pastors, like I. M. Haldeman, or participants in the Plymouth Brethren, like William C. Irvine and Sydney Watson.J. Gordon Melton,\"The counter-cult monitoring movement in historical perspective,\" in Challenging Religion: Essays in Honour of Eileen Barker, edited by James A. Beckford & James T. Richardson, Routledge, London, 2003, pp. 102–113. Watson wrote a series of didactic novels like Escaped from the Snare: Christian Science,Sydney Watson, Escaped from the Snare: Christian Science, London: William Nichoson & Sons, no date. Bewitched by Spiritualism,Sydney Watson, The Lure of a Soul: Bewitched by Spiritualism, London: W. Nicholson & Sons, no date. and The Gilded Lie, as warnings of the dangers posed by cultic groups. Watson's use of fiction to counter the cults has been repeated by later novelists like Frank E. Peretti.Frank E. Peretti, This Present Darkness, Westchester: Crossway,1986.James R. Lewis, \"Works of Darkness: Occult Fascination in the Novels of Frank Peretti\" in Magical Religion and Modern Witchcraft, James R. Lewis ed. Albany: State University of New York Press, 1996, pp.339-350.\n\nThe early twentieth century apologists generally applied the words \"heresy\" and \"sects\" to groups like the Christadelphians, Mormons, Jehovah's Witnesses, Spiritualists, and Theosophists. This was reflected in several chapters contributed to the multi-volume work released in 1915 The Fundamentals, where apologists criticised the teachings of Charles Taze Russell, Mary Baker Eddy, the Mormons and Spiritualists.William G. Moorehead, ‘Millennial Dawn A Counterfeit of Christianity’, in The Fundamentals: A Testimony to the Truth, Volume 7. Chicago: Testimony Publishing.Maurice E. Wilson, ‘Eddyism, Commonly Called “Christian Science”, in The Fundamentals: A Testimony to the Truth, Volume 9. Chicago: Testimony Publishing.R. G. McNiece, ‘Mormonism: Its Origin, Characteristics, and Doctrines’, in The Fundamentals: A Testimony to the Truth, Volume 8. Chicago: Testimony Publishing.Algernon J. Pollock, ‘Modern Spiritualism Briefly Tested By Scripture’, in The Fundamentals: A Testimony to the Truth, Volume 10. Chicago: Testimony Publishing.\n\nMid-20th century apologists\n\nSince the 1940s, the approach of traditional Christians was to apply the meaning of cult such that it included those religious groups who use other scriptures beside the Bible or have teachings and practices deviating from traditional Christian teachings and practices. Some examples of sources (with published dates where known) that documented this approach are:\n\n*The Missionary Faces Isms, by John C. Mattes, pub. 1937 (Board of American Missions of the United Lutheran Church in America).\t\t\n*Heresies Ancient and Modern, by J.Oswald Sanders, pub.1948 (Marshall Morgan & Scott, London/Zondervan, Grand Rapids).\t\n*\n*\n*Heresies Exposed, by W.C. Irvine, pub. 1917, 1921, 1975 (Loizeaux Brothers).\t\n*Confusion of Tongues, by C.W. Ferguson, pub. 1928 (Doran & Co).\t\n*Isms New and Old, by Julius Bodensieck.\t\n*Some Latter-Day Religions, by G.H.Combs.\n\nOne of the first prominent counter-cult apologists was Jan Karel van Baalen (1890–1968), an ordained minister in the Christian Reformed Church in North America. His book, The Chaos of Cults, which was first published in 1938, became a classic in the field as it was repeatedly revised and updated until 1962.J.K.van Baalen, The Chaos of Cults, 4th rev.ed.Grand Rapids: William Eerdmans Publishing, 1962.\n\nWalter Martin\n\nHistorically, one of the most important protagonists of the movement was Walter Martin (1928–89), whose numerous books include the 1955 The Rise of the Cults: An Introductory Guide to the Non-Christian Cults and the 1965 The Kingdom of the Cults: An Analysis of Major Cult Systems in the Present Christian Era, which continues to be influential. He became well known in conservative Christian circles through a radio program, \"The Bible Answer Man\", currently hosted by Hank Hanegraaff.\n\nIn The Rise of the CultsWalter R. Martin, The Rise of the Cults, Grand Rapids: Zondervan, 1955, pp. 11-12. Martin gave the following definition of a cult:\n\nBy cultism we mean the adherence to doctrines which are pointedly contradictory to orthodox Christianity and which yet claim the distinction of either tracing their origin to orthodox sources or of being in essential harmony with those sources. Cultism, in short, is any major deviation from orthodox Christianity relative to the cardinal doctrines of the Christian faith.\n\nAs Martin's definition suggests, the countercult ministries concentrate on non-traditional groups that claim to be Christian, so chief targets have been The Church of Jesus Christ of Latter-day Saints (i.e., \"Mormons\"), Jehovah's Witnesses, Armstrongism, Christian Science and the Unification Church, but also smaller groups like the Swedenborgian ChurchEach of these movements are treated in separate chapters in Walter R. Martin, The Kingdom of the Cults, rev. ed. Ravi Zacharias ed. Bloomington: Bethany House, 2003.\n\nVarious other conservative Christian leaders—among them John Ankerberg and Norman Geisler—have emphasized themes similar to Martin's.John Ankerberg & John Weldon, Cult Watch, Eugene: Harvest House, 1991, pp. i-x.Geisler & Rhodes, When Cultists Ask, pp. 10-11.  Perhaps more importantly, numerous other well-known conservative Christian leaders as well as many conservative pastors have accepted Martin's definition of a cult as well as his understanding of the groups to which he gave that label. Dave BreeseDave Breese, Know the Marks of Cults, Wheaton: Victor, 1975, 14. summed up this kind of definitionCompare this definition with heresy. in these words:\nA cult is a religious perversion. It is a belief and practice in the world of religion which calls for devotion to a religious view or leader centered in false doctrine. It is an organized heresy. A cult may take many forms but it is basically a religious movement which distorts or warps orthodox faith to the point where truth becomes perverted into a lie. A cult is impossible to define except against the absolute standard of the teaching of Holy Scripture.\n\nDiscernment Blogging\n\nKenne \"Ken\" Silva is said by other discernment bloggers to have pioneered online discernment ministry.Marsha West, \"Online discernment ministries — the new lepers\" http://bereanresearch.org/online-discernment-ministries-new-lepers/ Ken was a Baptist pastor who ran the discernment blog Apprising. Silva wrote many blog articles about the Emerging Church, the Word of Faith Movement, Mormonism, the Jehovah's Witness, the Gay Christian Movement, and many other groups. He started his blog in 2005 and wrote there until his death in 2014.Amy Spreeman, \"Online Memorial for Pastor Ken Silva\" http://standupforthetruth.com/2014/10/online-memorial-pastor-ken-silva-10614/\n\nSilva's work paved the way for other internet discernment ministries such as Pirate Christian Radio, a group of blogs and podcasts founded by Lutheran Pastor Chris Rosebrough in 2008,http://www.piratechristian.com/contributors/ and Pulpit & Pen, a discernment blog founded by Baptist Pastor and polemicist J.D. Hall.\n\nOther technical terminology\n\nSince the 1980s the term \"new religions\" or \"new religious movements\" has slowly entered into Evangelical usage alongside the word \"cult\". Some book titles use both terms.Richard Abanes, Cults, New Religious Movements, and Your Family, Wheaton: Crossway, 1998.Ronald Enroth ed. A Guide to New Religious Movements, Downers Grove: IVP, 2005.Ron Rhodes, The Challenge of the Cults and New Religions, Grand Rapids: Zondervan, 2001.\n\nThe acceptance of these alternatives to the word \"cult\" in Evangelicalism reflects, in part, the wider usage of such language in the sociology of religion.On sociological understandings see for example Eileen Barker, New Religious Movements: A Practical Introduction, London: Her Majesty's Stationery Office, 1989. George D. Chryssides, Exploring New Religions, London & New York: Cassell, 1999.Jacob Needleman & George Baker ed. Understanding the New Religions, New York: Seabury Press, 1981. Mikael Rothstein & Reender Kranenborg ed. New Religions in a Postmodern World, Aarhus, Denmark: Aargus University Press, 2003.\n\nApologetics\n\nThe term \"countercult apologetics\" first appeared in Protestant Evangelical literature as a self-designation in the late 1970s and early 1980s in articles by Ronald Enroth and David Fetcho, and by Walter Martin in Martin Speaks Out on the Cults.Ronald M. Enroth, \"Cult/Counter-cult\", Eternity, November 1977, pp.18-22 & 32-35. David Fetcho, \"Disclosing the Unknown God: Evangelism to the New Religions\", Update: A Quarterly Journal on New Religious Movements Volume 6, number 4 December 1982 p.8. Walter R. Martin, Martin Speaks Out On The Cults, rev. ed. Ventura: Vision House, 1983, pp.124-125. A mid-1980s debate about apologetic methodology between Ronald Enroth and J. Gordon Melton, led the latter to place more emphasis in his publications on differentiating the Christian countercult from the secular anti-cult.Ronald M. Enroth and J. Gordon Melton, Why Cults Succeed Where The Church Fails, Elgin: Brethren, 1985, pp. 25-30. Eric Pement urged Melton to adopt the label \"Christian countercult\",Eric Pement, ‘Comments on the Directory’ in Keith Edward Tolbert and Eric Pement, The 1993 Directory of Cult Research Organizations, Trenton: American Religions Center, 1993, p. x. and since the early 1990s the terms has entered into popular usage and is recognised by sociologists such as Douglas Cowan.Douglas E. Cowan, Bearing False Witness? An Introduction to the Christian Countercult, Westport: Praeger, 2003.\n\nThe only existing umbrella organization within the countercult movement in the USA is the EMNR (Evangelical Ministries to New Religions) founded in 1982 which has the evangelical Lausanne Covenant as governing document and which stresses mission, scholarship, accountability and networking.\n\nWorldwide organizations\n\nWhile the greatest number of countercult ministries are found in the USA, ministries exist in Australia, Brazil, Canada, Denmark, England, Ethiopia, Germany, Hungary, Italy, Mexico, New Zealand, Philippines, Romania, Russia,  Sweden, and Ukraine. A comparison between the methods employed in the USA and other nations discloses some similarities in emphasis, but also other nuances in emphasis. The similarities are that globally these ministries share a common concern about the evangelization of people in cults and new religions. There is also often a common thread of comparing orthodox doctrines and biblical passages with the teachings of the groups under examination. However, in some of the European and southern hemisphere contexts, confrontational methods of engagement are not always relied on, and dialogical approaches are sometimes advocated.\n\nA group of organizations which originated within the context of established religion is working in more general fields of cult-awareness, especially in Europe. Their leaders are theologians, and they are often social ministries affiliated to big churches.\n\nProtestant\n\n* Berlin-based Pfarramt für Sekten- und Weltanschauungsfragen (\"Parish Office for Sects and World Views.\") headed by Lutheran Pastor Thomas Gandow\n*Swiss \"Evangelische Informationsstelle Kirchen-Sekten-Religionen\" (Protestant Reformed Zwinglian Information Service on Churches, Sects and Religions) headed by Zwinglian Parson Georg Schmid\n\nCatholic\n\n*Sekten und Weltanschauungen in Sachsen (Sects and ideologies in Saxony)\n* Weltanschauungen und religiöse Gruppierungen (\"Worldviews and religious groups\") of the Roman Catholic Diocese of Linz, Austria\n* GRIS (Gruppo di ricerca e informazione socio-religiosa), Italy\n\nOrthodox\n\n*Synodic Committee about Heresies of Greek Orthodox Church\n*Center of Ireneus of Lyon in Russia.\n\nContextual missiology\n\nThe phenomena of \"cults\" has also entered into the discourses of Christian missions and theology of religions. An initial step in this direction occurred in 1980 when the Lausanne Committee for World Evangelization convened a mini-consultation in Thailand. From that consultation a position paper was produced.[http://www.lausanne.org/Brix?pageID=14647 The Thailand Report on New Religious Movements]  The issue was revisited at the Lausanne Forum in 2004 with another paper.[http://www.lausanne.org/lcwe/assets/LOP45_IG16.pdf Religious and Non-Religious Spirituality in the Western World] The latter paper adopts a different methodology to that advocated in 1980.\n\nIn the 1990s discussions in academic missions and theological journals indicate that another trajectory is emerging which reflects the influence of contextual missions theory. Advocates of this approach maintain that apologetics as a tool needs to be retained, but do not favour a confrontational style of engagement.Irving Hexham, Stephen Rost & John W. Morehead ed. Encountering New Religious Movements: A Holistic Evangelical Approach, Grand Rapids: Kregel, 2004.Gordon R. Lewis, \"Our Mission Responsibility to New Religious Movements\" International Journal of Frontier Missions Volume 15, number 3 July–September 1998, p. 116.\n\nVariations and models\n\nCountercult apologetics has several variations and methods employed in analysing and responding to cults. The different nuances in countercult apologetics have been discussed by John A. Saliba and Philip Johnson.Saliba, Understanding New Religious Movements, pp.212-223. Philip Johnson, \"Apologetics, Mission and New Religious Movements: A Holistic Approach,\" Sacred Tribes Journal, Volume 1, number 1 Fall 2002 5-220.\n\nThe dominant method is the emphasis on detecting unorthodox or heretical doctrines and contrasting those with orthodox interpretations of the Bible and early creedal documents. Some apologists, such as Francis J. Beckwith, have emphasised a philosophical approach, pointing out logical, epistemological and metaphysical problems within the teachings of a particular group.Francis J. Beckwith & Stephen E. Parrish, See the gods fall, Joplin: College Press, 1997. Francis J. Beckwith, Carl Mosser & Paul Owen ed. The New Mormon Challenge, Grand Rapids: Zondervan, 2002. Another approach involves former members of cultic groups recounting their spiritual autobiographies, which highlight experiences of disenchantment with the group, unanswered questions and doubts about commitment to the group, culminating in the person's conversion to Evangelical Christianity.James R. Adair & Ted Miller ed. Escape from Darkness, Wheaton: Victor, 1982.Chris Elkins, Heavenly Deception, Wheaton: Tyndale House, 1980. Joe Hewitt, I Was Raised a Jehovah's Witness, Denver: Accent Books, 1979. Latayne C. Scott, Ex-Mormons: Why We Left, Grand Rapids: Baker Book House, 1990.\n\nApologists like Dave Hunt in Peace, Prosperity and the Coming Holocaust and Hal Lindsey in The Terminal Generation have tended to interpret the phenomena of cults as part of the burgeoning evidence of signs that Christ's Second Advent is close at hand.Dave Hunt, Peace, Prosperity and the Coming Holocaust: The New Age Movement in Prophecy, Eugene: Harvest House, 1983. Hal Lindsey, The Terminal Generation, Old Tappan: Fleming H. Revell, 1976. Both Hunt, and Constance Cumbey, have applied a conspiracy model to interpreting the emergence of New Age spirituality and linking that to speculations about fulfilled prophecies heralding Christ's reappearance.Constance E. Cumbey, The Hidden Dangers of the Rainbow, Shreveport: Huntington House, 1983. Evaluated in Elliot Miller, A Crash Course on the New Age Movement, Grand Rapids: Baker Book House, 1989, pp. 193-206. John A. Saliba, Christian Responses to the New Age Movement: A Critical Assessment, London: Geoffrey Chapman, 1999, pp.58-63.\n\nProminent advocates\n\nPeople\n\n*Constance Cumbey\n*Douglas Groothuis\n*Dave Hunt\n*Greg Koukl\n*J. P. Moreland, Biola University\n*Norman Geisler\n*Bob and Gretchen Passantino\n*Ronald Enroth, evangelical Christian author of books about \"cults\" and new religious movements.\n*Walter Martin Late Baptist minister who was the host of the Bible Answer Man radio broadcast and the president of the Christian Research Institute.  He often used his show to promote arguments against Jehovah's Witnesses, The Church of Jesus Christ of Latter-day Saints, and other movements.\n*Phil Johnson\n*Chris Rosebrough\n*Justin Peters\n*J.D. Hall\n*Ken Silva\n\nOrganizations\n\n*Answers in Action, Bob and Gretchen Passantino\n*Apologetics resource center, by Craig Branch\n*Apologetics Press, current Executive Director Dr. Dave Miller\n*Apprising, Blog of Ken Silva\n*Christian Apologetics and Research Ministry (CARM) founded by Matt Slick\n*Christian Research Institute (CRI) founded by Walter Martin\n*Cult Awareness and Information Centre founded by the late Jan Groenveld\n*Dialog Center International founded by Johannes Aagaard\n*EMNR Evangelical Ministries to New Religions, an umbrella group for ministries to the cults and new religions\n*Midwest Christian Outreach\n*Mormonism Research Ministry (Bill McKeever)\n*Personal Freedom Outreach\n*Pirate Christian Radio, founded by Lutheran Pastor Chris Rosebrough\n*Pulpit & Pen, Discernment blog founded by Baptist Pastor and Polemicist J.D. Hall\n*Spiritual Counterfeits Project, president Tal Brooke\n*Stand To Reason, founded by Greg Koukl and Melinda Penner\n*Utah Lighthouse Ministry (Jerald & Sandra Tanner)\n*Watchman Fellowship, founder David Henke, president James K. Walker",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Christian countercult movement" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7731" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Christian countercult movement or Christian anti-cult movement is a social movement of certain  Protestant evangelical and fundamentalist and other Christian ministries (\"discernment ministries\"Robert M. Bowman, Orthodoxy and Heresy: A Biblical Guide to Doctrinal Discernment, Grand Rapids: Baker Book House, 1992, pp. 10, 106-107, & 123-124.) and individual activists who oppose religious sects they consider \"cults\".Douglas E Cowan author.  Bearing False Witness? Introduction to the Christian Counter Cult. https://www.amazon.com/dp/0275974596\n\nOverview\n\nChristian countercult activism stems mainly from evangelicalism or fundamentalism. The countercult movement asserts that particular Christian sects whose beliefs they deem to be partially or wholly not in accordance with the Bible are erroneous. It also states that a religious sect can be considered a cult if its beliefs involve a denial of what they view as any of the essential Christian teachings such as salvation, the Trinity, Jesus himself as a person, the ministry and miracles of Jesus, his crucifixion, his resurrection, the Second Coming and the Rapture.Walter R. Martin, The Rise of the Cults, rev.ed. Santa Ana: Vision House, 1978, pp. 11-12.Richard Abanes, Defending the Faith: A Beginner's Guide to Cults and New Religions, Grand Rapids: Baker Book House, 1997, p. 33.H. Wayne House & Gordon Carle, Doctrine Twisting: How Core Biblical Truths are Distorted, Downers Grove: IVP, 2003.\n\nCountercult ministries often concern themselves with religious sects that consider themselves Christian but hold beliefs thought to contradict the Bible, including The Church of Jesus Christ of Latter-day Saints, the Unification Church, Christian Science, and Jehovah's Witnesses. Anti-Catholic movements have led Protestants to classify Catholicism as a cult. John Highham described anti-Catholicism as \"the most luxuriant, tenacious tradition of paranoiac agitation in American history\". Some also denounce non-Christian religions such as Islam, Wicca, Paganism, New Age groups, Buddhism, Hinduism and other religions.\n\nCountercult literature usually expresses doctrinal or theological concerns and a missionary or apologetic purpose.Garry W. Trompf,\"Missiology, Methodology and the Study of New Religious Movements,\" Religious Traditions Volume 10, 1987, pp. 95-106. It presents a rebuttal by emphasizing the teachings of the Bible against the beliefs of non-fundamental Christian sects. Christian countercult activist writers also emphasize the need for Christians to evangelize to followers of cults.Walter R. Martin, The Kingdom of the Cults, rev.ed. Ravi Zacharias ed. Bloomington: Bethany House, 2003, pp.479-493.Ronald Enroth ed. Evangelising the Cults, Milton Keynes: Word, 1990.Norman L Geisler & Ron Rhodes, When Cultists Ask: A Popular Handbook on Cultic Misinterpretations, Grand Rapids: Baker Book House, 1997. Some Christians also share concerns similar to those of the secular anti-cult movement.Paul R. Martin, Cult Proofing Your Kids, Grand Rapids: Zondervan, 1993.Joel A. MacCollam, Carnival of Souls: Religious Cults and Young People, New York: Seabury Press, 1979.\n\nThe movement publishes its views through a variety of media including books, magazines, and newsletters, radio broadcasting; audio and videocassette production, direct mail appeals, proactive evangelistic encounters, professional and avocational websites, as well as lecture series, training workshops and counter cult conferences.Cowan, D.E. 2003. Bearing False Witness?: An Introduction to the Christian Countercult: Praeger.\n\nHistory\n\nPrecursors and pioneers\n\nChristians have applied theological criteria to assess the teachings of non-orthodox movements throughout church history.Saliba, Understanding New Religious Movements, pp.45-74.Harold O. J. Brown, Heresies: The Image of Christ in the Mirror of Heresy and Orthodoxy from the Apostles to the Present, Garden City: Doubleday, 1984.J.W.C.Wand, The Four Great Heresies:Nestorian, Eutychian, Apollinarian, Arian, London: A.R.Mowbray, 1955. The Apostles themselves were involved in challenging the doctrines and claims of various teachers. The Apostle Paul wrote an entire epistle, Galatians, antagonistic to the teachings of a Jewish sect that claimed adherence to the teachings of both Jesus and Moses (cf. Acts 15: & Gal. 1:6-10). The Apostle John devoted his first Epistle to countering early proto-gnostic cults that had arisen in the first century, all claiming to be \"Christian\" (1 Jn. 2:19).\n\nThe early Church in the post-apostolic period was much more involved in \"defending its frontiers against alternative soteriologies — either by defining its own position with greater and greater exactness, or by attacking other religions, and particularly the Hellenistic mysteries.\"Eric J. Sharpe, Comparative Religion: A History, London: Duckworth, 1975, p. 9 In fact, a good deal of the early Christian literature is devoted to the exposure and refutation of unorthodox  theology, mystery religions and Gnostic groups.Brown, Heresies, pp.38-69.Ronald H. Nash, Christianity and the Hellenistic World, Grand Rapids: Zondervan, 1984, pp.213-224. Irenaeus, Tertullian and Hippolytus of Rome were among the greatest early Christian apologetes who engaged in critical analyses of unorthodox theology, Greco-Roman pagan religions, and Gnostic groups.Avery Dulles, A History of Apologetics, Eugene: Wipf & Stock, 1999, pp. 22-58.J.K.S.Reid, Christian Apologetics, Grand Rapids: William Eerdmans, 1970, pp. 36-53.Bengt Hagglund, History of Theology, trans. Gene J. Lund, St. Louis: Concordia Publishing House, 1968, pp.31-105.\n\nIn the Protestant traditions some of the earliest writings opposing unorthodox groups like Swedenborg's teachings, can be traced back to John Wesley, Alexander Campbell and Princeton Theological Seminary theologians like Charles Hodge and B. B. Warfield.Richard G. Kyle, The Religious Fringe: A History of Alternative Religions in America, Downers Grove: IVP, 1993.Philip Jenkins, Mystics and Messiahs: Cults and New Religions in American History, New York: Oxford University Press, 2000. The first known usage of the term \"cult\" by a Protestant apologist to denote a group is heretical or unorthodox is in Anti-Christian Cults by A. H. Barrington, published in 1898.A.H.Barrington, Anti-Christian Cults, Milwaukee: Young Churchman/London: Sampson Low, Marston, 1898.\n\nQuite a few of the pioneering apologists were Baptist pastors, like I. M. Haldeman, or participants in the Plymouth Brethren, like William C. Irvine and Sydney Watson.J. Gordon Melton,\"The counter-cult monitoring movement in historical perspective,\" in Challenging Religion: Essays in Honour of Eileen Barker, edited by James A. Beckford & James T. Richardson, Routledge, London, 2003, pp. 102–113. Watson wrote a series of didactic novels like Escaped from the Snare: Christian Science,Sydney Watson, Escaped from the Snare: Christian Science, London: William Nichoson & Sons, no date. Bewitched by Spiritualism,Sydney Watson, The Lure of a Soul: Bewitched by Spiritualism, London: W. Nicholson & Sons, no date. and The Gilded Lie, as warnings of the dangers posed by cultic groups. Watson's use of fiction to counter the cults has been repeated by later novelists like Frank E. Peretti.Frank E. Peretti, This Present Darkness, Westchester: Crossway,1986.James R. Lewis, \"Works of Darkness: Occult Fascination in the Novels of Frank Peretti\" in Magical Religion and Modern Witchcraft, James R. Lewis ed. Albany: State University of New York Press, 1996, pp.339-350.\n\nThe early twentieth century apologists generally applied the words \"heresy\" and \"sects\" to groups like the Christadelphians, Mormons, Jehovah's Witnesses, Spiritualists, and Theosophists. This was reflected in several chapters contributed to the multi-volume work released in 1915 The Fundamentals, where apologists criticised the teachings of Charles Taze Russell, Mary Baker Eddy, the Mormons and Spiritualists.William G. Moorehead, ‘Millennial Dawn A Counterfeit of Christianity’, in The Fundamentals: A Testimony to the Truth, Volume 7. Chicago: Testimony Publishing.Maurice E. Wilson, ‘Eddyism, Commonly Called “Christian Science”, in The Fundamentals: A Testimony to the Truth, Volume 9. Chicago: Testimony Publishing.R. G. McNiece, ‘Mormonism: Its Origin, Characteristics, and Doctrines’, in The Fundamentals: A Testimony to the Truth, Volume 8. Chicago: Testimony Publishing.Algernon J. Pollock, ‘Modern Spiritualism Briefly Tested By Scripture’, in The Fundamentals: A Testimony to the Truth, Volume 10. Chicago: Testimony Publishing.\n\nMid-20th century apologists\n\nSince the 1940s, the approach of traditional Christians was to apply the meaning of cult such that it included those religious groups who use other scriptures beside the Bible or have teachings and practices deviating from traditional Christian teachings and practices. Some examples of sources (with published dates where known) that documented this approach are:\n\n*The Missionary Faces Isms, by John C. Mattes, pub. 1937 (Board of American Missions of the United Lutheran Church in America).\t\t\n*Heresies Ancient and Modern, by J.Oswald Sanders, pub.1948 (Marshall Morgan & Scott, London/Zondervan, Grand Rapids).\t\n*\n*\n*Heresies Exposed, by W.C. Irvine, pub. 1917, 1921, 1975 (Loizeaux Brothers).\t\n*Confusion of Tongues, by C.W. Ferguson, pub. 1928 (Doran & Co).\t\n*Isms New and Old, by Julius Bodensieck.\t\n*Some Latter-Day Religions, by G.H.Combs.\n\nOne of the first prominent counter-cult apologists was Jan Karel van Baalen (1890–1968), an ordained minister in the Christian Reformed Church in North America. His book, The Chaos of Cults, which was first published in 1938, became a classic in the field as it was repeatedly revised and updated until 1962.J.K.van Baalen, The Chaos of Cults, 4th rev.ed.Grand Rapids: William Eerdmans Publishing, 1962.\n\nWalter Martin\n\nHistorically, one of the most important protagonists of the movement was Walter Martin (1928–89), whose numerous books include the 1955 The Rise of the Cults: An Introductory Guide to the Non-Christian Cults and the 1965 The Kingdom of the Cults: An Analysis of Major Cult Systems in the Present Christian Era, which continues to be influential. He became well known in conservative Christian circles through a radio program, \"The Bible Answer Man\", currently hosted by Hank Hanegraaff.\n\nIn The Rise of the CultsWalter R. Martin, The Rise of the Cults, Grand Rapids: Zondervan, 1955, pp. 11-12. Martin gave the following definition of a cult:\n\nBy cultism we mean the adherence to doctrines which are pointedly contradictory to orthodox Christianity and which yet claim the distinction of either tracing their origin to orthodox sources or of being in essential harmony with those sources. Cultism, in short, is any major deviation from orthodox Christianity relative to the cardinal doctrines of the Christian faith.\n\nAs Martin's definition suggests, the countercult ministries concentrate on non-traditional groups that claim to be Christian, so chief targets have been The Church of Jesus Christ of Latter-day Saints (i.e., \"Mormons\"), Jehovah's Witnesses, Armstrongism, Christian Science and the Unification Church, but also smaller groups like the Swedenborgian ChurchEach of these movements are treated in separate chapters in Walter R. Martin, The Kingdom of the Cults, rev. ed. Ravi Zacharias ed. Bloomington: Bethany House, 2003.\n\nVarious other conservative Christian leaders—among them John Ankerberg and Norman Geisler—have emphasized themes similar to Martin's.John Ankerberg & John Weldon, Cult Watch, Eugene: Harvest House, 1991, pp. i-x.Geisler & Rhodes, When Cultists Ask, pp. 10-11.  Perhaps more importantly, numerous other well-known conservative Christian leaders as well as many conservative pastors have accepted Martin's definition of a cult as well as his understanding of the groups to which he gave that label. Dave BreeseDave Breese, Know the Marks of Cults, Wheaton: Victor, 1975, 14. summed up this kind of definitionCompare this definition with heresy. in these words:\nA cult is a religious perversion. It is a belief and practice in the world of religion which calls for devotion to a religious view or leader centered in false doctrine. It is an organized heresy. A cult may take many forms but it is basically a religious movement which distorts or warps orthodox faith to the point where truth becomes perverted into a lie. A cult is impossible to define except against the absolute standard of the teaching of Holy Scripture.\n\nDiscernment Blogging\n\nKenne \"Ken\" Silva is said by other discernment bloggers to have pioneered online discernment ministry.Marsha West, \"Online discernment ministries — the new lepers\" http://bereanresearch.org/online-discernment-ministries-new-lepers/ Ken was a Baptist pastor who ran the discernment blog Apprising. Silva wrote many blog articles about the Emerging Church, the Word of Faith Movement, Mormonism, the Jehovah's Witness, the Gay Christian Movement, and many other groups. He started his blog in 2005 and wrote there until his death in 2014.Amy Spreeman, \"Online Memorial for Pastor Ken Silva\" http://standupforthetruth.com/2014/10/online-memorial-pastor-ken-silva-10614/\n\nSilva's work paved the way for other internet discernment ministries such as Pirate Christian Radio, a group of blogs and podcasts founded by Lutheran Pastor Chris Rosebrough in 2008,http://www.piratechristian.com/contributors/ and Pulpit & Pen, a discernment blog founded by Baptist Pastor and polemicist J.D. Hall.\n\nOther technical terminology\n\nSince the 1980s the term \"new religions\" or \"new religious movements\" has slowly entered into Evangelical usage alongside the word \"cult\". Some book titles use both terms.Richard Abanes, Cults, New Religious Movements, and Your Family, Wheaton: Crossway, 1998.Ronald Enroth ed. A Guide to New Religious Movements, Downers Grove: IVP, 2005.Ron Rhodes, The Challenge of the Cults and New Religions, Grand Rapids: Zondervan, 2001.\n\nThe acceptance of these alternatives to the word \"cult\" in Evangelicalism reflects, in part, the wider usage of such language in the sociology of religion.On sociological understandings see for example Eileen Barker, New Religious Movements: A Practical Introduction, London: Her Majesty's Stationery Office, 1989. George D. Chryssides, Exploring New Religions, London & New York: Cassell, 1999.Jacob Needleman & George Baker ed. Understanding the New Religions, New York: Seabury Press, 1981. Mikael Rothstein & Reender Kranenborg ed. New Religions in a Postmodern World, Aarhus, Denmark: Aargus University Press, 2003.\n\nApologetics\n\nThe term \"countercult apologetics\" first appeared in Protestant Evangelical literature as a self-designation in the late 1970s and early 1980s in articles by Ronald Enroth and David Fetcho, and by Walter Martin in Martin Speaks Out on the Cults.Ronald M. Enroth, \"Cult/Counter-cult\", Eternity, November 1977, pp.18-22 & 32-35. David Fetcho, \"Disclosing the Unknown God: Evangelism to the New Religions\", Update: A Quarterly Journal on New Religious Movements Volume 6, number 4 December 1982 p.8. Walter R. Martin, Martin Speaks Out On The Cults, rev. ed. Ventura: Vision House, 1983, pp.124-125. A mid-1980s debate about apologetic methodology between Ronald Enroth and J. Gordon Melton, led the latter to place more emphasis in his publications on differentiating the Christian countercult from the secular anti-cult.Ronald M. Enroth and J. Gordon Melton, Why Cults Succeed Where The Church Fails, Elgin: Brethren, 1985, pp. 25-30. Eric Pement urged Melton to adopt the label \"Christian countercult\",Eric Pement, ‘Comments on the Directory’ in Keith Edward Tolbert and Eric Pement, The 1993 Directory of Cult Research Organizations, Trenton: American Religions Center, 1993, p. x. and since the early 1990s the terms has entered into popular usage and is recognised by sociologists such as Douglas Cowan.Douglas E. Cowan, Bearing False Witness? An Introduction to the Christian Countercult, Westport: Praeger, 2003.\n\nThe only existing umbrella organization within the countercult movement in the USA is the EMNR (Evangelical Ministries to New Religions) founded in 1982 which has the evangelical Lausanne Covenant as governing document and which stresses mission, scholarship, accountability and networking.\n\nWorldwide organizations\n\nWhile the greatest number of countercult ministries are found in the USA, ministries exist in Australia, Brazil, Canada, Denmark, England, Ethiopia, Germany, Hungary, Italy, Mexico, New Zealand, Philippines, Romania, Russia,  Sweden, and Ukraine. A comparison between the methods employed in the USA and other nations discloses some similarities in emphasis, but also other nuances in emphasis. The similarities are that globally these ministries share a common concern about the evangelization of people in cults and new religions. There is also often a common thread of comparing orthodox doctrines and biblical passages with the teachings of the groups under examination. However, in some of the European and southern hemisphere contexts, confrontational methods of engagement are not always relied on, and dialogical approaches are sometimes advocated.\n\nA group of organizations which originated within the context of established religion is working in more general fields of cult-awareness, especially in Europe. Their leaders are theologians, and they are often social ministries affiliated to big churches.\n\nProtestant\n\n* Berlin-based Pfarramt für Sekten- und Weltanschauungsfragen (\"Parish Office for Sects and World Views.\") headed by Lutheran Pastor Thomas Gandow\n*Swiss \"Evangelische Informationsstelle Kirchen-Sekten-Religionen\" (Protestant Reformed Zwinglian Information Service on Churches, Sects and Religions) headed by Zwinglian Parson Georg Schmid\n\nCatholic\n\n*Sekten und Weltanschauungen in Sachsen (Sects and ideologies in Saxony)\n* Weltanschauungen und religiöse Gruppierungen (\"Worldviews and religious groups\") of the Roman Catholic Diocese of Linz, Austria\n* GRIS (Gruppo di ricerca e informazione socio-religiosa), Italy\n\nOrthodox\n\n*Synodic Committee about Heresies of Greek Orthodox Church\n*Center of Ireneus of Lyon in Russia.\n\nContextual missiology\n\nThe phenomena of \"cults\" has also entered into the discourses of Christian missions and theology of religions. An initial step in this direction occurred in 1980 when the Lausanne Committee for World Evangelization convened a mini-consultation in Thailand. From that consultation a position paper was produced.[http://www.lausanne.org/Brix?pageID=14647 The Thailand Report on New Religious Movements]  The issue was revisited at the Lausanne Forum in 2004 with another paper.[http://www.lausanne.org/lcwe/assets/LOP45_IG16.pdf Religious and Non-Religious Spirituality in the Western World] The latter paper adopts a different methodology to that advocated in 1980.\n\nIn the 1990s discussions in academic missions and theological journals indicate that another trajectory is emerging which reflects the influence of contextual missions theory. Advocates of this approach maintain that apologetics as a tool needs to be retained, but do not favour a confrontational style of engagement.Irving Hexham, Stephen Rost & John W. Morehead ed. Encountering New Religious Movements: A Holistic Evangelical Approach, Grand Rapids: Kregel, 2004.Gordon R. Lewis, \"Our Mission Responsibility to New Religious Movements\" International Journal of Frontier Missions Volume 15, number 3 July–September 1998, p. 116.\n\nVariations and models\n\nCountercult apologetics has several variations and methods employed in analysing and responding to cults. The different nuances in countercult apologetics have been discussed by John A. Saliba and Philip Johnson.Saliba, Understanding New Religious Movements, pp.212-223. Philip Johnson, \"Apologetics, Mission and New Religious Movements: A Holistic Approach,\" Sacred Tribes Journal, Volume 1, number 1 Fall 2002 5-220.\n\nThe dominant method is the emphasis on detecting unorthodox or heretical doctrines and contrasting those with orthodox interpretations of the Bible and early creedal documents. Some apologists, such as Francis J. Beckwith, have emphasised a philosophical approach, pointing out logical, epistemological and metaphysical problems within the teachings of a particular group.Francis J. Beckwith & Stephen E. Parrish, See the gods fall, Joplin: College Press, 1997. Francis J. Beckwith, Carl Mosser & Paul Owen ed. The New Mormon Challenge, Grand Rapids: Zondervan, 2002. Another approach involves former members of cultic groups recounting their spiritual autobiographies, which highlight experiences of disenchantment with the group, unanswered questions and doubts about commitment to the group, culminating in the person's conversion to Evangelical Christianity.James R. Adair & Ted Miller ed. Escape from Darkness, Wheaton: Victor, 1982.Chris Elkins, Heavenly Deception, Wheaton: Tyndale House, 1980. Joe Hewitt, I Was Raised a Jehovah's Witness, Denver: Accent Books, 1979. Latayne C. Scott, Ex-Mormons: Why We Left, Grand Rapids: Baker Book House, 1990.\n\nApologists like Dave Hunt in Peace, Prosperity and the Coming Holocaust and Hal Lindsey in The Terminal Generation have tended to interpret the phenomena of cults as part of the burgeoning evidence of signs that Christ's Second Advent is close at hand.Dave Hunt, Peace, Prosperity and the Coming Holocaust: The New Age Movement in Prophecy, Eugene: Harvest House, 1983. Hal Lindsey, The Terminal Generation, Old Tappan: Fleming H. Revell, 1976. Both Hunt, and Constance Cumbey, have applied a conspiracy model to interpreting the emergence of New Age spirituality and linking that to speculations about fulfilled prophecies heralding Christ's reappearance.Constance E. Cumbey, The Hidden Dangers of the Rainbow, Shreveport: Huntington House, 1983. Evaluated in Elliot Miller, A Crash Course on the New Age Movement, Grand Rapids: Baker Book House, 1989, pp. 193-206. John A. Saliba, Christian Responses to the New Age Movement: A Critical Assessment, London: Geoffrey Chapman, 1999, pp.58-63.\n\nProminent advocates\n\nPeople\n\n*Constance Cumbey\n*Douglas Groothuis\n*Dave Hunt\n*Greg Koukl\n*J. P. Moreland, Biola University\n*Norman Geisler\n*Bob and Gretchen Passantino\n*Ronald Enroth, evangelical Christian author of books about \"cults\" and new religious movements.\n*Walter Martin Late Baptist minister who was the host of the Bible Answer Man radio broadcast and the president of the Christian Research Institute.  He often used his show to promote arguments against Jehovah's Witnesses, The Church of Jesus Christ of Latter-day Saints, and other movements.\n*Phil Johnson\n*Chris Rosebrough\n*Justin Peters\n*J.D. Hall\n*Ken Silva\n\nOrganizations\n\n*Answers in Action, Bob and Gretchen Passantino\n*Apologetics resource center, by Craig Branch\n*Apologetics Press, current Executive Director Dr. Dave Miller\n*Apprising, Blog of Ken Silva\n*Christian Apologetics and Research Ministry (CARM) founded by Matt Slick\n*Christian Research Institute (CRI) founded by Walter Martin\n*Cult Awareness and Information Centre founded by the late Jan Groenveld\n*Dialog Center International founded by Johannes Aagaard\n*EMNR Evangelical Ministries to New Religions, an umbrella group for ministries to the cults and new religions\n*Midwest Christian Outreach\n*Mormonism Research Ministry (Bill McKeever)\n*Personal Freedom Outreach\n*Pirate Christian Radio, founded by Lutheran Pastor Chris Rosebrough\n*Pulpit & Pen, Discernment blog founded by Baptist Pastor and Polemicist J.D. Hall\n*Spiritual Counterfeits Project, president Tal Brooke\n*Stand To Reason, founded by Greg Koukl and Melinda Penner\n*Utah Lighthouse Ministry (Jerald & Sandra Tanner)\n*Watchman Fellowship, founder David Henke, president James K. Walker. Christian countercult movement. http://en.wikipedia.org/?curid=7731."
  }
}
