{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15941",
  "eid" : "21ea2710-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778566145,
  "textBody" : "Jean-Jacques Rousseau (;; 28 June 1712 – 2 July 1778) was a Francophone Genevan philosopher, writer, and composer of the 18th century. His political philosophy influenced the Enlightenment in France and across Europe, as well as aspects of the French Revolution and the overall development of modern political and educational thought.\n\nRousseau's novel Emile, or On Education is a treatise on the education of the whole person for citizenship. His sentimental novel Julie, or the New Heloise was of importance to the development of pre-romanticism and romanticism in fiction. for some interesting examples of contemporary reactions to this novel. Rousseau's autobiographical writings—his Confessions, which initiated the modern autobiography, and his Reveries of a Solitary Walker—exemplified the late 18th-century movement known as the Age of Sensibility, and featured an increased focus on subjectivity and introspection that later characterized modern writing. His Discourse on Inequality and The Social Contract are cornerstones in modern political and social thought.\n\nDuring the period of the French Revolution, Rousseau was the most popular of the philosophes among members of the Jacobin Club. He was interred as a national hero in the Panthéon in Paris, in 1794, 16 years after his death.\n\nBiography\n\nYouth\n\nRousseau was born in Geneva, which was at the time a city-state and a Protestant associate of the Swiss Confederacy. Since 1536, Geneva had been a Huguenot republic and the seat of Calvinism. Five generations before Rousseau, his ancestor Didier, a bookseller who may have published Protestant tracts, had escaped persecution from French Catholics by fleeing to Geneva in 1549, where he became a wine merchant.\n\nRousseau was proud that his family, of the moyen order (or middle-class), had voting rights in the city. Throughout his life, he generally signed his books \"Jean-Jacques Rousseau, Citizen of Geneva\".\n\nGeneva, in theory, was governed \"democratically\" by its male voting \"citizens\". The citizens were a minority of the population when compared to the immigrants, referred to as \"inhabitants\", whose descendants were called \"natives\" and continued to lack suffrage. In fact, rather than being run by vote of the \"citizens\", the city was ruled by a small number of wealthy families that made up the \"Council of Two Hundred\"; these delegated their power to a twenty-five member executive group from among them called the \"Little Council\".\n\nThere was much political debate within Geneva, extending down to the tradespeople. Much discussion was over the idea of the sovereignty of the people, of which the ruling class oligarchy was making a mockery. In 1707, a democratic reformer named Pierre Fatio protested this situation, saying \"a sovereign that never performs an act of sovereignty is an imaginary being\". He was shot by order of the Little Council. Jean-Jacques Rousseau's father, Isaac, was not in the city at this time, but Jean-Jacques's grandfather supported Fatio and was penalized for it.\n\nThe trade of watchmaking had become a family tradition by the time of Rousseau's father, Isaac Rousseau. Isaac followed his grandfather, father and brothers into the business, except for a short stint teaching dance as a dance master. Isaac, notwithstanding his artisan status, was well educated and a lover of music. \"A Genevan watchmaker\", Rousseau wrote, \"is a man who can be introduced anywhere; a Parisian watchmaker is only fit to talk about watches\".\n\nIn 1699, Isaac ran into political difficulty by entering a quarrel with visiting English officers, who in response drew their swords and threatened him. After local officials stepped in, it was Isaac who was punished, as Geneva was concerned with maintaining its ties to foreign powers.\n\nRousseau's mother, Suzanne Bernard Rousseau, was from an upper-class family. She was raised by her uncle Samuel Bernard, a Calvinist preacher. He cared for Suzanne after her father Jacques (who had run into trouble with the legal and religious authorities for fornication and having a mistress) died in his early thirties. In 1695, Suzanne had to answer charges that she had attended a street theater disguised as a peasant woman so she could gaze upon M. Vincent Sarrasin, whom she fancied despite his continuing marriage. After a hearing, she was ordered by the Genevan Consistory to never interact with him again. She married Rousseau's father at the age of 31. Isaac's sister had married Suzanne's brother eight years earlier, after she had become pregnant and they had been chastised by the Consistory. The child died at birth. Later, the young Rousseau was told a romantic fairy-tale about the situation by the adults in his family—a tale where young love was denied by a disapproving patriarch but that prevailed by sibling loyalty that, in the story, resulted in love conquering all and two marriages uniting the families on the same day. Rousseau never learnt the truth.\n\nRousseau was born on 28 June 1712, and he would later relate: \"I was born almost dying, they had little hope of saving me\". He was baptized on 4 July 1712, in the great cathedral. His mother died of puerperal fever nine days after his birth, which he later described as \"the first of my misfortunes\".\n\nHe and his older brother François were brought up by their father and a paternal aunt, also named Suzanne. When Rousseau was five, his father sold the house that the family had received from his mother's relatives. While the idea was that his sons would inherit the principal when grown up and he would live off the interest in the meantime, in the end the father took most of the substantial proceeds. With the selling of the house, the Rousseau family moved out of the upper-class neighborhood and moved into an apartment house in a neighborhood of craftsmen—silversmiths, engravers, and other watchmakers. Growing up around craftsmen, Rousseau would later contrast them favorably to those who produced more aesthetic works, writing \"those important persons who are called artists rather than artisans, work solely for the idle and rich, and put an arbitrary price on their baubles\". Rousseau was also exposed to class politics in this environment, as the artisans often agitated in a campaign of resistance against the privileged class running Geneva.\n\nRousseau had no recollection of learning to read, but he remembered how when he was 5 or 6 his father encouraged his love of reading:\n Rousseau's reading of escapist stories (such as L'Astrée by Honoré d'Urfé) had an effect on him; he later wrote that they \"gave me bizarre and romantic notions of human life, which experience and reflection have never been able to cure me of\". After they had finished reading the novels, they began to read a collection of ancient and modern classics left by his mother's uncle. Of these, his favorite was Plutarch's Lives of the Noble Greeks and Romans, which he would read to his father while he made watches. Rousseau saw Plutarch's work as another kind of novel—the noble actions of heroes—and he would act out the deeds of the characters he was reading about.\n\nWitnessing the local townsfolk participate in militias made a big impression on Rousseau. Throughout his life, he would recall one scene where, after the volunteer militia had finished its manoeuvres, they began to dance around a fountain and most of the people from neighboring buildings came out to join them, including him and his father. Rousseau would always see militias as the embodiment of popular spirit in opposition to the armies of the rulers, whom he saw as disgraceful mercenaries.\n\nWhen Rousseau was 10, his father, an avid hunter, got into a legal quarrel with a wealthy landowner on whose lands he had been caught trespassing. To avoid certain defeat in the courts, he moved away to Nyon in the territory of Bern, taking Rousseau's aunt Suzanne with him. He remarried, and from that point Jean-Jacques saw little of him. Jean-Jacques was left with his maternal uncle, who packed him, along with his own son, Abraham Bernard, away to board for two years with a Calvinist minister in a hamlet outside Geneva. Here, the boys picked up the elements of mathematics and drawing. Rousseau, who was always deeply moved by religious services, for a time even dreamed of becoming a Protestant minister.\n\nVirtually all our information about Rousseau's youth has come from his posthumously published Confessions, in which the chronology is somewhat confused, though recent scholars have combed the archives for confirming evidence to fill in the blanks. At age 13, Rousseau was apprenticed first to a notary and then to an engraver who beat him. At 15, he ran away from Geneva (on 14 March 1728) after returning to the city and finding the city gates locked due to the curfew.\n\nIn adjoining Savoy he took shelter with a Roman Catholic priest, who introduced him to Françoise-Louise de Warens, age 29. She was a noblewoman of Protestant background who was separated from her husband. As professional lay proselytizer, she was paid by the King of Piedmont to help bring Protestants to Catholicism. They sent the boy to Turin, the capital of Savoy (which included Piedmont, in what is now Italy), to complete his conversion. This resulted in his having to give up his Genevan citizenship, although he would later revert to Calvinism in order to regain it.\n\nIn converting to Catholicism, both De Warens and Rousseau were likely reacting to Calvinism's insistence on the total depravity of man. Leo Damrosch writes: \"An eighteenth-century Genevan liturgy still required believers to declare 'that we are miserable sinners, born in corruption, inclined to evil, incapable by ourselves of doing good'\". De Warens, a deist by inclination, was attracted to Catholicism's doctrine of forgiveness of sins.\n\nAdulthood\n\nFinding himself on his own, since his father and uncle had more or less disowned him, the teenage Rousseau supported himself for a time as a servant, secretary, and tutor, wandering in Italy (Piedmont and Savoy) and France. During this time, he lived on and off with De Warens, whom he idolized and called his \"maman\". Flattered by his devotion, De Warens tried to get him started in a profession, and arranged formal music lessons for him. At one point, he briefly attended a seminary with the idea of becoming a priest.\n\nWhen Rousseau reached 20, De Warens took him as her lover, while intimate also with the steward of her house. The sexual aspect of their relationship (in fact a ménage à trois) confused Rousseau and made him uncomfortable, but he always considered De Warens the greatest love of his life. A rather profligate spender, she had a large library and loved to entertain and listen to music. She and her circle, comprising educated members of the Catholic clergy, introduced Rousseau to the world of letters and ideas.\n\nRousseau had been an indifferent student, but during his 20s, which were marked by long bouts of hypochondria, he applied himself in earnest to the study of philosophy, mathematics, and music. At 25, he came into a small inheritance from his mother and used a portion of it to repay De Warens for her financial support of him. At 27, he took a job as a tutor in Lyon.\n\nIn 1742, Rousseau moved to Paris in order to present the Académie des Sciences with a new system of numbered musical notation he believed would make his fortune. His system, intended to be compatible with typography, is based on a single line, displaying numbers representing intervals between notes and dots and commas indicating rhythmic values. Believing the system was impractical, the Academy rejected it, though they praised his mastery of the subject, and urged him to try again.\n\nFrom 1743 to 1744, Rousseau had an honorable but ill-paying post as a secretary to the Comte de Montaigue, the French ambassador to Venice. This awoke in him a lifelong love for Italian music, particularly opera:\n\nRousseau's employer routinely received his stipend as much as a year late and paid his staff irregularly. After 11 months, Rousseau quit, taking from the experience a profound distrust of government bureaucracy.\n\nReturn to Paris\n\nReturning to Paris, the penniless Rousseau befriended and became the lover of Thérèse Levasseur, a seamstress who was the sole support of her mother and numerous ne'er-do-well siblings. At first, they did not live together, though later Rousseau took Thérèse and her mother in to live with him as his servants, and himself assumed the burden of supporting her large family. According to his Confessions, before she moved in with him, Thérèse bore him a son and as many as four other children (there is no independent verification for this numberSome of Rousseau's contemporaries believed the babies were not his. George Sand has written an essai, \"Les Charmettes\" (1865. Printed in the same volume as \"Laura\" from the same year) in which she explains why Rousseau may have accused himself falsely. She quotes her grandmother, in whose family Rousseau had been a tutor, and who stated that Rousseau could not get children.).\n\nRousseau wrote that he persuaded Thérèse to give each of the newborns up to a foundling hospital, for the sake of her \"honor\". \"Her mother, who feared the inconvenience of a brat, came to my aid, and she [Thérèse] allowed herself to be overcome\" (Confessions). In his letter to Madame de Francueil in 1751, he first pretended that he wasn't rich enough to raise his children, but in Book IX of the Confessions he gave the true reasons of his choice: \"I trembled at the thought of intrusting them to a family ill brought up, to be still worse educated. The risk of the education of the foundling hospital was much less\".\n\nTen years later, Rousseau made inquiries about the fate of his son, but no record could be found. When Rousseau subsequently became celebrated as a theorist of education and child-rearing, his abandonment of his children was used by his critics, including Voltaire and Edmund Burke, as the basis for ad hominem attacks.\n\nWhile in Paris, Rousseau became a close friend of French philosopher Diderot and, beginning with some articles on music in 1749,Rousseau in his musical articles in the Encyclopédie engaged in lively controversy with other musicians, e.g. with Rameau, as in his article on Temperament, for which see [http://quod.lib.umich.edu/cgi/t/text/text-idx?cdid;cc\ndid;rgnmain;view\ntext;idno=did2222.0000.897 Encyclopédie: Tempérament] (English translation), also Temperament Ordinaire. contributed numerous articles to Diderot and D'Alembert's great Encyclopédie, the most famous of which was an article on political economy written in 1755.\n\nRousseau's ideas were the result of an almost obsessive dialogue with writers of the past, filtered in many cases through conversations with Diderot. In 1749, Rousseau was paying daily visits to Diderot, who had been thrown into the fortress of Vincennes under a lettre de cachet for opinions in his \"Lettre sur les aveugles\", that hinted at materialism, a belief in atoms, and natural selection.\n\nAccording to science historian Conway Zirkle, Rousseau saw the concept of natural selection \"as an agent for improving the human species.\"\n\nRousseau had read about an essay competition sponsored by the Académie de Dijon to be published in the Mercure de France on the theme of whether the development of the arts and sciences had been morally beneficial. He wrote that while walking to Vincennes (about three miles from Paris), he had a revelation that the arts and sciences were responsible for the moral degeneration of mankind, who were basically good by nature. Rousseau's 1750 Discourse on the Arts and Sciences was awarded the first prize and gained him significant fame.\n\nRousseau continued his interest in music. He wrote both the words and music of his opera Le devin du village (The Village Soothsayer), which was performed for King Louis XV in 1752. The king was so pleased by the work that he offered Rousseau a lifelong pension. To the exasperation of his friends, Rousseau turned down the great honor, bringing him notoriety as \"the man who had refused a king's pension\". He also turned down several other advantageous offers, sometimes with a brusqueness bordering on truculence that gave offense and caused him problems. The same year, the visit of a troupe of Italian musicians to Paris, and their performance of Giovanni Battista Pergolesi's La serva padrona, prompted the Querelle des Bouffons, which pitted protagonists of French music against supporters of the Italian style. Rousseau as noted above, was an enthusiastic supporter of the Italians against Jean-Philippe Rameau and others, making an important contribution with his Letter on French Music.\n\nReturn to Geneva (1754)\n\nOn returning to Geneva in 1754, Rousseau reconverted to Calvinism and regained his official Genevan citizenship. In 1755, Rousseau completed his second major work, the Discourse on the Origin and Basis of Inequality Among Men (the Discourse on Inequality), which elaborated on the arguments of the Discourse on the Arts and Sciences.\n\nHe also pursued an unconsummated romantic attachment with the 25-year-old Sophie d'Houdetot, which partly inspired his epistolary novel, Julie, ou la nouvelle Héloïse (also based on memories of his idyllic youthful relationship with Mme de Warens). Sophie was the cousin and houseguest of Rousseau's patroness and landlady Madame d'Épinay, whom he treated rather highhandedly. He resented being at Mme. d'Épinay's beck and call and detested the insincere conversation and shallow atheism of the Encyclopedistes whom he met at her table. Wounded feelings gave rise to a bitter three-way quarrel between Rousseau and Madame d'Épinay; her lover, the journalist Grimm; and their mutual friend, Diderot, who took their side against Rousseau. Diderot later described Rousseau as being \"false, vain as Satan, ungrateful, cruel, hypocritical, and wicked... He sucked ideas from me, used them himself, and then affected to despise me\".\n\nRousseau's break with the Encyclopedistes coincided with the composition of his three major works, in all of which he emphasized his fervent belief in a spiritual origin of man's soul and the universe, in contradistinction to the materialism of Diderot, La Mettrie and D'Holbach. During this period, Rousseau enjoyed the support and patronage of Charles François Frédéric de Montmorency-Luxembourg and the Prince de Conti, two of the richest and most powerful nobles in France. These men truly liked Rousseau and enjoyed his ability to converse on any subject, but they also used him as a way of getting back at Louis XV and the political faction surrounding his mistress, Madame de Pompadour. Even with them, however, Rousseau went too far, courting rejection when he criticized the practice of tax farming, in which some of them engaged.\n\nRousseau's 800-page novel of sentiment, Julie, ou la nouvelle Héloïse, was published in 1761 to immense success. The book's rhapsodic descriptions of the natural beauty of the Swiss countryside struck a chord in the public and may have helped spark the subsequent nineteenth-century craze for Alpine scenery. In 1762, Rousseau published Du Contrat Social, Principes du droit politique (in English, literally Of the Social Contract, Principles of Political Right) in April. Even his friend Antoine-Jacques Roustan felt impelled to write a polite rebuttal of the chapter on Civil Religion in the Social Contract, which implied that the concept of a Christian republic was paradoxical since Christianity taught submission rather than participation in public affairs. Rousseau helped Roustan find a publisher for the rebuttal.\n\nRousseau published Emile, or On Education in May. A famous section of Emile, \"The Profession of Faith of a Savoyard Vicar\", was intended to be a defense of religious belief. Rousseau's choice of a Catholic vicar of humble peasant background (plausibly based on a kindly prelate he had met as a teenager) as a spokesman for the defense of religion was in itself a daring innovation for the time. The vicar's creed was that of Socinianism (or Unitarianism as it is called today). Because it rejected original sin and divine revelation, both Protestant and Catholic authorities took offense.\n\nMoreover, Rousseau advocated the opinion that, insofar as they lead people to virtue, all religions are equally worthy, and that people should therefore conform to the religion in which they have been brought up. This religious indifferentism caused Rousseau and his books to be banned from France and Geneva. He was condemned from the pulpit by the Archbishop of Paris, his books were burned and warrants were issued for his arrest. Former friends such as Jacob Vernes of Geneva could not accept his views, and wrote violent rebuttals.\n\nA sympathetic observer, David Hume \"professed no surprise when he learned that Rousseau's books were banned in Geneva and elsewhere\". Rousseau, he wrote, \"has not had the precaution to throw any veil over his sentiments; and, as he scorns to dissemble his contempt for established opinions, he could not wonder that all the zealots were in arms against him. The liberty of the press is not so secured in any country... as not to render such an open attack on popular prejudice somewhat dangerous.\"Peter Gay, The Enlightenment, The Science of Freedom, p. 72.\n\nRousseau, Voltaire, and Frederick the Great\n\nAfter Rousseau's Emile had outraged the French parliament, an arrest order was issued by parliament against him, causing him to flee to Switzerland. Subsequently, when the Swiss authorities also proved unsympathetic to him—condemning both Emile, and also The Social Contract—Voltaire issued an invitation to Rousseau to come and reside with him, commenting that: \"I shall always love the author of the 'Vicaire savoyard' whatever he has done, and whatever he may do...Let him come here [to Ferney]! He must come! I shall receive him with open arms. He shall be master here more than I. I shall treat him like my own son.\"\n\nRousseau later expressed regret that he had not replied to Voltaire's invitation. In July 1762, after Rousseau was informed that he could not continue to reside in Bern, d'Alembert advised him to move to the Principality of Neuchâtel, ruled by Frederick the Great of Prussia. Subsequently, Rousseau accepted an invitation to reside in Môtiers, fifteen miles from Neuchâtel. On 11 July 1762, Rousseau wrote to Frederick, describing how he had been driven from France, from Geneva, and from Bern; and seeking Frederick's protection. He also mentioned that he had criticized Frederick in the past and would continue to be critical of Frederick in the future, stating however: \"Your Majesty may dispose of me as you like.\" Frederick, still in the middle of the Seven Years' War, then wrote to the local governor of Neuchatel, Marischal Keith who was a mutual friend of theirs:\n\nRousseau, touched by the help he received from Frederick, stated that from then onwards he took a keen interest in Frederick's activities. As the Seven Years' War was about to end, Rousseau wrote to Frederick again, thanking him for the help received and urging him to put an end to military activities and to endeavor to keep his subjects happy instead. Frederick made no known reply, but commented to Keith that Rousseau had given him a \"scolding\".\n\nFugitive\n\nFor more than two years (1762-1765) Rousseau lived at Môtiers, spending his time in reading and writing and meeting visitors such as James Boswell (December 1764). In the meantime, the local ministers had become aware of the apostasies in some of his writings, and resolved not to let him stay in the vicinity. The Neuchâtel Consistory summoned Rousseau to answer a charge of blasphemy. He wrote back asking to be excused due to his inability to sit for a long time due to his ailment. Subsequently, Rousseau's own pastor, Frédéric-Guillaume de Montmollin, started denouncing him publicly as the Antichrist. In one inflammatory sermon, Montmollin quoted Proverbs 15:8: \"The sacrifice of the wicked is an abomination to the Lord, but the prayer of the upright is his delight\"; this was interpreted by everyone to mean that Rousseau's taking communion was detested by the Lord. The ecclesiastical attacks inflamed the parishioners, who proceeded to pelt Rousseau with stones when he would go out for walks. Around midnight of 6–7 September 1765, stones were thrown at the house Rousseau was staying in, and some glass windows were shattered. When a local official, Martinet, arrived at Rousseau's residence he saw so many stones on the balcony that he exclaimed \"My God, it's a quarry!\" At this point, Rousseau's friends in Môtiers advised him to leave the town.\n\nSince he wanted to remain in Switzerland, Rousseau decided to accept an offer to move to a tiny island, the Ile de St.-Pierre, having a solitary house. Although it was within the Canton of Bern, from where he had been expelled two years previously, he was informally assured that he could move into this island house without fear of arrest, and he did so (10 September 1765). However, on 17 October 1765, the Senate of Bern ordered Rousseau to leave the island and all Bernese territory within fifteen days. He replied, requesting permission to extend his stay, and offered to be incarcerated in any place within their jurisdiction with only a few books in his possession and permission to walk occasionally in a garden while living at his own expense. The Senate's response was to direct Rousseau to leave the island, and all Bernese territory, within twenty four hours. On 29 October 1765 he left the Ile de St.-Pierre and moved to Strasbourg. At this point:\n\nHe subsequently decided to accept Hume's invitation to go to England.\n\nBack in Paris\n\nOn 9 December 1765, having secured a passport from the French government to come to Paris, Rousseau left Strasbourg for Paris where he arrived after a week, and lodged in a palace of his friend, the Prince of Conti. Here he met Hume, and also numerous friends, and well wishers, and became a very conspicuous figure in the city. At this time, Hume wrote: \n\nOne significant meeting could have taken place at this time: Diderot wanted to reconcile and make amends with Rousseau. However, since both Diderot and Rousseau wanted the other person to take the initiative in this respect, no meeting between the two took place.\n\n;Walpole's Letter\nOn 1 January 1766, Grimm wrote a report to his clientele, in which he included a letter said to have been written by Frederick the Great to Rousseau. This letter had actually been composed by Horace Walpole as a playful hoax. Walpole had never met Rousseau, but he was well acquainted with Diderot and Grimm. The letter soon found wide publicity; Hume is believed to have been present, and to have participated in its creation. On 16 February 1766, Hume wrote to the Marquise de Brabantane: \"The only pleasantry I permitted myself in connection with the pretended letter of the King of Prussia was made by me at the dinner table of Lord Ossory.\" This letter was one of the reasons for the later rupture in Hume's relations with Rousseau.\n\nIn Britain (1766–67)\n\nOn 4 January 1766, Rousseau left Paris along with Hume, the merchant de Luze who was an old friend of Rousseau, and Rousseau's pet dog Sultan. After a four-day journey to Calais, where they stayed for two nights, the travelers embarked on a ship to Dover. On 13 January 1766 they arrived in London.\n\nSoon after their arrival, David Garrick arranged a box at the Drury Lane Theatre for Hume and Rousseau on a night when the King and Queen were also present. Garrick was himself performing in a comedy by himself, and also a tragedy by Voltaire. Rousseau became so excited during the performance that he leaned too far and almost fell out of the box; Hume observed that the King and Queen were looking at Rousseau more than at the performance. Afterwards, Garrick served supper for Rousseau who commended Garrick's acting: \"Sir, you have made me shed tears at your tragedy, and smile at your comedy, though I scarce understood a word of your language.\"\n\nAt this time, Hume had a favorable opinion of Rousseau; in a letter to Mme. de Brabantane, Hume wrote that after observing Rousseau carefully he had concluded that he had never met a more affable and virtuous person. According to Hume, Rousseau was \"gentle, modest, affectionate, disinterested, of extreme sensitivity.\" Initially, Rousseau was lodged by Hume in the house of Mrs Adams in London, but he began receiving so many visitors that he soon wanted to move to a quieter location. An offer came to lodge him in a Welsh monastery, and he was inclined to accept it, but Hume persuaded him to move to Chiswick. He now asked for Therese to rejoin him.\n\nMeanwhile, James Boswell was in Paris, and offered to escort Therese to Rousseau. (Boswell had earlier met Rousseau and Therese at Motiers; he had subsequently also sent Therese a garnet necklace and written to Rousseau seeking permission to occasionally communicate with her). Hume foresaw what was going to happen: \"I dread some event fatal to our friend's honor.\" Boswell and Therese were together for more than a week, and as per notes in Boswell's diary they consummated the relationship, having intercourse several times. On one occasion, Therese told Boswell: \"Don't imagine you are a better lover than Rousseau.\"\n\nSince Rousseau was keen to relocate to a more remote location, Richard Davenport—a wealthy and elderly widower who spoke French—offered to accommodate Therese and Rousseau at Wootton Hall. On 22 March, Rousseau and Therese set forth for Wootton, against Hume's advise. Hume and Rousseau would never meet again.\n\nInitially Rousseau was pleased with his new accommodation at Wootton Hall, and wrote favorably about the natural beauty of the place, and how he was feeling reborn, forgetting past sorrows.\n\nQuarrel with Hume \n\nOn 3 April, the letter featuring Horace Walpole's hoax on Rousseau was published in a British daily without mention of Walpole being the actual author; that the editor of the publication was Hume's personal friend compounded Rousseau's grief. Gradually articles critical of Rousseau started appearing in the British press; Rousseau felt that Hume, as his host, ought to have defended him. Moreover, in Rousseau's estimate, some of the public criticism contained details which only Hume was privy to. Further, Rousseau was aggrieved to find that Hume had been lodging in London with Francois Tronchin, son of Rousseau's enemy in Geneva.\n\nAbout this time, Voltaire anonymously published his Letter to Dr. J.-J. Pansophe in which he gave extracts from many of Rousseau's prior statements critical of the British; the most damaging portions of Voltaire's writeup were reprinted in a London periodical. Rousseau now decided that there was a conspiracy afoot to defame him.\n\nA further cause for Rousseau's displeasure was his concern that Hume was tampering with his mail. The misunderstanding had arisen because Rousseau tired of receiving voluminous correspondence whose postage he had to pay.Hume offered to open Rousseau's mail himself and forward the important letters to Rousseau; this offer was accepted. However, there is some evidence of Hume intercepting even Rousseau's outgoing mail.\n\nAfter some correspondence with Rousseau, which included an eighteen-page letter from Rousseau describing the reasons for his resentment, Hume concluded that Rousseau was losing his mental balance. On learning that Rousseau had denounced him to his Parisian friends, Hume sent a copy of Rousseau's long letter to Madame de Boufflers. She replied stating that Hume's alleged participation in the composition of Horace Walpole's faux letter was the reason for Rousseau's anger in her estimate.\n\nWhen Hume learnt that Rousseau was writing the Confessions, he assumed that the present dispute would feature in the book. Adam Smith, Turgot, Marischal Keith, Horace Walpole, and Mme de Boufflers advised Hume not to make his quarrel with Rousseau public; however, many members of D'Holbach's Coterie—particularly, d'Alembert—urged him to reveal his version of the events. In October 1766, Hume's version of the quarrel was translated into French and published in France; in November it was published in England. Grimm included it in his correspondance; ultimately, \n\nAfter the dispute became public, due in part to comments from notable publishers like Andrew Millar, Walpole told Hume that quarrels such as this only end up becoming a source of amusement for Europe. Diderot took a charitable view of the mess: \"I knew these two philosophers well. I could write a play about them that would make you weep, and it would excuse them both.\"\n\nReturn to France \n\nAmidst the controversy surrounding his quarrel with Hume, Rousseau maintained a public silence; but, he resolved now to return to France. To encourage him to do so swiftly, Therese advised him that the servants at Wootton Hall sought to poison him. On 22 May 1767, Rousseau and Therese embarked from Dover to Calais.\n\nIn France\n\nOn 22 May 1767, Rousseau reentered France even though an arrest warrant against him was still in place. He had taken an assumed name, but was recognized, and a banquet in his honor was held by the city of Amiens. Many French nobles offered him a residence at this time. Initially, Rousseau decided to stay in an estate near Paris belonging to Mirabeau. Subsequently, on 21 June 1767, he moved to a chateau of the Prince of Conti in Trie.\n\nAround this time, Rousseau started developing feelings of paranoia, anxiety, and of a conspiracy against him. Most of this was just his imagination at work, but on 29 January 1768, the theatre at Geneva was destroyed through burning, and Voltaire mendaciously accused Rousseau of being the culprit. In June 1768, Rousseau left Trie, leaving Therese behind, and went first to Lyon, and subsequently to Bourgoin. He now invited Therese to this place and \"married\" her under his alias \"Renou\" Rousseau and Thérèse le Vasseur were not legally married nor married in church. A faux marriage took place instead in Bourgoin in 1768. Rousseau himself writes in his Confessions: \"...je lui ai déclaré que je ne l'épouserais jamais ; et même un mariage public nous eut été impossible à cause de la différence de religion…\" Eyewitnesses have declared that he didn't even use his own name, but \"Renou,\" which was his alias when he was on the run. He neither conformed to the official formalities of a legal marriage. There were two \"witnesses\" present: mr. de Champagneux, mayor of Bourgoin en a Mr. de Rosières, both were artillery officers (Musset-Pathay, V.-D.: Histoire de J.J. Rousseau, Bruxelles 1827). Read more at: http://www.notablebiographies.com/Ro-Sc/Rousseau-Jean-Jacques.html#Comments_form#ixzz3qcpQYMYt in a faux civil ceremony in Bourgoin on 30 August 1768.\n\nIn January 1769, Rousseau and Therese went to live in a farmhouse near Grenoble. Here he practiced botany and completed the Confessions. At this time he expressed regret for placing his children in an orphanage. On 10 April 1770, Rousseau and Therese left for Lyon where he befriended Horace Coignet, a fabric designer and amateur musician. At Rousseau's suggestion, Coignet composed musical interludes for Rousseau's prose poem Pygmalion; this was performed in Lyon together with Rousseau's romance The Village Soothsayer to public acclaim. On 8 June, Rousseau and Therese left Lyon for Paris; they reached Paris on 24 June.\n\nIn Paris, Rousseau and Therese lodged in an unfashionable neighborhood of the city, the Rue Platrière—now called the Rue Jean-Jacques Rousseau. He now supported himself financially by copying music, and continued his study of botany. At this time also, he wrote his Letters on the Elements of Botany. These consisted of a series of letters Rousseau wrote to Mme Delessert in Lyon to help her daughters learn the subject. These letters received widespread acclaim when they were eventually published posthumously. \"It's a true pedagogical model, and it complements Emile,\" commented Goethe.\n\nFor defending his reputation against hostile gossip, Rousseau had begun writing the Confessions in 1765. In November 1770, these were completed, and although he did not wish to publish them at this time, he began to offer group readings of certain portions of the book. Between December 1770, and May 1771, Rousseau made at least four group readings of his book with the final reading lasting seventeen hours. A witness to one of these sessions, Claude Joseph Dorat, wrote:",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Jean-Jacques Rousseau" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15941" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Jean-Jacques Rousseau (;; 28 June 1712 – 2 July 1778) was a Francophone Genevan philosopher, writer, and composer of the 18th century. His political philosophy influenced the Enlightenment in France and across Europe, as well as aspects of the French Revolution and the overall development of modern political and educational thought.\n\nRousseau's novel Emile, or On Education is a treatise on the education of the whole person for citizenship. His sentimental novel Julie, or the New Heloise was of importance to the development of pre-romanticism and romanticism in fiction. for some interesting examples of contemporary reactions to this novel. Rousseau's autobiographical writings—his Confessions, which initiated the modern autobiography, and his Reveries of a Solitary Walker—exemplified the late 18th-century movement known as the Age of Sensibility, and featured an increased focus on subjectivity and introspection that later characterized modern writing. His Discourse on Inequality and The Social Contract are cornerstones in modern political and social thought.\n\nDuring the period of the French Revolution, Rousseau was the most popular of the philosophes among members of the Jacobin Club. He was interred as a national hero in the Panthéon in Paris, in 1794, 16 years after his death.\n\nBiography\n\nYouth\n\nRousseau was born in Geneva, which was at the time a city-state and a Protestant associate of the Swiss Confederacy. Since 1536, Geneva had been a Huguenot republic and the seat of Calvinism. Five generations before Rousseau, his ancestor Didier, a bookseller who may have published Protestant tracts, had escaped persecution from French Catholics by fleeing to Geneva in 1549, where he became a wine merchant.\n\nRousseau was proud that his family, of the moyen order (or middle-class), had voting rights in the city. Throughout his life, he generally signed his books \"Jean-Jacques Rousseau, Citizen of Geneva\".\n\nGeneva, in theory, was governed \"democratically\" by its male voting \"citizens\". The citizens were a minority of the population when compared to the immigrants, referred to as \"inhabitants\", whose descendants were called \"natives\" and continued to lack suffrage. In fact, rather than being run by vote of the \"citizens\", the city was ruled by a small number of wealthy families that made up the \"Council of Two Hundred\"; these delegated their power to a twenty-five member executive group from among them called the \"Little Council\".\n\nThere was much political debate within Geneva, extending down to the tradespeople. Much discussion was over the idea of the sovereignty of the people, of which the ruling class oligarchy was making a mockery. In 1707, a democratic reformer named Pierre Fatio protested this situation, saying \"a sovereign that never performs an act of sovereignty is an imaginary being\". He was shot by order of the Little Council. Jean-Jacques Rousseau's father, Isaac, was not in the city at this time, but Jean-Jacques's grandfather supported Fatio and was penalized for it.\n\nThe trade of watchmaking had become a family tradition by the time of Rousseau's father, Isaac Rousseau. Isaac followed his grandfather, father and brothers into the business, except for a short stint teaching dance as a dance master. Isaac, notwithstanding his artisan status, was well educated and a lover of music. \"A Genevan watchmaker\", Rousseau wrote, \"is a man who can be introduced anywhere; a Parisian watchmaker is only fit to talk about watches\".\n\nIn 1699, Isaac ran into political difficulty by entering a quarrel with visiting English officers, who in response drew their swords and threatened him. After local officials stepped in, it was Isaac who was punished, as Geneva was concerned with maintaining its ties to foreign powers.\n\nRousseau's mother, Suzanne Bernard Rousseau, was from an upper-class family. She was raised by her uncle Samuel Bernard, a Calvinist preacher. He cared for Suzanne after her father Jacques (who had run into trouble with the legal and religious authorities for fornication and having a mistress) died in his early thirties. In 1695, Suzanne had to answer charges that she had attended a street theater disguised as a peasant woman so she could gaze upon M. Vincent Sarrasin, whom she fancied despite his continuing marriage. After a hearing, she was ordered by the Genevan Consistory to never interact with him again. She married Rousseau's father at the age of 31. Isaac's sister had married Suzanne's brother eight years earlier, after she had become pregnant and they had been chastised by the Consistory. The child died at birth. Later, the young Rousseau was told a romantic fairy-tale about the situation by the adults in his family—a tale where young love was denied by a disapproving patriarch but that prevailed by sibling loyalty that, in the story, resulted in love conquering all and two marriages uniting the families on the same day. Rousseau never learnt the truth.\n\nRousseau was born on 28 June 1712, and he would later relate: \"I was born almost dying, they had little hope of saving me\". He was baptized on 4 July 1712, in the great cathedral. His mother died of puerperal fever nine days after his birth, which he later described as \"the first of my misfortunes\".\n\nHe and his older brother François were brought up by their father and a paternal aunt, also named Suzanne. When Rousseau was five, his father sold the house that the family had received from his mother's relatives. While the idea was that his sons would inherit the principal when grown up and he would live off the interest in the meantime, in the end the father took most of the substantial proceeds. With the selling of the house, the Rousseau family moved out of the upper-class neighborhood and moved into an apartment house in a neighborhood of craftsmen—silversmiths, engravers, and other watchmakers. Growing up around craftsmen, Rousseau would later contrast them favorably to those who produced more aesthetic works, writing \"those important persons who are called artists rather than artisans, work solely for the idle and rich, and put an arbitrary price on their baubles\". Rousseau was also exposed to class politics in this environment, as the artisans often agitated in a campaign of resistance against the privileged class running Geneva.\n\nRousseau had no recollection of learning to read, but he remembered how when he was 5 or 6 his father encouraged his love of reading:\n Rousseau's reading of escapist stories (such as L'Astrée by Honoré d'Urfé) had an effect on him; he later wrote that they \"gave me bizarre and romantic notions of human life, which experience and reflection have never been able to cure me of\". After they had finished reading the novels, they began to read a collection of ancient and modern classics left by his mother's uncle. Of these, his favorite was Plutarch's Lives of the Noble Greeks and Romans, which he would read to his father while he made watches. Rousseau saw Plutarch's work as another kind of novel—the noble actions of heroes—and he would act out the deeds of the characters he was reading about.\n\nWitnessing the local townsfolk participate in militias made a big impression on Rousseau. Throughout his life, he would recall one scene where, after the volunteer militia had finished its manoeuvres, they began to dance around a fountain and most of the people from neighboring buildings came out to join them, including him and his father. Rousseau would always see militias as the embodiment of popular spirit in opposition to the armies of the rulers, whom he saw as disgraceful mercenaries.\n\nWhen Rousseau was 10, his father, an avid hunter, got into a legal quarrel with a wealthy landowner on whose lands he had been caught trespassing. To avoid certain defeat in the courts, he moved away to Nyon in the territory of Bern, taking Rousseau's aunt Suzanne with him. He remarried, and from that point Jean-Jacques saw little of him. Jean-Jacques was left with his maternal uncle, who packed him, along with his own son, Abraham Bernard, away to board for two years with a Calvinist minister in a hamlet outside Geneva. Here, the boys picked up the elements of mathematics and drawing. Rousseau, who was always deeply moved by religious services, for a time even dreamed of becoming a Protestant minister.\n\nVirtually all our information about Rousseau's youth has come from his posthumously published Confessions, in which the chronology is somewhat confused, though recent scholars have combed the archives for confirming evidence to fill in the blanks. At age 13, Rousseau was apprenticed first to a notary and then to an engraver who beat him. At 15, he ran away from Geneva (on 14 March 1728) after returning to the city and finding the city gates locked due to the curfew.\n\nIn adjoining Savoy he took shelter with a Roman Catholic priest, who introduced him to Françoise-Louise de Warens, age 29. She was a noblewoman of Protestant background who was separated from her husband. As professional lay proselytizer, she was paid by the King of Piedmont to help bring Protestants to Catholicism. They sent the boy to Turin, the capital of Savoy (which included Piedmont, in what is now Italy), to complete his conversion. This resulted in his having to give up his Genevan citizenship, although he would later revert to Calvinism in order to regain it.\n\nIn converting to Catholicism, both De Warens and Rousseau were likely reacting to Calvinism's insistence on the total depravity of man. Leo Damrosch writes: \"An eighteenth-century Genevan liturgy still required believers to declare 'that we are miserable sinners, born in corruption, inclined to evil, incapable by ourselves of doing good'\". De Warens, a deist by inclination, was attracted to Catholicism's doctrine of forgiveness of sins.\n\nAdulthood\n\nFinding himself on his own, since his father and uncle had more or less disowned him, the teenage Rousseau supported himself for a time as a servant, secretary, and tutor, wandering in Italy (Piedmont and Savoy) and France. During this time, he lived on and off with De Warens, whom he idolized and called his \"maman\". Flattered by his devotion, De Warens tried to get him started in a profession, and arranged formal music lessons for him. At one point, he briefly attended a seminary with the idea of becoming a priest.\n\nWhen Rousseau reached 20, De Warens took him as her lover, while intimate also with the steward of her house. The sexual aspect of their relationship (in fact a ménage à trois) confused Rousseau and made him uncomfortable, but he always considered De Warens the greatest love of his life. A rather profligate spender, she had a large library and loved to entertain and listen to music. She and her circle, comprising educated members of the Catholic clergy, introduced Rousseau to the world of letters and ideas.\n\nRousseau had been an indifferent student, but during his 20s, which were marked by long bouts of hypochondria, he applied himself in earnest to the study of philosophy, mathematics, and music. At 25, he came into a small inheritance from his mother and used a portion of it to repay De Warens for her financial support of him. At 27, he took a job as a tutor in Lyon.\n\nIn 1742, Rousseau moved to Paris in order to present the Académie des Sciences with a new system of numbered musical notation he believed would make his fortune. His system, intended to be compatible with typography, is based on a single line, displaying numbers representing intervals between notes and dots and commas indicating rhythmic values. Believing the system was impractical, the Academy rejected it, though they praised his mastery of the subject, and urged him to try again.\n\nFrom 1743 to 1744, Rousseau had an honorable but ill-paying post as a secretary to the Comte de Montaigue, the French ambassador to Venice. This awoke in him a lifelong love for Italian music, particularly opera:\n\nRousseau's employer routinely received his stipend as much as a year late and paid his staff irregularly. After 11 months, Rousseau quit, taking from the experience a profound distrust of government bureaucracy.\n\nReturn to Paris\n\nReturning to Paris, the penniless Rousseau befriended and became the lover of Thérèse Levasseur, a seamstress who was the sole support of her mother and numerous ne'er-do-well siblings. At first, they did not live together, though later Rousseau took Thérèse and her mother in to live with him as his servants, and himself assumed the burden of supporting her large family. According to his Confessions, before she moved in with him, Thérèse bore him a son and as many as four other children (there is no independent verification for this numberSome of Rousseau's contemporaries believed the babies were not his. George Sand has written an essai, \"Les Charmettes\" (1865. Printed in the same volume as \"Laura\" from the same year) in which she explains why Rousseau may have accused himself falsely. She quotes her grandmother, in whose family Rousseau had been a tutor, and who stated that Rousseau could not get children.).\n\nRousseau wrote that he persuaded Thérèse to give each of the newborns up to a foundling hospital, for the sake of her \"honor\". \"Her mother, who feared the inconvenience of a brat, came to my aid, and she [Thérèse] allowed herself to be overcome\" (Confessions). In his letter to Madame de Francueil in 1751, he first pretended that he wasn't rich enough to raise his children, but in Book IX of the Confessions he gave the true reasons of his choice: \"I trembled at the thought of intrusting them to a family ill brought up, to be still worse educated. The risk of the education of the foundling hospital was much less\".\n\nTen years later, Rousseau made inquiries about the fate of his son, but no record could be found. When Rousseau subsequently became celebrated as a theorist of education and child-rearing, his abandonment of his children was used by his critics, including Voltaire and Edmund Burke, as the basis for ad hominem attacks.\n\nWhile in Paris, Rousseau became a close friend of French philosopher Diderot and, beginning with some articles on music in 1749,Rousseau in his musical articles in the Encyclopédie engaged in lively controversy with other musicians, e.g. with Rameau, as in his article on Temperament, for which see [http://quod.lib.umich.edu/cgi/t/text/text-idx?cdid;cc\ndid;rgnmain;view\ntext;idno=did2222.0000.897 Encyclopédie: Tempérament] (English translation), also Temperament Ordinaire. contributed numerous articles to Diderot and D'Alembert's great Encyclopédie, the most famous of which was an article on political economy written in 1755.\n\nRousseau's ideas were the result of an almost obsessive dialogue with writers of the past, filtered in many cases through conversations with Diderot. In 1749, Rousseau was paying daily visits to Diderot, who had been thrown into the fortress of Vincennes under a lettre de cachet for opinions in his \"Lettre sur les aveugles\", that hinted at materialism, a belief in atoms, and natural selection.\n\nAccording to science historian Conway Zirkle, Rousseau saw the concept of natural selection \"as an agent for improving the human species.\"\n\nRousseau had read about an essay competition sponsored by the Académie de Dijon to be published in the Mercure de France on the theme of whether the development of the arts and sciences had been morally beneficial. He wrote that while walking to Vincennes (about three miles from Paris), he had a revelation that the arts and sciences were responsible for the moral degeneration of mankind, who were basically good by nature. Rousseau's 1750 Discourse on the Arts and Sciences was awarded the first prize and gained him significant fame.\n\nRousseau continued his interest in music. He wrote both the words and music of his opera Le devin du village (The Village Soothsayer), which was performed for King Louis XV in 1752. The king was so pleased by the work that he offered Rousseau a lifelong pension. To the exasperation of his friends, Rousseau turned down the great honor, bringing him notoriety as \"the man who had refused a king's pension\". He also turned down several other advantageous offers, sometimes with a brusqueness bordering on truculence that gave offense and caused him problems. The same year, the visit of a troupe of Italian musicians to Paris, and their performance of Giovanni Battista Pergolesi's La serva padrona, prompted the Querelle des Bouffons, which pitted protagonists of French music against supporters of the Italian style. Rousseau as noted above, was an enthusiastic supporter of the Italians against Jean-Philippe Rameau and others, making an important contribution with his Letter on French Music.\n\nReturn to Geneva (1754)\n\nOn returning to Geneva in 1754, Rousseau reconverted to Calvinism and regained his official Genevan citizenship. In 1755, Rousseau completed his second major work, the Discourse on the Origin and Basis of Inequality Among Men (the Discourse on Inequality), which elaborated on the arguments of the Discourse on the Arts and Sciences.\n\nHe also pursued an unconsummated romantic attachment with the 25-year-old Sophie d'Houdetot, which partly inspired his epistolary novel, Julie, ou la nouvelle Héloïse (also based on memories of his idyllic youthful relationship with Mme de Warens). Sophie was the cousin and houseguest of Rousseau's patroness and landlady Madame d'Épinay, whom he treated rather highhandedly. He resented being at Mme. d'Épinay's beck and call and detested the insincere conversation and shallow atheism of the Encyclopedistes whom he met at her table. Wounded feelings gave rise to a bitter three-way quarrel between Rousseau and Madame d'Épinay; her lover, the journalist Grimm; and their mutual friend, Diderot, who took their side against Rousseau. Diderot later described Rousseau as being \"false, vain as Satan, ungrateful, cruel, hypocritical, and wicked... He sucked ideas from me, used them himself, and then affected to despise me\".\n\nRousseau's break with the Encyclopedistes coincided with the composition of his three major works, in all of which he emphasized his fervent belief in a spiritual origin of man's soul and the universe, in contradistinction to the materialism of Diderot, La Mettrie and D'Holbach. During this period, Rousseau enjoyed the support and patronage of Charles François Frédéric de Montmorency-Luxembourg and the Prince de Conti, two of the richest and most powerful nobles in France. These men truly liked Rousseau and enjoyed his ability to converse on any subject, but they also used him as a way of getting back at Louis XV and the political faction surrounding his mistress, Madame de Pompadour. Even with them, however, Rousseau went too far, courting rejection when he criticized the practice of tax farming, in which some of them engaged.\n\nRousseau's 800-page novel of sentiment, Julie, ou la nouvelle Héloïse, was published in 1761 to immense success. The book's rhapsodic descriptions of the natural beauty of the Swiss countryside struck a chord in the public and may have helped spark the subsequent nineteenth-century craze for Alpine scenery. In 1762, Rousseau published Du Contrat Social, Principes du droit politique (in English, literally Of the Social Contract, Principles of Political Right) in April. Even his friend Antoine-Jacques Roustan felt impelled to write a polite rebuttal of the chapter on Civil Religion in the Social Contract, which implied that the concept of a Christian republic was paradoxical since Christianity taught submission rather than participation in public affairs. Rousseau helped Roustan find a publisher for the rebuttal.\n\nRousseau published Emile, or On Education in May. A famous section of Emile, \"The Profession of Faith of a Savoyard Vicar\", was intended to be a defense of religious belief. Rousseau's choice of a Catholic vicar of humble peasant background (plausibly based on a kindly prelate he had met as a teenager) as a spokesman for the defense of religion was in itself a daring innovation for the time. The vicar's creed was that of Socinianism (or Unitarianism as it is called today). Because it rejected original sin and divine revelation, both Protestant and Catholic authorities took offense.\n\nMoreover, Rousseau advocated the opinion that, insofar as they lead people to virtue, all religions are equally worthy, and that people should therefore conform to the religion in which they have been brought up. This religious indifferentism caused Rousseau and his books to be banned from France and Geneva. He was condemned from the pulpit by the Archbishop of Paris, his books were burned and warrants were issued for his arrest. Former friends such as Jacob Vernes of Geneva could not accept his views, and wrote violent rebuttals.\n\nA sympathetic observer, David Hume \"professed no surprise when he learned that Rousseau's books were banned in Geneva and elsewhere\". Rousseau, he wrote, \"has not had the precaution to throw any veil over his sentiments; and, as he scorns to dissemble his contempt for established opinions, he could not wonder that all the zealots were in arms against him. The liberty of the press is not so secured in any country... as not to render such an open attack on popular prejudice somewhat dangerous.\"Peter Gay, The Enlightenment, The Science of Freedom, p. 72.\n\nRousseau, Voltaire, and Frederick the Great\n\nAfter Rousseau's Emile had outraged the French parliament, an arrest order was issued by parliament against him, causing him to flee to Switzerland. Subsequently, when the Swiss authorities also proved unsympathetic to him—condemning both Emile, and also The Social Contract—Voltaire issued an invitation to Rousseau to come and reside with him, commenting that: \"I shall always love the author of the 'Vicaire savoyard' whatever he has done, and whatever he may do...Let him come here [to Ferney]! He must come! I shall receive him with open arms. He shall be master here more than I. I shall treat him like my own son.\"\n\nRousseau later expressed regret that he had not replied to Voltaire's invitation. In July 1762, after Rousseau was informed that he could not continue to reside in Bern, d'Alembert advised him to move to the Principality of Neuchâtel, ruled by Frederick the Great of Prussia. Subsequently, Rousseau accepted an invitation to reside in Môtiers, fifteen miles from Neuchâtel. On 11 July 1762, Rousseau wrote to Frederick, describing how he had been driven from France, from Geneva, and from Bern; and seeking Frederick's protection. He also mentioned that he had criticized Frederick in the past and would continue to be critical of Frederick in the future, stating however: \"Your Majesty may dispose of me as you like.\" Frederick, still in the middle of the Seven Years' War, then wrote to the local governor of Neuchatel, Marischal Keith who was a mutual friend of theirs:\n\nRousseau, touched by the help he received from Frederick, stated that from then onwards he took a keen interest in Frederick's activities. As the Seven Years' War was about to end, Rousseau wrote to Frederick again, thanking him for the help received and urging him to put an end to military activities and to endeavor to keep his subjects happy instead. Frederick made no known reply, but commented to Keith that Rousseau had given him a \"scolding\".\n\nFugitive\n\nFor more than two years (1762-1765) Rousseau lived at Môtiers, spending his time in reading and writing and meeting visitors such as James Boswell (December 1764). In the meantime, the local ministers had become aware of the apostasies in some of his writings, and resolved not to let him stay in the vicinity. The Neuchâtel Consistory summoned Rousseau to answer a charge of blasphemy. He wrote back asking to be excused due to his inability to sit for a long time due to his ailment. Subsequently, Rousseau's own pastor, Frédéric-Guillaume de Montmollin, started denouncing him publicly as the Antichrist. In one inflammatory sermon, Montmollin quoted Proverbs 15:8: \"The sacrifice of the wicked is an abomination to the Lord, but the prayer of the upright is his delight\"; this was interpreted by everyone to mean that Rousseau's taking communion was detested by the Lord. The ecclesiastical attacks inflamed the parishioners, who proceeded to pelt Rousseau with stones when he would go out for walks. Around midnight of 6–7 September 1765, stones were thrown at the house Rousseau was staying in, and some glass windows were shattered. When a local official, Martinet, arrived at Rousseau's residence he saw so many stones on the balcony that he exclaimed \"My God, it's a quarry!\" At this point, Rousseau's friends in Môtiers advised him to leave the town.\n\nSince he wanted to remain in Switzerland, Rousseau decided to accept an offer to move to a tiny island, the Ile de St.-Pierre, having a solitary house. Although it was within the Canton of Bern, from where he had been expelled two years previously, he was informally assured that he could move into this island house without fear of arrest, and he did so (10 September 1765). However, on 17 October 1765, the Senate of Bern ordered Rousseau to leave the island and all Bernese territory within fifteen days. He replied, requesting permission to extend his stay, and offered to be incarcerated in any place within their jurisdiction with only a few books in his possession and permission to walk occasionally in a garden while living at his own expense. The Senate's response was to direct Rousseau to leave the island, and all Bernese territory, within twenty four hours. On 29 October 1765 he left the Ile de St.-Pierre and moved to Strasbourg. At this point:\n\nHe subsequently decided to accept Hume's invitation to go to England.\n\nBack in Paris\n\nOn 9 December 1765, having secured a passport from the French government to come to Paris, Rousseau left Strasbourg for Paris where he arrived after a week, and lodged in a palace of his friend, the Prince of Conti. Here he met Hume, and also numerous friends, and well wishers, and became a very conspicuous figure in the city. At this time, Hume wrote: \n\nOne significant meeting could have taken place at this time: Diderot wanted to reconcile and make amends with Rousseau. However, since both Diderot and Rousseau wanted the other person to take the initiative in this respect, no meeting between the two took place.\n\n;Walpole's Letter\nOn 1 January 1766, Grimm wrote a report to his clientele, in which he included a letter said to have been written by Frederick the Great to Rousseau. This letter had actually been composed by Horace Walpole as a playful hoax. Walpole had never met Rousseau, but he was well acquainted with Diderot and Grimm. The letter soon found wide publicity; Hume is believed to have been present, and to have participated in its creation. On 16 February 1766, Hume wrote to the Marquise de Brabantane: \"The only pleasantry I permitted myself in connection with the pretended letter of the King of Prussia was made by me at the dinner table of Lord Ossory.\" This letter was one of the reasons for the later rupture in Hume's relations with Rousseau.\n\nIn Britain (1766–67)\n\nOn 4 January 1766, Rousseau left Paris along with Hume, the merchant de Luze who was an old friend of Rousseau, and Rousseau's pet dog Sultan. After a four-day journey to Calais, where they stayed for two nights, the travelers embarked on a ship to Dover. On 13 January 1766 they arrived in London.\n\nSoon after their arrival, David Garrick arranged a box at the Drury Lane Theatre for Hume and Rousseau on a night when the King and Queen were also present. Garrick was himself performing in a comedy by himself, and also a tragedy by Voltaire. Rousseau became so excited during the performance that he leaned too far and almost fell out of the box; Hume observed that the King and Queen were looking at Rousseau more than at the performance. Afterwards, Garrick served supper for Rousseau who commended Garrick's acting: \"Sir, you have made me shed tears at your tragedy, and smile at your comedy, though I scarce understood a word of your language.\"\n\nAt this time, Hume had a favorable opinion of Rousseau; in a letter to Mme. de Brabantane, Hume wrote that after observing Rousseau carefully he had concluded that he had never met a more affable and virtuous person. According to Hume, Rousseau was \"gentle, modest, affectionate, disinterested, of extreme sensitivity.\" Initially, Rousseau was lodged by Hume in the house of Mrs Adams in London, but he began receiving so many visitors that he soon wanted to move to a quieter location. An offer came to lodge him in a Welsh monastery, and he was inclined to accept it, but Hume persuaded him to move to Chiswick. He now asked for Therese to rejoin him.\n\nMeanwhile, James Boswell was in Paris, and offered to escort Therese to Rousseau. (Boswell had earlier met Rousseau and Therese at Motiers; he had subsequently also sent Therese a garnet necklace and written to Rousseau seeking permission to occasionally communicate with her). Hume foresaw what was going to happen: \"I dread some event fatal to our friend's honor.\" Boswell and Therese were together for more than a week, and as per notes in Boswell's diary they consummated the relationship, having intercourse several times. On one occasion, Therese told Boswell: \"Don't imagine you are a better lover than Rousseau.\"\n\nSince Rousseau was keen to relocate to a more remote location, Richard Davenport—a wealthy and elderly widower who spoke French—offered to accommodate Therese and Rousseau at Wootton Hall. On 22 March, Rousseau and Therese set forth for Wootton, against Hume's advise. Hume and Rousseau would never meet again.\n\nInitially Rousseau was pleased with his new accommodation at Wootton Hall, and wrote favorably about the natural beauty of the place, and how he was feeling reborn, forgetting past sorrows.\n\nQuarrel with Hume \n\nOn 3 April, the letter featuring Horace Walpole's hoax on Rousseau was published in a British daily without mention of Walpole being the actual author; that the editor of the publication was Hume's personal friend compounded Rousseau's grief. Gradually articles critical of Rousseau started appearing in the British press; Rousseau felt that Hume, as his host, ought to have defended him. Moreover, in Rousseau's estimate, some of the public criticism contained details which only Hume was privy to. Further, Rousseau was aggrieved to find that Hume had been lodging in London with Francois Tronchin, son of Rousseau's enemy in Geneva.\n\nAbout this time, Voltaire anonymously published his Letter to Dr. J.-J. Pansophe in which he gave extracts from many of Rousseau's prior statements critical of the British; the most damaging portions of Voltaire's writeup were reprinted in a London periodical. Rousseau now decided that there was a conspiracy afoot to defame him.\n\nA further cause for Rousseau's displeasure was his concern that Hume was tampering with his mail. The misunderstanding had arisen because Rousseau tired of receiving voluminous correspondence whose postage he had to pay.Hume offered to open Rousseau's mail himself and forward the important letters to Rousseau; this offer was accepted. However, there is some evidence of Hume intercepting even Rousseau's outgoing mail.\n\nAfter some correspondence with Rousseau, which included an eighteen-page letter from Rousseau describing the reasons for his resentment, Hume concluded that Rousseau was losing his mental balance. On learning that Rousseau had denounced him to his Parisian friends, Hume sent a copy of Rousseau's long letter to Madame de Boufflers. She replied stating that Hume's alleged participation in the composition of Horace Walpole's faux letter was the reason for Rousseau's anger in her estimate.\n\nWhen Hume learnt that Rousseau was writing the Confessions, he assumed that the present dispute would feature in the book. Adam Smith, Turgot, Marischal Keith, Horace Walpole, and Mme de Boufflers advised Hume not to make his quarrel with Rousseau public; however, many members of D'Holbach's Coterie—particularly, d'Alembert—urged him to reveal his version of the events. In October 1766, Hume's version of the quarrel was translated into French and published in France; in November it was published in England. Grimm included it in his correspondance; ultimately, \n\nAfter the dispute became public, due in part to comments from notable publishers like Andrew Millar, Walpole told Hume that quarrels such as this only end up becoming a source of amusement for Europe. Diderot took a charitable view of the mess: \"I knew these two philosophers well. I could write a play about them that would make you weep, and it would excuse them both.\"\n\nReturn to France \n\nAmidst the controversy surrounding his quarrel with Hume, Rousseau maintained a public silence; but, he resolved now to return to France. To encourage him to do so swiftly, Therese advised him that the servants at Wootton Hall sought to poison him. On 22 May 1767, Rousseau and Therese embarked from Dover to Calais.\n\nIn France\n\nOn 22 May 1767, Rousseau reentered France even though an arrest warrant against him was still in place. He had taken an assumed name, but was recognized, and a banquet in his honor was held by the city of Amiens. Many French nobles offered him a residence at this time. Initially, Rousseau decided to stay in an estate near Paris belonging to Mirabeau. Subsequently, on 21 June 1767, he moved to a chateau of the Prince of Conti in Trie.\n\nAround this time, Rousseau started developing feelings of paranoia, anxiety, and of a conspiracy against him. Most of this was just his imagination at work, but on 29 January 1768, the theatre at Geneva was destroyed through burning, and Voltaire mendaciously accused Rousseau of being the culprit. In June 1768, Rousseau left Trie, leaving Therese behind, and went first to Lyon, and subsequently to Bourgoin. He now invited Therese to this place and \"married\" her under his alias \"Renou\" Rousseau and Thérèse le Vasseur were not legally married nor married in church. A faux marriage took place instead in Bourgoin in 1768. Rousseau himself writes in his Confessions: \"...je lui ai déclaré que je ne l'épouserais jamais ; et même un mariage public nous eut été impossible à cause de la différence de religion…\" Eyewitnesses have declared that he didn't even use his own name, but \"Renou,\" which was his alias when he was on the run. He neither conformed to the official formalities of a legal marriage. There were two \"witnesses\" present: mr. de Champagneux, mayor of Bourgoin en a Mr. de Rosières, both were artillery officers (Musset-Pathay, V.-D.: Histoire de J.J. Rousseau, Bruxelles 1827). Read more at: http://www.notablebiographies.com/Ro-Sc/Rousseau-Jean-Jacques.html#Comments_form#ixzz3qcpQYMYt in a faux civil ceremony in Bourgoin on 30 August 1768.\n\nIn January 1769, Rousseau and Therese went to live in a farmhouse near Grenoble. Here he practiced botany and completed the Confessions. At this time he expressed regret for placing his children in an orphanage. On 10 April 1770, Rousseau and Therese left for Lyon where he befriended Horace Coignet, a fabric designer and amateur musician. At Rousseau's suggestion, Coignet composed musical interludes for Rousseau's prose poem Pygmalion; this was performed in Lyon together with Rousseau's romance The Village Soothsayer to public acclaim. On 8 June, Rousseau and Therese left Lyon for Paris; they reached Paris on 24 June.\n\nIn Paris, Rousseau and Therese lodged in an unfashionable neighborhood of the city, the Rue Platrière—now called the Rue Jean-Jacques Rousseau. He now supported himself financially by copying music, and continued his study of botany. At this time also, he wrote his Letters on the Elements of Botany. These consisted of a series of letters Rousseau wrote to Mme Delessert in Lyon to help her daughters learn the subject. These letters received widespread acclaim when they were eventually published posthumously. \"It's a true pedagogical model, and it complements Emile,\" commented Goethe.\n\nFor defending his reputation against hostile gossip, Rousseau had begun writing the Confessions in 1765. In November 1770, these were completed, and although he did not wish to publish them at this time, he began to offer group readings of certain portions of the book. Between December 1770, and May 1771, Rousseau made at least four group readings of his book with the final reading lasting seventeen hours. A witness to one of these sessions, Claude Joseph Dorat, wrote:. Jean-Jacques Rousseau. http://en.wikipedia.org/?curid=15941."
  }
}
