{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14563",
  "eid" : "15496cf0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778544959,
  "textBody" : "An integer (from the Latin integer meaning \"whole\")Integer 's first literal meaning in Latin is \"untouched\", from in (\"not\") plus tangere (\"to touch\"). \"Entire\" derives from the same origin via the French word entier, which means both entire and integer (see: ) is a number that can be written without a fractional component. For example, 21, 4, 0, and −2048 are integers, while 9.75, , and  are not.\n\nThe set of integers consists of zero (), the positive natural numbers (, , , …), also called whole numbers or counting numbers, and their additive inverses (the negative integers, i.e., −1, −2, −3, …). This is often denoted by a boldface Z (\"\") or blackboard bold \\mathbb{Z} (Unicode U+2124 ℤ) standing for the German word Zahlen (, \"numbers\").  \n\n is a subset of the set of all rational numbers , in turn a subset of the real numbers .  Like the natural numbers,  is countably infinite.\n\nThe integers form the smallest group and the smallest ring containing the natural numbers. In algebraic number theory, the integers are sometimes called rational integers to distinguish them from the more general algebraic integers. In fact, the (rational) integers are the algebraic integers that are also rational numbers.\n\nSymbol\n\nThe symbol  can be annotated to denote various sets, with varying usage amongst different authors: ,  or  for the positive integers,  for non-negative integers,  for non-zero integers. Some authors use  for non-zero integers, others use it for non-negative integers, or for . Additionally,  is used to denote either the set of integers modulo , i.e., a set of congruence classes of integers, or the set of -adic integers.\nKeith Pledger and Dave Wilkins, \"Edexcel AS and A Level Modular Mathematics: Core Mathematics 1\" Pearson 2008\nLK Turner, FJ BUdden, D Knighton, \"Advanced Mathematics\", Book 2, Longman 1975.  \nhttp://mathworld.wolfram.com/Z-Star.html\n\nAlgebraic properties \n\nLike the natural numbers,  is closed under the operations of addition and multiplication, that is, the sum and product of any two integers is an integer. However, with the inclusion of the negative natural numbers, and, importantly, ,  (unlike the natural numbers) is also closed under subtraction. The integers form a unital ring which is the most basic one, in the following sense: for any unital ring, there is a unique ring homomorphism from the integers into this ring. This universal property, namely to be an initial object in the category of rings, characterizes the ring .\n\n is not closed under division, since the quotient of two integers (e.g., 1 divided by 2), need not be an integer. Although the natural numbers are closed under exponentiation, the integers are not (since the result can be a fraction when the exponent is negative).\n\nThe following lists some of the basic properties of addition and multiplication for any integers ,  and .\n\nIn the language of abstract algebra, the first five properties listed above for addition say that  under addition is an abelian group. As a group under addition,  is a cyclic group, since every non-zero integer can be written as a finite sum  or . In fact,  under addition is the only infinite cyclic group, in the sense that any infinite cyclic group is isomorphic to .\n\nThe first four properties listed above for multiplication say that  under multiplication is a commutative monoid. However, not every integer has a multiplicative inverse; e.g., there is no integer  such that  because the left hand side is even, while the right hand side is odd. This means that  under multiplication is not a group.\n\nAll the rules from the above property table, except for the last, taken together say that  together with addition and multiplication is a commutative ring with unity. It is the prototype of all objects of such algebraic structure. Only those equalities of expressions are true in  for all values of variables, which are true in any unital commutative ring. Note that certain non-zero integers map to zero in certain rings.\n\nThe lack of zero divisors in the integers (last property in the table) means that the commutative ring  is an integral domain.\n\nThe lack of multiplicative inverses, which is equivalent to the fact that  is not closed under division, means that  is not a field. The smallest field containing the integers as a subring is the field of rational numbers. The process of constructing the rationals from the integers can be mimicked to form the field of fractions of any integral domain. And back, starting from an algebraic number field (an extension of rational numbers), its ring of integers can be extracted, which includes  as its subring.\n\nMoreover,  is a principal ideal.\n\nAlthough ordinary division is not defined on , the division \"with remainder\" is defined on them. It is called Euclidean division and possesses the following important property: that is, given two integers  and  with , there exist unique integers  and  such that  and , where  denotes the absolute value of . The integer  is called the quotient and  is called the remainder of the division of  by . The Euclidean algorithm for computing greatest common divisors works by a sequence of Euclidean divisions.\n\nAgain, in the language of abstract algebra, the above says that Z is a Euclidean domain. This implies that  is a principal ideal domain and any positive integer can be written as the products of primes in an essentially unique way. This is the fundamental theorem of arithmetic.\n\nOrder-theoretic properties\n\n is a totally ordered set without upper or lower bound. The ordering of  is given by:\n\nAn integer is positive if it is greater than zero and negative if it is less than zero. Zero is defined as neither negative nor positive.\n\nThe ordering of integers is compatible with the algebraic operations in the following way:\n#if  and , then \n#if  and , then .\n\nIt follows that  together with the above ordering is an ordered ring.\n\nThe integers are the only nontrivial totally ordered abelian group whose positive elements are well-ordered.. This is equivalent to the statement that any Noetherian valuation ring is either a field or a discrete valuation ring.\n\nConstruction\n\nIn elementary school teaching, integers are often intuitively defined as the (positive) natural numbers,  zero, and the negations of the natural numbers. However, this style of definition leads to many different cases (each arithmetic operation needs to be defined on each combination of types of integer) and makes it tedious to prove that these operations obey the laws of arithmetic.. Therefore, in modern set-theoretic mathematics a more abstract construction,Ivorra Castillo: Álgebra which allows one to define the arithmetical operations without any case distinction, is often used instead.. The integers can thus be formally constructed as the equivalence classes of ordered pairs of natural numbers .\n\nThe intuition is that  stands for the result of subtracting  from . To confirm our expectation that  and  denote the same number, we define an equivalence relation  on these pairs with the following rule:\n(a,b) \\sim (c,d) \nprecisely when\na + d = b + c. \n\nAddition and multiplication of integers can be defined in terms of the equivalent operations on the natural numbers; denoting by  the equivalence class having  as a member, one has:\n[(a,b)] + [(c,d)] := [(a+c,b+d)].\n[(a,b)]\\cdot[(c,d)] := [(ac+bd,ad+bc)].\n\nThe negation (or additive inverse) of an integer is obtained by reversing the order of the pair:\n-[(a,b)] := [(b,a)].\n\nHence subtraction can be defined as the addition of the additive inverse:\n[(a,b)] - [(c,d)] := [(a+d,b+c)].\n\nThe standard ordering on the integers is given by:\n[(a,b)]  iff a+d \n\nIt is easily verified that these definitions are independent of the choice of representatives of the equivalence classes.\n\nEvery equivalence class has a unique member that is of the form  or  (or both at once). The natural number  is identified with the class  (in other words the natural numbers are embedded into the integers by map sending  to ), and the class  is denoted  (this covers all remaining classes, and gives the class  a second time since \n\nThus,  is denoted by\n\\begin{cases} a - b, & \\mbox{if }  a \\ge b  \\\\ -(b - a),  & \\mbox{if } a \n\nIf the natural numbers are identified with the corresponding integers (using the embedding mentioned above), this convention creates no ambiguity.\n\nThis notation recovers the familiar representation of the integers as  }.\n\nSome examples are:\n\\begin{align}\n 0 &[(0,0)] &\n [(1,1)] &\\cdots & &\n [(k,k)] \\\\\n 1 &[(1,0)] &\n [(2,1)] &\\cdots & &\n [(k+1,k)] \\\\\n-1 &[(0,1)] &\n [(1,2)] &\\cdots & &\n [(k,k+1)] \\\\\n 2 &[(2,0)] &\n [(3,1)] &\\cdots & &\n [(k+2,k)] \\\\\n-2 &[(0,2)] &\n [(1,3)] &\\cdots & &\n [(k,k+2)].\n\\end{align}\n\nIn theoretical computer science, other approaches for the construction of integers are used by automated theorem provers and term rewrite engines. \nIntegers are represented as algebraic terms built using a few basic operations  (such as zero, succ, pred, etc.) and, possibly, using natural numbers, which are assumed to be already constructed (e.g., using the Peano approach).\n\nThere exist at least a tenth of such constructions of signed integers. These constructions differ in several ways: the number of basic operations used for the construction, the number (usually, between 0 and 2) and the types of arguments accepted by these operations; the presence or absence of natural numbers as arguments of some of these operations, and the fact that these operations are free constructors or not, i.e., that the same integer can be represented using only one or many algebraic terms.\n\nThe technique for the construction of integers presented above in this section corresponds to the particular case where there is a single basic operation pair(x,y) that takes as arguments two natural numbers x and y, and returns an integer (equal to x-y). This operation is not free since the integer 0 can be written pair(0,0), or pair(1,1), or pair(2,2), etc. This technique of construction is used by the proof assistant Isabelle; however, many other tools use alternative construction techniques, notable those based upon free constructors, which are simpler and can be implemented more efficiently in computers.\n\nComputer science\n\nAn integer is often a primitive data type in computer languages. However, integer data types can only represent a subset of all integers, since practical computers are of finite capacity. Also, in the common two's complement representation, the inherent definition of sign distinguishes between \"negative\" and \"non-negative\" rather than \"negative, positive, and 0\". (It is, however, certainly possible for a computer to determine whether an integer value is truly positive.) Fixed length integer approximation data types (or subsets) are denoted int or Integer in several programming languages (such as Algol68, C, Java, Delphi, etc.).\n\nVariable-length representations of integers, such as bignums, can store any integer that fits in the computer's memory. Other integer data types are implemented with a fixed size, usually a number of bits which is a power of 2 (4, 8, 16, etc.) or a memorable number of decimal digits (e.g., 9 or 10).\n\nCardinality\n\nThe cardinality of the set of integers is equal to  (aleph-null). This is readily demonstrated by the construction of a bijection, that is, a function that is injective and surjective from  to .\nIf  then consider the function:\nf(x) = \\begin{cases} 2|x|,  & \\mbox{if } x \\leq 0\\\\ 2x-1, & \\mbox{if }  x > 0. \\end{cases} \n\nIf  then consider the function:\ng(x) = \\begin{cases} 2|x|,  & \\mbox{if } x \n\nIf the domain is restricted to  then each and every member of  has one and only one corresponding member of N and by the definition of cardinal equality the two sets have equal cardinality.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Integer" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14563" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "An integer (from the Latin integer meaning \"whole\")Integer 's first literal meaning in Latin is \"untouched\", from in (\"not\") plus tangere (\"to touch\"). \"Entire\" derives from the same origin via the French word entier, which means both entire and integer (see: ) is a number that can be written without a fractional component. For example, 21, 4, 0, and −2048 are integers, while 9.75, , and  are not.\n\nThe set of integers consists of zero (), the positive natural numbers (, , , …), also called whole numbers or counting numbers, and their additive inverses (the negative integers, i.e., −1, −2, −3, …). This is often denoted by a boldface Z (\"\") or blackboard bold \\mathbb{Z} (Unicode U+2124 ℤ) standing for the German word Zahlen (, \"numbers\").  \n\n is a subset of the set of all rational numbers , in turn a subset of the real numbers .  Like the natural numbers,  is countably infinite.\n\nThe integers form the smallest group and the smallest ring containing the natural numbers. In algebraic number theory, the integers are sometimes called rational integers to distinguish them from the more general algebraic integers. In fact, the (rational) integers are the algebraic integers that are also rational numbers.\n\nSymbol\n\nThe symbol  can be annotated to denote various sets, with varying usage amongst different authors: ,  or  for the positive integers,  for non-negative integers,  for non-zero integers. Some authors use  for non-zero integers, others use it for non-negative integers, or for . Additionally,  is used to denote either the set of integers modulo , i.e., a set of congruence classes of integers, or the set of -adic integers.\nKeith Pledger and Dave Wilkins, \"Edexcel AS and A Level Modular Mathematics: Core Mathematics 1\" Pearson 2008\nLK Turner, FJ BUdden, D Knighton, \"Advanced Mathematics\", Book 2, Longman 1975.  \nhttp://mathworld.wolfram.com/Z-Star.html\n\nAlgebraic properties \n\nLike the natural numbers,  is closed under the operations of addition and multiplication, that is, the sum and product of any two integers is an integer. However, with the inclusion of the negative natural numbers, and, importantly, ,  (unlike the natural numbers) is also closed under subtraction. The integers form a unital ring which is the most basic one, in the following sense: for any unital ring, there is a unique ring homomorphism from the integers into this ring. This universal property, namely to be an initial object in the category of rings, characterizes the ring .\n\n is not closed under division, since the quotient of two integers (e.g., 1 divided by 2), need not be an integer. Although the natural numbers are closed under exponentiation, the integers are not (since the result can be a fraction when the exponent is negative).\n\nThe following lists some of the basic properties of addition and multiplication for any integers ,  and .\n\nIn the language of abstract algebra, the first five properties listed above for addition say that  under addition is an abelian group. As a group under addition,  is a cyclic group, since every non-zero integer can be written as a finite sum  or . In fact,  under addition is the only infinite cyclic group, in the sense that any infinite cyclic group is isomorphic to .\n\nThe first four properties listed above for multiplication say that  under multiplication is a commutative monoid. However, not every integer has a multiplicative inverse; e.g., there is no integer  such that  because the left hand side is even, while the right hand side is odd. This means that  under multiplication is not a group.\n\nAll the rules from the above property table, except for the last, taken together say that  together with addition and multiplication is a commutative ring with unity. It is the prototype of all objects of such algebraic structure. Only those equalities of expressions are true in  for all values of variables, which are true in any unital commutative ring. Note that certain non-zero integers map to zero in certain rings.\n\nThe lack of zero divisors in the integers (last property in the table) means that the commutative ring  is an integral domain.\n\nThe lack of multiplicative inverses, which is equivalent to the fact that  is not closed under division, means that  is not a field. The smallest field containing the integers as a subring is the field of rational numbers. The process of constructing the rationals from the integers can be mimicked to form the field of fractions of any integral domain. And back, starting from an algebraic number field (an extension of rational numbers), its ring of integers can be extracted, which includes  as its subring.\n\nMoreover,  is a principal ideal.\n\nAlthough ordinary division is not defined on , the division \"with remainder\" is defined on them. It is called Euclidean division and possesses the following important property: that is, given two integers  and  with , there exist unique integers  and  such that  and , where  denotes the absolute value of . The integer  is called the quotient and  is called the remainder of the division of  by . The Euclidean algorithm for computing greatest common divisors works by a sequence of Euclidean divisions.\n\nAgain, in the language of abstract algebra, the above says that Z is a Euclidean domain. This implies that  is a principal ideal domain and any positive integer can be written as the products of primes in an essentially unique way. This is the fundamental theorem of arithmetic.\n\nOrder-theoretic properties\n\n is a totally ordered set without upper or lower bound. The ordering of  is given by:\n\nAn integer is positive if it is greater than zero and negative if it is less than zero. Zero is defined as neither negative nor positive.\n\nThe ordering of integers is compatible with the algebraic operations in the following way:\n#if  and , then \n#if  and , then .\n\nIt follows that  together with the above ordering is an ordered ring.\n\nThe integers are the only nontrivial totally ordered abelian group whose positive elements are well-ordered.. This is equivalent to the statement that any Noetherian valuation ring is either a field or a discrete valuation ring.\n\nConstruction\n\nIn elementary school teaching, integers are often intuitively defined as the (positive) natural numbers,  zero, and the negations of the natural numbers. However, this style of definition leads to many different cases (each arithmetic operation needs to be defined on each combination of types of integer) and makes it tedious to prove that these operations obey the laws of arithmetic.. Therefore, in modern set-theoretic mathematics a more abstract construction,Ivorra Castillo: Álgebra which allows one to define the arithmetical operations without any case distinction, is often used instead.. The integers can thus be formally constructed as the equivalence classes of ordered pairs of natural numbers .\n\nThe intuition is that  stands for the result of subtracting  from . To confirm our expectation that  and  denote the same number, we define an equivalence relation  on these pairs with the following rule:\n(a,b) \\sim (c,d) \nprecisely when\na + d = b + c. \n\nAddition and multiplication of integers can be defined in terms of the equivalent operations on the natural numbers; denoting by  the equivalence class having  as a member, one has:\n[(a,b)] + [(c,d)] := [(a+c,b+d)].\n[(a,b)]\\cdot[(c,d)] := [(ac+bd,ad+bc)].\n\nThe negation (or additive inverse) of an integer is obtained by reversing the order of the pair:\n-[(a,b)] := [(b,a)].\n\nHence subtraction can be defined as the addition of the additive inverse:\n[(a,b)] - [(c,d)] := [(a+d,b+c)].\n\nThe standard ordering on the integers is given by:\n[(a,b)]  iff a+d \n\nIt is easily verified that these definitions are independent of the choice of representatives of the equivalence classes.\n\nEvery equivalence class has a unique member that is of the form  or  (or both at once). The natural number  is identified with the class  (in other words the natural numbers are embedded into the integers by map sending  to ), and the class  is denoted  (this covers all remaining classes, and gives the class  a second time since \n\nThus,  is denoted by\n\\begin{cases} a - b, & \\mbox{if }  a \\ge b  \\\\ -(b - a),  & \\mbox{if } a \n\nIf the natural numbers are identified with the corresponding integers (using the embedding mentioned above), this convention creates no ambiguity.\n\nThis notation recovers the familiar representation of the integers as  }.\n\nSome examples are:\n\\begin{align}\n 0 &[(0,0)] &\n [(1,1)] &\\cdots & &\n [(k,k)] \\\\\n 1 &[(1,0)] &\n [(2,1)] &\\cdots & &\n [(k+1,k)] \\\\\n-1 &[(0,1)] &\n [(1,2)] &\\cdots & &\n [(k,k+1)] \\\\\n 2 &[(2,0)] &\n [(3,1)] &\\cdots & &\n [(k+2,k)] \\\\\n-2 &[(0,2)] &\n [(1,3)] &\\cdots & &\n [(k,k+2)].\n\\end{align}\n\nIn theoretical computer science, other approaches for the construction of integers are used by automated theorem provers and term rewrite engines. \nIntegers are represented as algebraic terms built using a few basic operations  (such as zero, succ, pred, etc.) and, possibly, using natural numbers, which are assumed to be already constructed (e.g., using the Peano approach).\n\nThere exist at least a tenth of such constructions of signed integers. These constructions differ in several ways: the number of basic operations used for the construction, the number (usually, between 0 and 2) and the types of arguments accepted by these operations; the presence or absence of natural numbers as arguments of some of these operations, and the fact that these operations are free constructors or not, i.e., that the same integer can be represented using only one or many algebraic terms.\n\nThe technique for the construction of integers presented above in this section corresponds to the particular case where there is a single basic operation pair(x,y) that takes as arguments two natural numbers x and y, and returns an integer (equal to x-y). This operation is not free since the integer 0 can be written pair(0,0), or pair(1,1), or pair(2,2), etc. This technique of construction is used by the proof assistant Isabelle; however, many other tools use alternative construction techniques, notable those based upon free constructors, which are simpler and can be implemented more efficiently in computers.\n\nComputer science\n\nAn integer is often a primitive data type in computer languages. However, integer data types can only represent a subset of all integers, since practical computers are of finite capacity. Also, in the common two's complement representation, the inherent definition of sign distinguishes between \"negative\" and \"non-negative\" rather than \"negative, positive, and 0\". (It is, however, certainly possible for a computer to determine whether an integer value is truly positive.) Fixed length integer approximation data types (or subsets) are denoted int or Integer in several programming languages (such as Algol68, C, Java, Delphi, etc.).\n\nVariable-length representations of integers, such as bignums, can store any integer that fits in the computer's memory. Other integer data types are implemented with a fixed size, usually a number of bits which is a power of 2 (4, 8, 16, etc.) or a memorable number of decimal digits (e.g., 9 or 10).\n\nCardinality\n\nThe cardinality of the set of integers is equal to  (aleph-null). This is readily demonstrated by the construction of a bijection, that is, a function that is injective and surjective from  to .\nIf  then consider the function:\nf(x) = \\begin{cases} 2|x|,  & \\mbox{if } x \\leq 0\\\\ 2x-1, & \\mbox{if }  x > 0. \\end{cases} \n\nIf  then consider the function:\ng(x) = \\begin{cases} 2|x|,  & \\mbox{if } x \n\nIf the domain is restricted to  then each and every member of  has one and only one corresponding member of N and by the definition of cardinal equality the two sets have equal cardinality. Integer. http://en.wikipedia.org/?curid=14563."
  }
}
