{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13612",
  "eid" : "0b867e60-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778528582,
  "textBody" : "Hexen: Beyond Heretic is a dark fantasy first-person shooter video game developed by Raven Software and published by id Software through GT Interactive Software on October 30, 1995. It is the sequel to 1994's Heretic, and the second game in Raven Software's \"Serpent Riders\" series. The title comes from the German noun Hexen, which means \"witches\", and/or the verb hexen, which means \"to cast a spell\". Game producer John Romero stated that a third, unreleased game in this series was to be called Hecatomb.\n\nPlot\n\nFollowing the tale of D'Sparil's defeat in Heretic, Hexen takes place in another realm, Cronos, which is besieged by the second of the three Serpent Riders, Korax. Three heroes set out to destroy Korax. The player assumes the role of one such hero. Throughout the course of his quest, he travels through elemental dungeons, a wilderness region, a mountainside seminary, a large castle, and finally a necropolis.\n\nGameplay\n\nA new series feature introduced in Hexen is the choice of three character classes. Players may choose to play as a fighter (Baratus), a cleric (Parias), or a mage (Daedolon). Each character has unique weapons and physical characteristics, lending an additional degree of variety and replay value to the game. The Fighter relies mainly on close quarter physical attacks with weapons both mundane and magical in nature, and is tougher and faster than the other characters. The Mage uses an assortment of long-range spells, whose reach is counterbalanced by the fact that he is the most fragile and slowest moving of the classes. The Cleric arms himself with a combination of both melee and ranged capabilities, being a middle ground of sorts between the other two classes. Additionally, certain items, such as the flechette (poison gas bomb), behave differently when collected and used by each of the classes, functioning in a manner better suiting their varying approach to combat, further differentiating the three characters.\n\nHexen introduces \"hub\" levels to the series, wherein the player can travel back and forth between central hub levels and connected side levels. This is done in order to solve larger-scale puzzles that require a series of items or switches to be used. The player must traverse through a hub in order to reach a boss and advance to the next hub.\n\nDevelopment\n\nLike Heretic, Hexen was developed on NeXTSTEP.[http://rome.ro/2006/12/apple-next-merger-birthday.html planet rome.ro: Apple-NeXT Merger Birthday!]  Hexen uses a modified version of the Doom engine, which allows looking up and down, network play with up to eight players, and the choice of three character classes. It also popularized the \"hub system\" of level progression in the genre of first-person shooter games. Unlike previous games, which had relied purely on General MIDI for music, Hexen is also able to play tracks from a CD. The game's own CD contained a soundtrack in an audio format that was exactly the same as the MIDI soundtrack, but played through a high-quality sound module. However, the most significant improvement was the addition of wall translation, rotation, and level scripting.\n\nEngine modifications\n\n\"Polyobjects\" are the walls that move within the game. Because the Doom engine uses the binary space partitioning system for rendering, it does not enable moving walls. Hexens moving walls are actually one-sided lines built somewhere else on the map and rendered at the desired start spot when the level is loaded. This enables a pseudo-moving wall, but does not allow moving sectors (such as seeing the tops of moving doors). This often creates problems in sectors containing more than one node, however, explaining the relatively limited use of polyobjects.\n\nWhereas Doom, Doom II, and Heretic rely on lines within the maps to perform simple actions, Hexen also allows these actions to be activated by Action Code Script (ACS). These scripts use a syntactic variant of C, thus allowing special sequencing of game actions. Programming features such as randomization, variables, and intermap script activation enable smooth hub gameplay and are responsible for most of the special effects within the game: on-screen messages, random sound effects, monster spawning, sidedef texture changes, versatile control of polyobjects, level initialization for deathmatch, and even complex environment changes such as earthquakes manipulating floor textures and heights.\n\nSource code\n\nOn January 11, 1999, the source code for Hexen was released by Raven Software under a license that granted rights to non-commercial use, and was re-released under the GNU General Public License on September 4, 2008.[http://sourceforge.net/project/showfiles.php?group_id=238655 Heretic / Hexen - Browse Files at SourceForge.net]. This allowed the game to be ported to different platforms such as Linux, AmigaOS, and OS/2 (EComStation).\n\nHexen is compatible with many Doom source ports; Hexens features are also compatible with Doom WADs made for source ports regardless of what game they are being played on.\n\nMusic\n\nThe score was composed by Kevin Schilder. In contrast to Heretic, some songs in Hexen, in addition to MIDI versions, had higher-quality versions on CD. When playing in CD-audio mode, songs absent from CD would be replaced by some existing CD tracks.[https://doomwiki.org/wiki/Hexen_music Hexen music - DoomWiki.org, the new home of the Doom Wiki - Doom, Heretic, Hexen, Strife, and more].\n\nConsole versions\n\nHexen was released for the Sega Saturn, PlayStation, and Nintendo 64, all released by GT Interactive during the first half of 1997. While presenting several specific differences in their respective translations of the original PC game, all of them constitute essentially the same game with no major changes to level design, plot, or overall delivery.\n\nThe PlayStation version, developed by Probe Entertainment, has the FMV scenes and Redbook audio music from the PC CD-ROM version, but no multiplayer mode. The scripting and animation is slower, enemies have only their front sprites and lack gory deaths when attacked by strong hits or weapons, and the frame rate is slower. Although all levels are present in this version and feature their correct layouts, their architecture details are somewhat simplified and there is some loss in overall lighting quality. This port is based on a beta version of the original PC version of Hexen as many gameplay tweaks are shared, such as the simpler level design and the Fighter's fists being weaker compared to other versions.\n\nThe Sega Saturn version, also developed by Probe, inherits most of the restrictions of the PlayStation version, such as the simplified scenery architecture and the downgraded lighting, although it does feature improvements in certain aspects. The scripting is faster, and the frame rate, while not fluid or consistent, is slightly better. The enemies still have all but their front sprites missing, but they retain their gory deaths when killed by a strong hit or weapon. This version also has hidden two-player link-up cooperative and deathmatch modes, accessible only through the unlockable cheat menu. While this port shares the FMV scenes and most of the Redbook audio music from the other CD-ROM versions, it also includes some new music tracks.\n\nThe Nintendo 64 version, developed by Software Creations, retains all of the graphical quality and scenery architecture, has a consistent frame rate, and includes high detail and smooth filtering. This version also has four-player split-screen cooperative and deathmatch modes, although they must be played in low detail mode. Due to cartridge storage limitations, the Nintendo 64 version is based on the original PC floppy version and lacks the FMV scenes and Redbook audio music introduced in the CD-ROM version, although it has new narrative introductions to the levels.\n\nDeathkings of the Dark Citadel\n\nDeathkings of the Dark Citadel is an official expansion pack that was released for Hexen in 1996. It features three more hubs with a total of 20 new single player levels and six new deathmatch levels. Unlike the Shadow of the Serpent Riders expansion pack for Heretic, it had to be purchased in retail stores or by mail order. This was unusual at the time, as most non-free expansion packs also included other new or revised gameplay elements. Deathkings of the Dark Citadel, unlike Shadow of the Serpent Riders, was not packaged with the original game, meaning that both had to be purchased separately, and the expansion would not work without already having Hexen. This expansion pack also did not initially include nor enable any music. Music could be fully enabled by applying a patch specially released to address this issue (usually found online under the name \"dkpatch\").\n\nEach of the hubs (The Blight, The Constable's Gate, and The Nave) features one secret level, and new puzzles based on the quest items from the original game (no new quest artifacts were added). Any type of enemy may spawn on the map.\n\nThe final level of the expansion, the Dark Citadel itself, is an arena-like level, which features teleporting waves of monsters and three bosses (Fighter, Cleric, and Mage clones).\n\nReception\n\nReviewing the PC version, Maximum remarked that Hexen sets itself apart from other \"3D slashers\" with its selection of characters and novel approach to level design, which \"leads to your character choosing their path rather than being guided around a rather linear series of rooms, proving that 3D games have matured\". They also commented that the gameplay is consistently intense due to the difficulty of the enemies, the variety of weapons and power-ups, and the sheer size and breadth of the levels. They gave the game 5 out of 5 stars and their \"Maximum Game of the Month\" award. A reviewer for Next Generation opined that \"Hexen takes everything that was good about Heretic, and makes it even better.\" He commented that the ability to choose between three different character classes gives the game replay value, something that had been missing from first-person shooters up until then, and though the graphics are blocky and pixelated, the \"eerily lifelike\" sound effects make up for it to a large extent. Like Maximum, he praised the non-linear level design and concluded the game to be a must-have for any first-person shooter fan. Chris Hudak, citing the differing abilities of the three playable characters, called Hexen \"Slicker, smarter and more stylish than Doom---with all the killing and three times the replay value.\"\n\nHexen was a runner-up for Computer Gaming Worlds 1995 \"Action Game of the Year\" award, which ultimately went to Crusader: No Remorse. The editors called it \"another Doom bloodfest distinguished by its fantasy setting and the fact that it let you play as either a fighter, priest or mage, each with unique attributes and weapons\".\n\nThe Saturn version was far less positively received. A review in Next Generation reasoned that, \"Like oil and water, Doom-style games and console conversions don't mix well. Unless the programmers are willing to rewrite the graphics engine from scratch, PC ports suffer from getting cramped into too little memory and neglecting the console's native 3D hardware.\" The reviewer recommended Saturn owners instead try PowerSlave or Ghen War, first-person shooters specifically designed for the console. Shawn Smith and Sushi-X of Electronic Gaming Monthly similarly said the game had not converted well from PC. Others described the Saturn port as an exact conversion, and argued the problem was simply that Hexen was too old a game to be released for console in 1997 without any improvements. Though they disagreed on why, most critics agreed that the Saturn version suffers from pixelated graphics, dramatic drops in frame rate, and cumbersome controls. Scary Larry of GamePro gave it a mixed review, summarizing that \"although it doesn't live up to PowerSlaves standards, it's still decent fun.\" John Broady of GameSpot gave a slightly more dismal assessment: \"Despite these glaring deficiencies, Hexen nonetheless offers enough enhancements over the standard shooter to warrant a rental, especially for fans of role-playing games who thirst for real-time action. ... But for the rest, the Saturn version of Hexen is a classic game of too little and too late.\" Rich Leadbetter of Sega Saturn Magazine and James Price of Saturn Power defended the Saturn version, commenting that while it is not outstanding, it is far superior to the Saturn version of Doom, which was released at roughly the same time. Price was particularly enthusiastic about the link cable-enabled multiplayer mode.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Hexen: Beyond Heretic" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13612" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Hexen: Beyond Heretic is a dark fantasy first-person shooter video game developed by Raven Software and published by id Software through GT Interactive Software on October 30, 1995. It is the sequel to 1994's Heretic, and the second game in Raven Software's \"Serpent Riders\" series. The title comes from the German noun Hexen, which means \"witches\", and/or the verb hexen, which means \"to cast a spell\". Game producer John Romero stated that a third, unreleased game in this series was to be called Hecatomb.\n\nPlot\n\nFollowing the tale of D'Sparil's defeat in Heretic, Hexen takes place in another realm, Cronos, which is besieged by the second of the three Serpent Riders, Korax. Three heroes set out to destroy Korax. The player assumes the role of one such hero. Throughout the course of his quest, he travels through elemental dungeons, a wilderness region, a mountainside seminary, a large castle, and finally a necropolis.\n\nGameplay\n\nA new series feature introduced in Hexen is the choice of three character classes. Players may choose to play as a fighter (Baratus), a cleric (Parias), or a mage (Daedolon). Each character has unique weapons and physical characteristics, lending an additional degree of variety and replay value to the game. The Fighter relies mainly on close quarter physical attacks with weapons both mundane and magical in nature, and is tougher and faster than the other characters. The Mage uses an assortment of long-range spells, whose reach is counterbalanced by the fact that he is the most fragile and slowest moving of the classes. The Cleric arms himself with a combination of both melee and ranged capabilities, being a middle ground of sorts between the other two classes. Additionally, certain items, such as the flechette (poison gas bomb), behave differently when collected and used by each of the classes, functioning in a manner better suiting their varying approach to combat, further differentiating the three characters.\n\nHexen introduces \"hub\" levels to the series, wherein the player can travel back and forth between central hub levels and connected side levels. This is done in order to solve larger-scale puzzles that require a series of items or switches to be used. The player must traverse through a hub in order to reach a boss and advance to the next hub.\n\nDevelopment\n\nLike Heretic, Hexen was developed on NeXTSTEP.[http://rome.ro/2006/12/apple-next-merger-birthday.html planet rome.ro: Apple-NeXT Merger Birthday!]  Hexen uses a modified version of the Doom engine, which allows looking up and down, network play with up to eight players, and the choice of three character classes. It also popularized the \"hub system\" of level progression in the genre of first-person shooter games. Unlike previous games, which had relied purely on General MIDI for music, Hexen is also able to play tracks from a CD. The game's own CD contained a soundtrack in an audio format that was exactly the same as the MIDI soundtrack, but played through a high-quality sound module. However, the most significant improvement was the addition of wall translation, rotation, and level scripting.\n\nEngine modifications\n\n\"Polyobjects\" are the walls that move within the game. Because the Doom engine uses the binary space partitioning system for rendering, it does not enable moving walls. Hexens moving walls are actually one-sided lines built somewhere else on the map and rendered at the desired start spot when the level is loaded. This enables a pseudo-moving wall, but does not allow moving sectors (such as seeing the tops of moving doors). This often creates problems in sectors containing more than one node, however, explaining the relatively limited use of polyobjects.\n\nWhereas Doom, Doom II, and Heretic rely on lines within the maps to perform simple actions, Hexen also allows these actions to be activated by Action Code Script (ACS). These scripts use a syntactic variant of C, thus allowing special sequencing of game actions. Programming features such as randomization, variables, and intermap script activation enable smooth hub gameplay and are responsible for most of the special effects within the game: on-screen messages, random sound effects, monster spawning, sidedef texture changes, versatile control of polyobjects, level initialization for deathmatch, and even complex environment changes such as earthquakes manipulating floor textures and heights.\n\nSource code\n\nOn January 11, 1999, the source code for Hexen was released by Raven Software under a license that granted rights to non-commercial use, and was re-released under the GNU General Public License on September 4, 2008.[http://sourceforge.net/project/showfiles.php?group_id=238655 Heretic / Hexen - Browse Files at SourceForge.net]. This allowed the game to be ported to different platforms such as Linux, AmigaOS, and OS/2 (EComStation).\n\nHexen is compatible with many Doom source ports; Hexens features are also compatible with Doom WADs made for source ports regardless of what game they are being played on.\n\nMusic\n\nThe score was composed by Kevin Schilder. In contrast to Heretic, some songs in Hexen, in addition to MIDI versions, had higher-quality versions on CD. When playing in CD-audio mode, songs absent from CD would be replaced by some existing CD tracks.[https://doomwiki.org/wiki/Hexen_music Hexen music - DoomWiki.org, the new home of the Doom Wiki - Doom, Heretic, Hexen, Strife, and more].\n\nConsole versions\n\nHexen was released for the Sega Saturn, PlayStation, and Nintendo 64, all released by GT Interactive during the first half of 1997. While presenting several specific differences in their respective translations of the original PC game, all of them constitute essentially the same game with no major changes to level design, plot, or overall delivery.\n\nThe PlayStation version, developed by Probe Entertainment, has the FMV scenes and Redbook audio music from the PC CD-ROM version, but no multiplayer mode. The scripting and animation is slower, enemies have only their front sprites and lack gory deaths when attacked by strong hits or weapons, and the frame rate is slower. Although all levels are present in this version and feature their correct layouts, their architecture details are somewhat simplified and there is some loss in overall lighting quality. This port is based on a beta version of the original PC version of Hexen as many gameplay tweaks are shared, such as the simpler level design and the Fighter's fists being weaker compared to other versions.\n\nThe Sega Saturn version, also developed by Probe, inherits most of the restrictions of the PlayStation version, such as the simplified scenery architecture and the downgraded lighting, although it does feature improvements in certain aspects. The scripting is faster, and the frame rate, while not fluid or consistent, is slightly better. The enemies still have all but their front sprites missing, but they retain their gory deaths when killed by a strong hit or weapon. This version also has hidden two-player link-up cooperative and deathmatch modes, accessible only through the unlockable cheat menu. While this port shares the FMV scenes and most of the Redbook audio music from the other CD-ROM versions, it also includes some new music tracks.\n\nThe Nintendo 64 version, developed by Software Creations, retains all of the graphical quality and scenery architecture, has a consistent frame rate, and includes high detail and smooth filtering. This version also has four-player split-screen cooperative and deathmatch modes, although they must be played in low detail mode. Due to cartridge storage limitations, the Nintendo 64 version is based on the original PC floppy version and lacks the FMV scenes and Redbook audio music introduced in the CD-ROM version, although it has new narrative introductions to the levels.\n\nDeathkings of the Dark Citadel\n\nDeathkings of the Dark Citadel is an official expansion pack that was released for Hexen in 1996. It features three more hubs with a total of 20 new single player levels and six new deathmatch levels. Unlike the Shadow of the Serpent Riders expansion pack for Heretic, it had to be purchased in retail stores or by mail order. This was unusual at the time, as most non-free expansion packs also included other new or revised gameplay elements. Deathkings of the Dark Citadel, unlike Shadow of the Serpent Riders, was not packaged with the original game, meaning that both had to be purchased separately, and the expansion would not work without already having Hexen. This expansion pack also did not initially include nor enable any music. Music could be fully enabled by applying a patch specially released to address this issue (usually found online under the name \"dkpatch\").\n\nEach of the hubs (The Blight, The Constable's Gate, and The Nave) features one secret level, and new puzzles based on the quest items from the original game (no new quest artifacts were added). Any type of enemy may spawn on the map.\n\nThe final level of the expansion, the Dark Citadel itself, is an arena-like level, which features teleporting waves of monsters and three bosses (Fighter, Cleric, and Mage clones).\n\nReception\n\nReviewing the PC version, Maximum remarked that Hexen sets itself apart from other \"3D slashers\" with its selection of characters and novel approach to level design, which \"leads to your character choosing their path rather than being guided around a rather linear series of rooms, proving that 3D games have matured\". They also commented that the gameplay is consistently intense due to the difficulty of the enemies, the variety of weapons and power-ups, and the sheer size and breadth of the levels. They gave the game 5 out of 5 stars and their \"Maximum Game of the Month\" award. A reviewer for Next Generation opined that \"Hexen takes everything that was good about Heretic, and makes it even better.\" He commented that the ability to choose between three different character classes gives the game replay value, something that had been missing from first-person shooters up until then, and though the graphics are blocky and pixelated, the \"eerily lifelike\" sound effects make up for it to a large extent. Like Maximum, he praised the non-linear level design and concluded the game to be a must-have for any first-person shooter fan. Chris Hudak, citing the differing abilities of the three playable characters, called Hexen \"Slicker, smarter and more stylish than Doom---with all the killing and three times the replay value.\"\n\nHexen was a runner-up for Computer Gaming Worlds 1995 \"Action Game of the Year\" award, which ultimately went to Crusader: No Remorse. The editors called it \"another Doom bloodfest distinguished by its fantasy setting and the fact that it let you play as either a fighter, priest or mage, each with unique attributes and weapons\".\n\nThe Saturn version was far less positively received. A review in Next Generation reasoned that, \"Like oil and water, Doom-style games and console conversions don't mix well. Unless the programmers are willing to rewrite the graphics engine from scratch, PC ports suffer from getting cramped into too little memory and neglecting the console's native 3D hardware.\" The reviewer recommended Saturn owners instead try PowerSlave or Ghen War, first-person shooters specifically designed for the console. Shawn Smith and Sushi-X of Electronic Gaming Monthly similarly said the game had not converted well from PC. Others described the Saturn port as an exact conversion, and argued the problem was simply that Hexen was too old a game to be released for console in 1997 without any improvements. Though they disagreed on why, most critics agreed that the Saturn version suffers from pixelated graphics, dramatic drops in frame rate, and cumbersome controls. Scary Larry of GamePro gave it a mixed review, summarizing that \"although it doesn't live up to PowerSlaves standards, it's still decent fun.\" John Broady of GameSpot gave a slightly more dismal assessment: \"Despite these glaring deficiencies, Hexen nonetheless offers enough enhancements over the standard shooter to warrant a rental, especially for fans of role-playing games who thirst for real-time action. ... But for the rest, the Saturn version of Hexen is a classic game of too little and too late.\" Rich Leadbetter of Sega Saturn Magazine and James Price of Saturn Power defended the Saturn version, commenting that while it is not outstanding, it is far superior to the Saturn version of Doom, which was released at roughly the same time. Price was particularly enthusiastic about the link cable-enabled multiplayer mode. Hexen: Beyond Heretic. http://en.wikipedia.org/?curid=13612."
  }
}
