{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8631",
  "eid" : "e97702e0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778471438,
  "textBody" : "Dimmu Borgir (,) is a Norwegian symphonic black metal band from Oslo, Norway, formed in 1993. The name is derived from Dimmuborgir, a volcanic formation in Iceland, the name of which means \"dark cities\" or \"dark castles/fortresses\" in Icelandic, Faroese and Old Norse. The band has been through numerous lineup changes over the years; guitarist Silenoz and vocalist Shagrath are the only original members who still remain with guitarist Galder being a longstanding member.Bradley Torreano: [http://www.allmusic.com/artist/dimmu-borgir-p207278 Dimmu Borgir]. AllMusic. Retrieved on 2011-06-11.\n\nBiography \n\nFor All Tid and Stormblåst period \n\nDimmu Borgir was founded in 1993 by Shagrath, Silenoz and Tjodalv; the band released an EP in 1994 entitled Inn i evighetens mørke (\"In the Eternal Darkness\" in English). This short EP sold out within weeks, and the band followed up with the 1994 full-length album For All Tid (\"For All Time\" in English). This album featured vocal contributions by Vicotnik of Ved Buens Ende and Dødheimsgard and Aldrahn of Dødheimsgard and Zyklon-B. The initial line-up consisted of Shagrath playing drums with Tjodalv on guitar and Silenoz contributing lead vocals. This line-up changed before the release of Stormblåst (translates to \"Stormblown\") on Cacophonous Records in 1996, an album considered by many to be their finest. It is also the last album which features all lyrics written and sung in Norwegian.[http://www.cduniverse.com/productinfo.asp?pid1019306 Dimmu Borgir – For All Tid CD Album]. Cduniverse.com (1997-10-21). Retrieved on 2011-06-11.[http://www.cduniverse.com/productinfo.asp?pid\n3005823 Dimmu Borgir – Stormblast CD Album]. Cduniverse.com (2002-03-19). Retrieved on 2011-06-11.\n\nEnthrone Darkness Triumphant period \n\nAfter Stormblåst, keyboardist Stian Aarstad left the band due to his obligation to serve in the Norwegian army, thus being unable to participate in the 1996 recording of Devil's Path. That period was also marked by the departure of bassist Brynjard Tristan and the arrival of Nagash. Stian Aarstad returned for the recording of 1997's Enthrone Darkness Triumphant. He had trouble attending rehearsals and was unable to tour. He was then subsequently fired and replaced by Kimberly Goss for their 1997/1998 world tour. Enthrone Darkness Triumphant was a huge success for the band, and was their first release signed to Nuclear Blast, a German record label. The album was recorded in the Abyss Studios, owned by Hypocrisy's frontman Peter Tägtgren.[http://www.discogs.com/artist/Peter+T%C3%A4gtgren Peter Tägtgren – Bio, CDs and Vinyl at Discogs]. Discogs.com. Retrieved on 2011-06-11.Anderson, Jason. (1997-05-27) [http://www.allmusic.com/album/enthrone-darkness-triumphant-r276860 Enthrone Darkness Triumphant – Dimmu Borgir]. AllMusic. Retrieved on 2011-06-11. After the release of Enthrone Darkness Triumphant, the band went on tour with In Flames, Dissection and other bands who were prominent in the scene at the time.\n\nSpiritual Black Dimensions and Puritanical Euphoric Misanthropia period \n\nAfter the tour for Enthrone Darkness Triumphant, the band recruited new members Mustis on keyboards and Astennu on lead guitar. Dimmu Borgir's following full-length albums Spiritual Black Dimensions in 1999 and 2001's Puritanical Euphoric Misanthropia, both met critical acclaim. However, another line-up change occurred between the two albums; Nagash quit and was replaced by new bassist/singer ICS Vortex, and Tjodalv left due to his family commitments, and to form the subsequent band Susperia, only to be replaced with Nicholas Barker of Cradle of Filth. Astennu was fired from his guitar duties as well, and was replaced by Galder.[http://www.cduniverse.com/productinfo.asp?pid1019343 Dimmu Borgir – Spiritual Black Dimensions CD Album]. Cduniverse.com (2004-11-02). Retrieved on 2011-06-11.[http://www.cduniverse.com/productinfo.asp?pid\n1019316 Dimmu Borgir – Godless Savage Garden CD Album]. Cduniverse.com (1998-08-04). Retrieved on 2011-06-11.O'Neill, Brian. (2001-03-20) [http://www.allmusic.com/album/puritanical-euphoric-misanthropia-r524537 Puritanical Euphoric Misanthropia – Dimmu Borgir]. AllMusic. Retrieved on 2011-06-11. \n\nDeath Cult Armageddon and Stormblåst MMV period \n\nDespite the regular video play on MTV2 and Fuse that their follow-up album would receive, the band stated that they were not \"commercially-oriented,\" and instead, they 'simply wished to spread their message to more people'.[http://www.metalstorm.net/pub/interview.php?interview_id=2 Dimmu Borgir interview (09/2003)]. Metalstorm.net. Retrieved on 2011-06-11. In 2003, Dimmu Borgir recorded Death Cult Armageddon. Death Cult Armageddon was recorded with the Prague Philarmonic Orchestra, conducted by Adam Klemens. All orchestrations were arranged by Gaute Storaas (who had previously worked with Dimmu Borgir on the album Puritanical Euphoric Misanthropia). In 2004, Dimmu Borgir performed on the mainstage at Ozzfest.\n\nIn 2005, the band did a complete re-recording of the Stormblåst album, featuring Hellhammer of Mayhem fame as the session drummer. The album also featured a DVD with a live performance from the 2004 Ozzfest tour.\n\nIn Sorte Diaboli period\n\nDimmu Borgir's eighth studio album, In Sorte Diaboli, was released on 24 April 2007.[http://www.cduniverse.com/productinfo.asp?pid=7398161 Dimmu Borgir – In Sorte Diaboli CD Album]. Cduniverse.com (2007-04-24). Retrieved on 2011-06-11. A special edition version was released in a boxed case with a DVD, backward-printed lyrics, and a mirror. The album artwork was released on 14 February 2007 on a promotional webpage for the album. This album features once more the drumming of Hellhammer of Mayhem. Blomberg left the band in mid-tour in 2007 because of a neck injury that resulted in limited movement of his right arm. With the release of this album, Dimmu Borgir became the first black metal band with a number one album on the charts in their native country.  In October 2008, they released their second live DVD set titled The Invaluable Darkness, which was based on several shows during the world tour supporting 'In Sorte Diaboli'.\n\nIn 2009, members ICS Vortex and Mustis independently announced their departure from Dimmu Borgir. Mustis released a statement claiming his disfavor with the band, stating that he was not properly credited for his writing contributions to the band's music, mentioning possibly taking legal action.\n\nDimmu Borgir soon after confirmed the pair's dismissal from the band, releasing a statement explaining why the two were fired. Shagrath, Silenoz and Galder wrote: \"Funny then, how the new album is half-way finished written already by the rest of us without any of these guys' input, still having all those elements we're known for.\" The band's decision has received a very mixed response from fans.\n\nAbrahadabra period\n\nDimmu Borgir's ninth studio album, Abrahadabra, was released on 24 September 2010 in Germany, 27 September 2010 for the rest of Europe and October 12, 2010 in North America. Silenoz explained that the growing periods of time between albums was because the band had stopped writing music while touring, which was affecting the quality of the music. He described the new album as having an \"eerie and haunting feel to it\", adding that the material is \"epic\", \"primal\", atmospheric and ambient. A promotional image released with the statement showed Shagrath returning to the keyboards. The album features an ensemble orchestra, the Kringkastingsorkestret (the Norwegian Broadcasting Orchestra), as well as the Schola Cantorum choir, totaling more than 100 musicians and singers.\n\nGaute Storaas, composer of the orchestral arrangements, released a statement on his role in working on the album. \"Their music is epic, thematic and symphonic already from the creation; they are clearly having an orchestral approach to composing. My role in this is sometimes just to transcribe their themes, sometimes to take their ideas, tear them apart and build them back up in ways that are true to the band's intentions. The music must also be both interesting and playable for the musicians, and hopefully, meet the quality standards of the orchestral world.\"\n\nOn 8 July the band confirmed that they had tapped Swedish multi-instrumentalist Snowy Shaw (Therion, Dream Evil) to replace bassist/clean vocalist ICS Vortex on their then-upcoming album, Abrahadabra, and world tour. On 25 August it was announced that Snowy Shaw had left Dimmu Borgir to rejoin Therion. On 17 September 2010 Dimmu Borgir released the song \"Born Treacherous\" from Abrahadabra on their official Myspace page. Then on 24 September the band announced they would stream Abrahadabra in its entirety until 7 p.m. EST that evening. The keyboards and bass are currently played by Gerlioz from Apoptygma Berzerk and Cyrus of Susperia respectively, and the clean vocals are sampled.\n\n28 May 2011 saw Dimmu Borgir, for the very first time in the band's career, perform live with a full symphony orchestra and choir in a one-off show with the Norwegian Broadcasting Orchestra and Schola Cantorum Choir (who collaborated on Abrahadabra the previous year) at the Oslo Spectrum entitled \"Forces of the Northern Night\". This was broadcast live on Norway's main national TV carrier NRK. The setlist for this show consisted of tracks from the band's recent transfiguration Abrahadabra, leading tracks \"Vredysbyrd\" and \"Progenies of the Great Apocalypse\" from Death Cult Armageddon, as well as newly updated versions of tracks from their standard back catalog; \"The Serpentine Offering\", \"Kings of the Carnival Creation\", and \"Mourning Palace\" which were re-orchestrated by Gaute Storaas. The band played a similar show the following year at the Wacken Open Air festival, having yet performed a second live show with a symphony orchestra and choir. This time, they were accompanied by the Czech National Orchestra with the same choir, being the second band in the festival's history to play with a live orchestra and choir (next to German power metal band Rage's 2007 performance). The show was broadcast live on Germany's Kultur TV arts channel. Silenoz has also said in several recent interviews that both live sets have been fully mixed and will be accompanied by a feature-length documentary and bonus material when released.  In late 2011-2012 the band went on a special tour for fans in various European countries, including playing in some small, intimate venues celebrating their 1997 album Enthrone Darkness Triumphant by playing the album in its entirety, alongside an additional set of various fan favourite tracks, following a poll to fans directly, asking which of their first 3 albums would they want to see played in full on their next European tour.\n\nForces of the Northern Night and Eonian\n\nThe band originally announced in August 2013 that work had commenced on the band's next album. However, the production and release of the album has faced numerous delays. It will mark the longest ever gap between each studio release. Following various delays, The Oslo and Wacken Orchestra performances, recorded between 2011-2012 were finally released on CD/DVD/Blu-Ray format on April 28, 2017 worldwide as their third live video release titled 'Forces of the Northern Night'.  Silenoz recently revealed that the band is in the mixing stage of the follow-up to Abrahadabra.http://www.blabbermouth.net/news/dimmu-borgir-guitarist-on-upcoming-album-every-song-stands-perfectly-on-its-own-feet/  Ten songs will feature on the next album and they have said it has since been completed.  On 18 December 2017 it was announced that the first single from the new album will be initially released on a 7-inch vinyl E.P, and will be titled ‘Interdimensional Summit’, and it will be released on February 23, 2018. The new album will be titled Eonian and will be released on 4 May through Nuclear Blast, which will mark the band’s first new release of original material in almost 8 years.\n\nInfluences and musical style\n\nDimmu Borgir's older releases (since 1994 to 1999) are, according to Allmusic journalist Bradley Torreano, strongly influenced by Darkthrone, Mayhem, Bathory, Emperor, Celtic Frost, Immortal, Venom and Iron Maiden. The band became more progressive and symphonic through the years; many black metal purists consider the band's second album, Stormblåst, to be \"the act's last true contribution to black metal\". Enthrone Darkness Triumphant, Dimmu Borgir's third album, \"distinguished itself in two important areas, firstly forgoing their native language for English and secondly for its dramatic increase in synthesizer content\". Significant experimentation started c. 2000, during the era of Spiritual Black Dimensions (due to the addition of Vortex's clean vocals, and the variety of musical ideas from then-new member Mustis), as well as Puritanical Euphoric Misanthropia due to addition of influences from composers such as Antonín Dvořák, Enya, Richard Wagner and Frédéric Chopin.Serba, John. (2003-09-09) [http://www.allmusic.com/album/death-cult-armageddon-r655155 Death Cult Armageddon – Dimmu Borgir]. AllMusic. Retrieved on 2011-06-11. As the music strongly differed from the older, rawer black metal style, Jon \"Metalion\" Kristiansen called Spiritual Black Dimensions \"a fine case of melodic, over-produced symphonic metal. If you like this melodic style I can't really think of anyone doing it better [...]. No, I wouldn't call this black metal. Read the interview with Funeral Mist for the right definition of black metal.\"The Great Rock & Roll Swindle!. In: Jon Kristiansen: Metalion: The Slayer Mag Diaries. Brooklyn, NY: Bazillion Points Books 2011, p. 419.\n\nDiscography\n\n*For all tid (1995)\n*Stormblåst (1996)\n*Enthrone Darkness Triumphant (1997)\n*Spiritual Black Dimensions (1999)\n*Puritanical Euphoric Misanthropia (2001)\n*Death Cult Armageddon (2003)\n*Stormblåst MMV (2005)\n*In Sorte Diaboli (2007)\n*Abrahadabra (2010)\n*Eonian (2018)\n\nBand members\n\nCurrent members\n\nOfficial members\n\n* Shagrath – drums (1993–1995), lead vocals (1995–present), lead guitar (1995–1996), keyboards (1996, 2010)\n* Silenoz – rhythm guitar (1993–present), lead vocals (1993–1995),  backing vocals (1995–present)\n* Galder – lead guitar, backing vocals (2000–present)\n*Daray – drums (2018–present)\n*Gerlioz – keyboards, synthesizer (2018–present)\n\nSession members\n\n* Daray – drums (2008–2018)\n* Cyrus – bass, backing vocals (2010–present)\n* Gerlioz – keyboards, synthesizer (2010–2018)[http://www.roadrunnerrecords.com/blabbermouth.net/news.aspx?modeArticle&newsitemID\n145889 ]\n\nFormer members\n\nBassists\n\n* Brynjard Tristan (1993–1996)\n* Nagash – (1996–1999)\n* ICS Vortex – (1999–2009)\n* Secthdamon – session musician (2007)\n* Snowy Shaw – (2010)\n\nKeyboardists\n\n* Stian Aarstad – (1993–1997)\n* Kimberly Goss – (1997–1998)\n* Mustis – (1998–2009)\n\nMultinstrumentalist\n\n* Tjodalv – lead guitar, backing vocals (1993–1995) drums, percussion (1995–1999)\n\nLead guitarists\n\n* Jens-Petter Sandvik – (1996–1997)\n* Astennu – (1997–1999)\n\nDrummers\n\n* Aggressor – session (1997)\n* Nicholas Barker – (1999–2004)\n* Reno Kiilerich – (2004) \n* Tony Laureano – (2004-2005, 2007-2008) \n* Hellhammer – (2005–2007)\n\nTimeline\n\nImageSize = width:800 height:auto barincrement:20\nPlotArea = left:100 bottom:120 top:0 right:50\nAlignbars = justify\nDateFormat  = mm/dd/yyyy\nPeriod = from:01/01/1993 till:08/01/2018\nTimeAxis = orientation:horizontal format:yyyy\n\nColors =\n  id:Lead      value:red         legend:Lead_vocals\n  id:Guitar    value:teal        legend:Lead_guitar\n  id:Rhythm    value:brightgreen legend:Rhythm_guitar\n  id:Bass      value:blue        legend:Bass\n  id:Keyboards value:purple      legend:Keyboards\n  id:Drums     value:orange      legend:Drums\n  id:Lines     value:black       legend:Studio albums\n\nLegend = orientation:vertical position:bottom columns:2\n\nScaleMajor = increment:2 start:1993\nScaleMinor = unit:year increment:1 start:1994\n\nLineData =\n  at:02/01/1995 color:black layer:back\n  at:01/25/1996 color:black layer:back\n  at:05/30/1997 color:black layer:back\n  at:03/02/1999 color:black layer:back\n  at:03/20/2001 color:black layer:back\n  at:09/09/2003 color:black layer:back\n  at:11/11/2005 color:black layer:back\n  at:04/23/2007 color:black layer:back\n  at:09/22/2010 color:black layer:back\n  at:07/01/2018 color:black layer:back\n\nBarData =\n  bar:Shagrath   text:\"Shagrath\"\n  bar:Astennu    text:\"Astennu\" \n  bar:Galder     text:\"Galder\"\n  bar:Silenoz    text:\"Silenoz\"\n  bar:Brynjard   text:\"Brynjard Tristan\"\n  bar:Nagash     text:\"Nagash\"\n  bar:Simen      text:\"ICS Vortex\"\n  bar:Snowy      text:\"Snowy Shaw\"\n  bar:Cyrus      text:\"Cyrus\"\n  bar:Tjodalv    text:\"Tjodalv\"\n  bar:Nicholas   text:\"Nicholas Barker\"\n  bar:Hellhammer text:\"Hellhammer\"\n  bar:Daray      text:\"Daray\"\n  bar:Stian      text:\"Stian Aarstad\"\n  bar:Kim        text:\"Kim Goss\"\n  bar:Mustis     text:\"Mustis\"\n  bar:Gerlioz    text:\"Gerlioz\"\n\nPlotData=\n  width:10 textcolor:black align:left anchor:from shift:(10,-4)\n  bar:Shagrath from:01/01/1993 till:04/01/1995 color:Drums\n  bar:Shagrath from:04/01/1995 till:08/04/1997 color:Guitar\n  bar:Shagrath from:08/04/1997 till:end color:Lead\n  bar:Silenoz from:01/01/1993 till:end color:Rhythm\n  bar:Brynjard from:01/01/1993 till:04/01/1996 color:Bass\n  bar:Stian from:01/01/1993 till:08/01/1997 color:Keyboards\n  bar:Kim from:08/01/1997 till:08/01/1998 color:Keyboards\n  bar:Tjodalv from:01/01/1993 till:04/01/1995 color:Guitar\n  bar:Tjodalv from:04/01/1995 till:05/01/1999 color:Drums\n  bar:Nagash from:04/01/1996 till:05/01/1999 color:Bass\n  bar:Astennu  from:08/01/1997 till:12/31/1999 color:Guitar\n  bar:Mustis from:08/01/1998 till:10/01/2009 color:Keyboards\n  bar:Simen from:05/01/1999 till:10/01/2009 color:Bass\n  bar:Galder from:01/01/2000 till:end color:Guitar\n  bar:Nicholas from:05/01/1999 till:12/31/2004 color:Drums\n  bar:Hellhammer from:01/01/2005 till:12/31/2007 color:Drums\n  bar:Daray from:01/01/2008 till:end color:Drums\n  bar:Gerlioz from:09/01/2010 till:end color:Keyboards\n  bar:Snowy from:02/01/2010 till:08/25/2010 color:Bass\n  bar:Cyrus from:09/01/2010 till:end color:Bass\n  width:3 textcolor:black align:left anchor:from shift:(10,-4)\n  bar:Silenoz from:01/01/1993 till:10/01/1995 color:Lead\n  bar:Shagrath from:04/01/1995 till:08/04/1997 color:Lead\n  bar:Simen from:05/10/1999 till:10/01/2009 color:Lead\n  bar:Snowy from:02/01/2010 till:08/25/2010 color:Lead\n  bar:Shagrath from:02/01/2010 till:08/25/2010 color:Keyboards",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Dimmu Borgir" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8631" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Dimmu Borgir (,) is a Norwegian symphonic black metal band from Oslo, Norway, formed in 1993. The name is derived from Dimmuborgir, a volcanic formation in Iceland, the name of which means \"dark cities\" or \"dark castles/fortresses\" in Icelandic, Faroese and Old Norse. The band has been through numerous lineup changes over the years; guitarist Silenoz and vocalist Shagrath are the only original members who still remain with guitarist Galder being a longstanding member.Bradley Torreano: [http://www.allmusic.com/artist/dimmu-borgir-p207278 Dimmu Borgir]. AllMusic. Retrieved on 2011-06-11.\n\nBiography \n\nFor All Tid and Stormblåst period \n\nDimmu Borgir was founded in 1993 by Shagrath, Silenoz and Tjodalv; the band released an EP in 1994 entitled Inn i evighetens mørke (\"In the Eternal Darkness\" in English). This short EP sold out within weeks, and the band followed up with the 1994 full-length album For All Tid (\"For All Time\" in English). This album featured vocal contributions by Vicotnik of Ved Buens Ende and Dødheimsgard and Aldrahn of Dødheimsgard and Zyklon-B. The initial line-up consisted of Shagrath playing drums with Tjodalv on guitar and Silenoz contributing lead vocals. This line-up changed before the release of Stormblåst (translates to \"Stormblown\") on Cacophonous Records in 1996, an album considered by many to be their finest. It is also the last album which features all lyrics written and sung in Norwegian.[http://www.cduniverse.com/productinfo.asp?pid1019306 Dimmu Borgir – For All Tid CD Album]. Cduniverse.com (1997-10-21). Retrieved on 2011-06-11.[http://www.cduniverse.com/productinfo.asp?pid\n3005823 Dimmu Borgir – Stormblast CD Album]. Cduniverse.com (2002-03-19). Retrieved on 2011-06-11.\n\nEnthrone Darkness Triumphant period \n\nAfter Stormblåst, keyboardist Stian Aarstad left the band due to his obligation to serve in the Norwegian army, thus being unable to participate in the 1996 recording of Devil's Path. That period was also marked by the departure of bassist Brynjard Tristan and the arrival of Nagash. Stian Aarstad returned for the recording of 1997's Enthrone Darkness Triumphant. He had trouble attending rehearsals and was unable to tour. He was then subsequently fired and replaced by Kimberly Goss for their 1997/1998 world tour. Enthrone Darkness Triumphant was a huge success for the band, and was their first release signed to Nuclear Blast, a German record label. The album was recorded in the Abyss Studios, owned by Hypocrisy's frontman Peter Tägtgren.[http://www.discogs.com/artist/Peter+T%C3%A4gtgren Peter Tägtgren – Bio, CDs and Vinyl at Discogs]. Discogs.com. Retrieved on 2011-06-11.Anderson, Jason. (1997-05-27) [http://www.allmusic.com/album/enthrone-darkness-triumphant-r276860 Enthrone Darkness Triumphant – Dimmu Borgir]. AllMusic. Retrieved on 2011-06-11. After the release of Enthrone Darkness Triumphant, the band went on tour with In Flames, Dissection and other bands who were prominent in the scene at the time.\n\nSpiritual Black Dimensions and Puritanical Euphoric Misanthropia period \n\nAfter the tour for Enthrone Darkness Triumphant, the band recruited new members Mustis on keyboards and Astennu on lead guitar. Dimmu Borgir's following full-length albums Spiritual Black Dimensions in 1999 and 2001's Puritanical Euphoric Misanthropia, both met critical acclaim. However, another line-up change occurred between the two albums; Nagash quit and was replaced by new bassist/singer ICS Vortex, and Tjodalv left due to his family commitments, and to form the subsequent band Susperia, only to be replaced with Nicholas Barker of Cradle of Filth. Astennu was fired from his guitar duties as well, and was replaced by Galder.[http://www.cduniverse.com/productinfo.asp?pid1019343 Dimmu Borgir – Spiritual Black Dimensions CD Album]. Cduniverse.com (2004-11-02). Retrieved on 2011-06-11.[http://www.cduniverse.com/productinfo.asp?pid\n1019316 Dimmu Borgir – Godless Savage Garden CD Album]. Cduniverse.com (1998-08-04). Retrieved on 2011-06-11.O'Neill, Brian. (2001-03-20) [http://www.allmusic.com/album/puritanical-euphoric-misanthropia-r524537 Puritanical Euphoric Misanthropia – Dimmu Borgir]. AllMusic. Retrieved on 2011-06-11. \n\nDeath Cult Armageddon and Stormblåst MMV period \n\nDespite the regular video play on MTV2 and Fuse that their follow-up album would receive, the band stated that they were not \"commercially-oriented,\" and instead, they 'simply wished to spread their message to more people'.[http://www.metalstorm.net/pub/interview.php?interview_id=2 Dimmu Borgir interview (09/2003)]. Metalstorm.net. Retrieved on 2011-06-11. In 2003, Dimmu Borgir recorded Death Cult Armageddon. Death Cult Armageddon was recorded with the Prague Philarmonic Orchestra, conducted by Adam Klemens. All orchestrations were arranged by Gaute Storaas (who had previously worked with Dimmu Borgir on the album Puritanical Euphoric Misanthropia). In 2004, Dimmu Borgir performed on the mainstage at Ozzfest.\n\nIn 2005, the band did a complete re-recording of the Stormblåst album, featuring Hellhammer of Mayhem fame as the session drummer. The album also featured a DVD with a live performance from the 2004 Ozzfest tour.\n\nIn Sorte Diaboli period\n\nDimmu Borgir's eighth studio album, In Sorte Diaboli, was released on 24 April 2007.[http://www.cduniverse.com/productinfo.asp?pid=7398161 Dimmu Borgir – In Sorte Diaboli CD Album]. Cduniverse.com (2007-04-24). Retrieved on 2011-06-11. A special edition version was released in a boxed case with a DVD, backward-printed lyrics, and a mirror. The album artwork was released on 14 February 2007 on a promotional webpage for the album. This album features once more the drumming of Hellhammer of Mayhem. Blomberg left the band in mid-tour in 2007 because of a neck injury that resulted in limited movement of his right arm. With the release of this album, Dimmu Borgir became the first black metal band with a number one album on the charts in their native country.  In October 2008, they released their second live DVD set titled The Invaluable Darkness, which was based on several shows during the world tour supporting 'In Sorte Diaboli'.\n\nIn 2009, members ICS Vortex and Mustis independently announced their departure from Dimmu Borgir. Mustis released a statement claiming his disfavor with the band, stating that he was not properly credited for his writing contributions to the band's music, mentioning possibly taking legal action.\n\nDimmu Borgir soon after confirmed the pair's dismissal from the band, releasing a statement explaining why the two were fired. Shagrath, Silenoz and Galder wrote: \"Funny then, how the new album is half-way finished written already by the rest of us without any of these guys' input, still having all those elements we're known for.\" The band's decision has received a very mixed response from fans.\n\nAbrahadabra period\n\nDimmu Borgir's ninth studio album, Abrahadabra, was released on 24 September 2010 in Germany, 27 September 2010 for the rest of Europe and October 12, 2010 in North America. Silenoz explained that the growing periods of time between albums was because the band had stopped writing music while touring, which was affecting the quality of the music. He described the new album as having an \"eerie and haunting feel to it\", adding that the material is \"epic\", \"primal\", atmospheric and ambient. A promotional image released with the statement showed Shagrath returning to the keyboards. The album features an ensemble orchestra, the Kringkastingsorkestret (the Norwegian Broadcasting Orchestra), as well as the Schola Cantorum choir, totaling more than 100 musicians and singers.\n\nGaute Storaas, composer of the orchestral arrangements, released a statement on his role in working on the album. \"Their music is epic, thematic and symphonic already from the creation; they are clearly having an orchestral approach to composing. My role in this is sometimes just to transcribe their themes, sometimes to take their ideas, tear them apart and build them back up in ways that are true to the band's intentions. The music must also be both interesting and playable for the musicians, and hopefully, meet the quality standards of the orchestral world.\"\n\nOn 8 July the band confirmed that they had tapped Swedish multi-instrumentalist Snowy Shaw (Therion, Dream Evil) to replace bassist/clean vocalist ICS Vortex on their then-upcoming album, Abrahadabra, and world tour. On 25 August it was announced that Snowy Shaw had left Dimmu Borgir to rejoin Therion. On 17 September 2010 Dimmu Borgir released the song \"Born Treacherous\" from Abrahadabra on their official Myspace page. Then on 24 September the band announced they would stream Abrahadabra in its entirety until 7 p.m. EST that evening. The keyboards and bass are currently played by Gerlioz from Apoptygma Berzerk and Cyrus of Susperia respectively, and the clean vocals are sampled.\n\n28 May 2011 saw Dimmu Borgir, for the very first time in the band's career, perform live with a full symphony orchestra and choir in a one-off show with the Norwegian Broadcasting Orchestra and Schola Cantorum Choir (who collaborated on Abrahadabra the previous year) at the Oslo Spectrum entitled \"Forces of the Northern Night\". This was broadcast live on Norway's main national TV carrier NRK. The setlist for this show consisted of tracks from the band's recent transfiguration Abrahadabra, leading tracks \"Vredysbyrd\" and \"Progenies of the Great Apocalypse\" from Death Cult Armageddon, as well as newly updated versions of tracks from their standard back catalog; \"The Serpentine Offering\", \"Kings of the Carnival Creation\", and \"Mourning Palace\" which were re-orchestrated by Gaute Storaas. The band played a similar show the following year at the Wacken Open Air festival, having yet performed a second live show with a symphony orchestra and choir. This time, they were accompanied by the Czech National Orchestra with the same choir, being the second band in the festival's history to play with a live orchestra and choir (next to German power metal band Rage's 2007 performance). The show was broadcast live on Germany's Kultur TV arts channel. Silenoz has also said in several recent interviews that both live sets have been fully mixed and will be accompanied by a feature-length documentary and bonus material when released.  In late 2011-2012 the band went on a special tour for fans in various European countries, including playing in some small, intimate venues celebrating their 1997 album Enthrone Darkness Triumphant by playing the album in its entirety, alongside an additional set of various fan favourite tracks, following a poll to fans directly, asking which of their first 3 albums would they want to see played in full on their next European tour.\n\nForces of the Northern Night and Eonian\n\nThe band originally announced in August 2013 that work had commenced on the band's next album. However, the production and release of the album has faced numerous delays. It will mark the longest ever gap between each studio release. Following various delays, The Oslo and Wacken Orchestra performances, recorded between 2011-2012 were finally released on CD/DVD/Blu-Ray format on April 28, 2017 worldwide as their third live video release titled 'Forces of the Northern Night'.  Silenoz recently revealed that the band is in the mixing stage of the follow-up to Abrahadabra.http://www.blabbermouth.net/news/dimmu-borgir-guitarist-on-upcoming-album-every-song-stands-perfectly-on-its-own-feet/  Ten songs will feature on the next album and they have said it has since been completed.  On 18 December 2017 it was announced that the first single from the new album will be initially released on a 7-inch vinyl E.P, and will be titled ‘Interdimensional Summit’, and it will be released on February 23, 2018. The new album will be titled Eonian and will be released on 4 May through Nuclear Blast, which will mark the band’s first new release of original material in almost 8 years.\n\nInfluences and musical style\n\nDimmu Borgir's older releases (since 1994 to 1999) are, according to Allmusic journalist Bradley Torreano, strongly influenced by Darkthrone, Mayhem, Bathory, Emperor, Celtic Frost, Immortal, Venom and Iron Maiden. The band became more progressive and symphonic through the years; many black metal purists consider the band's second album, Stormblåst, to be \"the act's last true contribution to black metal\". Enthrone Darkness Triumphant, Dimmu Borgir's third album, \"distinguished itself in two important areas, firstly forgoing their native language for English and secondly for its dramatic increase in synthesizer content\". Significant experimentation started c. 2000, during the era of Spiritual Black Dimensions (due to the addition of Vortex's clean vocals, and the variety of musical ideas from then-new member Mustis), as well as Puritanical Euphoric Misanthropia due to addition of influences from composers such as Antonín Dvořák, Enya, Richard Wagner and Frédéric Chopin.Serba, John. (2003-09-09) [http://www.allmusic.com/album/death-cult-armageddon-r655155 Death Cult Armageddon – Dimmu Borgir]. AllMusic. Retrieved on 2011-06-11. As the music strongly differed from the older, rawer black metal style, Jon \"Metalion\" Kristiansen called Spiritual Black Dimensions \"a fine case of melodic, over-produced symphonic metal. If you like this melodic style I can't really think of anyone doing it better [...]. No, I wouldn't call this black metal. Read the interview with Funeral Mist for the right definition of black metal.\"The Great Rock & Roll Swindle!. In: Jon Kristiansen: Metalion: The Slayer Mag Diaries. Brooklyn, NY: Bazillion Points Books 2011, p. 419.\n\nDiscography\n\n*For all tid (1995)\n*Stormblåst (1996)\n*Enthrone Darkness Triumphant (1997)\n*Spiritual Black Dimensions (1999)\n*Puritanical Euphoric Misanthropia (2001)\n*Death Cult Armageddon (2003)\n*Stormblåst MMV (2005)\n*In Sorte Diaboli (2007)\n*Abrahadabra (2010)\n*Eonian (2018)\n\nBand members\n\nCurrent members\n\nOfficial members\n\n* Shagrath – drums (1993–1995), lead vocals (1995–present), lead guitar (1995–1996), keyboards (1996, 2010)\n* Silenoz – rhythm guitar (1993–present), lead vocals (1993–1995),  backing vocals (1995–present)\n* Galder – lead guitar, backing vocals (2000–present)\n*Daray – drums (2018–present)\n*Gerlioz – keyboards, synthesizer (2018–present)\n\nSession members\n\n* Daray – drums (2008–2018)\n* Cyrus – bass, backing vocals (2010–present)\n* Gerlioz – keyboards, synthesizer (2010–2018)[http://www.roadrunnerrecords.com/blabbermouth.net/news.aspx?modeArticle&newsitemID\n145889 ]\n\nFormer members\n\nBassists\n\n* Brynjard Tristan (1993–1996)\n* Nagash – (1996–1999)\n* ICS Vortex – (1999–2009)\n* Secthdamon – session musician (2007)\n* Snowy Shaw – (2010)\n\nKeyboardists\n\n* Stian Aarstad – (1993–1997)\n* Kimberly Goss – (1997–1998)\n* Mustis – (1998–2009)\n\nMultinstrumentalist\n\n* Tjodalv – lead guitar, backing vocals (1993–1995) drums, percussion (1995–1999)\n\nLead guitarists\n\n* Jens-Petter Sandvik – (1996–1997)\n* Astennu – (1997–1999)\n\nDrummers\n\n* Aggressor – session (1997)\n* Nicholas Barker – (1999–2004)\n* Reno Kiilerich – (2004) \n* Tony Laureano – (2004-2005, 2007-2008) \n* Hellhammer – (2005–2007)\n\nTimeline\n\nImageSize = width:800 height:auto barincrement:20\nPlotArea = left:100 bottom:120 top:0 right:50\nAlignbars = justify\nDateFormat  = mm/dd/yyyy\nPeriod = from:01/01/1993 till:08/01/2018\nTimeAxis = orientation:horizontal format:yyyy\n\nColors =\n  id:Lead      value:red         legend:Lead_vocals\n  id:Guitar    value:teal        legend:Lead_guitar\n  id:Rhythm    value:brightgreen legend:Rhythm_guitar\n  id:Bass      value:blue        legend:Bass\n  id:Keyboards value:purple      legend:Keyboards\n  id:Drums     value:orange      legend:Drums\n  id:Lines     value:black       legend:Studio albums\n\nLegend = orientation:vertical position:bottom columns:2\n\nScaleMajor = increment:2 start:1993\nScaleMinor = unit:year increment:1 start:1994\n\nLineData =\n  at:02/01/1995 color:black layer:back\n  at:01/25/1996 color:black layer:back\n  at:05/30/1997 color:black layer:back\n  at:03/02/1999 color:black layer:back\n  at:03/20/2001 color:black layer:back\n  at:09/09/2003 color:black layer:back\n  at:11/11/2005 color:black layer:back\n  at:04/23/2007 color:black layer:back\n  at:09/22/2010 color:black layer:back\n  at:07/01/2018 color:black layer:back\n\nBarData =\n  bar:Shagrath   text:\"Shagrath\"\n  bar:Astennu    text:\"Astennu\" \n  bar:Galder     text:\"Galder\"\n  bar:Silenoz    text:\"Silenoz\"\n  bar:Brynjard   text:\"Brynjard Tristan\"\n  bar:Nagash     text:\"Nagash\"\n  bar:Simen      text:\"ICS Vortex\"\n  bar:Snowy      text:\"Snowy Shaw\"\n  bar:Cyrus      text:\"Cyrus\"\n  bar:Tjodalv    text:\"Tjodalv\"\n  bar:Nicholas   text:\"Nicholas Barker\"\n  bar:Hellhammer text:\"Hellhammer\"\n  bar:Daray      text:\"Daray\"\n  bar:Stian      text:\"Stian Aarstad\"\n  bar:Kim        text:\"Kim Goss\"\n  bar:Mustis     text:\"Mustis\"\n  bar:Gerlioz    text:\"Gerlioz\"\n\nPlotData=\n  width:10 textcolor:black align:left anchor:from shift:(10,-4)\n  bar:Shagrath from:01/01/1993 till:04/01/1995 color:Drums\n  bar:Shagrath from:04/01/1995 till:08/04/1997 color:Guitar\n  bar:Shagrath from:08/04/1997 till:end color:Lead\n  bar:Silenoz from:01/01/1993 till:end color:Rhythm\n  bar:Brynjard from:01/01/1993 till:04/01/1996 color:Bass\n  bar:Stian from:01/01/1993 till:08/01/1997 color:Keyboards\n  bar:Kim from:08/01/1997 till:08/01/1998 color:Keyboards\n  bar:Tjodalv from:01/01/1993 till:04/01/1995 color:Guitar\n  bar:Tjodalv from:04/01/1995 till:05/01/1999 color:Drums\n  bar:Nagash from:04/01/1996 till:05/01/1999 color:Bass\n  bar:Astennu  from:08/01/1997 till:12/31/1999 color:Guitar\n  bar:Mustis from:08/01/1998 till:10/01/2009 color:Keyboards\n  bar:Simen from:05/01/1999 till:10/01/2009 color:Bass\n  bar:Galder from:01/01/2000 till:end color:Guitar\n  bar:Nicholas from:05/01/1999 till:12/31/2004 color:Drums\n  bar:Hellhammer from:01/01/2005 till:12/31/2007 color:Drums\n  bar:Daray from:01/01/2008 till:end color:Drums\n  bar:Gerlioz from:09/01/2010 till:end color:Keyboards\n  bar:Snowy from:02/01/2010 till:08/25/2010 color:Bass\n  bar:Cyrus from:09/01/2010 till:end color:Bass\n  width:3 textcolor:black align:left anchor:from shift:(10,-4)\n  bar:Silenoz from:01/01/1993 till:10/01/1995 color:Lead\n  bar:Shagrath from:04/01/1995 till:08/04/1997 color:Lead\n  bar:Simen from:05/10/1999 till:10/01/2009 color:Lead\n  bar:Snowy from:02/01/2010 till:08/25/2010 color:Lead\n  bar:Shagrath from:02/01/2010 till:08/25/2010 color:Keyboards. Dimmu Borgir. http://en.wikipedia.org/?curid=8631."
  }
}
