{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8594",
  "eid" : "e918dd50-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778470821,
  "textBody" : "The stab-in-the-back myth (,)Despite the similarity of the German word Legende and the English word \"legend\", \"stab-in-the-back myth\" is the preferred term in English. was the notion, widely believed and promulgated in right-wing circles in Germany after 1918, that the German Army did not lose World War I on the battlefield but was instead betrayed by the civilians on the home front, especially the republicans who overthrew the monarchy in the German Revolution of 1918–19. Advocates denounced the German government leaders who signed the Armistice on November 11, 1918, as the \"November Criminals\" ().\n\nWhen the Nazis came to power in 1933, they made the legend an integral part of their official history of the 1920s, portraying the Weimar Republic as the work of the \"November criminals\" who used the stab in the back myth to seize power while betraying the nation. The Nazi propaganda depicted Weimar as \"a morass of corruption, degeneracy, national humiliation, ruthless persecution of the honest 'national opposition'—fourteen years of rule by Jews, Marxists, and 'cultural Bolsheviks', who had at last been swept away by the National Socialist movement under Adolf Hitler and the victory of the 'national revolution' of 1933\".\n\nScholars inside and outside Germany unanimously reject the notion, pointing out the German army was out of reserves and was being overwhelmed in late 1918.  To many Germans, the expression \"stab in the back\" was evocative of Richard Wagner's 1876 opera Götterdämmerung, in which Hagen murders his enemy Siegfried with a spear in his back.\n\nOrigins\n\nIn the later part of the war, Germany was essentially a military dictatorship, with the Supreme High Command (German: OHL, \"Oberste Heeresleitung\") and General Field Marshal Paul von Hindenburg as commander-in-chief advising the Kaiser. After the last German offensive on the Western Front failed in 1918, the war effort was doomed. In response, by autumn, OHL arranged for a rapid change to a civilian government. General Erich Ludendorff, Germany's Chief of Staff, said:\n\nI have asked His Excellency to now bring those circles to power which we have to thank for coming so far. We will therefore now bring those gentlemen into the ministries. They can now make the peace which has to be made. They can eat the broth which they have prepared for us!Nebelin, Manfred: Ludendorff: Diktator im Ersten Weltkrieg, Munich: Siedler Verlag—Verlagsgruppe Random House, 2011\n\nAs the military situation for the Germans on the Western Front became ever more precarious, Prince Maximilian of Baden reached out to the American President Woodrow Wilson, indicating that Germany was willing to accept his Fourteen Points.  \nOn November 11, 1918, the representatives of the newly formed Weimar Republic signed an armistice with the Allies which would end World War I. The subsequent Treaty of Versailles led to further territorial and financial losses. As the Kaiser had been forced to abdicate and the military relinquished executive power, it was the temporary \"civilian government\" that sued for peace—the signature on the armistice document was of Matthias Erzberger, a civilian, who was later murdered for his alleged treason; this led to the signing of the Treaty of Versailles.\n\nThe official birth of the term \"stab-in-the-back\" itself possibly can be dated to the autumn of 1919, when Ludendorff was dining with the head of the British Military Mission in Berlin, British general Sir Neill Malcolm. Malcolm asked Ludendorff why it was that he thought Germany lost the war. Ludendorff replied with his list of excuses, including that the home front failed the army.\n\nMalcolm asked him: \"Do you mean, General, that you were stabbed in the back?\" Ludendorff's eyes lit up and he leapt upon the phrase like a dog on a bone. \"Stabbed in the back?\" he repeated. \"Yes, that's it, exactly, we were stabbed in the back\". And thus was born a legend which has never entirely perished.\n\nThe phrase was to Ludendorff's liking, and he let it be known among the general staff that this was the \"official\" version, and so it was disseminated throughout German society. This was picked up by right-wing political factions and used as a form of attack against the SPD-led early Weimar government, which had come to power in the German Revolution of November 1918.\n\nThe reviews in the German press that grossly misrepresented General Frederick Barton Maurice's book, The Last Four Months, also contributed to the creation of this myth. \"Ludendorff made use of the reviews to convince Hindenburg.\"Shirer, William L., The Rise and fall of the Third Reich, Simon and Schuster (1960) p. 31\n\nIn 1919, Deutschvölkischer Schutz und Trutzbund leader Alfred Roth, writing under the pseudonym Otto Arnim, published the book The Jew in the Army which he said was based on evidence gathered during his participation on the Judenzählung, a military census which had in fact shown that German Jews had served in the front lines proportionately to their numbers. Roth's work claimed that most Jews involved in the war were only taking part as profiteers and spies, while he also blamed Jewish officers for fostering a defeatist mentality which impacted negatively on their soldiers. As such, the book offered one of the earliest published versions of the stab-in-the-back legend.\n\nIn November 1919, the newly elected Weimar National Assembly initiated a Untersuchungsausschuß für Schuldfragen to investigate the causes of the World War and Germany's defeat. On November 18, von Hindenburg testified in front of this parliamentary commission, and cited a December 17, 1918 Neue Zürcher Zeitung article that summarized two earlier articles in the Daily Mail by British General Frederick Barton Maurice with the phrase that the German army had been \"dagger-stabbed from behind by the civilian populace\" (von der Zivilbevölkerung von hinten erdolcht). Maurice later disavowed having used the term himself. It was particularly this testimony of Hindenburg that led to the widespread Dolchstoßlegende in post-World War I Germany.\n\nRichard Steigmann-Gall says that the stab-in-the-back legend traces back to a sermon preached on February 3, 1918, by Protestant Court Chaplain Bruno Doehring, nine months before the war had even ended. German scholar Boris Barth, in contrast to Steigmann-Gall, implies that Doehring did not actually use the term, but spoke only of 'betrayal'. Barth says Doehring was an army chaplain, not a court chaplain. The following references to Barth are on pages 148 (Müller-Meiningen), and 324 (NZZ article, with a discussion of the Ludendorff-Malcolm conversation). Barth traces the first documented use to a centrist political meeting in the Munich Löwenbräu-Keller on November 2, 1918, in which , a member of the Progressive coalition in the Reichstag, used the term to exhort his listeners to keep fighting:\n\nAs long as the front holds, we damned well have the duty to hold out in the homeland. We would have to be ashamed of ourselves in front of our children and grandchildren if we attacked the battle front from the rear and gave it a dagger-stab. (wenn wir der Front in den Rücken fielen und ihr den Dolchstoß versetzten.)\n\nBarth also shows that the term was primarily popularized by the patriotic German newspaper Deutsche Tageszeitung that repeatedly quoted the Neue Zürcher article after Hindenburg had referred to it in front of the parliamentary inquiry commission.\n\nCharges of a Jewish conspiratorial element in Germany's defeat drew heavily upon figures like Kurt Eisner, a Berlin-born German Jew who lived in Munich. He had written about the illegal nature of the war from 1916 onward, and he also had a large hand in the Munich revolution until he was assassinated in February 1919. The Weimar Republic under Friedrich Ebert violently suppressed workers' uprisings with the help of Gustav Noske and Reichswehr General Groener, and tolerated the paramilitary Freikorps forming all across Germany. In spite of such tolerance, the Republic's legitimacy was constantly attacked with claims such as the stab-in-the-back. Many of its representatives such as Matthias Erzberger and Walther Rathenau were assassinated, and the leaders were branded as \"criminals\" and Jews by the right-wing press dominated by Alfred Hugenberg.\n\nThe noted German historian Friedrich Meinecke attempted to trace the roots of the expression in a June 11, 1922 article in the Viennese newspaper Neue Freie Presse. In the 1924 national election, the Munich cultural journal Süddeutsche Monatshefte published a series of articles blaming the SPD and trade unions for Germany's defeat in World War I, which came out during the trial of Adolf Hitler and Ludendorff for high treason following the Beer Hall Putsch in 1923. The editor of an SPD newspaper sued the journal for defamation, giving rise to what is known as the Munich Dolchstoßprozess from October 19 to November 20, 1925. Many prominent figures testified in that trial, including members of the parliamentary committee investigating the reasons for the defeat, so some of its results were made public long before the publication of the committee report in 1928.\n\nThe Dolchstoß was a central image in propaganda produced by the many right-wing and traditionally conservative political parties that sprang up in the early days of the Weimar Republic, including Hitler's NSDAP. For Hitler himself, this explanatory model for World War I was of crucial personal importance. He had learned of Germany's defeat while being treated for temporary blindness following a gas attack on the front. In Mein Kampf, he described a vision at this time which drove him to enter politics. Throughout his career, he railed against the \"November criminals\" of 1918, who had stabbed the German Army in the back.\n\nEven provisional President Friedrich Ebert contributed to the myth when he saluted returning veterans with the oration that \"no enemy has vanquished you\" (kein Feind hat euch überwunden!) and \"they returned undefeated from the battlefield\" (sie sind vom Schlachtfeld unbesiegt zurückgekehrt) on November 10, 1918. The latter quote was shortened to im Felde unbesiegt (\"undefeated on the battlefield\") as a semi-official slogan of the Reichswehr. Ebert had meant these sayings as a tribute to the German soldier, but it only contributed to the prevailing feeling.\n\nA version of the stab-in-the-back myth was publicized in 1922 by German anti-Semitic theorist Alfred Rosenberg in his primary contribution to Nazi theory on Zionism, Der Staatsfeindliche Zionismus (\"Zionism, the Enemy of the State\"). Rosenberg accused German Zionists of working for a German defeat and supporting Britain and the implementation of the Balfour Declaration.\n\nAftermath\n\nThe theme of stab-in-the-back was articulated in 1919 most prominently by General Erich Ludendorff, one of the two top German commanders. He blamed the Berlin government and the civilian population for the armistice/surrender of November 1918, saying they had failed to support him, had let him down, and had proved themselves unworthy of the traditions of a fighting nation. He popularized the Dolchstoß terminology, and became a prominent right-wing leader in the 1920s.\n\nPost-war reactions and reflections\n\nConservatives, nationalists and ex-military leaders began to speak critically about the peace and Weimar politicians, socialists, communists, Jews, and sometimes even Catholics were viewed with suspicion due to presumed extra-national loyalties. It was claimed that they had not supported the war and had played a role in selling out Germany to its enemies. These November Criminals, or those who seemed to benefit from the newly formed Weimar Republic, were seen to have \"stabbed them in the back\" on the home front, by either criticizing German nationalism, instigating unrest and strikes in the critical military industries or profiteering. In essence, the accusation was that the accused committed treason against the \"benevolent and righteous\" common cause. These theories were given credence by the fact that when Germany surrendered in November 1918, its armies were still in French and Belgian territory, Berlin remained 450 miles from the nearest front, and the German armies retired from the field of battle in good order.\n\nThe Allies had been amply resupplied by the United States, which also had fresh armies ready for combat, but the UK and France were too war-weary to contemplate an invasion of Germany with its unknown consequences.Simonds, Frank Herbert, History of the World War, Volume 2, Doubleday (1919) p.85 On the Western Front, although the Hindenburg Line had been penetrated and German forces were in retreat, the Allied army had not reached the western German frontier, and on the Eastern Front, Germany had already won the war against Russia, concluded with the Treaty of Brest-Litovsk. In the West, Germany had had successes with the Spring Offensive. Contributing to the Dolchstoßlegende, its failure was blamed on strikes in the arms industry at a critical moment of the offensive, leaving soldiers without an adequate supply of materiel. The strikes were seen to be instigated by treasonous elements, with the Jews taking most of the blame.\n\nThe weakness of Germany's strategic position was exacerbated by the rapid collapse of the other Central Powers in late 1918, following Allied victories on the Macedonian and Italian fronts. Bulgaria was the first to sign an armistice on September 29, 1918, at Saloniki. On October 30 the Ottoman Empire capitulated at Mudros.  On November 3 Austria-Hungary sent a flag of truce to ask for an Armistice. The terms, arranged by telegraph with the Allied Authorities in Paris, were communicated to the Austrian commander and accepted. The Armistice with Austria-Hungary was signed in the Villa Giusti, near Padua, on November 3. Austria and Hungary signed separate treaties following the collapse of the Austro-Hungarian empire.\n\nNevertheless, the idea of domestic betrayal resonated among its audience, and its claims would provide some basis for public support for the emerging National Socialist Party, under an autocratic and chauvinistic form of nationalism. Anti-Jewish sentiment was intensified by the Bavarian Soviet Republic, a Communist government which ruled the city of Munich for two weeks before being crushed by the Freikorps militia. Many of the Bavarian Soviet Republic's leaders were Jewish, allowing anti-Jewish propagandists to connect Jews with Communism (and thus treason).\n\nRichard M. Hunt argues in his 1958 article that the myth was an irrational belief which commanded the force of irrefutable emotional convictions for millions of Germans. He suggests that behind these myths was a sense of communal shame, not for causing the war, but for losing it. Hunt argues that it was not the guilt of wickedness, but the shame of weakness that seized Germany's national psychology, and \"served as a solvent of the Weimar democracy and also as an ideological cement of Hitler's dictatorship\".\n\nSecond World War\n\nThe Allied policy of unconditional surrender was devised in 1943 in part to avoid a repetition of the stab-in-the-back theme. According to historian John Wheeler-Bennett, speaking from the British perspective,It was necessary for the Nazi régime and/or the German Generals to surrender unconditionally in order to bring home to the German people that they had lost the War by themselves; so that their defeat should not be attributed to a \"stab in the back\".\n\nEquivalents in other countries\n\nParallel interpretations of national trauma after military defeat appear in other countries.Jenny Macleod,  ed., Defeat and Memory: Cultural Histories of Military Defeat since 1815 (2008). For example, it was used regarding the United States in the Vietnam War, without the anti-Semitic slant.Jeffrey P. Kimball, \"The Stab-in-the-back Legend and the Vietnam War.\" Armed Forces & Society 14#3 (1988): 433-458. The song The Battle-Hymn of Lieutenant Calley claims that \"While we're fighting in the jungles they were marching in the street. / While we're dying in the rice fields they were helping our defeat. / While we're facing V.C. bullets they were sounding a retreat\". See also Vietnam Syndrome.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Stab-in-the-back myth" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8594" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The stab-in-the-back myth (,)Despite the similarity of the German word Legende and the English word \"legend\", \"stab-in-the-back myth\" is the preferred term in English. was the notion, widely believed and promulgated in right-wing circles in Germany after 1918, that the German Army did not lose World War I on the battlefield but was instead betrayed by the civilians on the home front, especially the republicans who overthrew the monarchy in the German Revolution of 1918–19. Advocates denounced the German government leaders who signed the Armistice on November 11, 1918, as the \"November Criminals\" ().\n\nWhen the Nazis came to power in 1933, they made the legend an integral part of their official history of the 1920s, portraying the Weimar Republic as the work of the \"November criminals\" who used the stab in the back myth to seize power while betraying the nation. The Nazi propaganda depicted Weimar as \"a morass of corruption, degeneracy, national humiliation, ruthless persecution of the honest 'national opposition'—fourteen years of rule by Jews, Marxists, and 'cultural Bolsheviks', who had at last been swept away by the National Socialist movement under Adolf Hitler and the victory of the 'national revolution' of 1933\".\n\nScholars inside and outside Germany unanimously reject the notion, pointing out the German army was out of reserves and was being overwhelmed in late 1918.  To many Germans, the expression \"stab in the back\" was evocative of Richard Wagner's 1876 opera Götterdämmerung, in which Hagen murders his enemy Siegfried with a spear in his back.\n\nOrigins\n\nIn the later part of the war, Germany was essentially a military dictatorship, with the Supreme High Command (German: OHL, \"Oberste Heeresleitung\") and General Field Marshal Paul von Hindenburg as commander-in-chief advising the Kaiser. After the last German offensive on the Western Front failed in 1918, the war effort was doomed. In response, by autumn, OHL arranged for a rapid change to a civilian government. General Erich Ludendorff, Germany's Chief of Staff, said:\n\nI have asked His Excellency to now bring those circles to power which we have to thank for coming so far. We will therefore now bring those gentlemen into the ministries. They can now make the peace which has to be made. They can eat the broth which they have prepared for us!Nebelin, Manfred: Ludendorff: Diktator im Ersten Weltkrieg, Munich: Siedler Verlag—Verlagsgruppe Random House, 2011\n\nAs the military situation for the Germans on the Western Front became ever more precarious, Prince Maximilian of Baden reached out to the American President Woodrow Wilson, indicating that Germany was willing to accept his Fourteen Points.  \nOn November 11, 1918, the representatives of the newly formed Weimar Republic signed an armistice with the Allies which would end World War I. The subsequent Treaty of Versailles led to further territorial and financial losses. As the Kaiser had been forced to abdicate and the military relinquished executive power, it was the temporary \"civilian government\" that sued for peace—the signature on the armistice document was of Matthias Erzberger, a civilian, who was later murdered for his alleged treason; this led to the signing of the Treaty of Versailles.\n\nThe official birth of the term \"stab-in-the-back\" itself possibly can be dated to the autumn of 1919, when Ludendorff was dining with the head of the British Military Mission in Berlin, British general Sir Neill Malcolm. Malcolm asked Ludendorff why it was that he thought Germany lost the war. Ludendorff replied with his list of excuses, including that the home front failed the army.\n\nMalcolm asked him: \"Do you mean, General, that you were stabbed in the back?\" Ludendorff's eyes lit up and he leapt upon the phrase like a dog on a bone. \"Stabbed in the back?\" he repeated. \"Yes, that's it, exactly, we were stabbed in the back\". And thus was born a legend which has never entirely perished.\n\nThe phrase was to Ludendorff's liking, and he let it be known among the general staff that this was the \"official\" version, and so it was disseminated throughout German society. This was picked up by right-wing political factions and used as a form of attack against the SPD-led early Weimar government, which had come to power in the German Revolution of November 1918.\n\nThe reviews in the German press that grossly misrepresented General Frederick Barton Maurice's book, The Last Four Months, also contributed to the creation of this myth. \"Ludendorff made use of the reviews to convince Hindenburg.\"Shirer, William L., The Rise and fall of the Third Reich, Simon and Schuster (1960) p. 31\n\nIn 1919, Deutschvölkischer Schutz und Trutzbund leader Alfred Roth, writing under the pseudonym Otto Arnim, published the book The Jew in the Army which he said was based on evidence gathered during his participation on the Judenzählung, a military census which had in fact shown that German Jews had served in the front lines proportionately to their numbers. Roth's work claimed that most Jews involved in the war were only taking part as profiteers and spies, while he also blamed Jewish officers for fostering a defeatist mentality which impacted negatively on their soldiers. As such, the book offered one of the earliest published versions of the stab-in-the-back legend.\n\nIn November 1919, the newly elected Weimar National Assembly initiated a Untersuchungsausschuß für Schuldfragen to investigate the causes of the World War and Germany's defeat. On November 18, von Hindenburg testified in front of this parliamentary commission, and cited a December 17, 1918 Neue Zürcher Zeitung article that summarized two earlier articles in the Daily Mail by British General Frederick Barton Maurice with the phrase that the German army had been \"dagger-stabbed from behind by the civilian populace\" (von der Zivilbevölkerung von hinten erdolcht). Maurice later disavowed having used the term himself. It was particularly this testimony of Hindenburg that led to the widespread Dolchstoßlegende in post-World War I Germany.\n\nRichard Steigmann-Gall says that the stab-in-the-back legend traces back to a sermon preached on February 3, 1918, by Protestant Court Chaplain Bruno Doehring, nine months before the war had even ended. German scholar Boris Barth, in contrast to Steigmann-Gall, implies that Doehring did not actually use the term, but spoke only of 'betrayal'. Barth says Doehring was an army chaplain, not a court chaplain. The following references to Barth are on pages 148 (Müller-Meiningen), and 324 (NZZ article, with a discussion of the Ludendorff-Malcolm conversation). Barth traces the first documented use to a centrist political meeting in the Munich Löwenbräu-Keller on November 2, 1918, in which , a member of the Progressive coalition in the Reichstag, used the term to exhort his listeners to keep fighting:\n\nAs long as the front holds, we damned well have the duty to hold out in the homeland. We would have to be ashamed of ourselves in front of our children and grandchildren if we attacked the battle front from the rear and gave it a dagger-stab. (wenn wir der Front in den Rücken fielen und ihr den Dolchstoß versetzten.)\n\nBarth also shows that the term was primarily popularized by the patriotic German newspaper Deutsche Tageszeitung that repeatedly quoted the Neue Zürcher article after Hindenburg had referred to it in front of the parliamentary inquiry commission.\n\nCharges of a Jewish conspiratorial element in Germany's defeat drew heavily upon figures like Kurt Eisner, a Berlin-born German Jew who lived in Munich. He had written about the illegal nature of the war from 1916 onward, and he also had a large hand in the Munich revolution until he was assassinated in February 1919. The Weimar Republic under Friedrich Ebert violently suppressed workers' uprisings with the help of Gustav Noske and Reichswehr General Groener, and tolerated the paramilitary Freikorps forming all across Germany. In spite of such tolerance, the Republic's legitimacy was constantly attacked with claims such as the stab-in-the-back. Many of its representatives such as Matthias Erzberger and Walther Rathenau were assassinated, and the leaders were branded as \"criminals\" and Jews by the right-wing press dominated by Alfred Hugenberg.\n\nThe noted German historian Friedrich Meinecke attempted to trace the roots of the expression in a June 11, 1922 article in the Viennese newspaper Neue Freie Presse. In the 1924 national election, the Munich cultural journal Süddeutsche Monatshefte published a series of articles blaming the SPD and trade unions for Germany's defeat in World War I, which came out during the trial of Adolf Hitler and Ludendorff for high treason following the Beer Hall Putsch in 1923. The editor of an SPD newspaper sued the journal for defamation, giving rise to what is known as the Munich Dolchstoßprozess from October 19 to November 20, 1925. Many prominent figures testified in that trial, including members of the parliamentary committee investigating the reasons for the defeat, so some of its results were made public long before the publication of the committee report in 1928.\n\nThe Dolchstoß was a central image in propaganda produced by the many right-wing and traditionally conservative political parties that sprang up in the early days of the Weimar Republic, including Hitler's NSDAP. For Hitler himself, this explanatory model for World War I was of crucial personal importance. He had learned of Germany's defeat while being treated for temporary blindness following a gas attack on the front. In Mein Kampf, he described a vision at this time which drove him to enter politics. Throughout his career, he railed against the \"November criminals\" of 1918, who had stabbed the German Army in the back.\n\nEven provisional President Friedrich Ebert contributed to the myth when he saluted returning veterans with the oration that \"no enemy has vanquished you\" (kein Feind hat euch überwunden!) and \"they returned undefeated from the battlefield\" (sie sind vom Schlachtfeld unbesiegt zurückgekehrt) on November 10, 1918. The latter quote was shortened to im Felde unbesiegt (\"undefeated on the battlefield\") as a semi-official slogan of the Reichswehr. Ebert had meant these sayings as a tribute to the German soldier, but it only contributed to the prevailing feeling.\n\nA version of the stab-in-the-back myth was publicized in 1922 by German anti-Semitic theorist Alfred Rosenberg in his primary contribution to Nazi theory on Zionism, Der Staatsfeindliche Zionismus (\"Zionism, the Enemy of the State\"). Rosenberg accused German Zionists of working for a German defeat and supporting Britain and the implementation of the Balfour Declaration.\n\nAftermath\n\nThe theme of stab-in-the-back was articulated in 1919 most prominently by General Erich Ludendorff, one of the two top German commanders. He blamed the Berlin government and the civilian population for the armistice/surrender of November 1918, saying they had failed to support him, had let him down, and had proved themselves unworthy of the traditions of a fighting nation. He popularized the Dolchstoß terminology, and became a prominent right-wing leader in the 1920s.\n\nPost-war reactions and reflections\n\nConservatives, nationalists and ex-military leaders began to speak critically about the peace and Weimar politicians, socialists, communists, Jews, and sometimes even Catholics were viewed with suspicion due to presumed extra-national loyalties. It was claimed that they had not supported the war and had played a role in selling out Germany to its enemies. These November Criminals, or those who seemed to benefit from the newly formed Weimar Republic, were seen to have \"stabbed them in the back\" on the home front, by either criticizing German nationalism, instigating unrest and strikes in the critical military industries or profiteering. In essence, the accusation was that the accused committed treason against the \"benevolent and righteous\" common cause. These theories were given credence by the fact that when Germany surrendered in November 1918, its armies were still in French and Belgian territory, Berlin remained 450 miles from the nearest front, and the German armies retired from the field of battle in good order.\n\nThe Allies had been amply resupplied by the United States, which also had fresh armies ready for combat, but the UK and France were too war-weary to contemplate an invasion of Germany with its unknown consequences.Simonds, Frank Herbert, History of the World War, Volume 2, Doubleday (1919) p.85 On the Western Front, although the Hindenburg Line had been penetrated and German forces were in retreat, the Allied army had not reached the western German frontier, and on the Eastern Front, Germany had already won the war against Russia, concluded with the Treaty of Brest-Litovsk. In the West, Germany had had successes with the Spring Offensive. Contributing to the Dolchstoßlegende, its failure was blamed on strikes in the arms industry at a critical moment of the offensive, leaving soldiers without an adequate supply of materiel. The strikes were seen to be instigated by treasonous elements, with the Jews taking most of the blame.\n\nThe weakness of Germany's strategic position was exacerbated by the rapid collapse of the other Central Powers in late 1918, following Allied victories on the Macedonian and Italian fronts. Bulgaria was the first to sign an armistice on September 29, 1918, at Saloniki. On October 30 the Ottoman Empire capitulated at Mudros.  On November 3 Austria-Hungary sent a flag of truce to ask for an Armistice. The terms, arranged by telegraph with the Allied Authorities in Paris, were communicated to the Austrian commander and accepted. The Armistice with Austria-Hungary was signed in the Villa Giusti, near Padua, on November 3. Austria and Hungary signed separate treaties following the collapse of the Austro-Hungarian empire.\n\nNevertheless, the idea of domestic betrayal resonated among its audience, and its claims would provide some basis for public support for the emerging National Socialist Party, under an autocratic and chauvinistic form of nationalism. Anti-Jewish sentiment was intensified by the Bavarian Soviet Republic, a Communist government which ruled the city of Munich for two weeks before being crushed by the Freikorps militia. Many of the Bavarian Soviet Republic's leaders were Jewish, allowing anti-Jewish propagandists to connect Jews with Communism (and thus treason).\n\nRichard M. Hunt argues in his 1958 article that the myth was an irrational belief which commanded the force of irrefutable emotional convictions for millions of Germans. He suggests that behind these myths was a sense of communal shame, not for causing the war, but for losing it. Hunt argues that it was not the guilt of wickedness, but the shame of weakness that seized Germany's national psychology, and \"served as a solvent of the Weimar democracy and also as an ideological cement of Hitler's dictatorship\".\n\nSecond World War\n\nThe Allied policy of unconditional surrender was devised in 1943 in part to avoid a repetition of the stab-in-the-back theme. According to historian John Wheeler-Bennett, speaking from the British perspective,It was necessary for the Nazi régime and/or the German Generals to surrender unconditionally in order to bring home to the German people that they had lost the War by themselves; so that their defeat should not be attributed to a \"stab in the back\".\n\nEquivalents in other countries\n\nParallel interpretations of national trauma after military defeat appear in other countries.Jenny Macleod,  ed., Defeat and Memory: Cultural Histories of Military Defeat since 1815 (2008). For example, it was used regarding the United States in the Vietnam War, without the anti-Semitic slant.Jeffrey P. Kimball, \"The Stab-in-the-back Legend and the Vietnam War.\" Armed Forces & Society 14#3 (1988): 433-458. The song The Battle-Hymn of Lieutenant Calley claims that \"While we're fighting in the jungles they were marching in the street. / While we're dying in the rice fields they were helping our defeat. / While we're facing V.C. bullets they were sounding a retreat\". See also Vietnam Syndrome. Stab-in-the-back myth. http://en.wikipedia.org/?curid=8594."
  }
}
