{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=4911",
  "eid" : "d13dfdf0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778430799,
  "textBody" : "Basel (; also Basle; ; ; ) is a city in northwestern Switzerland on the river Rhine. Basel is Switzerland's third-most-populous city (after Zürich and Geneva) with about 175,000 inhabitants.\n\nLocated where the Swiss, French and German borders meet, Basel also has suburbs in France and Germany. In 2014, the Basel agglomeration was the third largest in Switzerland with a population of 537,100 in 74 municipalities in Switzerland and an additional 53 in neighboring countries (municipal count as of 2000). The official language of Basel is (the Swiss variety of Standard) German, but the main spoken language is the local variant of the Alemannic Swiss German dialect.\n\nThe city is known for its many internationally renowned museums, ranging from the Kunstmuseum, the first collection of art accessible to the public in Europe (1661) and the largest museum of art in the whole of Switzerland, to the Fondation Beyeler (located in Riehen). \nThe University of Basel, founded in 1460, Switzerland's oldest university and the city's centuries long commitment to humanism, have made Basel a safe haven during times of political unrest in other parts of Europe to the likes of Erasmus of Rotterdam, the Holbein family, and more recently also to Hermann Hesse and Karl Jaspers.\n\nBasel has been the seat of a Prince-Bishopric since the 11th century, and joined the Swiss Confederacy in 1501. \nThe city has been a commercial hub and important cultural centre since the Renaissance, and has emerged as a centre for the chemical and pharmaceutical industry in the 20th century. In 1897 the city was chosen as the location for the first World Zionist Congress by Theodor Herzl, and all together the congress has taken place in Basel for ten times over a time span of fifty years, more than in any other city in the world. The city is also home to the worldwide seat of the Bank for International Settlements.\n\nToday the city of Basel, together with two other Swiss cities Zürich and Geneva, is counted among the cities with the highest standards of living in the entire world.https://www.mercer.com/newsroom/2017-quality-of-living-survey.html\n\nHistory\n\nEarly history \n\nThere are settlement traces on the Rhine knee from the early La Tène period (5th century BC). In the 2nd century BC, there was a village of the Raurici at the site of Basel-Gasfabrik, to the northwest of the Old City, likely identical with the town of Arialbinnum mentioned on the Tabula Peutingeriana.René Teuteberg: Basler Geschichte, p. 49. The unfortified settlement was abandoned in the 1st century BC in favour of an oppidum on the site of Basel Minster, probably in reaction to the Roman invasion of Gaul.\n\nIn Roman Gaul, Augusta Raurica was established some 20 km from Basel as the regional administrative centre, while a castra (castle) was built on the site of the Celtic oppidum. The city of Basel eventually grew around the castle. In AD 83, Basel was incorporated into the Roman province of Germania Superior. Roman control over the area deteriorated in the 3rd century, and Basel became an outpost of the Provincia Maxima Sequanorum formed by Diocletian.\n\nThe Germanic confederation of the Alemanni attempted to cross the Rhine several times in the 4th century, but were repelled, one such event being the Battle of Solicinium (368). However, in the great invasion of AD 406, the Alemanni appear to have crossed the Rhine river a final time, conquering and then settling what is today Alsace and a large part of the Swiss Plateau. From this time, Basel has been an Alemannic settlement.\n\nThe Duchy of Alemannia fell under Frankish rule in the 6th century, and by the 7th century, the former bishopric of Augusta Raurica was re-established as the Bishopric of Basel. Based on the evidence of a third solidus with the inscription Basilia fit, Basel seems to have minted its own coins in the 7th century.[http://www.hmb.ch/en/collection/object/basel-kopie-vom-gold-triens-des-muenzmeisters-gunso-anfangs-7-jh-vs.html Paris, Cabinet des Médailles (copy: HMB Inv. 1981.125.1)] Under bishop Haito, the first cathedral was built on the site of the Roman castle, later replaced by a Romanesque structure consecrated in 1019. At the partition of the Carolingian Empire, Basel was first given to West Francia, but passed to East Francia with the treaty of Meerssen of 870.\n\nThe city was plundered and destroyed by a Magyar invasion of 917. The rebuilt city became part of Upper Burgundy, and as such was incorporated into the Holy Roman Empire in 1032.\n\nPrince-Bishopric of Basel\n\nSince the donation by Rudolph III of Burgundy of the Moutier-Grandval Abbey and all its possessions to Bishop Adalbero II in 999 till the Reformation, Basel was ruled by prince-bishops (see Bishop of Basel,The New Encyclopædia Britannica, Encyclopædia Britannica, 1993, p.659 whose memory is preserved in the crosier shown on the Basel coat-of-arms – see above).\n\nIn 1019, the construction of the cathedral of Basel (known locally as the Münster) began under Henry II, Holy Roman Emperor.Franz Kugler, Kleine Schriften und Studien zur Kunstgeschichte, 1853, p. 486\nIn 1225–1226, a bridge, now known as the Middle Bridge, was constructed by Bishop Heinrich von Thun and Lesser Basel (Kleinbasel) founded as a bridgehead to protect the bridge. The bridge was largely funded by Basel's Jewish community which had settled there a century earlier.Habicht, Peter, Basel - A Center at the Fringe  (Basel: Christoph Merian Verlag, 2006) pp. 43, 55, 70, 79. For many centuries to come Basel possessed the only permanent bridge over the river \"between Lake Constance and the sea\".\n\nThe Bishop also allowed the furriers to establish a guild in 1226. Eventually about 15 guilds were established in the 13th century. They increased the town's, and hence the bishop's, reputation, influence, and income from the taxes and duties on goods in Basel's expanding market.\n\nIn 1347, the plague came to Europe but did not reach Basel until June 1349. The guilds, asserting that the Jews were responsible—several had been tortured and confessed—demanded they be executed, which the Council did in January 1349, except for a few who escaped to Alsace. During the Basel massacre, 600 Jews were murdered. They were shackled inside a wooden barn on an island in the Rhine, which was set afire. The few survivors - young orphans - were forcibly converted to Christianity. The council then forbade Jews in Basel for 200 years, except that their money was helpful in rebuilding after the Basel earthquake of 1356 which destroyed much of the city along with a number of castles in the vicinity. The city offered courts to nobles as an alternative to rebuilding their castles, in exchange for the nobles' military protection of the city.\n\nIn 1412 (or earlier), the well-known guesthouse Zum Goldenen Sternen was established. Basel became the focal point of western Christendom during the 15th century Council of Basel (1431–1449), including the 1439 election of antipope Felix V. In 1459, Pope Pius II endowed the University of Basel where such notables as Erasmus of Rotterdam and Paracelsus later taught. At the same time the new craft of printing was introduced to Basel by apprentices of Johann Gutenberg.\n\nThe Schwabe publishing house was founded in 1488 by Johannes Petri and is the oldest publishing house still in business. Johann Froben also operated his printing house in Basel and was notable for publishing works by Erasmus.Josef Nadler, Literaturgeschichte der deutschen Schweiz, Grethlein 1932 In 1495, Basel was incorporated in the Upper Rhenish Imperial Circle; the Bishop of Basel was added to the Bench of the Ecclesiastical Princes. In 1500 the construction of the Basel Münster was finished. In 1521 so was the bishop. The Council, under the supremacy of the guilds, explained that henceforth they would only give allegiance to the Swiss Confederation, to whom the bishop appealed but in vain.\n\nAs a member state in the Swiss Confederacy\n\nThe city had remained neutral through the Swabian War of 1499 despite being plundered by soldiers on both sides. The Treaty of Basel ended the war and granted the Swiss confederates exemptions from the emperor Maximillian's taxes and jurisdictions, separating Switzerland de facto from the Holy Roman Empire.Rappard, William,  Collective Security in Swiss Experience 1291–1948 (London, 1948) p. 85 ff\n\nOn 9 June 1501, Basel joined the Swiss Confederation as its eleventh canton.Karl Strupp, Wörterbuch Des Völkerrechts, De Gruyter 1960, p.225 It was the only canton that had been asked to join, not the other way round. Basel had a strategic location, good relations with Strasbourg and Mulhouse, and control of the corn imports from Alsace, whereas the Swiss lands were becoming overpopulated and had few resources.  A provision of the Charter accepting Basel required that in conflicts among the other cantons it was to stay neutral and offer its services for mediation.Habicht, Peter, Basel - A Center at the Fringe (Basel 2006) p. 65 ffBonjour, Edgar et al. A short History of Switzerland (Oxford, 1952) p. 139 ff\n\nIn 1503, the new bishop Christoph von Utenheim refused to give Basel a new constitution whereupon, to show its power, the city began the construction of a new city hall.\n\nIn 1529, the city became Protestant under Oecolampadius and the bishop's seat was moved to Porrentruy. The bishop's crook was however retained as the city's coat of arms. For the centuries to come, a handful of wealthy families collectively referred to as the \"Daig\" played a pivotal role in city affairs as they gradually established themselves as a de facto city aristocracy.\n\nThe first edition of Christianae religionis institutio (Institutes of the Christian Religion – John Calvin's great exposition of Calvinist doctrine) was published at Basel in March 1536.Geoffrey Rudolph Elton, Harold Fullard, Henry Clifford Darby, Charles Loch Mowat, The New Cambridge Modern History, 1990, p. 113\n\nIn 1544, Johann von Brugge, a rich Dutch Protestant refugee, was given citizenship and lived respectfully until his death in 1556 then buried with honors. His body was exhumed and burnt at the stake in 1559 after it was discovered that he was the Anabaptist David Joris.\n\nIn 1543, De humani corporis fabrica, the first book on human anatomy, was published and printed in Basel by Andreas Vesalius (1514–1564).The Illustrations from the Works of Andreas Vesalius of Brussels, Courier Dover Publications 1973, p.30\n\nThere are indications Joachim Meyer, author of the influential 16th-century martial arts text Kunst des Fechten (\"The Art of Fencing\"), came from Basel. In 1662 the Amerbaschsches Kabinett was established in Basel as the first public museum of art. Its collection became the core of the later Basel Museum of Art.\n\nThe Bernoulli family, which included important 17th- and 18th-century mathematicians such as Jakob Bernoulli, Johann Bernoulli and Daniel Bernoulli, were from Basel. The 18th-century mathematician Leonhard Euler was born in Basel and studied under Johann Bernoulli.\n\nModern history\n\nIn 1792, the Republic of Rauracia, a revolutionary French client republic, was created. It lasted until 1793.Heinrich Zschokke, Emil Zschokke, The History of Switzerland, for the Swiss People, S. Low, Son & Co. 1855, p.253 After three years of political agitation and a short civil war in 1833 the disadvantaged countryside seceded from the Canton of Basel, forming the half canton of Basel-Landschaft.Heinrich Türler, Marcel Godet, Victor Attinger, Historisch-biographisches Lexikon der Schweiz, 1934, p.307\n\nOn 3 July 1874, Switzerland's first zoo (the Zoo Basel) opened its doors in the south of the city towards Binningen.\n\nIn 1897 the first World Zionist Congress was held in Basel. Altogether the World Zionist Congress took place in Basel for ten times, more than in any other city in the world.\n\nOn 16 November 1938, the psychedelic drug LSD was first synthesized by Swiss chemist Albert Hofmann at Sandoz Laboratories in Basel.\n\nBasel as a historical, international meeting place\n\nBasel has often been the site of peace negotiations and other international meetings. The Treaty of Basel (1499) ended the Swabian War. Two years later Basel joined the Swiss Confederation. The Peace of Basel in 1795 between the French Republic and Prussia and Spain ended the First Coalition against France during the French Revolutionary Wars. In more recent times, the World Zionist Organization held its first congress in Basel from August 29 through August 31, 1897. Because of the Balkan Wars, the Second International held an extraordinary congress at Basel in 1912. In 1989, the Basel Convention was opened for signature with the aim of preventing the export of hazardous waste from wealthy to developing nations for disposal.\n\nName\n\nThe name of Basel is derived from the Roman-era toponym Basilia, first recorded in the 3rd century.\nIt is presumably derived from the personal Greek name Basilius.Basileam applicuerunt (AD 237 or 238). Andres Kristol: Basel BS (Basel Stadt) in: Dictionnaire toponymique des communes suisses – Lexikon der schweizerischen Gemeindenamen – Dizionario toponomastico dei comuni svizzeri (DTS|LSG). Centre de dialectologie, Université de Neuchâtel, Verlag Huber, Frauenfeld/Stuttgart/Wien 2005,  und Éditions Payot, Lausanne 2005, , S. 125. The Old French form Basle was adopted into English, and developed into the modern French Bâle. The Icelandic name Buslaraborg goes back to the 12th century Leiðarvísir og borgarskipan chronicle.\n\nGeography and climate\n\nTopography\n\nBasel has an area, , of . Of this area,  or 4.0% is used for agricultural purposes, while  or 3.7% is forested. Of the rest of the land,  or 86.4% is settled (buildings or roads),  or 6.1% is either rivers or lakes.[http://www.bfs.admin.ch/bfs/portal/de/index/themen/02/03/blank/data/gemeindedaten.html Swiss Federal Statistical Office-Land Use Statistics] 2009 data  accessed 25 March 2010\n\nOf the built up area, industrial buildings made up 10.2% of the total area while housing and buildings made up 40.7% and transportation infrastructure made up 24.0%. Power and water infrastructure as well as other special developed areas made up 2.7% of the area while parks, green belts and sports fields made up 8.9%. Out of the forested land, all of the forested land area is covered with heavy forests. Of the agricultural land, 2.5% is used for growing crops and 1.3% is pastures. All the water in the municipality is flowing water.\n\nClimate\n\nUnder the Köppen climate classification, Basel features a temperate oceanic (Köppen: Cfb) climate.[http://www.weatherbase.com/weather/weather-summary.php3?s590607 Weatherbase] accessed 19 October 2017 The city averages 120.4 days of rain or snow annually and on average receives 842 mm of precipitation. The wettest month is May during which time Basel receives an average of 99 mm of rain. The month with the most days of precipitation is also May, with an average of 12.4 days. The driest month of the year is February with an average of 45 mm of precipitation over 8.4 days.\n\nPolitics\n\nThe city of Basel functions as the capital of the Swiss half-canton of Basel-Stadt, though several of its suburbs are located in the half-canton of Basel-Landschaft or the canton of Aargau. Others are even located in France and Germany.\n\nCanton\n\nThe canton Basel-Stadt consists of three municipalities: Riehen, Bettingen, and the city Basel itself. The political structure and agencies of the city and the canton are identical.\n\nCity\n\nQuarters\n\nThe city itself has 19 quarters:\n\n* Grossbasel (Greater Basel):\n\n1 Altstadt Grossbasel\n2 Vorstädte\n3 Am Ring\n4 Breite\n5 St. Alban\n6 Gundeldingen\n7 Bruderholz\n8 Bachletten\n9 Gotthelf\n10 Iselin\n11 St. Johann\n\n* Kleinbasel (Lesser Basel):\n\n12 Altstadt Kleinbasel\n13 Clara\n14 Wettstein\n15 Hirzbrunnen\n16 Rosental\n17 Matthäus\n18 Klybeck\n19 Kleinhüningen\n\nCoat of arms\n\nThe blazon of the municipal coat of arms is In Silber ein schwarzer Baselstab.[http://www.crwflags.com/fotw/flags/ch-bs001.html Flags of the World.com] accessed 18-April-2011\n\nGovernment\n\nThe canton's executive, the Executive Council (Regierungsrat), consists of seven members for a mandate period of 4 years. They are elected by any inhabitant valid to vote on the same day as the parliament and operates as a collegiate authority. The president () is elected as such by a public election while the heads of the other departments are assigned by the collegiate. Current president is Dr. Guy Morin. The executive body holds its meetings in the red Town Hall (Rathaus) on the central Marktplatz. The building was built in 1504–1514.\n\n, Basel's Executive Council is made up of three representatives of the SP (Social Democratic Party), and one member each of Green Alliance of Basel (GB) (who is the president), FDP (Free Democratic Party), LDP (Liberal-Demokratische Partei of Basel), and CVP (Christian Democratic Party), giving the left parties a combined four out of seven seats. The last election was held on 23 October and 27 November 2016.\n\nBarbara Schüpbach-Guggenbühlis is State Chronicler (Staatsschreiberin) since 2009, and Marco Greiner is Head of Communication (Regierungssprecher) and Vice State Chronicler (Vizestaatsschreiber) since 2007 for the Executive Council.\n\nParliament\n\nThe parliament, the Grand Council of Basel-Stadt (Grosser Rat), consists of 100 seats, with members (called in German: Grossrat/Grossrätin) elected every 4 years. The sessions of the Grand Council are public. Unlike the member of the Executive Council, the members of the Grand Council are not politicians by profession, but they are paid a fee based on their attendance. Any resident of Basel allowed to vote can be elected as a member of the parliament. The legislative body holds its meetings in the red Town Hall (Rathaus).\n\nThe last election was held on 23 October 2016 for the mandate period (Legislatur) of 2017–2021. Currently, the Grand Council consist of 34 members of the Social Democratic Party (SP), 15 members of the Swiss People's Party (SVP), 14 Grünes Bündnis (GB) (a collaboration of the Green Party (GPS), its junior party, and Basels starke Alternative (BastA!)), 10 The Liberals (FDP) and its junior party, the representative of the Aktive Bettingen (AB) is associated to the parliamentary group (Fraktion) of the FDP, 14 Liberal-Demokratische Partei (LDP) and its junior party, 8 (7/1) Christian Democratic People's Party (CVP)/Evangelical People's Party (EVP), and 4 Green Liberal Party (GLP).\n\nThe left parties misses an absolute majority by two seats.\n\nFederal elections\n\nNational Council\n\nOn 18 October 2015, in the federal election the most popular party was the Social Democratic Party (SP) which received two seats with 33.5% of the votes. The next three most popular parties were the FDP (21.4%), the SVP (17.6%), and the Green Party (GPS) (11.2%), each with one seat. In the federal election, a total of 57,304 votes were cast, and the voter turnout was 50.4%.\n\nCouncil of States\n\nOn 18 October 2015, in the federal election State Councilor () Anita Fetz, member of the Social Democratic Party   (SP), was re-elected in the first round as single representative of the canton of Basel-Stadt in the national Council of States (German: Ständerat) with an absolute majority of 35'842 votes. She has been a member of it since 2003.\n\nInternational relations\n\nTwin towns and sister cities\n\nBasel has two sister cities and a twinning among two states:\n\n*  Shanghai, China, since 2007\n*  US State Massachusetts, since 2002\n*  Miami Beach, US, since 2011\n\nDemographics\n\nPopulation\n\nBasel has a population () of .  , 35.5% of the population are resident foreign nationals.  Over the last 10 years (1999–2009 ) the population has changed at a rate of -0.3%. It has changed at a rate of 3.2% due to migration and at a rate of -3% due to births and deaths.[http://www.bfs.admin.ch/bfs/portal/en/index/regionen/02/key.html Swiss Federal Statistical Office]  accessed 18-April-2011\n\nOf the population in the municipality 58,560 or about 35.2% were born in Basel and lived there in 2000. There were 1,396 or 0.8% who were born in the same canton, while 44,874 or 26.9% were born somewhere else in Switzerland, and 53,774 or 32.3% were born outside of Switzerland.\n\nIn  there were 898 live births to Swiss citizens and 621 births to non-Swiss citizens, and in same time span there were 1,732 deaths of Swiss citizens and 175 non-Swiss citizen deaths.  Ignoring immigration and emigration, the population of Swiss citizens decreased by 834 while the foreign population increased by 446.  There were 207 Swiss men and 271 Swiss women who emigrated from Switzerland.  At the same time, there were 1756 non-Swiss men and 1655 non-Swiss women who immigrated from another country to Switzerland.  The total Swiss population change in 2008 (from all sources, including moves across municipal borders) was an increase of 278 and the non-Swiss population increased by 1138 people.  This represents a population growth rate of 0.9%.[http://www.bfs.admin.ch/bfs/portal/de/index/infothek/onlinedb/superweb/login.html Swiss Federal Statistical Office - Superweb database - Gemeinde Statistics 1981-2008]   accessed 19 June 2010\n\n, there were 70,502 people who were single and never married in the municipality.  There were 70,517 married individuals, 12,435 widows or widowers and 13,104 individuals who are divorced.[http://www.pxweb.bfs.admin.ch/Database/German_40%20-%20Eidgen%C3%B6ssische%20Volksz%C3%A4hlung/40.3%20-%202000/40.3%20-%202000.asp?lang\n1&prod40&secprod\n3&openChild=true STAT-TAB Datenwürfel für Thema 40.3 - 2000]    accessed 2 February 2011\n\n the average number of residents per living room was 0.59 which is about equal to the cantonal average of 0.58 per room. In this case, a room is defined as space of a housing unit of at least 4 m2 as normal bedrooms, dining rooms, living rooms, kitchens and habitable cellars and attics. About 10.5% of the total households were owner occupied, or in other words did not pay rent (though they may have a mortgage or a rent-to-own agreement).\n, there were 86,371 private households in the municipality, and an average of 1.8 persons per household.  There were 44,469 households that consist of only one person and 2,842 households with five or more people.  Out of a total of 88,646 households that answered this question, 50.2% were households made up of just one person and there were 451 adults who lived with their parents.  Of the rest of the households, there are 20,472 married couples without children, 14,554 married couples with children There were 4,318 single parents with a child or children.  There were 2,107 households that were made up of unrelated people and 2,275 households that were made up of some sort of institution or another collective housing.\n\n there were 5,747 single family homes (or 30.8% of the total) out of a total of 18,631 inhabited buildings.  There were 7,642 multi-family buildings (41.0%), along with 4,093 multi-purpose buildings that were mostly used for housing (22.0%) and 1,149 other use buildings (commercial or industrial) that also had some housing (6.2%).  Of the single family homes 1090 were built before 1919, while 65 were built between 1990 and 2000.  The greatest number of single family homes (3,474) were built between 1919 and 1945.[http://www.pxweb.bfs.admin.ch/Database/German_09%20-%20Bau-%20und%20Wohnungswesen/09.2%20-%20Geb%C3%A4ude%20und%20Wohnungen/09.2%20-%20Geb%C3%A4ude%20und%20Wohnungen.asp?lang\n1&prod09&secprod\n2&openChild=trueSwiss Federal Statistical Office STAT-TAB - Datenwürfel für Thema 09.2 - Gebäude und Wohnungen]   accessed 28 January 2011\n\n there were 96,640 apartments in the municipality.  The most common apartment size was 3 rooms of which there were 35,958.  There were 11,957 single room apartments and 9,702 apartments with five or more rooms.  Of these apartments, a total of 84,675 apartments (87.6% of the total) were permanently occupied, while 7,916 apartments (8.2%) were seasonally occupied and 4,049 apartments (4.2%) were empty.  , the construction rate of new housing units was 2.6 new units per 1000 residents.\n\n the average price to rent an average apartment in Basel was 1118.60 Swiss francs (CHF) per month (US$890, £500, €720 approx. exchange rate from 2003).  The average rate for a one-room apartment was 602.27 CHF (US$480, £270, €390), a two-room apartment was about 846.52 CHF (US$680, £380, €540), a three-room apartment was about 1054.14 CHF (US$840, £470, €670) and a six or more room apartment cost an average of 2185.24 CHF (US$1750, £980, €1400).  The average apartment price in Basel was 100.2% of the national average of 1116 CHF.[http://www.bfs.admin.ch/bfs/portal/de/index/themen/05/06/blank/key/einfuehrung.html Swiss Federal Statistical Office-Rental prices] 2003 data  accessed 26 May 2010  The vacancy rate for the municipality, , was 0.74%.\n\nHistorical population\n\nLanguage\n\nMost of the population () speaks German (129,592 or 77.8%), with Italian being second most common (9,049 or 5.4%) and French being third (4,280 or 2.6%). There are 202 persons who speak Romansh.\n\nReligion\n\nFrom the , 41,916 or 25.2% were Roman Catholic, while 39,180 or 23.5% belonged to the Swiss Reformed Church. Of the rest of the population, there were 4,567 members of an Orthodox church (or about 2.74% of the population), there were 459 individuals (or about 0.28% of the population) who belonged to the Christian Catholic Church, and there were 3,464 individuals (or about 2.08% of the population) who belonged to another Christian church. There were 12,368 individuals (or about 7.43% of the population) who were Islamic. There were 1,325 individuals (or about 0.80% of the population) who were Jewish, however only members of religious institutions are counted as such by the municipality, which makes the actual number of people of Jewish descent living in Basel considerably higher. There were 746 individuals who were Buddhist, 947 individuals who were Hindu and 485 individuals who belonged to another church. 52,321 (or about 31.41% of the population) belonged to no church, are agnostic or atheist, and 8,780 individuals (or about 5.27% of the population) did not answer the question.\n\nInfrastructure\n\nQuarters\n\nBasel is subdivided into 19 quarters (Quartiere). The municipalities of Riehen and Bettingen, outside the city limits of Basel, are included in the canton of Basel-Stadt as rural quarters (Landquartiere).\n\nTransport\n\nBasel's airport is set up for airfreight; heavy goods reach the city and the heart of continental Europe from the North Sea by ship along the Rhine. The main European routes for the highway and railway transport of freight cross in Basel. The outstanding location benefits logistics corporations, which operate globally from Basel. Trading firms are traditionally well represented in the Basel Region.\n\nPort\n\nBasel has Switzerland's only cargo port, through which goods pass along the navigable stretches of the Rhine and connect to ocean-going ships at the port of Rotterdam.\n\nAir transport\n\nEuroAirport Basel Mulhouse Freiburg is operated jointly by two countries, France and Switzerland, although the airport is located completely on French soil. The airport itself is split into two architecturally independent sectors, one half serving the French side and the other half serving the Swiss side; prior to Schengen there was an immigration inspection point at the middle of the airport so that people could \"emigrate\" to the other side of the airport.\n\nRailways\n\nBasel has long held an important place as a rail hub. Three railway stations — those of the German, French and Swiss networks — lie within the city (although the Swiss (Basel SBB) and French (Bâle SNCF) stations are actually in the same complex, separated by Customs and Immigration facilities). Basel Badischer Bahnhof is on the opposite side of the city. Basel's local rail services are supplied by the Basel Regional S-Bahn. The largest goods railway complex of the country  is located just outside the city, spanning the municipalities of Muttenz and Pratteln. The new highspeed ICE railway line from Karlsruhe to Basel was completed in 2008 while phase I of the TGV Rhin-Rhône line, opened in December 2011, has reduced travel time from Basel to Paris to about 3 hours.[http://www.infolignes.com/recherche.php?date_num_train2012|05|14&type_heure\n1&train_horaire_depart14|00&next_horaire\n14|00&num_train=9218 SNCF website, TGV Lyria 9218] accessed 14 May 2012\n\nRoads\n\nBasel is located on the A3 motorway.\n\nWithin the city limits, five bridges connect Greater and Lesser Basel (downstream):\n\n* Schwarzwaldbrücke (built 1972)\n* Wettsteinbrücke (current structure built 1998, original bridge built 1879)\n* Mittlere Rheinbrücke (current structure built 1905, original bridge built 1225 as the first bridge to cross the Rhine River)\n* Johanniterbrücke (built 1967)\n* Dreirosenbrücke (built 2004, original bridge built 1935)\n\nFerries\n\nA somewhat anachronistic yet still widely used system of reaction ferry boats links the two shores. There are four ferries, each situated approximately midway between two bridges. Each is attached by a cable to a block that rides along another cable spanning the river at a height of 20 or 30 metres. To cross the river, the ferryman orients the boat around 45° from the current so that the current pushes the boat across the river. This form of transportation is therefore completely hydraulically driven, requiring no outside energy source.\n[http://www.faehri.ch]\n\nPublic transport\n\nBasel has an extensive public transportation network serving the city and connecting to surrounding suburbs, including a large tram network. The green-colored local trams and buses are operated by the Basler Verkehrs-Betriebe (BVB). The yellow-colored buses and trams are operated by the Baselland Transport (BLT), and connect areas in the nearby half-canton of Baselland to central Basel. The BVB also shares commuter bus lines in cooperation with transit authorities in the neighboring Alsace region in France and Baden region in Germany. The Basel Regional S-Bahn, the commuter rail network connecting to suburbs surrounding the city, is jointly operated by SBB, SNCF and DB.\n\nBorder crossings\n\nBasel is located at the meeting point of France, Germany and Switzerland; because it is so near other countries and is beyond the Jura Mountains, many within the Swiss military reportedly believe that the city is indefensible during wartime. It has numerous road and rail crossings between Switzerland and the other two countries. With Switzerland joining the Schengen Area on 12 December 2008, immigration checks were no longer carried out at the crossings. However, Switzerland did not join the European Union Customs Union (though it did join the EU Single Market) and customs checks are still conducted at or near the crossings.\n\nFrance-Switzerland (from east to west) \n* Road crossings (with French road name continuation)\n** Kohlenstrasse (Avenue de Bâle, Huningue). This crossing replaces the former crossing Hüningerstrasse further east.\n** Elsässerstrasse (Avenue de Bâle, Saint-Louis)\n** Autobahn A3 (A35 autoroute, Saint-Louis)\n** EuroAirport Basel-Mulhouse-Freiburg – pedestrian walkway between the French and Swiss sections on Level 3 (departures) of airport.\n** Burgfelderstrasse (Rue du 1er Mars, Saint Louis)\n* Railway crossing\n** Basel SBB railway station\n\nGermany-Switzerland (clockwise, from north to south)\n* Road crossings (with German road name continuation)\n** Hiltalingerstrasse (Zollstraße, Weil am Rhein). Tram 8 goes along this road to Weil am Rhein. The extension opened in 2014; it used to end before the border.[http://www.tram8.info Tram 8 construction information page] \n** Autobahn A2 (Autobahn A5, Weil am Rhein)\n** Freiburgerstrasse (Baslerstraße, Weil am Rhein)\n** Weilstrasse, Riehen (Haupstraße, Weil am Rhein)\n** Lörracherstrasse, Riehen (Baslerstraße, Stetten, Lörrach)\n** Inzlingerstrasse, Riehen (Riehenstraße, Inzlingen)\n** Grenzacherstrasse (Hörnle, Grenzach-Wyhlen)\n* Railway crossing\n** Between Basel SBB and Basel Badischer Bahnhof – Basel Badischer Bahnhof, and all other railway property and stations on the right bank of the Rhine belong to DB and are classed as German customs territory. Immigration and customs checks are conducted at the platform exit tunnel for passengers leaving trains here.\n\nAdditionally there are many footpaths and cycle tracks crossing the border between Basel and Germany.\n\nHealth\n\nAs the biggest town in the Northwest of Switzerland numerous public and private health centres are located in Basel. Among others the Universitätsspital Basel as well as the Universitätskinderspital Basel. The anthroposophical health institute Klinik-Arlesheim (formerly known as Lukas-Klinik and Ita-Wegman-Klinik) are both located in the Basel area as well. Private health centres include the Bethesda Spital and the Merian Iselin Klinik. Additionally the Swiss Tropical and Public Health Institute is located in Basel too.  \n\nEnergy\n\nBasel is at the forefront of a national vision to more than halve energy use in Switzerland by 2050. In order to research, develop and commercialise the technologies and techniques required for the country to become a '2000 Watt society', a number of projects have been set up since 2001 in the Basel metropolitan area. These including demonstration buildings constructed to MINERGIE or Passivhaus standards, electricity generation from renewable energy sources, and vehicles using natural gas, hydrogen and biogas.[http://www.basel.ch/en/basel/urban_development/2000_watt_society The Basel pilot region of the 2000 Watt Society]  \nA building construction law was passed in 2002 also which stated that all new flat roofs must be greened leading to Basel becoming the world’s leading green roof city. This was driven by an energy saving programme. Carter, J.G. 2011, \"Climate change adaptation in European cities\", Current Opinion in Environmental Sustainability, vol. 3, no. 3, pp. 193-198.\n\nA hot dry rock geothermal energy project was cancelled in 2009 since it caused induced seismicity in Basel.\n\nEconomy\n\nThe city of Basel, located in the heart of the tri-border region (called Dreiländereck) is one of the most dynamic economic regions of Switzerland.\n\n, Basel had an unemployment rate of 3.7%. , there were 18 people employed in the primary economic sector and about 9 businesses involved in this sector.  34,645 people were employed in the secondary sector and there were 1,176 businesses in this sector.  120,130 people were employed in the tertiary sector, with 8,908 businesses in this sector.  There were 82,449 residents of the municipality who were employed in some capacity, of which females made up 46.2% of the workforce.\n\n the total number of full-time equivalent jobs was 130,988. The number of jobs in the primary sector was 13, of which 10 were in agriculture and 4 were in forestry or lumber production.  The number of jobs in the secondary sector was 33,171 of which 24,848 or (74.9%) were in manufacturing, 10 were in mining and 7,313 (22.0%) were in construction.  The number of jobs in the tertiary sector was 97,804. In the tertiary sector; 12,880 or 13.2% were in wholesale or retail sales or the repair of motor vehicles, 11,959 or 12.2% were in the movement and storage of goods, 6,120 or 6.3% were in a hotel or restaurant, 4,186 or 4.3% were in the information industry, 10,752 or 11.0% were the insurance or financial industry, 13,695 or 14.0% were technical professionals or scientists, 6,983 or 7.1% were in education and 16,060 or 16.4% were in health care.[http://www.pxweb.bfs.admin.ch/Database/German_06%20-%20Industrie%20und%20Dienstleistungen/06.2%20-%20Unternehmen/06.2%20-%20Unternehmen.asp?lang1&prod\n06&secprod2&openChild\ntrue Swiss Federal Statistical Office STAT-TAB Betriebszählung: Arbeitsstätten nach Gemeinde und NOGA 2008 (Abschnitte), Sektoren 1-3]   accessed 28 January 2011\n\n, there were 121,842 workers who commuted into the municipality and 19,263 workers who commuted away.  The municipality is a net importer of workers, with about 6.3 workers entering the municipality for every one leaving.  About 23.9% of the workforce coming into Basel are coming from outside Switzerland, while 1.0% of the locals commute out of Switzerland for work.[https://archive.is/20120804043150/http://www.media-stat.admin.ch/stat/pendler/pop.php Swiss Federal Statistical Office - Statweb]  accessed 24 June 2010  Of the working population, 49.2% used public transportation to get to work, and 18.7% used a private car.\n\nThe Roche Tower, designed by Herzog & de Meuron is 41 floors and 178 m high, upon its opening in 2015 it has become the tallest building in Switzerland. Basel has also Switzerland's third tallest building (Basler Messeturm, 105 m) and Switzerland's tallest tower (St. Chrischona TV tower, 250 m).\n\nChemical industry\n\nThe Swiss chemical industry operates largely from Basel, and Basel also has a large pharmaceutical industry. Novartis,Chen, Aric. \"[http://travel.nytimes.com/2006/06/11/travel/11goingto.html Going to Basel].\" The New York Times. 11 June 2006. Retrieved on 12 January 2010. Syngenta, Ciba Specialty Chemicals, Clariant,Anna Bálint: Clariant clareant. The beginnings of a specialty chemicals company, Campus Verlag, Frankfurt am Main/New York 2012, . Hoffmann-La Roche, Basilea Pharmaceutica and Actelion are headquartered there. Pharmaceuticals and specialty chemicals have become the modern focus of the city's industrial production.\n\nBanking\n\nBanking is extremely important to Basel:\n* UBS AG maintains central offices in Basel,\"[https://apps2.ubs.com/locationfinder/search.do?GeoEntityId29&GeoEntityType\n6 UBS AG in Basel, Aeschenvorstadt 1].\" ([https://apps2.ubs.com/locationfinder/search.do?GeoEntityId6592&GeoEntityType\n7&EntityTypeId0&Type\npdf PDF version]) UBS AG. Retrieved on 2 July 2010.\n* The Bank for International Settlements is located within the city and is the central banker's bank. The bank is controlled by a board of directors, which is composed of the elite central bankers of 11 different countries (US, UK, Belgium, Canada, France, Germany, Italy, Japan, Switzerland, the Netherlands and Sweden).\nAccording to the BIS, \"The choice of Switzerland for the seat of the BIS was a compromise by those countries that established the BIS: Belgium, France, Germany, Italy, Japan, the United Kingdom and the United States. When consensus could not be reached on locating the Bank in London, Brussels or Amsterdam, the choice fell on Switzerland. An independent, neutral country, Switzerland offered the BIS less exposure to undue influence from any of the major powers. Within Switzerland, Basel was chosen largely because of its location, with excellent railway connections in all directions, especially important at a time when most international travel was by train.\"\nCreated in May 1930, the BIS is owned by its member central banks, which are private entities. No agent of the Swiss public authorities may enter the premises without the express consent of the bank.[http://www.bis.org/about/headquart-en.pdf Agreement between the Swiss Federal Council and the Bank for International Settlements to determine the Bank's legal status in Switzerland] The bank exercises supervision and police power over its premises. The bank enjoys immunity from criminal and administrative jurisdiction, as well as setting recommendations which become standard for the world's commercial banking system.\n* Basel is also the location of the Basel Committee on Banking Supervision, which is distinct from the BIS. It usually meets at the BIS premises in Basel. Responsible for the Basel Accords (Basel I, Basel II and Basel III), this organization fundamentally changed Risk Management within its industry.\n* Basel also hosts the headquarters of the Global Infrastructure Basel Foundation, which is active in the field of sustainable infrastructure (financing).\n\nAir\n\nSwiss International Air Lines, the national airline of Switzerland, is headquartered on the grounds of EuroAirport Basel-Mulhouse-Freiburg in Saint-Louis, Haut-Rhin, France, near Basel.\"[http://www.swiss.com/web/EN/about_swiss/company/Pages/facts_figures.aspx Facts and figures].\" Swiss International Air Lines. Retrieved on 13 June 2009.\"[http://saint-louis.plan-interactif.com/index.php?detect=flash Plan interactif] .\" Saint-Louis (Haut-Rhin). Retrieved on 25 September 2009.\"[http://www.swiss.com/web/EN/various/Documents/Direction_Basel.pdf Swiss International Air Lines Basel] .\" Swiss International Air Lines. Retrieved on 24 September 2009. Prior to the formation of Swiss International Air Lines, the regional airline Crossair was headquartered near Basel.\"[https://web.archive.org/web/20020202015152/http://www.crossair.com/en/ourcompany/location/index.html Location].\" Crossair. Retrieved on 13 June 2009.\n\nMedia\n\nBasler Zeitung (\"BaZ\"), TagesWoche and bz Basel are the local newspapers. The local TV Station is called telebasel. The German-speaking Swiss Radio and Television SRF company, part of the Swiss Broadcasting Corporation SRG SSR, holds offices in Basel as well. The academic publishers Birkhäuser, Karger and MDPI are based in Basel.\n\nTrade fairs\n\nAn annual Federal Swiss trade fair (Mustermesse) takes place in Kleinbasel on the right bank of the Rhine since 1917. Other important trade shows include \"Baselworld\" (watches and jewelry), Art Basel in Basel, Swissbau and Igeho.\n\nEducation\n\nBesides Humanism the city of Basel has also always been very famous for its achievement in the field of mathematics. Among others the mathematician Leonhard Euler and the Bernoulli family have done research and been teaching at the local institutions for centuries. In 1910 the Swiss Mathematical Society was founded in the city and in the mid-twentieth century the Russian mathematician Alexander Ostrowski taught at the local university. \nIn 2000 about 57,864 or (34.7%) of the population have completed non-mandatory upper secondary education, and 27,603 or (16.6%) have completed additional higher education (either university or a Fachhochschule). Of the 27,603 who completed tertiary schooling, 44.4% were Swiss men, 31.1% were Swiss women, 13.9% were non-Swiss men and 10.6% were non-Swiss women.\n\nIn 2010 11,912 students attended the University of Basel (55% female). 25% were foreign nationals, 16% were from canton of Basel-Stadt. In 2006 6162 students studied at one of the nine academies of the FHNW (51% female).\n\n, there were 5,820 students in Basel who came from another municipality, while 1,116 residents attended schools outside the municipality.\n\nUniversities\n\nBasel hosts Switzerland's oldest university, the University of Basel, dating from 1460. Erasmus, Paracelsus, Daniel Bernoulli, Leonhard Euler, Jacob Burckhardt, Friedrich Nietzsche, Tadeusz Reichstein, Karl Jaspers, Carl Gustav Jung and Karl Barth worked here. The University of Basel is currently counted among the 90 best educational institutions worldwide.Christoph Eymann, BaZ-Article (German): http://bazonline.ch/basel/stadt/mehr-als-nur-wirtschaftsmotor/story/16443640?track\n\nIn 2007, the ETH (Swiss Federal Institute of Technology Zürich) established the Department of Biosystems Science and Engineering (D-BSSE) in Basel. The creation of the D-BSSE was driven by a Swiss-wide research initiative SystemsX, and was jointly supported by funding from the ETH Zürich, the Swiss Government, the Swiss University Conference (SUC) and private industry.\n\nBasel also hosts several academies of the Fachhochschule Nordwestschweiz|Fachhochschule NW (FHNW): the FHNW Academy of Art and Design, FHNW Academy of Music, and the FHNW School of Business.\n\nBasel is renowned for various scientific societies, such as the Entomological Society of Basel (Entomologische Gesellschaft Basel, EGB), which celebrated its 100th anniversary in 2005.[http://www.egbasel.ch/ EGB website-Wer sind wir]  accessed 14 May 2012\n\nVolksschule\n\nIn 2005 16,939 pupils and students visited the Volksschule (the obligatory school time, including Kindergarten (127), primary schools (Primarschule, 25), and lower secondary schools (Sekundarschule, 10), of which 94% visited public schools and 39.5% were foreign nationals. In 2010 already 51.1% of all pupils spoke another language than German as their first language. In 2009 3.1% of the pupils visited special classes for pupils with particular needs. The average amount of study in primary school in Basel is 816 teaching hours per year.\n\nUpper secondary school\n\nIn 2010 65% of the youth finished their upper secondary education with a vocational training and education, 18% finished their upper secondary education with a Federal Matura at one of the five gymnasiums, 5% completed a Fachmaturität at the FMS, 5% completed a Berufsmaturität synchronosly to their vocational training, and 7% other kind of upper secondary maturity. 14.1% of all students at public gymnasiums were foreign nationals. The Maturity quota in 2010 was on a record high at 28.8% (32.8 female, 24.9% male).\n\nBasel has five public gymnasiums (', ', ', ', '), each with its own profiles (different focus on major subjects, such as visual design, biology and chemistry, Italian, Spanish, or Latin languages, music, physics and applied mathematics, philosophy/education/psychology, and economics and law) that entitles students with a successful Matura graduation to attend universities. And one Fachmaturitätsschule, the FMS, with six different major subjects (health/natural sciences, education, social work, design/art, music/theatre/dance, and communication/media) that entitles students with a successful Fachmatura graduation to attend Fachhochschulen. Four different höhere Fachschulen (higher vocational schools such as Bildungszentrum Gesundheit Basel-Stadt (health), Allgemeine Gewerbeschule Basel (trade), Berufsfachschule Basel, Schule für Gestaltung Basel (design)) allows vocational students to improve their knowledge and know-how.\n\nInternational schools\n\nAs a city with a percentage of foreigners of more than thirty-five percent and as one of the most important centres in the chemical and pharmaceutical field in the world, Basel counts several International Schools including: Academia International School, École Française de Bâle, Freies Gymnasium Basel (private), Gymnasium am Münsterplatz (public), Schweizerisch-italienische Primarschule Sandro Pertini, and Swiss International School (Basel).International School of Basel - webpage: http://www.isbasel.ch\n\nLibraries\n\nBasel is home to at least 65 libraries. Some of the largest include; the Universitätsbibliothek Basel (main university library), the special libraries of the University of Basel, the Allgemein Bibliotheken der Gesellschaft für Gutes und Gemeinnütziges (GGG) Basel, the Library of the Pädagogische Hochschule, the Library of the Hochschule für Soziale Arbeit and the Library of the Hochschule für Wirtschaft.  There was a combined total () of 8,443,643 books or other media in the libraries, and in the same year a total of 1,722,802 items were loaned out.[http://www.bfs.admin.ch/bfs/portal/de/index/themen/16/02/02/data.html Swiss Federal Statistical Office, list of libraries]  accessed 14 May 2010\n\nCulture\n\nMain sights\n\nThe red sandstone Münster, one of the foremost late-Romanesque/early Gothic buildings in the Upper Rhine, was badly damaged in the great earthquake of 1356, rebuilt in the 14th and 15th century, extensively reconstructed in the mid-19th century and further restored in the late 20th century.[http://www.baslermuenster.ch/sub_architektur_jh_20.html Basel Münster website - Architecture 20th century]  accessed 4 May 2012 A memorial to Erasmus lies inside the Münster. The City Hall from the 16th century is located on the Market Square and is decorated with fine murals on the outer walls and on the walls of the inner court.\n\nBasel is also host to an array of buildings by internationally renowned architects. These include the Beyeler Foundation by Renzo Piano, or the Vitra complex in nearby Weil am Rhein, composed of buildings by architects such as Zaha Hadid (fire station), Frank Gehry (Design Museum), Álvaro Siza Vieira (factory building) and Tadao Ando (conference centre). Basel also features buildings by Mario Botta (Jean Tinguely Museum and Bank of International settlements) and Herzog & de Meuron (whose architectural practice is in Basel, and who are best known as the architects of Tate Modern in London and the Bird's Nest in Beijing, the Olympia stadium, which was designed for use throughout the 2008 Summer Olympics and Paralympics). The city received the Wakker Prize in 1996.\n\nHeritage sites\n\nBasel features a great number of heritage sites of national significance.\n\nThese include the entire Old Town of Basel as well as the following buildings and collections: \n\n;Churches and monasteries :Old Catholic Prediger Kirche (church), Bischofshof with Collegiate church at Rittergasse 1, Domhof at Münsterplatz 10–12, former Carthusian House of St Margarethental, Catholic Church of St Antonius, Lohnhof (former Augustinians Collegiate Church), Mission 21, Archive of the Evangelisches Missionswerk Basel, Münster of Basle (cathedral), Reformed Elisabethenkirche (church), Reformed Johanneskirche (church), Reformed Leonhardskirche (church, former Augustinians Abbey), Reformed Martinskirche (church), Reformed Pauluskirche (church), Reformed Peterskirche (church), Reformed St. Albankirche (church) with cloister and cemetery, Reformed Theodorskirche (church), Synagoge at Eulerstrasse 2\n\n;Secular buildings:Badischer Bahnhof (Geman Baden's railway station) with fountain, Bank for International Settlements, Blaues Haus (Reichensteinerhof) at Rheinsprung 16, Bruderholzschule (school house) at Fritz-Hauser-Strasse 20, Brunschwiler Haus at Hebelstrasse 15, Bahnhof Basel SBB (Swiss railway station), Bürgerspital (hospital), Café Spitz (Merianflügel), Coop Schweiz company's central archive, Depot of the Archäologischen Bodenforschung des Kanton Basel-Stadt, former Gallizian Paper Mill and Swiss Museum of Paper, former Klingental-Kaserne (casern) with Klingentaler Kirche (church), Fasnachtsbrunnen (fountain), Feuerschützenhaus (guild house of the riflemen) at Schützenmattstrasse 56, Fischmarktbrunnen (fountain), Geltenzunft at Marktplatz 13, Gymnasium am Kohlenberg (St Leonhard) (school), Hauptpost (main post office), Haus zum Raben at Aeschenvorstadt 15, Hohenfirstenhof at Rittergasse 19, Holsteinerhof at Hebelstrasse 30, Markgräflerhof a former palace of the margraves of Baden-Durlach,Mittlere Rhein Brücke (Central Rhine Bridge), Stadtcasino (music hall) at Steinenberg 14, Ramsteinerhof at Rittergasse 7 and 9, Rathaus (town hall), Rundhof building of the Schweizerischen Mustermesse, Safranzunft at Gerbergasse 11, Sandgrube at Riehenstrasse 154, Schlösschen (Manor house) Gundeldingen, Schönes Haus and Schöner Hof at Nadelberg 6, Wasgenring school house, Seidenhof with painting of Rudolf von Habsburg, Spalenhof at Spalenberg 12, Spiesshof at Heuberg 7, city walls, Townhouse (former post office) at Stadthausgasse 13 / Totengässlein 6, Weisses Haus at Martinsgasse 3, Wildt'sches Haus at Petersplatz 13, Haus zum Neuen Singer at Speiserstrasse 98, Wolfgottesacker at Münchensteinerstrasse 99, Zerkindenhof at Nadelberg 10.\n\n;Archaeological sites: The Celtic Settlement at Gasfabrik, Münsterhügel and Altstadt (historical city, late La Tène and medieval settlement).\n\n;Museums, archives and collections: Basel calls itself the Cultural Capital of Switzerland.\n\nAmong others, there is the Anatomical Museum of the University Basel, Berri-Villen and Museum of Ancient Art Basel and Ludwig Collection, Former Franciscan Barefoot Order Church and Basel Historical Museum, Company Archive of Novartis, Haus zum Kirschgarten which is part of the Basel Historical Museum, \nHistoric Archive Roche and Industrial Complex Hoffmann-La Roche, \nJewish Museum of Switzerland, Caricature & Cartoon Museum Basel, Karl Barth-Archive, Kleines Klingental (Lower Klingen Valley) with Museum Klingental, \nArt Museum of Basel, hosting the world's oldest art collection accessible to the public, \nNatural History Museum of Basel and the Museum of Cultures Basel, Museum of Modern Art Basel with the E. Hoffmann collection, Museum Jean Tinguely Basel, Music Museum, Pharmacy Historical Museum of the University of Basel, Poster Collection of the School for Design (Schule für Gestaltung), Swiss Business Archives, Sculpture Hall, Sports Museum of Switzerland, Archives of the Canton of Basel-Stadt, UBS AG Corporate Archives, University Library with manuscripts and music collection, Zoological Garden (Zoologischer Garten).\n\nTheatre and music\n\nBasel is the home of the Schola Cantorum Basiliensis, founded in 1933, a worldwide centre for research on and performance of music from the Medieval through the Baroque eras. Theater Basel, chosen in 1999 as the best stage for German-language performances and in 2009 and 2010 as \"Opera of the Year\" by German Opera Magazine \"Opernwelt\",[https://web.archive.org/web/20110107230642/http://www.basel-virtuell.ch/en/culture Basel: culture pure] basel-virtuell.ch. Retrieved on 24 March 2010 presents a busy schedule of plays in addition to being home to the city's opera and ballet companies.  Basel is home to the largest orchestra in Switzerland, the Sinfonieorchester Basel. It is also the home of the Kammerorchester Basel, which is recording the complete symphonies of Ludwig van Beethoven for the Sony label led by its music director Giovanni Antonini. The Schola Cantorum and the Basler Kammerorchester were both founded by the conductor Paul Sacher who went on to commission works by many leading composers. The Paul Sacher Foundation, opened in 1986, houses a major collection of manuscripts, including the entire Igor Stravinsky archive.\nThe baroque orchestras La Cetra and Capriccio Basel are also based in Basel. In May 2004, the fifth European Festival of Youth Choirs (Europäisches Jugendchorfestival, or EJCF) choir festival opened: this Basel tradition started in 1992. Host of this festival is the local Basel Boys Choir.\n\nIn 1997, Basel contended to become the \"European Capital of Culture\", though the honor went instead to Thessaloniki.\n\nMuseums\n\nThe Basel museums cover a broad and diverse spectrum of collections with a marked concentration in the fine arts. They house numerous holdings of international significance. The over three dozen institutions yield an extraordinarily high density of museums compared to other cities of similar size and draw over one million visitors annually.\n\nConstituting an essential component of Basel culture and cultural policy, the museums are the result of closely interwoven private and public collecting activities and promotion of arts and culture going back to the 16th century. The public museum collection was first created back in 1661 and represents the oldest public collection in continuous existence. Since the late 1980s, various private collections have been made accessible to the public in new purpose-built structures that have been recognized as acclaimed examples of avant-garde museum architecture.\n\n* Antikenmuseum Basel und Sammlung Ludwig Ancient cultures of the mediterranean museum\n* Augusta Raurica Roman open-air museum\n* Basel Paper Mill ()\n* Beyeler Foundation (Foundation Beyeler) [http://www.beyeler.com/ Beyeler Museum (Fondation Beyeler)]\n* Botanical Garden Basel [https://www.unibas.ch/en/University/University-Society/Botanical-Garden.html One of the oldest botanical gardens in the world]\n* Caricature & Cartoon Museum Basel ()\n* Dollhouse Museum () a museum houring the largest teddy bear collection in Europe.\n* Foundation Fernet Branca () in Saint-Louis, Haut-Rhin near Basel. Modern art collection.\n* Historical Museum Basel ()\n* Kunsthalle Basel Modern and contemporary art museum\n* Kunstmuseum Basel Upper Rhenish and Flemish paintings, drawings from 1400 to 1600 and 19th- to 21st-century art\n* Monteverdi Automuseum\n* Museum of Cultures Basel () Large collections on European and non-Europeancultural life\n* Museum of Contemporary Art Art from the 1960s up to the present\n* Music Museum () of the Basel Historic Museum\n* Natural History Museum of Basel ()\n* Pharmazie-Historisches Museum der Universität Basel\n* Schaulager Modern and contemporary art museum\n* Swiss Architecture Museum ()\n* Tinguely Museum Life and work of the major Swiss iron sculptor Jean Tinguely\n* Vitra Design Museum Museum in Weil am Rhein near Basel\n* Jewish Museum of Switzerland\n\nEvents\n\nThe city of Basel is a centre for numerous fairs and events all year round. One of the most important fairs for contemporary art worldwide is the Art Basel which was founded in 1970 by Ernst Beyeler and takes place in June each year. Baselworld, the watch and jewellery show (Uhren- und Schmuckmesse) one of the biggest fairs of its kind in Europe is held every year as well, and attracts a great number of tourists and dealers to the city. The carnival of the city of Basel (Basler Fasnacht) is a major cultural event in the year. The carnival is the biggest in Switzerland and attracts large crowds every year, despite the fact that it starts at exactly four in the morning (Morgestraich) on a winter Monday. The Fasnacht asserts Basel's Protestant history by commencing the revelry five days after Ash Wednesday and continuing day and night for exactly 72 hours. Almost all study and work in the old city cease. Dozens of fife and drum clubs parade in medieval guild tradition with fantastical masks and illuminated lanterns.\n\nCuisine\n\nThere are a number of culinary specialties originating in Basel, including Basler Läckerli cookies and Mässmogge candies. Being located in the meeting place between Switzerland, France and Germany the culinary landscape as a whole is very varied and diverse, making it a city with a great number of restaurants of all sorts.\n\nZoo\n\nZoo Basel is, with over 1.7 million visitors per year,[http://bazonline.ch/basel/stadt/Trotz-Grossbaustelle-Besucherrekord-beim-Zolli/story/10759447  Besucherrekord beim Zolli]. Basler Zeitung, published 23 February 2012 the most visited tourist attraction in Basel and the second most visited tourist attraction in Switzerland.[http://www.20min.ch/news/basel/story/25637966  Zolli beliebt] . 20min.ch, published 23 February 2009\n\nEstablished in 1874, Zoo Basel is the oldest zoo in Switzerland and, by number of animals, the largest. Through its history, Zoo Basel has had several breeding successes, such as the first worldwide Indian rhinoceros birth[http://www.zoobasel.ch/aktuell/detail.php?NEWSID\n37  Eröffnung des Panzernashornhauses] . Zoo Basel, written 2006-09-26, retrieved 3 December 2009 and Greater flamingo hatch in a zoo. These and other achievements led Forbes Travel to rank Zoo Basel as one of the fifteen best zoos in the world in 2008.[http://www.getlisty.com/preview/worlds-best-zoos/ Forbes Travel]. GetListy, retrieved 26 March 2010\n\nDespite its international fame, Basel's population remains attached to Zoo Basel, which is entirely surrounded by the city of Basel.  Evidence of this is the millions of donations money each year, as well as Zoo Basel's unofficial name: locals lovingly call \"their\" zoo \"Zolli\" by which is it known throughout Basel and most of Switzerland.\n\nSport\n\nBasel has a reputation in Switzerland as a successful sporting city. The football club FC Basel continues to be successful and in recognition of this the city was one of the Swiss venues for the 2008 European Championships, as well as Geneva, Zürich and Bern. The championships were jointly hosted by Switzerland and Austria. BSC Old Boys and Concordia Basel are the other football teams in Basel.\n\nAmong the most popular sports in Switzerland is Ice hockey. Basel is home to the EHC Basel which plays in the MySports League, the third tier of the Swiss ice hockey league system. They play their home games in the 6,700-seat St. Jakob Arena. The team previously played in the National League and the Swiss League, but they had to fill a bankruptcy case after the 2013-14 Swiss League season.\n\nBasel features a large football stadium that has been awarded four stars by UEFA, a modern ice hockey hall, and an admitted sports hall.\n\nA large indoor tennis event takes place in Basel every October. Some of the best ATP-Professionals play every year at the Swiss Indoors, including Switzerland's biggest sporting hero and frequent participant Roger Federer, a Basel native who describes the city as \"one of the most beautiful cities in the world\".\n\nThe annual Basel Rhine Swim draws several thousand visitors to the city to swim in or float on the Rhine river.\n\nWhile football and ice hockey are by far the most popular sports, basketball has a very small but faithful fan base. The top division, called NLA, is a semi-professional league and has one team from the Basel region, the \"Birstal Starwings\".\nTwo players from Switzerland are currently active in the NBA, Thabo Sefolosha and Clint Capela. \nAs in most European countries, and contrary to the U.S., Switzerland has a club-based rather than a school-based competition system.[http://www.unibaselbasket.ch/english.html] The Starwings Basel are the only first division basketball team in German-speaking Switzerland.[http://www.indoorsports.ch/de/alle/detail-alle-sportarten/news/detail/News/starwings-die-exoten-aus-basel/ Starwings - die Exoten aus Basel], indoorsports.ch , accessed 5 September 2015.\n\nPicture gallery\n\nFile:Museum der Kulturen 2008-03-30.jpg|Museum of Cultures\nFile:Mittlere Brücke.jpg|Mittlere Rheinbrücke (Central Rhine Bridge)\nFile:Basler Kunstmuseum.jpg|Kunstmuseum Basel (Art Museum Basel)\nFile:Haus zum Kirschgarten 2008-03-30.jpg|Haus zum Kirschgarten\nFile:Basel Barfüsserkirche Inneres 11-05-2008.jpg| Former Franciscan Barefoot Order Church\nFile:Antikenmuseum Basel 2008-03-30.jpg|Berri-Villen and Antikenmuseum Basel\nFile:Basel - Bank für internationalen Zahlungsausgleich3.jpg|Bank for International Settlements\nFile:Basel, straatzicht Steinenberg-Sankt Alban Graben foto3 2013-07-27 09.48.jpg|Steinenberg-Sankt Alban Graben\nFile:Basel, straatzicht Barfüssenplatz foto4 2013-07-27 10.01.jpg|Barfüsserplatz\nFile:Basler - Basler Münster Westfassade.jpg|Basler Münster\nFile:Munsterplatz, Basel, Switzerland.jpg|Münsterplatz\nFile:Rathaus-004.jpg|Rathaus, Basel's Town Hall\nFile:Basel, Wettsteinbrücke met kathedraal op de achtergrond foto10 2013-07-21 09.08.jpg|Wettsteinbrücke\n\nNotes and references\n\nNotes\n\n=",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Basel" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=4911" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Basel (; also Basle; ; ; ) is a city in northwestern Switzerland on the river Rhine. Basel is Switzerland's third-most-populous city (after Zürich and Geneva) with about 175,000 inhabitants.\n\nLocated where the Swiss, French and German borders meet, Basel also has suburbs in France and Germany. In 2014, the Basel agglomeration was the third largest in Switzerland with a population of 537,100 in 74 municipalities in Switzerland and an additional 53 in neighboring countries (municipal count as of 2000). The official language of Basel is (the Swiss variety of Standard) German, but the main spoken language is the local variant of the Alemannic Swiss German dialect.\n\nThe city is known for its many internationally renowned museums, ranging from the Kunstmuseum, the first collection of art accessible to the public in Europe (1661) and the largest museum of art in the whole of Switzerland, to the Fondation Beyeler (located in Riehen). \nThe University of Basel, founded in 1460, Switzerland's oldest university and the city's centuries long commitment to humanism, have made Basel a safe haven during times of political unrest in other parts of Europe to the likes of Erasmus of Rotterdam, the Holbein family, and more recently also to Hermann Hesse and Karl Jaspers.\n\nBasel has been the seat of a Prince-Bishopric since the 11th century, and joined the Swiss Confederacy in 1501. \nThe city has been a commercial hub and important cultural centre since the Renaissance, and has emerged as a centre for the chemical and pharmaceutical industry in the 20th century. In 1897 the city was chosen as the location for the first World Zionist Congress by Theodor Herzl, and all together the congress has taken place in Basel for ten times over a time span of fifty years, more than in any other city in the world. The city is also home to the worldwide seat of the Bank for International Settlements.\n\nToday the city of Basel, together with two other Swiss cities Zürich and Geneva, is counted among the cities with the highest standards of living in the entire world.https://www.mercer.com/newsroom/2017-quality-of-living-survey.html\n\nHistory\n\nEarly history \n\nThere are settlement traces on the Rhine knee from the early La Tène period (5th century BC). In the 2nd century BC, there was a village of the Raurici at the site of Basel-Gasfabrik, to the northwest of the Old City, likely identical with the town of Arialbinnum mentioned on the Tabula Peutingeriana.René Teuteberg: Basler Geschichte, p. 49. The unfortified settlement was abandoned in the 1st century BC in favour of an oppidum on the site of Basel Minster, probably in reaction to the Roman invasion of Gaul.\n\nIn Roman Gaul, Augusta Raurica was established some 20 km from Basel as the regional administrative centre, while a castra (castle) was built on the site of the Celtic oppidum. The city of Basel eventually grew around the castle. In AD 83, Basel was incorporated into the Roman province of Germania Superior. Roman control over the area deteriorated in the 3rd century, and Basel became an outpost of the Provincia Maxima Sequanorum formed by Diocletian.\n\nThe Germanic confederation of the Alemanni attempted to cross the Rhine several times in the 4th century, but were repelled, one such event being the Battle of Solicinium (368). However, in the great invasion of AD 406, the Alemanni appear to have crossed the Rhine river a final time, conquering and then settling what is today Alsace and a large part of the Swiss Plateau. From this time, Basel has been an Alemannic settlement.\n\nThe Duchy of Alemannia fell under Frankish rule in the 6th century, and by the 7th century, the former bishopric of Augusta Raurica was re-established as the Bishopric of Basel. Based on the evidence of a third solidus with the inscription Basilia fit, Basel seems to have minted its own coins in the 7th century.[http://www.hmb.ch/en/collection/object/basel-kopie-vom-gold-triens-des-muenzmeisters-gunso-anfangs-7-jh-vs.html Paris, Cabinet des Médailles (copy: HMB Inv. 1981.125.1)] Under bishop Haito, the first cathedral was built on the site of the Roman castle, later replaced by a Romanesque structure consecrated in 1019. At the partition of the Carolingian Empire, Basel was first given to West Francia, but passed to East Francia with the treaty of Meerssen of 870.\n\nThe city was plundered and destroyed by a Magyar invasion of 917. The rebuilt city became part of Upper Burgundy, and as such was incorporated into the Holy Roman Empire in 1032.\n\nPrince-Bishopric of Basel\n\nSince the donation by Rudolph III of Burgundy of the Moutier-Grandval Abbey and all its possessions to Bishop Adalbero II in 999 till the Reformation, Basel was ruled by prince-bishops (see Bishop of Basel,The New Encyclopædia Britannica, Encyclopædia Britannica, 1993, p.659 whose memory is preserved in the crosier shown on the Basel coat-of-arms – see above).\n\nIn 1019, the construction of the cathedral of Basel (known locally as the Münster) began under Henry II, Holy Roman Emperor.Franz Kugler, Kleine Schriften und Studien zur Kunstgeschichte, 1853, p. 486\nIn 1225–1226, a bridge, now known as the Middle Bridge, was constructed by Bishop Heinrich von Thun and Lesser Basel (Kleinbasel) founded as a bridgehead to protect the bridge. The bridge was largely funded by Basel's Jewish community which had settled there a century earlier.Habicht, Peter, Basel - A Center at the Fringe  (Basel: Christoph Merian Verlag, 2006) pp. 43, 55, 70, 79. For many centuries to come Basel possessed the only permanent bridge over the river \"between Lake Constance and the sea\".\n\nThe Bishop also allowed the furriers to establish a guild in 1226. Eventually about 15 guilds were established in the 13th century. They increased the town's, and hence the bishop's, reputation, influence, and income from the taxes and duties on goods in Basel's expanding market.\n\nIn 1347, the plague came to Europe but did not reach Basel until June 1349. The guilds, asserting that the Jews were responsible—several had been tortured and confessed—demanded they be executed, which the Council did in January 1349, except for a few who escaped to Alsace. During the Basel massacre, 600 Jews were murdered. They were shackled inside a wooden barn on an island in the Rhine, which was set afire. The few survivors - young orphans - were forcibly converted to Christianity. The council then forbade Jews in Basel for 200 years, except that their money was helpful in rebuilding after the Basel earthquake of 1356 which destroyed much of the city along with a number of castles in the vicinity. The city offered courts to nobles as an alternative to rebuilding their castles, in exchange for the nobles' military protection of the city.\n\nIn 1412 (or earlier), the well-known guesthouse Zum Goldenen Sternen was established. Basel became the focal point of western Christendom during the 15th century Council of Basel (1431–1449), including the 1439 election of antipope Felix V. In 1459, Pope Pius II endowed the University of Basel where such notables as Erasmus of Rotterdam and Paracelsus later taught. At the same time the new craft of printing was introduced to Basel by apprentices of Johann Gutenberg.\n\nThe Schwabe publishing house was founded in 1488 by Johannes Petri and is the oldest publishing house still in business. Johann Froben also operated his printing house in Basel and was notable for publishing works by Erasmus.Josef Nadler, Literaturgeschichte der deutschen Schweiz, Grethlein 1932 In 1495, Basel was incorporated in the Upper Rhenish Imperial Circle; the Bishop of Basel was added to the Bench of the Ecclesiastical Princes. In 1500 the construction of the Basel Münster was finished. In 1521 so was the bishop. The Council, under the supremacy of the guilds, explained that henceforth they would only give allegiance to the Swiss Confederation, to whom the bishop appealed but in vain.\n\nAs a member state in the Swiss Confederacy\n\nThe city had remained neutral through the Swabian War of 1499 despite being plundered by soldiers on both sides. The Treaty of Basel ended the war and granted the Swiss confederates exemptions from the emperor Maximillian's taxes and jurisdictions, separating Switzerland de facto from the Holy Roman Empire.Rappard, William,  Collective Security in Swiss Experience 1291–1948 (London, 1948) p. 85 ff\n\nOn 9 June 1501, Basel joined the Swiss Confederation as its eleventh canton.Karl Strupp, Wörterbuch Des Völkerrechts, De Gruyter 1960, p.225 It was the only canton that had been asked to join, not the other way round. Basel had a strategic location, good relations with Strasbourg and Mulhouse, and control of the corn imports from Alsace, whereas the Swiss lands were becoming overpopulated and had few resources.  A provision of the Charter accepting Basel required that in conflicts among the other cantons it was to stay neutral and offer its services for mediation.Habicht, Peter, Basel - A Center at the Fringe (Basel 2006) p. 65 ffBonjour, Edgar et al. A short History of Switzerland (Oxford, 1952) p. 139 ff\n\nIn 1503, the new bishop Christoph von Utenheim refused to give Basel a new constitution whereupon, to show its power, the city began the construction of a new city hall.\n\nIn 1529, the city became Protestant under Oecolampadius and the bishop's seat was moved to Porrentruy. The bishop's crook was however retained as the city's coat of arms. For the centuries to come, a handful of wealthy families collectively referred to as the \"Daig\" played a pivotal role in city affairs as they gradually established themselves as a de facto city aristocracy.\n\nThe first edition of Christianae religionis institutio (Institutes of the Christian Religion – John Calvin's great exposition of Calvinist doctrine) was published at Basel in March 1536.Geoffrey Rudolph Elton, Harold Fullard, Henry Clifford Darby, Charles Loch Mowat, The New Cambridge Modern History, 1990, p. 113\n\nIn 1544, Johann von Brugge, a rich Dutch Protestant refugee, was given citizenship and lived respectfully until his death in 1556 then buried with honors. His body was exhumed and burnt at the stake in 1559 after it was discovered that he was the Anabaptist David Joris.\n\nIn 1543, De humani corporis fabrica, the first book on human anatomy, was published and printed in Basel by Andreas Vesalius (1514–1564).The Illustrations from the Works of Andreas Vesalius of Brussels, Courier Dover Publications 1973, p.30\n\nThere are indications Joachim Meyer, author of the influential 16th-century martial arts text Kunst des Fechten (\"The Art of Fencing\"), came from Basel. In 1662 the Amerbaschsches Kabinett was established in Basel as the first public museum of art. Its collection became the core of the later Basel Museum of Art.\n\nThe Bernoulli family, which included important 17th- and 18th-century mathematicians such as Jakob Bernoulli, Johann Bernoulli and Daniel Bernoulli, were from Basel. The 18th-century mathematician Leonhard Euler was born in Basel and studied under Johann Bernoulli.\n\nModern history\n\nIn 1792, the Republic of Rauracia, a revolutionary French client republic, was created. It lasted until 1793.Heinrich Zschokke, Emil Zschokke, The History of Switzerland, for the Swiss People, S. Low, Son & Co. 1855, p.253 After three years of political agitation and a short civil war in 1833 the disadvantaged countryside seceded from the Canton of Basel, forming the half canton of Basel-Landschaft.Heinrich Türler, Marcel Godet, Victor Attinger, Historisch-biographisches Lexikon der Schweiz, 1934, p.307\n\nOn 3 July 1874, Switzerland's first zoo (the Zoo Basel) opened its doors in the south of the city towards Binningen.\n\nIn 1897 the first World Zionist Congress was held in Basel. Altogether the World Zionist Congress took place in Basel for ten times, more than in any other city in the world.\n\nOn 16 November 1938, the psychedelic drug LSD was first synthesized by Swiss chemist Albert Hofmann at Sandoz Laboratories in Basel.\n\nBasel as a historical, international meeting place\n\nBasel has often been the site of peace negotiations and other international meetings. The Treaty of Basel (1499) ended the Swabian War. Two years later Basel joined the Swiss Confederation. The Peace of Basel in 1795 between the French Republic and Prussia and Spain ended the First Coalition against France during the French Revolutionary Wars. In more recent times, the World Zionist Organization held its first congress in Basel from August 29 through August 31, 1897. Because of the Balkan Wars, the Second International held an extraordinary congress at Basel in 1912. In 1989, the Basel Convention was opened for signature with the aim of preventing the export of hazardous waste from wealthy to developing nations for disposal.\n\nName\n\nThe name of Basel is derived from the Roman-era toponym Basilia, first recorded in the 3rd century.\nIt is presumably derived from the personal Greek name Basilius.Basileam applicuerunt (AD 237 or 238). Andres Kristol: Basel BS (Basel Stadt) in: Dictionnaire toponymique des communes suisses – Lexikon der schweizerischen Gemeindenamen – Dizionario toponomastico dei comuni svizzeri (DTS|LSG). Centre de dialectologie, Université de Neuchâtel, Verlag Huber, Frauenfeld/Stuttgart/Wien 2005,  und Éditions Payot, Lausanne 2005, , S. 125. The Old French form Basle was adopted into English, and developed into the modern French Bâle. The Icelandic name Buslaraborg goes back to the 12th century Leiðarvísir og borgarskipan chronicle.\n\nGeography and climate\n\nTopography\n\nBasel has an area, , of . Of this area,  or 4.0% is used for agricultural purposes, while  or 3.7% is forested. Of the rest of the land,  or 86.4% is settled (buildings or roads),  or 6.1% is either rivers or lakes.[http://www.bfs.admin.ch/bfs/portal/de/index/themen/02/03/blank/data/gemeindedaten.html Swiss Federal Statistical Office-Land Use Statistics] 2009 data  accessed 25 March 2010\n\nOf the built up area, industrial buildings made up 10.2% of the total area while housing and buildings made up 40.7% and transportation infrastructure made up 24.0%. Power and water infrastructure as well as other special developed areas made up 2.7% of the area while parks, green belts and sports fields made up 8.9%. Out of the forested land, all of the forested land area is covered with heavy forests. Of the agricultural land, 2.5% is used for growing crops and 1.3% is pastures. All the water in the municipality is flowing water.\n\nClimate\n\nUnder the Köppen climate classification, Basel features a temperate oceanic (Köppen: Cfb) climate.[http://www.weatherbase.com/weather/weather-summary.php3?s590607 Weatherbase] accessed 19 October 2017 The city averages 120.4 days of rain or snow annually and on average receives 842 mm of precipitation. The wettest month is May during which time Basel receives an average of 99 mm of rain. The month with the most days of precipitation is also May, with an average of 12.4 days. The driest month of the year is February with an average of 45 mm of precipitation over 8.4 days.\n\nPolitics\n\nThe city of Basel functions as the capital of the Swiss half-canton of Basel-Stadt, though several of its suburbs are located in the half-canton of Basel-Landschaft or the canton of Aargau. Others are even located in France and Germany.\n\nCanton\n\nThe canton Basel-Stadt consists of three municipalities: Riehen, Bettingen, and the city Basel itself. The political structure and agencies of the city and the canton are identical.\n\nCity\n\nQuarters\n\nThe city itself has 19 quarters:\n\n* Grossbasel (Greater Basel):\n\n1 Altstadt Grossbasel\n2 Vorstädte\n3 Am Ring\n4 Breite\n5 St. Alban\n6 Gundeldingen\n7 Bruderholz\n8 Bachletten\n9 Gotthelf\n10 Iselin\n11 St. Johann\n\n* Kleinbasel (Lesser Basel):\n\n12 Altstadt Kleinbasel\n13 Clara\n14 Wettstein\n15 Hirzbrunnen\n16 Rosental\n17 Matthäus\n18 Klybeck\n19 Kleinhüningen\n\nCoat of arms\n\nThe blazon of the municipal coat of arms is In Silber ein schwarzer Baselstab.[http://www.crwflags.com/fotw/flags/ch-bs001.html Flags of the World.com] accessed 18-April-2011\n\nGovernment\n\nThe canton's executive, the Executive Council (Regierungsrat), consists of seven members for a mandate period of 4 years. They are elected by any inhabitant valid to vote on the same day as the parliament and operates as a collegiate authority. The president () is elected as such by a public election while the heads of the other departments are assigned by the collegiate. Current president is Dr. Guy Morin. The executive body holds its meetings in the red Town Hall (Rathaus) on the central Marktplatz. The building was built in 1504–1514.\n\n, Basel's Executive Council is made up of three representatives of the SP (Social Democratic Party), and one member each of Green Alliance of Basel (GB) (who is the president), FDP (Free Democratic Party), LDP (Liberal-Demokratische Partei of Basel), and CVP (Christian Democratic Party), giving the left parties a combined four out of seven seats. The last election was held on 23 October and 27 November 2016.\n\nBarbara Schüpbach-Guggenbühlis is State Chronicler (Staatsschreiberin) since 2009, and Marco Greiner is Head of Communication (Regierungssprecher) and Vice State Chronicler (Vizestaatsschreiber) since 2007 for the Executive Council.\n\nParliament\n\nThe parliament, the Grand Council of Basel-Stadt (Grosser Rat), consists of 100 seats, with members (called in German: Grossrat/Grossrätin) elected every 4 years. The sessions of the Grand Council are public. Unlike the member of the Executive Council, the members of the Grand Council are not politicians by profession, but they are paid a fee based on their attendance. Any resident of Basel allowed to vote can be elected as a member of the parliament. The legislative body holds its meetings in the red Town Hall (Rathaus).\n\nThe last election was held on 23 October 2016 for the mandate period (Legislatur) of 2017–2021. Currently, the Grand Council consist of 34 members of the Social Democratic Party (SP), 15 members of the Swiss People's Party (SVP), 14 Grünes Bündnis (GB) (a collaboration of the Green Party (GPS), its junior party, and Basels starke Alternative (BastA!)), 10 The Liberals (FDP) and its junior party, the representative of the Aktive Bettingen (AB) is associated to the parliamentary group (Fraktion) of the FDP, 14 Liberal-Demokratische Partei (LDP) and its junior party, 8 (7/1) Christian Democratic People's Party (CVP)/Evangelical People's Party (EVP), and 4 Green Liberal Party (GLP).\n\nThe left parties misses an absolute majority by two seats.\n\nFederal elections\n\nNational Council\n\nOn 18 October 2015, in the federal election the most popular party was the Social Democratic Party (SP) which received two seats with 33.5% of the votes. The next three most popular parties were the FDP (21.4%), the SVP (17.6%), and the Green Party (GPS) (11.2%), each with one seat. In the federal election, a total of 57,304 votes were cast, and the voter turnout was 50.4%.\n\nCouncil of States\n\nOn 18 October 2015, in the federal election State Councilor () Anita Fetz, member of the Social Democratic Party   (SP), was re-elected in the first round as single representative of the canton of Basel-Stadt in the national Council of States (German: Ständerat) with an absolute majority of 35'842 votes. She has been a member of it since 2003.\n\nInternational relations\n\nTwin towns and sister cities\n\nBasel has two sister cities and a twinning among two states:\n\n*  Shanghai, China, since 2007\n*  US State Massachusetts, since 2002\n*  Miami Beach, US, since 2011\n\nDemographics\n\nPopulation\n\nBasel has a population () of .  , 35.5% of the population are resident foreign nationals.  Over the last 10 years (1999–2009 ) the population has changed at a rate of -0.3%. It has changed at a rate of 3.2% due to migration and at a rate of -3% due to births and deaths.[http://www.bfs.admin.ch/bfs/portal/en/index/regionen/02/key.html Swiss Federal Statistical Office]  accessed 18-April-2011\n\nOf the population in the municipality 58,560 or about 35.2% were born in Basel and lived there in 2000. There were 1,396 or 0.8% who were born in the same canton, while 44,874 or 26.9% were born somewhere else in Switzerland, and 53,774 or 32.3% were born outside of Switzerland.\n\nIn  there were 898 live births to Swiss citizens and 621 births to non-Swiss citizens, and in same time span there were 1,732 deaths of Swiss citizens and 175 non-Swiss citizen deaths.  Ignoring immigration and emigration, the population of Swiss citizens decreased by 834 while the foreign population increased by 446.  There were 207 Swiss men and 271 Swiss women who emigrated from Switzerland.  At the same time, there were 1756 non-Swiss men and 1655 non-Swiss women who immigrated from another country to Switzerland.  The total Swiss population change in 2008 (from all sources, including moves across municipal borders) was an increase of 278 and the non-Swiss population increased by 1138 people.  This represents a population growth rate of 0.9%.[http://www.bfs.admin.ch/bfs/portal/de/index/infothek/onlinedb/superweb/login.html Swiss Federal Statistical Office - Superweb database - Gemeinde Statistics 1981-2008]   accessed 19 June 2010\n\n, there were 70,502 people who were single and never married in the municipality.  There were 70,517 married individuals, 12,435 widows or widowers and 13,104 individuals who are divorced.[http://www.pxweb.bfs.admin.ch/Database/German_40%20-%20Eidgen%C3%B6ssische%20Volksz%C3%A4hlung/40.3%20-%202000/40.3%20-%202000.asp?lang\n1&prod40&secprod\n3&openChild=true STAT-TAB Datenwürfel für Thema 40.3 - 2000]    accessed 2 February 2011\n\n the average number of residents per living room was 0.59 which is about equal to the cantonal average of 0.58 per room. In this case, a room is defined as space of a housing unit of at least 4 m2 as normal bedrooms, dining rooms, living rooms, kitchens and habitable cellars and attics. About 10.5% of the total households were owner occupied, or in other words did not pay rent (though they may have a mortgage or a rent-to-own agreement).\n, there were 86,371 private households in the municipality, and an average of 1.8 persons per household.  There were 44,469 households that consist of only one person and 2,842 households with five or more people.  Out of a total of 88,646 households that answered this question, 50.2% were households made up of just one person and there were 451 adults who lived with their parents.  Of the rest of the households, there are 20,472 married couples without children, 14,554 married couples with children There were 4,318 single parents with a child or children.  There were 2,107 households that were made up of unrelated people and 2,275 households that were made up of some sort of institution or another collective housing.\n\n there were 5,747 single family homes (or 30.8% of the total) out of a total of 18,631 inhabited buildings.  There were 7,642 multi-family buildings (41.0%), along with 4,093 multi-purpose buildings that were mostly used for housing (22.0%) and 1,149 other use buildings (commercial or industrial) that also had some housing (6.2%).  Of the single family homes 1090 were built before 1919, while 65 were built between 1990 and 2000.  The greatest number of single family homes (3,474) were built between 1919 and 1945.[http://www.pxweb.bfs.admin.ch/Database/German_09%20-%20Bau-%20und%20Wohnungswesen/09.2%20-%20Geb%C3%A4ude%20und%20Wohnungen/09.2%20-%20Geb%C3%A4ude%20und%20Wohnungen.asp?lang\n1&prod09&secprod\n2&openChild=trueSwiss Federal Statistical Office STAT-TAB - Datenwürfel für Thema 09.2 - Gebäude und Wohnungen]   accessed 28 January 2011\n\n there were 96,640 apartments in the municipality.  The most common apartment size was 3 rooms of which there were 35,958.  There were 11,957 single room apartments and 9,702 apartments with five or more rooms.  Of these apartments, a total of 84,675 apartments (87.6% of the total) were permanently occupied, while 7,916 apartments (8.2%) were seasonally occupied and 4,049 apartments (4.2%) were empty.  , the construction rate of new housing units was 2.6 new units per 1000 residents.\n\n the average price to rent an average apartment in Basel was 1118.60 Swiss francs (CHF) per month (US$890, £500, €720 approx. exchange rate from 2003).  The average rate for a one-room apartment was 602.27 CHF (US$480, £270, €390), a two-room apartment was about 846.52 CHF (US$680, £380, €540), a three-room apartment was about 1054.14 CHF (US$840, £470, €670) and a six or more room apartment cost an average of 2185.24 CHF (US$1750, £980, €1400).  The average apartment price in Basel was 100.2% of the national average of 1116 CHF.[http://www.bfs.admin.ch/bfs/portal/de/index/themen/05/06/blank/key/einfuehrung.html Swiss Federal Statistical Office-Rental prices] 2003 data  accessed 26 May 2010  The vacancy rate for the municipality, , was 0.74%.\n\nHistorical population\n\nLanguage\n\nMost of the population () speaks German (129,592 or 77.8%), with Italian being second most common (9,049 or 5.4%) and French being third (4,280 or 2.6%). There are 202 persons who speak Romansh.\n\nReligion\n\nFrom the , 41,916 or 25.2% were Roman Catholic, while 39,180 or 23.5% belonged to the Swiss Reformed Church. Of the rest of the population, there were 4,567 members of an Orthodox church (or about 2.74% of the population), there were 459 individuals (or about 0.28% of the population) who belonged to the Christian Catholic Church, and there were 3,464 individuals (or about 2.08% of the population) who belonged to another Christian church. There were 12,368 individuals (or about 7.43% of the population) who were Islamic. There were 1,325 individuals (or about 0.80% of the population) who were Jewish, however only members of religious institutions are counted as such by the municipality, which makes the actual number of people of Jewish descent living in Basel considerably higher. There were 746 individuals who were Buddhist, 947 individuals who were Hindu and 485 individuals who belonged to another church. 52,321 (or about 31.41% of the population) belonged to no church, are agnostic or atheist, and 8,780 individuals (or about 5.27% of the population) did not answer the question.\n\nInfrastructure\n\nQuarters\n\nBasel is subdivided into 19 quarters (Quartiere). The municipalities of Riehen and Bettingen, outside the city limits of Basel, are included in the canton of Basel-Stadt as rural quarters (Landquartiere).\n\nTransport\n\nBasel's airport is set up for airfreight; heavy goods reach the city and the heart of continental Europe from the North Sea by ship along the Rhine. The main European routes for the highway and railway transport of freight cross in Basel. The outstanding location benefits logistics corporations, which operate globally from Basel. Trading firms are traditionally well represented in the Basel Region.\n\nPort\n\nBasel has Switzerland's only cargo port, through which goods pass along the navigable stretches of the Rhine and connect to ocean-going ships at the port of Rotterdam.\n\nAir transport\n\nEuroAirport Basel Mulhouse Freiburg is operated jointly by two countries, France and Switzerland, although the airport is located completely on French soil. The airport itself is split into two architecturally independent sectors, one half serving the French side and the other half serving the Swiss side; prior to Schengen there was an immigration inspection point at the middle of the airport so that people could \"emigrate\" to the other side of the airport.\n\nRailways\n\nBasel has long held an important place as a rail hub. Three railway stations — those of the German, French and Swiss networks — lie within the city (although the Swiss (Basel SBB) and French (Bâle SNCF) stations are actually in the same complex, separated by Customs and Immigration facilities). Basel Badischer Bahnhof is on the opposite side of the city. Basel's local rail services are supplied by the Basel Regional S-Bahn. The largest goods railway complex of the country  is located just outside the city, spanning the municipalities of Muttenz and Pratteln. The new highspeed ICE railway line from Karlsruhe to Basel was completed in 2008 while phase I of the TGV Rhin-Rhône line, opened in December 2011, has reduced travel time from Basel to Paris to about 3 hours.[http://www.infolignes.com/recherche.php?date_num_train2012|05|14&type_heure\n1&train_horaire_depart14|00&next_horaire\n14|00&num_train=9218 SNCF website, TGV Lyria 9218] accessed 14 May 2012\n\nRoads\n\nBasel is located on the A3 motorway.\n\nWithin the city limits, five bridges connect Greater and Lesser Basel (downstream):\n\n* Schwarzwaldbrücke (built 1972)\n* Wettsteinbrücke (current structure built 1998, original bridge built 1879)\n* Mittlere Rheinbrücke (current structure built 1905, original bridge built 1225 as the first bridge to cross the Rhine River)\n* Johanniterbrücke (built 1967)\n* Dreirosenbrücke (built 2004, original bridge built 1935)\n\nFerries\n\nA somewhat anachronistic yet still widely used system of reaction ferry boats links the two shores. There are four ferries, each situated approximately midway between two bridges. Each is attached by a cable to a block that rides along another cable spanning the river at a height of 20 or 30 metres. To cross the river, the ferryman orients the boat around 45° from the current so that the current pushes the boat across the river. This form of transportation is therefore completely hydraulically driven, requiring no outside energy source.\n[http://www.faehri.ch]\n\nPublic transport\n\nBasel has an extensive public transportation network serving the city and connecting to surrounding suburbs, including a large tram network. The green-colored local trams and buses are operated by the Basler Verkehrs-Betriebe (BVB). The yellow-colored buses and trams are operated by the Baselland Transport (BLT), and connect areas in the nearby half-canton of Baselland to central Basel. The BVB also shares commuter bus lines in cooperation with transit authorities in the neighboring Alsace region in France and Baden region in Germany. The Basel Regional S-Bahn, the commuter rail network connecting to suburbs surrounding the city, is jointly operated by SBB, SNCF and DB.\n\nBorder crossings\n\nBasel is located at the meeting point of France, Germany and Switzerland; because it is so near other countries and is beyond the Jura Mountains, many within the Swiss military reportedly believe that the city is indefensible during wartime. It has numerous road and rail crossings between Switzerland and the other two countries. With Switzerland joining the Schengen Area on 12 December 2008, immigration checks were no longer carried out at the crossings. However, Switzerland did not join the European Union Customs Union (though it did join the EU Single Market) and customs checks are still conducted at or near the crossings.\n\nFrance-Switzerland (from east to west) \n* Road crossings (with French road name continuation)\n** Kohlenstrasse (Avenue de Bâle, Huningue). This crossing replaces the former crossing Hüningerstrasse further east.\n** Elsässerstrasse (Avenue de Bâle, Saint-Louis)\n** Autobahn A3 (A35 autoroute, Saint-Louis)\n** EuroAirport Basel-Mulhouse-Freiburg – pedestrian walkway between the French and Swiss sections on Level 3 (departures) of airport.\n** Burgfelderstrasse (Rue du 1er Mars, Saint Louis)\n* Railway crossing\n** Basel SBB railway station\n\nGermany-Switzerland (clockwise, from north to south)\n* Road crossings (with German road name continuation)\n** Hiltalingerstrasse (Zollstraße, Weil am Rhein). Tram 8 goes along this road to Weil am Rhein. The extension opened in 2014; it used to end before the border.[http://www.tram8.info Tram 8 construction information page] \n** Autobahn A2 (Autobahn A5, Weil am Rhein)\n** Freiburgerstrasse (Baslerstraße, Weil am Rhein)\n** Weilstrasse, Riehen (Haupstraße, Weil am Rhein)\n** Lörracherstrasse, Riehen (Baslerstraße, Stetten, Lörrach)\n** Inzlingerstrasse, Riehen (Riehenstraße, Inzlingen)\n** Grenzacherstrasse (Hörnle, Grenzach-Wyhlen)\n* Railway crossing\n** Between Basel SBB and Basel Badischer Bahnhof – Basel Badischer Bahnhof, and all other railway property and stations on the right bank of the Rhine belong to DB and are classed as German customs territory. Immigration and customs checks are conducted at the platform exit tunnel for passengers leaving trains here.\n\nAdditionally there are many footpaths and cycle tracks crossing the border between Basel and Germany.\n\nHealth\n\nAs the biggest town in the Northwest of Switzerland numerous public and private health centres are located in Basel. Among others the Universitätsspital Basel as well as the Universitätskinderspital Basel. The anthroposophical health institute Klinik-Arlesheim (formerly known as Lukas-Klinik and Ita-Wegman-Klinik) are both located in the Basel area as well. Private health centres include the Bethesda Spital and the Merian Iselin Klinik. Additionally the Swiss Tropical and Public Health Institute is located in Basel too.  \n\nEnergy\n\nBasel is at the forefront of a national vision to more than halve energy use in Switzerland by 2050. In order to research, develop and commercialise the technologies and techniques required for the country to become a '2000 Watt society', a number of projects have been set up since 2001 in the Basel metropolitan area. These including demonstration buildings constructed to MINERGIE or Passivhaus standards, electricity generation from renewable energy sources, and vehicles using natural gas, hydrogen and biogas.[http://www.basel.ch/en/basel/urban_development/2000_watt_society The Basel pilot region of the 2000 Watt Society]  \nA building construction law was passed in 2002 also which stated that all new flat roofs must be greened leading to Basel becoming the world’s leading green roof city. This was driven by an energy saving programme. Carter, J.G. 2011, \"Climate change adaptation in European cities\", Current Opinion in Environmental Sustainability, vol. 3, no. 3, pp. 193-198.\n\nA hot dry rock geothermal energy project was cancelled in 2009 since it caused induced seismicity in Basel.\n\nEconomy\n\nThe city of Basel, located in the heart of the tri-border region (called Dreiländereck) is one of the most dynamic economic regions of Switzerland.\n\n, Basel had an unemployment rate of 3.7%. , there were 18 people employed in the primary economic sector and about 9 businesses involved in this sector.  34,645 people were employed in the secondary sector and there were 1,176 businesses in this sector.  120,130 people were employed in the tertiary sector, with 8,908 businesses in this sector.  There were 82,449 residents of the municipality who were employed in some capacity, of which females made up 46.2% of the workforce.\n\n the total number of full-time equivalent jobs was 130,988. The number of jobs in the primary sector was 13, of which 10 were in agriculture and 4 were in forestry or lumber production.  The number of jobs in the secondary sector was 33,171 of which 24,848 or (74.9%) were in manufacturing, 10 were in mining and 7,313 (22.0%) were in construction.  The number of jobs in the tertiary sector was 97,804. In the tertiary sector; 12,880 or 13.2% were in wholesale or retail sales or the repair of motor vehicles, 11,959 or 12.2% were in the movement and storage of goods, 6,120 or 6.3% were in a hotel or restaurant, 4,186 or 4.3% were in the information industry, 10,752 or 11.0% were the insurance or financial industry, 13,695 or 14.0% were technical professionals or scientists, 6,983 or 7.1% were in education and 16,060 or 16.4% were in health care.[http://www.pxweb.bfs.admin.ch/Database/German_06%20-%20Industrie%20und%20Dienstleistungen/06.2%20-%20Unternehmen/06.2%20-%20Unternehmen.asp?lang1&prod\n06&secprod2&openChild\ntrue Swiss Federal Statistical Office STAT-TAB Betriebszählung: Arbeitsstätten nach Gemeinde und NOGA 2008 (Abschnitte), Sektoren 1-3]   accessed 28 January 2011\n\n, there were 121,842 workers who commuted into the municipality and 19,263 workers who commuted away.  The municipality is a net importer of workers, with about 6.3 workers entering the municipality for every one leaving.  About 23.9% of the workforce coming into Basel are coming from outside Switzerland, while 1.0% of the locals commute out of Switzerland for work.[https://archive.is/20120804043150/http://www.media-stat.admin.ch/stat/pendler/pop.php Swiss Federal Statistical Office - Statweb]  accessed 24 June 2010  Of the working population, 49.2% used public transportation to get to work, and 18.7% used a private car.\n\nThe Roche Tower, designed by Herzog & de Meuron is 41 floors and 178 m high, upon its opening in 2015 it has become the tallest building in Switzerland. Basel has also Switzerland's third tallest building (Basler Messeturm, 105 m) and Switzerland's tallest tower (St. Chrischona TV tower, 250 m).\n\nChemical industry\n\nThe Swiss chemical industry operates largely from Basel, and Basel also has a large pharmaceutical industry. Novartis,Chen, Aric. \"[http://travel.nytimes.com/2006/06/11/travel/11goingto.html Going to Basel].\" The New York Times. 11 June 2006. Retrieved on 12 January 2010. Syngenta, Ciba Specialty Chemicals, Clariant,Anna Bálint: Clariant clareant. The beginnings of a specialty chemicals company, Campus Verlag, Frankfurt am Main/New York 2012, . Hoffmann-La Roche, Basilea Pharmaceutica and Actelion are headquartered there. Pharmaceuticals and specialty chemicals have become the modern focus of the city's industrial production.\n\nBanking\n\nBanking is extremely important to Basel:\n* UBS AG maintains central offices in Basel,\"[https://apps2.ubs.com/locationfinder/search.do?GeoEntityId29&GeoEntityType\n6 UBS AG in Basel, Aeschenvorstadt 1].\" ([https://apps2.ubs.com/locationfinder/search.do?GeoEntityId6592&GeoEntityType\n7&EntityTypeId0&Type\npdf PDF version]) UBS AG. Retrieved on 2 July 2010.\n* The Bank for International Settlements is located within the city and is the central banker's bank. The bank is controlled by a board of directors, which is composed of the elite central bankers of 11 different countries (US, UK, Belgium, Canada, France, Germany, Italy, Japan, Switzerland, the Netherlands and Sweden).\nAccording to the BIS, \"The choice of Switzerland for the seat of the BIS was a compromise by those countries that established the BIS: Belgium, France, Germany, Italy, Japan, the United Kingdom and the United States. When consensus could not be reached on locating the Bank in London, Brussels or Amsterdam, the choice fell on Switzerland. An independent, neutral country, Switzerland offered the BIS less exposure to undue influence from any of the major powers. Within Switzerland, Basel was chosen largely because of its location, with excellent railway connections in all directions, especially important at a time when most international travel was by train.\"\nCreated in May 1930, the BIS is owned by its member central banks, which are private entities. No agent of the Swiss public authorities may enter the premises without the express consent of the bank.[http://www.bis.org/about/headquart-en.pdf Agreement between the Swiss Federal Council and the Bank for International Settlements to determine the Bank's legal status in Switzerland] The bank exercises supervision and police power over its premises. The bank enjoys immunity from criminal and administrative jurisdiction, as well as setting recommendations which become standard for the world's commercial banking system.\n* Basel is also the location of the Basel Committee on Banking Supervision, which is distinct from the BIS. It usually meets at the BIS premises in Basel. Responsible for the Basel Accords (Basel I, Basel II and Basel III), this organization fundamentally changed Risk Management within its industry.\n* Basel also hosts the headquarters of the Global Infrastructure Basel Foundation, which is active in the field of sustainable infrastructure (financing).\n\nAir\n\nSwiss International Air Lines, the national airline of Switzerland, is headquartered on the grounds of EuroAirport Basel-Mulhouse-Freiburg in Saint-Louis, Haut-Rhin, France, near Basel.\"[http://www.swiss.com/web/EN/about_swiss/company/Pages/facts_figures.aspx Facts and figures].\" Swiss International Air Lines. Retrieved on 13 June 2009.\"[http://saint-louis.plan-interactif.com/index.php?detect=flash Plan interactif] .\" Saint-Louis (Haut-Rhin). Retrieved on 25 September 2009.\"[http://www.swiss.com/web/EN/various/Documents/Direction_Basel.pdf Swiss International Air Lines Basel] .\" Swiss International Air Lines. Retrieved on 24 September 2009. Prior to the formation of Swiss International Air Lines, the regional airline Crossair was headquartered near Basel.\"[https://web.archive.org/web/20020202015152/http://www.crossair.com/en/ourcompany/location/index.html Location].\" Crossair. Retrieved on 13 June 2009.\n\nMedia\n\nBasler Zeitung (\"BaZ\"), TagesWoche and bz Basel are the local newspapers. The local TV Station is called telebasel. The German-speaking Swiss Radio and Television SRF company, part of the Swiss Broadcasting Corporation SRG SSR, holds offices in Basel as well. The academic publishers Birkhäuser, Karger and MDPI are based in Basel.\n\nTrade fairs\n\nAn annual Federal Swiss trade fair (Mustermesse) takes place in Kleinbasel on the right bank of the Rhine since 1917. Other important trade shows include \"Baselworld\" (watches and jewelry), Art Basel in Basel, Swissbau and Igeho.\n\nEducation\n\nBesides Humanism the city of Basel has also always been very famous for its achievement in the field of mathematics. Among others the mathematician Leonhard Euler and the Bernoulli family have done research and been teaching at the local institutions for centuries. In 1910 the Swiss Mathematical Society was founded in the city and in the mid-twentieth century the Russian mathematician Alexander Ostrowski taught at the local university. \nIn 2000 about 57,864 or (34.7%) of the population have completed non-mandatory upper secondary education, and 27,603 or (16.6%) have completed additional higher education (either university or a Fachhochschule). Of the 27,603 who completed tertiary schooling, 44.4% were Swiss men, 31.1% were Swiss women, 13.9% were non-Swiss men and 10.6% were non-Swiss women.\n\nIn 2010 11,912 students attended the University of Basel (55% female). 25% were foreign nationals, 16% were from canton of Basel-Stadt. In 2006 6162 students studied at one of the nine academies of the FHNW (51% female).\n\n, there were 5,820 students in Basel who came from another municipality, while 1,116 residents attended schools outside the municipality.\n\nUniversities\n\nBasel hosts Switzerland's oldest university, the University of Basel, dating from 1460. Erasmus, Paracelsus, Daniel Bernoulli, Leonhard Euler, Jacob Burckhardt, Friedrich Nietzsche, Tadeusz Reichstein, Karl Jaspers, Carl Gustav Jung and Karl Barth worked here. The University of Basel is currently counted among the 90 best educational institutions worldwide.Christoph Eymann, BaZ-Article (German): http://bazonline.ch/basel/stadt/mehr-als-nur-wirtschaftsmotor/story/16443640?track\n\nIn 2007, the ETH (Swiss Federal Institute of Technology Zürich) established the Department of Biosystems Science and Engineering (D-BSSE) in Basel. The creation of the D-BSSE was driven by a Swiss-wide research initiative SystemsX, and was jointly supported by funding from the ETH Zürich, the Swiss Government, the Swiss University Conference (SUC) and private industry.\n\nBasel also hosts several academies of the Fachhochschule Nordwestschweiz|Fachhochschule NW (FHNW): the FHNW Academy of Art and Design, FHNW Academy of Music, and the FHNW School of Business.\n\nBasel is renowned for various scientific societies, such as the Entomological Society of Basel (Entomologische Gesellschaft Basel, EGB), which celebrated its 100th anniversary in 2005.[http://www.egbasel.ch/ EGB website-Wer sind wir]  accessed 14 May 2012\n\nVolksschule\n\nIn 2005 16,939 pupils and students visited the Volksschule (the obligatory school time, including Kindergarten (127), primary schools (Primarschule, 25), and lower secondary schools (Sekundarschule, 10), of which 94% visited public schools and 39.5% were foreign nationals. In 2010 already 51.1% of all pupils spoke another language than German as their first language. In 2009 3.1% of the pupils visited special classes for pupils with particular needs. The average amount of study in primary school in Basel is 816 teaching hours per year.\n\nUpper secondary school\n\nIn 2010 65% of the youth finished their upper secondary education with a vocational training and education, 18% finished their upper secondary education with a Federal Matura at one of the five gymnasiums, 5% completed a Fachmaturität at the FMS, 5% completed a Berufsmaturität synchronosly to their vocational training, and 7% other kind of upper secondary maturity. 14.1% of all students at public gymnasiums were foreign nationals. The Maturity quota in 2010 was on a record high at 28.8% (32.8 female, 24.9% male).\n\nBasel has five public gymnasiums (', ', ', ', '), each with its own profiles (different focus on major subjects, such as visual design, biology and chemistry, Italian, Spanish, or Latin languages, music, physics and applied mathematics, philosophy/education/psychology, and economics and law) that entitles students with a successful Matura graduation to attend universities. And one Fachmaturitätsschule, the FMS, with six different major subjects (health/natural sciences, education, social work, design/art, music/theatre/dance, and communication/media) that entitles students with a successful Fachmatura graduation to attend Fachhochschulen. Four different höhere Fachschulen (higher vocational schools such as Bildungszentrum Gesundheit Basel-Stadt (health), Allgemeine Gewerbeschule Basel (trade), Berufsfachschule Basel, Schule für Gestaltung Basel (design)) allows vocational students to improve their knowledge and know-how.\n\nInternational schools\n\nAs a city with a percentage of foreigners of more than thirty-five percent and as one of the most important centres in the chemical and pharmaceutical field in the world, Basel counts several International Schools including: Academia International School, École Française de Bâle, Freies Gymnasium Basel (private), Gymnasium am Münsterplatz (public), Schweizerisch-italienische Primarschule Sandro Pertini, and Swiss International School (Basel).International School of Basel - webpage: http://www.isbasel.ch\n\nLibraries\n\nBasel is home to at least 65 libraries. Some of the largest include; the Universitätsbibliothek Basel (main university library), the special libraries of the University of Basel, the Allgemein Bibliotheken der Gesellschaft für Gutes und Gemeinnütziges (GGG) Basel, the Library of the Pädagogische Hochschule, the Library of the Hochschule für Soziale Arbeit and the Library of the Hochschule für Wirtschaft.  There was a combined total () of 8,443,643 books or other media in the libraries, and in the same year a total of 1,722,802 items were loaned out.[http://www.bfs.admin.ch/bfs/portal/de/index/themen/16/02/02/data.html Swiss Federal Statistical Office, list of libraries]  accessed 14 May 2010\n\nCulture\n\nMain sights\n\nThe red sandstone Münster, one of the foremost late-Romanesque/early Gothic buildings in the Upper Rhine, was badly damaged in the great earthquake of 1356, rebuilt in the 14th and 15th century, extensively reconstructed in the mid-19th century and further restored in the late 20th century.[http://www.baslermuenster.ch/sub_architektur_jh_20.html Basel Münster website - Architecture 20th century]  accessed 4 May 2012 A memorial to Erasmus lies inside the Münster. The City Hall from the 16th century is located on the Market Square and is decorated with fine murals on the outer walls and on the walls of the inner court.\n\nBasel is also host to an array of buildings by internationally renowned architects. These include the Beyeler Foundation by Renzo Piano, or the Vitra complex in nearby Weil am Rhein, composed of buildings by architects such as Zaha Hadid (fire station), Frank Gehry (Design Museum), Álvaro Siza Vieira (factory building) and Tadao Ando (conference centre). Basel also features buildings by Mario Botta (Jean Tinguely Museum and Bank of International settlements) and Herzog & de Meuron (whose architectural practice is in Basel, and who are best known as the architects of Tate Modern in London and the Bird's Nest in Beijing, the Olympia stadium, which was designed for use throughout the 2008 Summer Olympics and Paralympics). The city received the Wakker Prize in 1996.\n\nHeritage sites\n\nBasel features a great number of heritage sites of national significance.\n\nThese include the entire Old Town of Basel as well as the following buildings and collections: \n\n;Churches and monasteries :Old Catholic Prediger Kirche (church), Bischofshof with Collegiate church at Rittergasse 1, Domhof at Münsterplatz 10–12, former Carthusian House of St Margarethental, Catholic Church of St Antonius, Lohnhof (former Augustinians Collegiate Church), Mission 21, Archive of the Evangelisches Missionswerk Basel, Münster of Basle (cathedral), Reformed Elisabethenkirche (church), Reformed Johanneskirche (church), Reformed Leonhardskirche (church, former Augustinians Abbey), Reformed Martinskirche (church), Reformed Pauluskirche (church), Reformed Peterskirche (church), Reformed St. Albankirche (church) with cloister and cemetery, Reformed Theodorskirche (church), Synagoge at Eulerstrasse 2\n\n;Secular buildings:Badischer Bahnhof (Geman Baden's railway station) with fountain, Bank for International Settlements, Blaues Haus (Reichensteinerhof) at Rheinsprung 16, Bruderholzschule (school house) at Fritz-Hauser-Strasse 20, Brunschwiler Haus at Hebelstrasse 15, Bahnhof Basel SBB (Swiss railway station), Bürgerspital (hospital), Café Spitz (Merianflügel), Coop Schweiz company's central archive, Depot of the Archäologischen Bodenforschung des Kanton Basel-Stadt, former Gallizian Paper Mill and Swiss Museum of Paper, former Klingental-Kaserne (casern) with Klingentaler Kirche (church), Fasnachtsbrunnen (fountain), Feuerschützenhaus (guild house of the riflemen) at Schützenmattstrasse 56, Fischmarktbrunnen (fountain), Geltenzunft at Marktplatz 13, Gymnasium am Kohlenberg (St Leonhard) (school), Hauptpost (main post office), Haus zum Raben at Aeschenvorstadt 15, Hohenfirstenhof at Rittergasse 19, Holsteinerhof at Hebelstrasse 30, Markgräflerhof a former palace of the margraves of Baden-Durlach,Mittlere Rhein Brücke (Central Rhine Bridge), Stadtcasino (music hall) at Steinenberg 14, Ramsteinerhof at Rittergasse 7 and 9, Rathaus (town hall), Rundhof building of the Schweizerischen Mustermesse, Safranzunft at Gerbergasse 11, Sandgrube at Riehenstrasse 154, Schlösschen (Manor house) Gundeldingen, Schönes Haus and Schöner Hof at Nadelberg 6, Wasgenring school house, Seidenhof with painting of Rudolf von Habsburg, Spalenhof at Spalenberg 12, Spiesshof at Heuberg 7, city walls, Townhouse (former post office) at Stadthausgasse 13 / Totengässlein 6, Weisses Haus at Martinsgasse 3, Wildt'sches Haus at Petersplatz 13, Haus zum Neuen Singer at Speiserstrasse 98, Wolfgottesacker at Münchensteinerstrasse 99, Zerkindenhof at Nadelberg 10.\n\n;Archaeological sites: The Celtic Settlement at Gasfabrik, Münsterhügel and Altstadt (historical city, late La Tène and medieval settlement).\n\n;Museums, archives and collections: Basel calls itself the Cultural Capital of Switzerland.\n\nAmong others, there is the Anatomical Museum of the University Basel, Berri-Villen and Museum of Ancient Art Basel and Ludwig Collection, Former Franciscan Barefoot Order Church and Basel Historical Museum, Company Archive of Novartis, Haus zum Kirschgarten which is part of the Basel Historical Museum, \nHistoric Archive Roche and Industrial Complex Hoffmann-La Roche, \nJewish Museum of Switzerland, Caricature & Cartoon Museum Basel, Karl Barth-Archive, Kleines Klingental (Lower Klingen Valley) with Museum Klingental, \nArt Museum of Basel, hosting the world's oldest art collection accessible to the public, \nNatural History Museum of Basel and the Museum of Cultures Basel, Museum of Modern Art Basel with the E. Hoffmann collection, Museum Jean Tinguely Basel, Music Museum, Pharmacy Historical Museum of the University of Basel, Poster Collection of the School for Design (Schule für Gestaltung), Swiss Business Archives, Sculpture Hall, Sports Museum of Switzerland, Archives of the Canton of Basel-Stadt, UBS AG Corporate Archives, University Library with manuscripts and music collection, Zoological Garden (Zoologischer Garten).\n\nTheatre and music\n\nBasel is the home of the Schola Cantorum Basiliensis, founded in 1933, a worldwide centre for research on and performance of music from the Medieval through the Baroque eras. Theater Basel, chosen in 1999 as the best stage for German-language performances and in 2009 and 2010 as \"Opera of the Year\" by German Opera Magazine \"Opernwelt\",[https://web.archive.org/web/20110107230642/http://www.basel-virtuell.ch/en/culture Basel: culture pure] basel-virtuell.ch. Retrieved on 24 March 2010 presents a busy schedule of plays in addition to being home to the city's opera and ballet companies.  Basel is home to the largest orchestra in Switzerland, the Sinfonieorchester Basel. It is also the home of the Kammerorchester Basel, which is recording the complete symphonies of Ludwig van Beethoven for the Sony label led by its music director Giovanni Antonini. The Schola Cantorum and the Basler Kammerorchester were both founded by the conductor Paul Sacher who went on to commission works by many leading composers. The Paul Sacher Foundation, opened in 1986, houses a major collection of manuscripts, including the entire Igor Stravinsky archive.\nThe baroque orchestras La Cetra and Capriccio Basel are also based in Basel. In May 2004, the fifth European Festival of Youth Choirs (Europäisches Jugendchorfestival, or EJCF) choir festival opened: this Basel tradition started in 1992. Host of this festival is the local Basel Boys Choir.\n\nIn 1997, Basel contended to become the \"European Capital of Culture\", though the honor went instead to Thessaloniki.\n\nMuseums\n\nThe Basel museums cover a broad and diverse spectrum of collections with a marked concentration in the fine arts. They house numerous holdings of international significance. The over three dozen institutions yield an extraordinarily high density of museums compared to other cities of similar size and draw over one million visitors annually.\n\nConstituting an essential component of Basel culture and cultural policy, the museums are the result of closely interwoven private and public collecting activities and promotion of arts and culture going back to the 16th century. The public museum collection was first created back in 1661 and represents the oldest public collection in continuous existence. Since the late 1980s, various private collections have been made accessible to the public in new purpose-built structures that have been recognized as acclaimed examples of avant-garde museum architecture.\n\n* Antikenmuseum Basel und Sammlung Ludwig Ancient cultures of the mediterranean museum\n* Augusta Raurica Roman open-air museum\n* Basel Paper Mill ()\n* Beyeler Foundation (Foundation Beyeler) [http://www.beyeler.com/ Beyeler Museum (Fondation Beyeler)]\n* Botanical Garden Basel [https://www.unibas.ch/en/University/University-Society/Botanical-Garden.html One of the oldest botanical gardens in the world]\n* Caricature & Cartoon Museum Basel ()\n* Dollhouse Museum () a museum houring the largest teddy bear collection in Europe.\n* Foundation Fernet Branca () in Saint-Louis, Haut-Rhin near Basel. Modern art collection.\n* Historical Museum Basel ()\n* Kunsthalle Basel Modern and contemporary art museum\n* Kunstmuseum Basel Upper Rhenish and Flemish paintings, drawings from 1400 to 1600 and 19th- to 21st-century art\n* Monteverdi Automuseum\n* Museum of Cultures Basel () Large collections on European and non-Europeancultural life\n* Museum of Contemporary Art Art from the 1960s up to the present\n* Music Museum () of the Basel Historic Museum\n* Natural History Museum of Basel ()\n* Pharmazie-Historisches Museum der Universität Basel\n* Schaulager Modern and contemporary art museum\n* Swiss Architecture Museum ()\n* Tinguely Museum Life and work of the major Swiss iron sculptor Jean Tinguely\n* Vitra Design Museum Museum in Weil am Rhein near Basel\n* Jewish Museum of Switzerland\n\nEvents\n\nThe city of Basel is a centre for numerous fairs and events all year round. One of the most important fairs for contemporary art worldwide is the Art Basel which was founded in 1970 by Ernst Beyeler and takes place in June each year. Baselworld, the watch and jewellery show (Uhren- und Schmuckmesse) one of the biggest fairs of its kind in Europe is held every year as well, and attracts a great number of tourists and dealers to the city. The carnival of the city of Basel (Basler Fasnacht) is a major cultural event in the year. The carnival is the biggest in Switzerland and attracts large crowds every year, despite the fact that it starts at exactly four in the morning (Morgestraich) on a winter Monday. The Fasnacht asserts Basel's Protestant history by commencing the revelry five days after Ash Wednesday and continuing day and night for exactly 72 hours. Almost all study and work in the old city cease. Dozens of fife and drum clubs parade in medieval guild tradition with fantastical masks and illuminated lanterns.\n\nCuisine\n\nThere are a number of culinary specialties originating in Basel, including Basler Läckerli cookies and Mässmogge candies. Being located in the meeting place between Switzerland, France and Germany the culinary landscape as a whole is very varied and diverse, making it a city with a great number of restaurants of all sorts.\n\nZoo\n\nZoo Basel is, with over 1.7 million visitors per year,[http://bazonline.ch/basel/stadt/Trotz-Grossbaustelle-Besucherrekord-beim-Zolli/story/10759447  Besucherrekord beim Zolli]. Basler Zeitung, published 23 February 2012 the most visited tourist attraction in Basel and the second most visited tourist attraction in Switzerland.[http://www.20min.ch/news/basel/story/25637966  Zolli beliebt] . 20min.ch, published 23 February 2009\n\nEstablished in 1874, Zoo Basel is the oldest zoo in Switzerland and, by number of animals, the largest. Through its history, Zoo Basel has had several breeding successes, such as the first worldwide Indian rhinoceros birth[http://www.zoobasel.ch/aktuell/detail.php?NEWSID\n37  Eröffnung des Panzernashornhauses] . Zoo Basel, written 2006-09-26, retrieved 3 December 2009 and Greater flamingo hatch in a zoo. These and other achievements led Forbes Travel to rank Zoo Basel as one of the fifteen best zoos in the world in 2008.[http://www.getlisty.com/preview/worlds-best-zoos/ Forbes Travel]. GetListy, retrieved 26 March 2010\n\nDespite its international fame, Basel's population remains attached to Zoo Basel, which is entirely surrounded by the city of Basel.  Evidence of this is the millions of donations money each year, as well as Zoo Basel's unofficial name: locals lovingly call \"their\" zoo \"Zolli\" by which is it known throughout Basel and most of Switzerland.\n\nSport\n\nBasel has a reputation in Switzerland as a successful sporting city. The football club FC Basel continues to be successful and in recognition of this the city was one of the Swiss venues for the 2008 European Championships, as well as Geneva, Zürich and Bern. The championships were jointly hosted by Switzerland and Austria. BSC Old Boys and Concordia Basel are the other football teams in Basel.\n\nAmong the most popular sports in Switzerland is Ice hockey. Basel is home to the EHC Basel which plays in the MySports League, the third tier of the Swiss ice hockey league system. They play their home games in the 6,700-seat St. Jakob Arena. The team previously played in the National League and the Swiss League, but they had to fill a bankruptcy case after the 2013-14 Swiss League season.\n\nBasel features a large football stadium that has been awarded four stars by UEFA, a modern ice hockey hall, and an admitted sports hall.\n\nA large indoor tennis event takes place in Basel every October. Some of the best ATP-Professionals play every year at the Swiss Indoors, including Switzerland's biggest sporting hero and frequent participant Roger Federer, a Basel native who describes the city as \"one of the most beautiful cities in the world\".\n\nThe annual Basel Rhine Swim draws several thousand visitors to the city to swim in or float on the Rhine river.\n\nWhile football and ice hockey are by far the most popular sports, basketball has a very small but faithful fan base. The top division, called NLA, is a semi-professional league and has one team from the Basel region, the \"Birstal Starwings\".\nTwo players from Switzerland are currently active in the NBA, Thabo Sefolosha and Clint Capela. \nAs in most European countries, and contrary to the U.S., Switzerland has a club-based rather than a school-based competition system.[http://www.unibaselbasket.ch/english.html] The Starwings Basel are the only first division basketball team in German-speaking Switzerland.[http://www.indoorsports.ch/de/alle/detail-alle-sportarten/news/detail/News/starwings-die-exoten-aus-basel/ Starwings - die Exoten aus Basel], indoorsports.ch , accessed 5 September 2015.\n\nPicture gallery\n\nFile:Museum der Kulturen 2008-03-30.jpg|Museum of Cultures\nFile:Mittlere Brücke.jpg|Mittlere Rheinbrücke (Central Rhine Bridge)\nFile:Basler Kunstmuseum.jpg|Kunstmuseum Basel (Art Museum Basel)\nFile:Haus zum Kirschgarten 2008-03-30.jpg|Haus zum Kirschgarten\nFile:Basel Barfüsserkirche Inneres 11-05-2008.jpg| Former Franciscan Barefoot Order Church\nFile:Antikenmuseum Basel 2008-03-30.jpg|Berri-Villen and Antikenmuseum Basel\nFile:Basel - Bank für internationalen Zahlungsausgleich3.jpg|Bank for International Settlements\nFile:Basel, straatzicht Steinenberg-Sankt Alban Graben foto3 2013-07-27 09.48.jpg|Steinenberg-Sankt Alban Graben\nFile:Basel, straatzicht Barfüssenplatz foto4 2013-07-27 10.01.jpg|Barfüsserplatz\nFile:Basler - Basler Münster Westfassade.jpg|Basler Münster\nFile:Munsterplatz, Basel, Switzerland.jpg|Münsterplatz\nFile:Rathaus-004.jpg|Rathaus, Basel's Town Hall\nFile:Basel, Wettsteinbrücke met kathedraal op de achtergrond foto10 2013-07-21 09.08.jpg|Wettsteinbrücke\n\nNotes and references\n\nNotes\n\n=. Basel. http://en.wikipedia.org/?curid=4911."
  }
}
