{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18291",
  "eid" : "32053ae0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778593166,
  "textBody" : "Luxembourgish, Luxemburgish or Letzeburgesch ( or) (Luxembourgish: Lëtzebuergesch) is a West Germanic language that is spoken mainly in Luxembourg. Worldwide, about 390,000 people speak Luxembourgish.\n\nWhile it could be considered a standardized variety (i.e., a dialect with a written form) of German, its official use in the state of Luxembourg and the existence of a separate regulatory body[http://www.cpll.lu/pdf/loi_2004.pdf Law establishing the Conseil Permanent de la Langue Luxembourgeoise (CPLL)] has removed Luxembourgish, at least in part, from the domain of the Dachsprache Standard German. Despite the lack of a sharp boundary between Luxembourgish and the neighboring German dialects, this has led several linguists (from Luxembourg as well as Germany) to regard it as a separate, yet closely related language.\n\nLanguage family\n\nLuxembourgish belongs to the West Central German group of High German languages and is the primary example of a Moselle Franconian language.\n\nUsage\n\nLuxembourgish is the national language of Luxembourg and one of three administrative languages, alongside French and German.[http://www.legilux.public.lu/leg/a/archives/1984/0162702/index.html Mémorial A no. 16 (27 February 1984), pp. 196–7:  \"Loi du 24 février 1984 sur le régime des langues\".]\n\nLuxembourgish is also spoken in the Arelerland region of Belgium (part of the Province of Luxembourg) and in small parts of Lorraine in France.\n\nIn the German Eifel and Hunsrück regions, and in Lorraine, similar local Moselle Franconian dialects of German are spoken. The language is also spoken by a few descendants of Luxembourg immigrants in the United States, and another similar Moselle Franconian dialect is spoken by ethnic Germans long settled in Transylvania, Romania (Siebenbürgen).\n\nMoselle Franconian dialects outside the Luxembourg state border tend to have far fewer French loan words, and these mostly remain from the French Revolution.\n\nVarieties\n\nThere are several distinct dialect forms of Luxembourgish including Areler (from Arlon), Eechternoacher (Echternach), Kliärrwer (Clervaux), Miseler (Moselle), Stater (Luxembourg), Veiner (Vianden), Minetter (Southern Luxembourg) and Weelzer (Wiltz). Further small vocabulary differences may be seen even between small villages.\n\nIncreasing mobility of the population and the dissemination of the language through mass media such as radio and television are leading to a gradual standardisation towards a \"Standard Luxembourgish\" through the process of koineization.[http://www.ulrichammon.de/resources/Stellung_der_deutschen_Sprache.pdf Ammon, Ulrich - Die Stellung der deutschen Sprache in der Welt (de Gruyter Mouton)]; \n\nSurrounding languages\n\nThere is no distinct geographic boundary between the use of Luxembourgish and the use of other closely related High German dialects (for example Lorraine Franconian); it instead forms a dialect continuum of gradual change.\n\nSpoken Luxembourgish is relatively hard to understand for speakers of German who are generally not familiar with Moselle Franconian dialects (or at least other West Central German dialects). However, they can usually read the language to some degree. For those Germans familiar with Moselle Franconian dialects, it is relatively easy to understand and speak Luxembourgish as far as the everyday vocabulary is concerned. However, the large number of French loanwords in Luxembourgish may hamper communication about certain topics, or with certain speakers (who use many French loanwords).\n\nThere is no intelligibility between Luxembourgish and French or any of the Romance dialects spoken in the adjacent parts of Belgium and France.\n\nErna Hennicot-Schoepges, President of the Christian Social People's Party of Luxembourg 1995–2003, was active in promoting the language beyond Luxembourg's borders.\n\nWritten Luxembourgish\n\nStandardisation\n\nA number of proposals for standardising the orthography of Luxembourgish can be documented, going back to the middle of the 19th century. There was no officially recognised system, however, until the adoption of the \"OLO\" (ofizjel lezebuurjer ortografi) on 5 June 1946.[http://www.legilux.public.lu/leg/a/archives/1946/0400709/index.html Mémorial A no. 40 (7 September 1946), pp. 637–41: \"Arrêté ministériel du 5 juin 1946 portant fixation d'un système officiel d'orthographe luxembourgeois\"] This orthography provided a system for speakers of all varieties of Luxembourgish to transcribe words the way they pronounced them, rather than imposing a single, standard spelling for the words of the language. The rules explicitly rejected certain elements of German orthography (e.g., the use of \"ä\" and \"ö\",\"Et get kèèn ä geshriven. […] Et get kèèn ö geshriven.\" (p. 639) the capitalisation of nouns). Similarly, new principles were adopted for the spelling of French loanwords.\n* ', ', ', ' (cf. German ', ', ', ')\n* ', ', ', ' (cf. French ', ', ', ')\nThis proposed orthography, so different from existing \"foreign\" standards that people were already familiar with, did not enjoy widespread approval.\n\nA more successful standard eventually emerged from the work of the committee of specialists charged with the task of creating the Luxemburger Wörterbuch, published in 5 volumes between 1950 and 1977. The orthographic conventions adopted in this decades-long project, set out in Bruch (1955), provided the basis of the standard orthography that became official on 10 October 1975.Mémorial B no. 68 (16 November 1976), pp. 1365–90: \"Arrêté ministériel du 10 octobre 1975 portant réforme du système officiel d'orthographe luxembourgeoise\". Modifications to this standard were proposed by the Conseil permanent de la langue luxembourgeoise and adopted officially in the spelling reform of 30 July 1999.[http://www.legilux.public.lu/leg/a/archives/1999/1121108/index.html Mémorial A no. 112 (11 August 1999), pp. 2040–8: \"Règlement grand-ducal du 30 juillet 1999 portant réforme du système officiel d'orthographe luxembourgeoise\".] A detailed explanation of current practice for Luxembourgish can be found in Schanen & Lulling (2003).\n\nAlphabet\n\nThe Luxembourgish alphabet consists of the 26 Latin letters plus three letters with diacritics: \"é\", \"ä\", and \"ë\". In loanwords from French and Standard German, other diacritics are usually preserved:\n* French: Boîte, Enquête, Piqûre, etc.\n* German: blöd, Bühn (but German Bühne), etc.\n\nEifeler Regel\n\nLike many other varieties of Western High German, Luxembourgish has a rule of final n-deletion in certain contexts. The effects of this rule (known as the \"Eifel Rule\") are indicated in writing, and therefore must be taken into account when spelling words and morphemes ending in  or . For example:\n* wann ech ginn \"when I go\", but wa mer ginn \"when we go\"\n* fënnefandrësseg \"thirty-five\", but fënnefavéierzeg \"forty-five\".\n\nPhonology\n\nConsonants\n\nThe consonant inventory of Luxembourgish is quite similar to that of Standard German.\n\n* occurs only in loanwords from Standard German. Just as among many native German-speakers, it tends to be simplified to word-initially. For example, Pflicht ('obligation') is pronounced, or in careful speech.\n* is realized as when it occurs after, e.g. zwee ('two').\n* appears only in a few words, such as spadséieren ('to go for a walk').\n* occurs only in loanwords from English.\n* have two types of allophones: alveolo-palatal,]}} and uvular,]}}. The latter occur before back vowels, whereas the former occur in all other positions.\n** The allophone appears only in a few words. Note that an increasing number of speakers do not distinguish between the alveolo-palatal allophones of and the postalveolar phonemes.\n* Younger speakers tend to vocalize the word-final to a central vowel or.\n\nVowels\n\n* The front rounded vowels appear only in loanwords from French and Standard German. In loanwords from French, nasal also occur. \n* has two allophones:\n** Before velars: close-mid front unrounded, which for some speakers may be open-mid - this is especially frequent before. Exactly the same variation applies to (except that it is back rounded).\n** All other positions: mid central vowel, more often slightly rounded than unrounded.\n* Phonetically, the long mid vowels are raised close-mid (near-close),]}}, and may even overlap with.\n** before is realized as.\n* is the long variant of, not (which does not have a long counterpart).\n\n* appears only in loanwords from Standard German.\n* The first elements of may be phonetically short in fast speech or in unstressed syllables.\n* The and contrasts arose from the former lexical tone contrast; the shorter were used in words with Accent 1, whereas the lengthened were used in words with Accent 2.\n\nGrammar\n\nNominal syntax\n\nLuxembourgish has three genders (masculine, feminine, and neuter), and has three cases (nominative, accusative, and dative). These are marked morphologically on determiners and pronouns. As in German, there is no morphological gender distinction in the plural.\n\nThe forms of the articles and of some selected determiners are given below:\n\nAs seen above, Luxembourgish has plural forms of en (\"a, an\"), namely eng in the nominative/accusative and engen in the dative. They are not used as indefinite articles, which—as in German and English—do not exist in the plural, but they do occur in the compound pronouns wéi en (\"what, which\") and sou en (\"such\"). For example: wéi eng Saachen (\"what things\"); sou eng Saachen (\"such things\"). Moreover, they are used before numbers to express an estimation: eng 30.000 Spectateuren (\"some 30,000 spectators\").\n\nDistinct nominative forms survive in a few nominal phrases such as der Däiwel (\"the devil\") and eiser Herrgott (\"our Lord\"). Rare examples of the genitive are also found: Enn des Mounts (\"end of the month\"), Ufanks der Woch (\"at the beginning of the week\"). The functions of the genitive are normally expressed using a combination of the dative and a possessive determiner: e.g. dem Mann säi Buch (lit. \"to the man his book\", i.e. \"the man's book\"). This is known as a periphrastic genitive, and is a phenomenon also commonly seen in dialectal and colloquial German, and in Dutch.\n\nThe forms of the personal pronouns are given in the following table (unstressed forms appear in parentheses):\n\nThe 2pl form is also used as a polite singular (like French vous, see T-V distinction); the forms are capitalised in writing:\nWéi hues du de Concert fonnt? (\"How did you [informal sg.] like the concert?\")\nWéi hutt dir de Concert fonnt? (\"How did you [informal pl.] like the concert?\")\nWéi hutt Dir de Concert fonnt?  (\"How did you [formal sg. or pl.] like the concert?\")\n\nLike most varieties of colloquial German, but even more invariably, Luxembourgish uses definite articles with personal names. They are obligatory and not to be translated:\nDe Serge ass an der Kichen. (\"Serge is in the kitchen.\")\n\nA feature Luxembourgish shares with only some western dialects of German is that women and girls are most often referred to with forms of the neuter pronoun hatt:\nDat ass d'Nathalie. Hatt ass midd, well et vill a sengem Gaart geschafft huet. (\"That's Nathalie. She is tired because she has worked a lot in her garden.\")\n\nAdjectives\n\nLuxembourgish morphology distinguishes two types of adjective: attributive and predicative. Predicative adjectives appear with verbs like sinn (\"to be\"), and receive no extra ending:\n* De Mann ass grouss. (masculine, \"The man is tall.\")\n* D'Fra ass grouss. (feminine, \"The woman is tall.\")\n* D'Meedchen ass grouss. (neuter, \"The girl is tall.\")\n* D'Kanner si grouss. (plural, \"The children are tall.\")\n\nAttributive adjectives are placed before the noun they describe, and change their ending according to the grammatical gender, number, and case:\n* de grousse Mann (masculine)\n* déi grouss Fra (feminine)\n* dat grousst Meedchen (neuter)\n* déi grouss Kanner (plural)\n\nCuriously, the definite article changes with the use of an attributive adjective: feminine d goes to déi (or di), neuter d' goes to dat, and plural d' changes to déi.\n\nThe comparative in Luxembourgish is formed analytically, i.e. the adjective itself is not altered (compare the use of -er in German and English; tall → taller, klein → kleiner). Instead it is formed using the adverb méi: e.g. schéin → méi schéin\n* Lëtzebuerg ass méi schéi wéi Esch. (\"Luxembourg is prettier than Esch.\")\n\nThe superlative involves a synthetic form consisting of the adjective and the suffix -st: e.g. schéin → schéinst  (compare German schönst, English prettiest). Attributive modification requires the emphatic definite article and the inflected superlative adjective:\n* dee schéinste Mann (\"the most handsome man\")\n* déi schéinst Fra (\"the prettiest woman\")\n\nPredicative modification uses either the same adjectival structure or the adverbial structure am+ -sten: e.g. schéin → am schéinsten:\n* Lëtzebuerg ass dee schéinsten / deen allerschéinsten / am schéinsten. (\"Luxembourg is the most beautiful (of all).\")\n\nSome common adjectives have exceptional comparative and superlative forms:\n* gutt, besser, am beschten (\"good, better, best\")\n* vill, méi, am meeschten (\"much, more, most\")\n* wéineg, manner, am mannsten (\"few, fewer, fewest\")\n\nSeveral other adjectives also have comparative forms. However, these are not commonly used as normal comparatives, but in special senses:\n* al (\"old\") → eeler Leit (\"elderly people\"), but: méi al Leit (\"older people, people older than X\")\n* fréi (\"early\") → de fréiere President (\"the former president\"), but: e méi fréien Termin (\"an earlier appointment\")\n* laang (\"long\") → viru längerer Zäit (\"some time ago\"), but: eng méi laang Zäit (\"a longer period of time\")\n\nWord-order\n\nLuxembourgish exhibits \"verb second\" word order in clauses. More specifically, Luxembourgish is a V2-SOV language, like German and Dutch. In other words, we find the following finite clausal structures:\n* the finite verb in second position in declarative clauses and wh-questions\n:Ech kafen en Hutt. Muer kafen ech en Hutt. (lit. \"I buy a hat. Tomorrow buy I a hat.)\n:Wat kafen ech haut? (lit. \"What buy I today?\")\n* the finite verb in first position in yes/no questions and finite imperatives\n:Bass de midd? (\"Are you tired?\")\n:Gëff mer deng Hand! (\"Give me your hand!\")\n* the finite verb in final position in subordinate clauses\n:Du weess, datt ech midd sinn. (lit. \"You know, that I tired am.\")\n\nNon-finite verbs (infinitives and participles) generally appear in final position:\n* compound past tenses\n:Ech hunn en Hutt kaf. (lit. \"I have a hat bought.\")\n* infinitival complements\n:Du solls net esou vill Kaffi drénken. (lit. \"You should not so much coffee drink.\")\n* infinitival clauses (e.g., used as imperatives)\n:Nëmme Lëtzebuergesch schwätzen! (lit. \"Only Luxembourgish speak!\")\n\nThese rules interact so that in subordinate clauses, the finite verb and any non-finite verbs must all cluster at the end. Luxembourgish allows different word orders in these cases:\n:Hie freet, ob ech komme kann. (cf. German Er fragt, ob ich kommen kann.)\n:Hie freet, ob ech ka kommen. (cf. Dutch Hij vraagt of ik kan komen.)\nThis is also the case when two non-finite verb forms occur together:\n:Ech hunn net kënne kommen. (cf. Dutch Ik heb niet kunnen komen.)\n:Ech hunn net komme kënnen. (cf. German Ich habe nicht kommen können.)\n\nLuxembourgish (like Dutch and German) allows prepositional phrases to appear after the verb cluster in subordinate clauses:\n:alles, wat Der ëmmer wollt wëssen iwwer Lëtzebuerg\n:(lit. \"everything what you always wanted know about Luxembourg\")\n\nVocabulary\n\nLuxembourgish has borrowed many French words. For example, the name for a bus driver is Buschauffeur (also Dutch and Swiss German), which would be Busfahrer in German and chauffeur de bus in French.\n\nSome words are different from Standard German but have equivalents in German dialects. An example is Gromperen (potatoes – German: Kartoffeln). Other words are exclusive to Luxembourgish.\n\nSelected common phrases\n\nNote: Words spoken in sound clip do not reflect all words on this list.\n\nNeologisms\n\nNeologisms in Luxembourgish include both entirely new words, and the attachment of new meanings to old words in everyday speech. The most recent neologisms come from the English language in the fields of telecommunications, computer science, and the Internet.\n\nRecent neologisms in Luxembourgish include:Lulling, Jérôme. (2002) La créativité lexicale en luxembourgeois, Doctoral thesis, Université Paul Valéry Montpellier III\n* direct loans from English: Browser, Spam, CD, Fitness, Come-back, Terminal, Hip, Cool, Tip-top\n* also found in German: Sichmaschinn (search engine, German: Suchmaschine), schwaarzt Lach (black hole, German: Schwarzes Loch), Handy (mobile phone), Websäit (webpage, German: Webseite)\n* native Luxembourgish\n** déck as an emphatic like ganz and voll, e.g. Dëse Kuch ass déck gutt! (\"This cake is really good!\")\n** recent expressions, used mainly by teenagers: oh mëllen! (\"oh crazy\"), en décke gelénkt (\"you've been tricked\") or cassé (French for \"(you've been) owned\")\n\nAcademic projects\n\nBetween 2000 and 2002, Luxembourgish linguist Jérôme Lulling compiled a lexical database of 125,000 word forms as the basis for the very first Luxembourgish spellchecker (Projet C.ORT.IN.A).\n\nThe LaF (Lëtzebuergesch als Friemsprooch – Luxembourgish as a Foreign Language) is a set of four language proficiency certifications for Luxembourgish and follows the ALTE framework of language examination standards. The tests are administered by the Institut National des Langues Luxembourg.[http://www.insl.lu/Francais/page3/p3frame.htm Institut national des langues – INL – Passer un examen à l'INL] \n\nThe \"Centre for Luxembourg Studies\" at the University of Sheffield was founded in 1995 on the initiative of Professor Gerald Newton. It is supported by the government of Luxembourg which funds an endowed chair in Luxembourg Studies at the university.\nThe first class of students to study the language outside of the country as undergraduate students began their studies at the 'Centre for Luxembourg Studies' at Sheffield in the academic year 2011–2012.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Luxembourgish" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18291" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Luxembourgish, Luxemburgish or Letzeburgesch ( or) (Luxembourgish: Lëtzebuergesch) is a West Germanic language that is spoken mainly in Luxembourg. Worldwide, about 390,000 people speak Luxembourgish.\n\nWhile it could be considered a standardized variety (i.e., a dialect with a written form) of German, its official use in the state of Luxembourg and the existence of a separate regulatory body[http://www.cpll.lu/pdf/loi_2004.pdf Law establishing the Conseil Permanent de la Langue Luxembourgeoise (CPLL)] has removed Luxembourgish, at least in part, from the domain of the Dachsprache Standard German. Despite the lack of a sharp boundary between Luxembourgish and the neighboring German dialects, this has led several linguists (from Luxembourg as well as Germany) to regard it as a separate, yet closely related language.\n\nLanguage family\n\nLuxembourgish belongs to the West Central German group of High German languages and is the primary example of a Moselle Franconian language.\n\nUsage\n\nLuxembourgish is the national language of Luxembourg and one of three administrative languages, alongside French and German.[http://www.legilux.public.lu/leg/a/archives/1984/0162702/index.html Mémorial A no. 16 (27 February 1984), pp. 196–7:  \"Loi du 24 février 1984 sur le régime des langues\".]\n\nLuxembourgish is also spoken in the Arelerland region of Belgium (part of the Province of Luxembourg) and in small parts of Lorraine in France.\n\nIn the German Eifel and Hunsrück regions, and in Lorraine, similar local Moselle Franconian dialects of German are spoken. The language is also spoken by a few descendants of Luxembourg immigrants in the United States, and another similar Moselle Franconian dialect is spoken by ethnic Germans long settled in Transylvania, Romania (Siebenbürgen).\n\nMoselle Franconian dialects outside the Luxembourg state border tend to have far fewer French loan words, and these mostly remain from the French Revolution.\n\nVarieties\n\nThere are several distinct dialect forms of Luxembourgish including Areler (from Arlon), Eechternoacher (Echternach), Kliärrwer (Clervaux), Miseler (Moselle), Stater (Luxembourg), Veiner (Vianden), Minetter (Southern Luxembourg) and Weelzer (Wiltz). Further small vocabulary differences may be seen even between small villages.\n\nIncreasing mobility of the population and the dissemination of the language through mass media such as radio and television are leading to a gradual standardisation towards a \"Standard Luxembourgish\" through the process of koineization.[http://www.ulrichammon.de/resources/Stellung_der_deutschen_Sprache.pdf Ammon, Ulrich - Die Stellung der deutschen Sprache in der Welt (de Gruyter Mouton)]; \n\nSurrounding languages\n\nThere is no distinct geographic boundary between the use of Luxembourgish and the use of other closely related High German dialects (for example Lorraine Franconian); it instead forms a dialect continuum of gradual change.\n\nSpoken Luxembourgish is relatively hard to understand for speakers of German who are generally not familiar with Moselle Franconian dialects (or at least other West Central German dialects). However, they can usually read the language to some degree. For those Germans familiar with Moselle Franconian dialects, it is relatively easy to understand and speak Luxembourgish as far as the everyday vocabulary is concerned. However, the large number of French loanwords in Luxembourgish may hamper communication about certain topics, or with certain speakers (who use many French loanwords).\n\nThere is no intelligibility between Luxembourgish and French or any of the Romance dialects spoken in the adjacent parts of Belgium and France.\n\nErna Hennicot-Schoepges, President of the Christian Social People's Party of Luxembourg 1995–2003, was active in promoting the language beyond Luxembourg's borders.\n\nWritten Luxembourgish\n\nStandardisation\n\nA number of proposals for standardising the orthography of Luxembourgish can be documented, going back to the middle of the 19th century. There was no officially recognised system, however, until the adoption of the \"OLO\" (ofizjel lezebuurjer ortografi) on 5 June 1946.[http://www.legilux.public.lu/leg/a/archives/1946/0400709/index.html Mémorial A no. 40 (7 September 1946), pp. 637–41: \"Arrêté ministériel du 5 juin 1946 portant fixation d'un système officiel d'orthographe luxembourgeois\"] This orthography provided a system for speakers of all varieties of Luxembourgish to transcribe words the way they pronounced them, rather than imposing a single, standard spelling for the words of the language. The rules explicitly rejected certain elements of German orthography (e.g., the use of \"ä\" and \"ö\",\"Et get kèèn ä geshriven. […] Et get kèèn ö geshriven.\" (p. 639) the capitalisation of nouns). Similarly, new principles were adopted for the spelling of French loanwords.\n* ', ', ', ' (cf. German ', ', ', ')\n* ', ', ', ' (cf. French ', ', ', ')\nThis proposed orthography, so different from existing \"foreign\" standards that people were already familiar with, did not enjoy widespread approval.\n\nA more successful standard eventually emerged from the work of the committee of specialists charged with the task of creating the Luxemburger Wörterbuch, published in 5 volumes between 1950 and 1977. The orthographic conventions adopted in this decades-long project, set out in Bruch (1955), provided the basis of the standard orthography that became official on 10 October 1975.Mémorial B no. 68 (16 November 1976), pp. 1365–90: \"Arrêté ministériel du 10 octobre 1975 portant réforme du système officiel d'orthographe luxembourgeoise\". Modifications to this standard were proposed by the Conseil permanent de la langue luxembourgeoise and adopted officially in the spelling reform of 30 July 1999.[http://www.legilux.public.lu/leg/a/archives/1999/1121108/index.html Mémorial A no. 112 (11 August 1999), pp. 2040–8: \"Règlement grand-ducal du 30 juillet 1999 portant réforme du système officiel d'orthographe luxembourgeoise\".] A detailed explanation of current practice for Luxembourgish can be found in Schanen & Lulling (2003).\n\nAlphabet\n\nThe Luxembourgish alphabet consists of the 26 Latin letters plus three letters with diacritics: \"é\", \"ä\", and \"ë\". In loanwords from French and Standard German, other diacritics are usually preserved:\n* French: Boîte, Enquête, Piqûre, etc.\n* German: blöd, Bühn (but German Bühne), etc.\n\nEifeler Regel\n\nLike many other varieties of Western High German, Luxembourgish has a rule of final n-deletion in certain contexts. The effects of this rule (known as the \"Eifel Rule\") are indicated in writing, and therefore must be taken into account when spelling words and morphemes ending in  or . For example:\n* wann ech ginn \"when I go\", but wa mer ginn \"when we go\"\n* fënnefandrësseg \"thirty-five\", but fënnefavéierzeg \"forty-five\".\n\nPhonology\n\nConsonants\n\nThe consonant inventory of Luxembourgish is quite similar to that of Standard German.\n\n* occurs only in loanwords from Standard German. Just as among many native German-speakers, it tends to be simplified to word-initially. For example, Pflicht ('obligation') is pronounced, or in careful speech.\n* is realized as when it occurs after, e.g. zwee ('two').\n* appears only in a few words, such as spadséieren ('to go for a walk').\n* occurs only in loanwords from English.\n* have two types of allophones: alveolo-palatal,]}} and uvular,]}}. The latter occur before back vowels, whereas the former occur in all other positions.\n** The allophone appears only in a few words. Note that an increasing number of speakers do not distinguish between the alveolo-palatal allophones of and the postalveolar phonemes.\n* Younger speakers tend to vocalize the word-final to a central vowel or.\n\nVowels\n\n* The front rounded vowels appear only in loanwords from French and Standard German. In loanwords from French, nasal also occur. \n* has two allophones:\n** Before velars: close-mid front unrounded, which for some speakers may be open-mid - this is especially frequent before. Exactly the same variation applies to (except that it is back rounded).\n** All other positions: mid central vowel, more often slightly rounded than unrounded.\n* Phonetically, the long mid vowels are raised close-mid (near-close),]}}, and may even overlap with.\n** before is realized as.\n* is the long variant of, not (which does not have a long counterpart).\n\n* appears only in loanwords from Standard German.\n* The first elements of may be phonetically short in fast speech or in unstressed syllables.\n* The and contrasts arose from the former lexical tone contrast; the shorter were used in words with Accent 1, whereas the lengthened were used in words with Accent 2.\n\nGrammar\n\nNominal syntax\n\nLuxembourgish has three genders (masculine, feminine, and neuter), and has three cases (nominative, accusative, and dative). These are marked morphologically on determiners and pronouns. As in German, there is no morphological gender distinction in the plural.\n\nThe forms of the articles and of some selected determiners are given below:\n\nAs seen above, Luxembourgish has plural forms of en (\"a, an\"), namely eng in the nominative/accusative and engen in the dative. They are not used as indefinite articles, which—as in German and English—do not exist in the plural, but they do occur in the compound pronouns wéi en (\"what, which\") and sou en (\"such\"). For example: wéi eng Saachen (\"what things\"); sou eng Saachen (\"such things\"). Moreover, they are used before numbers to express an estimation: eng 30.000 Spectateuren (\"some 30,000 spectators\").\n\nDistinct nominative forms survive in a few nominal phrases such as der Däiwel (\"the devil\") and eiser Herrgott (\"our Lord\"). Rare examples of the genitive are also found: Enn des Mounts (\"end of the month\"), Ufanks der Woch (\"at the beginning of the week\"). The functions of the genitive are normally expressed using a combination of the dative and a possessive determiner: e.g. dem Mann säi Buch (lit. \"to the man his book\", i.e. \"the man's book\"). This is known as a periphrastic genitive, and is a phenomenon also commonly seen in dialectal and colloquial German, and in Dutch.\n\nThe forms of the personal pronouns are given in the following table (unstressed forms appear in parentheses):\n\nThe 2pl form is also used as a polite singular (like French vous, see T-V distinction); the forms are capitalised in writing:\nWéi hues du de Concert fonnt? (\"How did you [informal sg.] like the concert?\")\nWéi hutt dir de Concert fonnt? (\"How did you [informal pl.] like the concert?\")\nWéi hutt Dir de Concert fonnt?  (\"How did you [formal sg. or pl.] like the concert?\")\n\nLike most varieties of colloquial German, but even more invariably, Luxembourgish uses definite articles with personal names. They are obligatory and not to be translated:\nDe Serge ass an der Kichen. (\"Serge is in the kitchen.\")\n\nA feature Luxembourgish shares with only some western dialects of German is that women and girls are most often referred to with forms of the neuter pronoun hatt:\nDat ass d'Nathalie. Hatt ass midd, well et vill a sengem Gaart geschafft huet. (\"That's Nathalie. She is tired because she has worked a lot in her garden.\")\n\nAdjectives\n\nLuxembourgish morphology distinguishes two types of adjective: attributive and predicative. Predicative adjectives appear with verbs like sinn (\"to be\"), and receive no extra ending:\n* De Mann ass grouss. (masculine, \"The man is tall.\")\n* D'Fra ass grouss. (feminine, \"The woman is tall.\")\n* D'Meedchen ass grouss. (neuter, \"The girl is tall.\")\n* D'Kanner si grouss. (plural, \"The children are tall.\")\n\nAttributive adjectives are placed before the noun they describe, and change their ending according to the grammatical gender, number, and case:\n* de grousse Mann (masculine)\n* déi grouss Fra (feminine)\n* dat grousst Meedchen (neuter)\n* déi grouss Kanner (plural)\n\nCuriously, the definite article changes with the use of an attributive adjective: feminine d goes to déi (or di), neuter d' goes to dat, and plural d' changes to déi.\n\nThe comparative in Luxembourgish is formed analytically, i.e. the adjective itself is not altered (compare the use of -er in German and English; tall → taller, klein → kleiner). Instead it is formed using the adverb méi: e.g. schéin → méi schéin\n* Lëtzebuerg ass méi schéi wéi Esch. (\"Luxembourg is prettier than Esch.\")\n\nThe superlative involves a synthetic form consisting of the adjective and the suffix -st: e.g. schéin → schéinst  (compare German schönst, English prettiest). Attributive modification requires the emphatic definite article and the inflected superlative adjective:\n* dee schéinste Mann (\"the most handsome man\")\n* déi schéinst Fra (\"the prettiest woman\")\n\nPredicative modification uses either the same adjectival structure or the adverbial structure am+ -sten: e.g. schéin → am schéinsten:\n* Lëtzebuerg ass dee schéinsten / deen allerschéinsten / am schéinsten. (\"Luxembourg is the most beautiful (of all).\")\n\nSome common adjectives have exceptional comparative and superlative forms:\n* gutt, besser, am beschten (\"good, better, best\")\n* vill, méi, am meeschten (\"much, more, most\")\n* wéineg, manner, am mannsten (\"few, fewer, fewest\")\n\nSeveral other adjectives also have comparative forms. However, these are not commonly used as normal comparatives, but in special senses:\n* al (\"old\") → eeler Leit (\"elderly people\"), but: méi al Leit (\"older people, people older than X\")\n* fréi (\"early\") → de fréiere President (\"the former president\"), but: e méi fréien Termin (\"an earlier appointment\")\n* laang (\"long\") → viru längerer Zäit (\"some time ago\"), but: eng méi laang Zäit (\"a longer period of time\")\n\nWord-order\n\nLuxembourgish exhibits \"verb second\" word order in clauses. More specifically, Luxembourgish is a V2-SOV language, like German and Dutch. In other words, we find the following finite clausal structures:\n* the finite verb in second position in declarative clauses and wh-questions\n:Ech kafen en Hutt. Muer kafen ech en Hutt. (lit. \"I buy a hat. Tomorrow buy I a hat.)\n:Wat kafen ech haut? (lit. \"What buy I today?\")\n* the finite verb in first position in yes/no questions and finite imperatives\n:Bass de midd? (\"Are you tired?\")\n:Gëff mer deng Hand! (\"Give me your hand!\")\n* the finite verb in final position in subordinate clauses\n:Du weess, datt ech midd sinn. (lit. \"You know, that I tired am.\")\n\nNon-finite verbs (infinitives and participles) generally appear in final position:\n* compound past tenses\n:Ech hunn en Hutt kaf. (lit. \"I have a hat bought.\")\n* infinitival complements\n:Du solls net esou vill Kaffi drénken. (lit. \"You should not so much coffee drink.\")\n* infinitival clauses (e.g., used as imperatives)\n:Nëmme Lëtzebuergesch schwätzen! (lit. \"Only Luxembourgish speak!\")\n\nThese rules interact so that in subordinate clauses, the finite verb and any non-finite verbs must all cluster at the end. Luxembourgish allows different word orders in these cases:\n:Hie freet, ob ech komme kann. (cf. German Er fragt, ob ich kommen kann.)\n:Hie freet, ob ech ka kommen. (cf. Dutch Hij vraagt of ik kan komen.)\nThis is also the case when two non-finite verb forms occur together:\n:Ech hunn net kënne kommen. (cf. Dutch Ik heb niet kunnen komen.)\n:Ech hunn net komme kënnen. (cf. German Ich habe nicht kommen können.)\n\nLuxembourgish (like Dutch and German) allows prepositional phrases to appear after the verb cluster in subordinate clauses:\n:alles, wat Der ëmmer wollt wëssen iwwer Lëtzebuerg\n:(lit. \"everything what you always wanted know about Luxembourg\")\n\nVocabulary\n\nLuxembourgish has borrowed many French words. For example, the name for a bus driver is Buschauffeur (also Dutch and Swiss German), which would be Busfahrer in German and chauffeur de bus in French.\n\nSome words are different from Standard German but have equivalents in German dialects. An example is Gromperen (potatoes – German: Kartoffeln). Other words are exclusive to Luxembourgish.\n\nSelected common phrases\n\nNote: Words spoken in sound clip do not reflect all words on this list.\n\nNeologisms\n\nNeologisms in Luxembourgish include both entirely new words, and the attachment of new meanings to old words in everyday speech. The most recent neologisms come from the English language in the fields of telecommunications, computer science, and the Internet.\n\nRecent neologisms in Luxembourgish include:Lulling, Jérôme. (2002) La créativité lexicale en luxembourgeois, Doctoral thesis, Université Paul Valéry Montpellier III\n* direct loans from English: Browser, Spam, CD, Fitness, Come-back, Terminal, Hip, Cool, Tip-top\n* also found in German: Sichmaschinn (search engine, German: Suchmaschine), schwaarzt Lach (black hole, German: Schwarzes Loch), Handy (mobile phone), Websäit (webpage, German: Webseite)\n* native Luxembourgish\n** déck as an emphatic like ganz and voll, e.g. Dëse Kuch ass déck gutt! (\"This cake is really good!\")\n** recent expressions, used mainly by teenagers: oh mëllen! (\"oh crazy\"), en décke gelénkt (\"you've been tricked\") or cassé (French for \"(you've been) owned\")\n\nAcademic projects\n\nBetween 2000 and 2002, Luxembourgish linguist Jérôme Lulling compiled a lexical database of 125,000 word forms as the basis for the very first Luxembourgish spellchecker (Projet C.ORT.IN.A).\n\nThe LaF (Lëtzebuergesch als Friemsprooch – Luxembourgish as a Foreign Language) is a set of four language proficiency certifications for Luxembourgish and follows the ALTE framework of language examination standards. The tests are administered by the Institut National des Langues Luxembourg.[http://www.insl.lu/Francais/page3/p3frame.htm Institut national des langues – INL – Passer un examen à l'INL] \n\nThe \"Centre for Luxembourg Studies\" at the University of Sheffield was founded in 1995 on the initiative of Professor Gerald Newton. It is supported by the government of Luxembourg which funds an endowed chair in Luxembourg Studies at the university.\nThe first class of students to study the language outside of the country as undergraduate students began their studies at the 'Centre for Luxembourg Studies' at Sheffield in the academic year 2011–2012. Luxembourgish. http://en.wikipedia.org/?curid=18291."
  }
}
