{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8460",
  "eid" : "e7ee8e20-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778468866,
  "textBody" : "Dieting is the practice of eating food in a regulated and supervised fashion to decrease, maintain, or increase body weight. In other words, it is conscious control or restriction of the diet. A restricted diet is often used by those who are overweight or obese, sometimes in combination with physical exercise, to reduce body weight. Some people follow a diet to gain weight (usually in the form of muscle). Diets can also be used to maintain a stable body weight and improve health. In particular, diets can be designed to prevent or treat diabetes.\n\nDiets to promote weight loss can be categorized as: low-fat, low-carbohydrate, low-calorie, very low calorie and more recently flexible dieting. A meta-analysis of six randomized controlled trials found no difference between low-calorie, low-carbohydrate, and low-fat diets, with a 2–4 kilogram weight loss over 12–18 months in all studies.  At two years, all calorie-reduced diet types cause equal weight loss irrespective of the macronutrients emphasized. In general, the most effective diet is any which reduces calorie consumption.\n\nA study published in American Psychologist found that short-term dieting involving \"severe restriction of calorie intake\" does not lead to \"sustained improvements in weight and health for the majority of individuals\". Other studies have found that the average individual maintains some weight loss after dieting. Weight loss by dieting, while of benefit to those classified as unhealthy, may slightly increase the mortality rate for individuals who are otherwise healthy.\n\nThe first popular diet was \"Banting\", named after William Banting. In his 1863 pamphlet, Letter on Corpulence, Addressed to the Public, he outlined the details of a particular low-carbohydrate, low-calorie diet that had led to his own dramatic weight loss.\n\nHistory\n\nOne of the first dietitians was the English doctor George Cheyne. He himself was tremendously overweight and would constantly eat large quantities of rich food and drink. He began a meatless diet, taking only milk and vegetables, and soon regained his health. He began publicly recommending his diet for everyone suffering from obesity. In 1724, he wrote An Essay of Health and Long Life, in which he advises exercise and fresh air and avoiding luxury foods.\n\nThe Scottish military surgeon, John Rollo, published Notes of a Diabetic Case in 1797. It described the benefits of a meat diet for those suffering from diabetes, basing this recommendation on Matthew Dobson's discovery of glycosuria in diabetes mellitus. By means of Dobson's testing procedure (for glucose in the urine) Rollo worked out a diet that had success for what is now called type 2 diabetes.\n\nThe first popular diet was \"Banting\", named after the English undertaker William Banting. In 1863, he wrote a booklet called Letter on Corpulence, Addressed to the Public, which contained the particular plan for the diet he had successfully followed. His own diet was four meals per day, consisting of meat, greens, fruits, and dry wine. The emphasis was on avoiding sugar, sweet foods, starch, beer, milk and butter. Banting’s pamphlet was popular for years to come, and would be used as a model for modern diets. The pamphlet's popularity was such that the question \"Do you bant?\" referred to his method, and eventually to dieting in general. His booklet remains in print as of 2007.See also .\n\nThe first weight-loss book to promote calorie counting, and the first weight-loss book to become a bestseller, was the 1918 Diet and Health: With Key to the Calories by American physician and columnist Lulu Hunt Peters.\n\nTypes \n\nLow-fat\n\nLow-fat diets involve the reduction of the percentage of fat in one's diet. Calorie consumption is reduced because less fat is consumed. Diets of this type include NCEP Step I and II. A meta-analysis of 16 trials of 2–12 months' duration found that low-fat diets (without intentional restriction of caloric intake) resulted in average weight loss of  over habitual eating.\n\nLow-carbohydrate\n\nLow-carbohydrate diets such as Atkins and Protein Power are relatively high in protein and fats. Low-carbohydrate diets are sometimes ketogenic (i.e., they restrict carbohydrate intake sufficiently to cause ketosis).\n\nLow-calorie\n\nLow-calorie diets usually produce an energy deficit of 500–1,000 calories per day, which can result in a  weight loss per week. One of the most commonly used low-calorie diets is Weight Watchers. The National Institutes of Health reviewed 34 randomized controlled trials to determine the effectiveness of low-calorie diets. They found that these diets lowered total body mass by 8% in the short term, over 3–12 months. Women doing low-calorie diets should have at least 1,200 calories per day. Men should have at least 1,800 calories per day.\n\nVery low-calorie\n\nVery low calorie diets provide 200–800 calories per day, maintaining protein intake but limiting calories from both fat and carbohydrates. They subject the body to starvation and produce an average loss of  per week. \"2-4-6-8\", a popular diet of this variety, follows a four-day cycle in which only 200 calories are consumed the first day, 400 the second day, 600 the third day, 800 the fourth day, and then totally fasting, after which the cycle repeats. These diets are not recommended for general use as they are associated with adverse side effects such as loss of lean muscle mass, increased risks of gout, and electrolyte imbalances. People attempting these diets must be monitored closely by a physician to prevent complications.\n\nDetox\n\nDetox diets claim to eliminate \"toxins\" from the human body rather than claiming to cause weight loss. Many of these use herbs or celery and other juicy low-calorie vegetables.\n\nReligious\n\nReligious prescription may be a factor in motivating people to adopt a specific restrictive diet.  For example, the Biblical Book of Daniel (1:2-20, and 10:2-3) refers to a 10- or 21-day avoidance of foods (Daniel Fast) declared unclean by God in the laws of Moses.  In modern versions of the Daniel Fast, food choices may be limited to whole grains, fruits, vegetables, pulses, nuts, seeds and oil. The Daniel Fast resembles the vegan diet in that it excludes foods of animal origin.  The passages strongly suggest that the Daniel Fast will promote good health and mental performance.\n\nFasting is practiced in various religions. Examples include Lent in Christianity; Yom Kippur, Tisha B'av, Fast of Esther, Tzom Gedalia, the Seventeenth of Tamuz, and the Tenth of Tevet in Judaism. Muslims refrain from eating during the hours of daytime for one entire month, Ramadan, every year.\n\nDetails of fasting practices differ.  Eastern Orthodox Christians fast during specified fasting seasons of the year, which include not only the better-known Great Lent, but also fasts on every Wednesday and Friday (except on special holidays), together with extended fasting periods before Christmas (the Nativity Fast), after Easter (the Apostles Fast) and in early August (the Dormition Fast). Members of The Church of Jesus Christ of Latter-day Saints (Mormons) generally fast for 24 hours on the first Sunday of each month. Like Muslims, they refrain from all drinking and eating unless they are children or are physically unable to fast. Fasting is also a feature of ascetic traditions in religions such as Hinduism and Buddhism. Mahayana traditions that follow the Brahma's Net Sutra may recommend that the laity fast \"during the six days of fasting each month and the three months of fasting each year\" [Brahma's Net Sutra, minor precept 30]. Members of the Baha'i Faith observe a Nineteen Day Fast from sunrise to sunset during March each year.\n\nNutrition\n\nWeight loss diets that manipulate the proportion of macronutrients (low-fat, low-carbohydrate, etc.) have been shown to be more effective than diets that maintain a typical mix of foods with smaller portions and perhaps some substitutions (e.g. low-fat milk, or less salad dressing). Extreme diets may, in some cases, lead to malnutrition.\n\nNutritionists also agree on the importance of avoiding fats, especially saturated fats, to reduce weight and to be healthier. They also agree on the importance of reducing salt intake because foods including snacks, biscuits, and bread already contain ocean-salt, contributing to an excess of salt daily intake.\n\nMyPyramid Food Guidance System is the result of extensive research performed by the United States Department of Agriculture to revise the original Food Guide Pyramid. It offers a wide array of personalized options to help individuals make healthy food choices. It also provides advice on physical activity.\n\nOne of the most important things to take into consideration when either trying to lose or put on weight is output versus input. It is important to know the amount of energy your body is using every day, so that your intake fits the needs of one's personal weight goal. Someone wanting to lose weight would want a smaller energy intake than what they put out. There is increasing research-based evidence that low-fat vegetarian diets consistently lead to healthy weight loss and management, a decrease in diabetic symptoms as well as improved cardiac health.\n\nHow the body eliminates fat\n\nWhen the body is expending more energy than it is consuming (e.g. when exercising), the body's cells rely on internally stored energy sources, such as complex carbohydrates and fats, for energy. The first source to which the body turns is glycogen (by glycogenolysis). Glycogen is a complex carbohydrate, 65% of which is stored in skeletal muscles and the remainder in the liver (totaling about 2,000 kcal in the whole body). It is created from the excess of ingested macronutrients, mainly carbohydrates. When glycogen is nearly depleted, the body begins lipolysis, the mobilization and catabolism of fat stores for energy. In this process, fats, obtained from adipose tissue, or fat cells, are broken down into glycerol and fatty acids, which can be used to generate energy. The primary by-products of metabolism are carbon dioxide and water; carbon dioxide is expelled through the respiratory system.\n\nWeight loss groups\n\nSome weight loss groups aim to make money, others work as charities. The former include Weight Watchers and Peertrainer. The latter include Overeaters Anonymous and groups run by local organizations.\n\nThese organizations' customs and practices differ widely. Some groups are modelled on twelve-step programs, while others are quite informal. Some groups advocate certain prepared foods or special menus, while others train dieters to make healthy choices from restaurant menus and while grocery-shopping and cooking.\n\nFood diary\n\nA 2008 study published in the American Journal of Preventive Medicine showed that dieters who kept a daily food diary (or diet journal), lost twice as much weight as those who did not keep a food log, suggesting that if you record your eating, you wouldn't eat as many calories.\n\nPossible weight loss effects of drinking water prior to meals\n\nA 2009 review found that existing limited evidence suggested that encouraging water consumption and substituting energy-free beverages for energy-containing beverages (i.e., reducing caloric intake) may facilitate weight management. A 2009 article found that drinking 500 ml of water prior to meals for a 12-week period resulted in increased long-term weight reduction. (References given in main article.)\n\nFasting\n\nLengthy fasting can be dangerous due to the risk of malnutrition and should be carried out only under medical supervision. During prolonged fasting or very low calorie diets the reduction of blood glucose, the preferred energy source of the brain, causes the body to deplete its glycogen stores. Once glycogen is depleted the body begins to fuel the brain using ketones, while also metabolizing body protein (including but not limited to skeletal muscle) to be used to synthesize sugars for use as energy by the rest of the body. Most experts believe that a prolonged fast can lead to muscle wasting, although some dispute this. The use of short-term fasting, or various forms of intermittent fasting have been used as a form of dieting to circumvent this issue.\n\nSide effects\n\nWhile there are studies that show the health and medical benefits of weight loss, a study in 2005 of around 3000 Finns over an 18-year period showed that weight loss from dieting can result in increased mortality, while those who maintained their weight fared the best. Similar conclusion is drawn by other studies, and although other studies suggest that intentional weight loss has a small benefit for individuals classified as unhealthy, it is associated with slightly increased mortality for healthy individuals and the slightly overweight but not obese. This may reflect the loss of subcutaneous fat and beneficial mass from organs and muscle in addition to visceral fat when there is a sudden and dramatic weight loss.\n \nLow carbohydrate versus low fat\n\nMany studies have focused on diets that reduce calories via a low-carbohydrate (Atkins diet, Scarsdale diet, Zone diet) diet versus a low-fat diet (LEARN diet, Ornish diet). The Nurses' Health Study, an observational cohort study, found that low carbohydrate diets based on vegetable sources of fat and protein are associated with less coronary heart disease. The same study also found no correlation (with multivariate adjustment) between animal fat intake and coronary heart disease (table 4). A long term study that monitored 43,396 Swedish women however suggests that a low carbohydrate-high protein diet, used on a regular basis and without consideration of the nature of carbohydrates or the source of proteins, is associated with increased risk of cardiovascular disease.\n\nA meta-analysis of randomized controlled trials by the international Cochrane Collaboration in 2002 concluded that fat-restricted diets are no better than calorie-restricted diets in achieving long term weight loss in overweight or obese people. A more recent meta-analysis that included randomized controlled trials published after the Cochrane review found that low-carbohydrate, non-energy-restricted diets appear to be at least as effective as low-fat, energy-restricted diets in inducing weight loss for up to 1 year. These results can be understood because weight loss is mainly governed by daily caloric deficit and not by the particular foods eaten. However, when low-carbohydrate diets to induce weight loss are considered, potential favorable changes in triglyceride and high-density lipoprotein cholesterol values should be weighed against potential unfavorable changes in low-density lipoprotein cholesterol values.\"\n\nThe Women's Health Initiative Randomized Controlled Dietary Modification Trial found that a diet of total fat to 20% of energy and increasing consumption of vegetables and fruit to at least 5 servings daily and grains to at least 6 servings daily resulted in:\n*no reduction in cardiovascular disease\n*no statistically significant reduction in invasive breast cancer\n*no reductions in colorectal cancer\n\nAdditional randomized controlled trials found that:\n*A comparison of Atkins, Zone diet, Ornish diet, and LEARN diet in premenopausal women found the greatest benefit from the Atkins diet.\n*The choice of diet for a specific person may be influenced by measuring the individual's insulin secretion:\nIn young adults \"Reducing glycemic [carbohydrate] load may be especially important to achieve weight loss among individuals with high insulin secretion.\" This is consistent with prior studies of diabetic patients in which low carbohydrate diets were more beneficial.\n\nThe American Diabetes Association recommended a low carbohydrate diet to reduce weight for those with or at risk of Type 2 diabetes in its January 2008 Clinical Practice Recommendations.\n\nLow glycemic index\n\n\"The glycemic index (GI) factor is a ranking of foods based on their overall effect on blood sugar levels. The diet based around this research is called the Low GI diet. Low glycemic index foods, such as lentils, provide a slower, more consistent source of glucose to the bloodstream, thereby stimulating less insulin release than high glycemic index foods, such as white bread.\"\n\nThe glycemic load is \"the mathematical product of the glycemic index and the carbohydrate amount\".\n\nIn a randomized controlled trial that compared four diets that varied in carbohydrate amount and glycemic index found complicated results:\n*Diet 1 and 2 were high carbohydrate (55% of total energy intake)\n**Diet 1 was high-glycemic index\n**Diet 2 was low-glycemic index\n*Diet 3 and 4 were high protein (25% of total energy intake)\n**Diet 3 was high-glycemic index\n**Diet 4 was low-glycemic index\n\nDiets 2 and 3 lost the most weight and fat mass; however, low density lipoprotein fell in Diet 2 and rose in Diet 3. Thus the authors concluded that the high-carbohydrate, low-glycemic index diet was the most favorable.\n\nA meta-analysis by the Cochrane Collaboration concluded that low glycemic index or low glycemic load diets led to more weight loss and better lipid profiles. However, the Cochrane Collaboration grouped low glycemic index and low glycemic load diets together and did not try to separate the effects of the load versus the index.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Dieting" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8460" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Dieting is the practice of eating food in a regulated and supervised fashion to decrease, maintain, or increase body weight. In other words, it is conscious control or restriction of the diet. A restricted diet is often used by those who are overweight or obese, sometimes in combination with physical exercise, to reduce body weight. Some people follow a diet to gain weight (usually in the form of muscle). Diets can also be used to maintain a stable body weight and improve health. In particular, diets can be designed to prevent or treat diabetes.\n\nDiets to promote weight loss can be categorized as: low-fat, low-carbohydrate, low-calorie, very low calorie and more recently flexible dieting. A meta-analysis of six randomized controlled trials found no difference between low-calorie, low-carbohydrate, and low-fat diets, with a 2–4 kilogram weight loss over 12–18 months in all studies.  At two years, all calorie-reduced diet types cause equal weight loss irrespective of the macronutrients emphasized. In general, the most effective diet is any which reduces calorie consumption.\n\nA study published in American Psychologist found that short-term dieting involving \"severe restriction of calorie intake\" does not lead to \"sustained improvements in weight and health for the majority of individuals\". Other studies have found that the average individual maintains some weight loss after dieting. Weight loss by dieting, while of benefit to those classified as unhealthy, may slightly increase the mortality rate for individuals who are otherwise healthy.\n\nThe first popular diet was \"Banting\", named after William Banting. In his 1863 pamphlet, Letter on Corpulence, Addressed to the Public, he outlined the details of a particular low-carbohydrate, low-calorie diet that had led to his own dramatic weight loss.\n\nHistory\n\nOne of the first dietitians was the English doctor George Cheyne. He himself was tremendously overweight and would constantly eat large quantities of rich food and drink. He began a meatless diet, taking only milk and vegetables, and soon regained his health. He began publicly recommending his diet for everyone suffering from obesity. In 1724, he wrote An Essay of Health and Long Life, in which he advises exercise and fresh air and avoiding luxury foods.\n\nThe Scottish military surgeon, John Rollo, published Notes of a Diabetic Case in 1797. It described the benefits of a meat diet for those suffering from diabetes, basing this recommendation on Matthew Dobson's discovery of glycosuria in diabetes mellitus. By means of Dobson's testing procedure (for glucose in the urine) Rollo worked out a diet that had success for what is now called type 2 diabetes.\n\nThe first popular diet was \"Banting\", named after the English undertaker William Banting. In 1863, he wrote a booklet called Letter on Corpulence, Addressed to the Public, which contained the particular plan for the diet he had successfully followed. His own diet was four meals per day, consisting of meat, greens, fruits, and dry wine. The emphasis was on avoiding sugar, sweet foods, starch, beer, milk and butter. Banting’s pamphlet was popular for years to come, and would be used as a model for modern diets. The pamphlet's popularity was such that the question \"Do you bant?\" referred to his method, and eventually to dieting in general. His booklet remains in print as of 2007.See also .\n\nThe first weight-loss book to promote calorie counting, and the first weight-loss book to become a bestseller, was the 1918 Diet and Health: With Key to the Calories by American physician and columnist Lulu Hunt Peters.\n\nTypes \n\nLow-fat\n\nLow-fat diets involve the reduction of the percentage of fat in one's diet. Calorie consumption is reduced because less fat is consumed. Diets of this type include NCEP Step I and II. A meta-analysis of 16 trials of 2–12 months' duration found that low-fat diets (without intentional restriction of caloric intake) resulted in average weight loss of  over habitual eating.\n\nLow-carbohydrate\n\nLow-carbohydrate diets such as Atkins and Protein Power are relatively high in protein and fats. Low-carbohydrate diets are sometimes ketogenic (i.e., they restrict carbohydrate intake sufficiently to cause ketosis).\n\nLow-calorie\n\nLow-calorie diets usually produce an energy deficit of 500–1,000 calories per day, which can result in a  weight loss per week. One of the most commonly used low-calorie diets is Weight Watchers. The National Institutes of Health reviewed 34 randomized controlled trials to determine the effectiveness of low-calorie diets. They found that these diets lowered total body mass by 8% in the short term, over 3–12 months. Women doing low-calorie diets should have at least 1,200 calories per day. Men should have at least 1,800 calories per day.\n\nVery low-calorie\n\nVery low calorie diets provide 200–800 calories per day, maintaining protein intake but limiting calories from both fat and carbohydrates. They subject the body to starvation and produce an average loss of  per week. \"2-4-6-8\", a popular diet of this variety, follows a four-day cycle in which only 200 calories are consumed the first day, 400 the second day, 600 the third day, 800 the fourth day, and then totally fasting, after which the cycle repeats. These diets are not recommended for general use as they are associated with adverse side effects such as loss of lean muscle mass, increased risks of gout, and electrolyte imbalances. People attempting these diets must be monitored closely by a physician to prevent complications.\n\nDetox\n\nDetox diets claim to eliminate \"toxins\" from the human body rather than claiming to cause weight loss. Many of these use herbs or celery and other juicy low-calorie vegetables.\n\nReligious\n\nReligious prescription may be a factor in motivating people to adopt a specific restrictive diet.  For example, the Biblical Book of Daniel (1:2-20, and 10:2-3) refers to a 10- or 21-day avoidance of foods (Daniel Fast) declared unclean by God in the laws of Moses.  In modern versions of the Daniel Fast, food choices may be limited to whole grains, fruits, vegetables, pulses, nuts, seeds and oil. The Daniel Fast resembles the vegan diet in that it excludes foods of animal origin.  The passages strongly suggest that the Daniel Fast will promote good health and mental performance.\n\nFasting is practiced in various religions. Examples include Lent in Christianity; Yom Kippur, Tisha B'av, Fast of Esther, Tzom Gedalia, the Seventeenth of Tamuz, and the Tenth of Tevet in Judaism. Muslims refrain from eating during the hours of daytime for one entire month, Ramadan, every year.\n\nDetails of fasting practices differ.  Eastern Orthodox Christians fast during specified fasting seasons of the year, which include not only the better-known Great Lent, but also fasts on every Wednesday and Friday (except on special holidays), together with extended fasting periods before Christmas (the Nativity Fast), after Easter (the Apostles Fast) and in early August (the Dormition Fast). Members of The Church of Jesus Christ of Latter-day Saints (Mormons) generally fast for 24 hours on the first Sunday of each month. Like Muslims, they refrain from all drinking and eating unless they are children or are physically unable to fast. Fasting is also a feature of ascetic traditions in religions such as Hinduism and Buddhism. Mahayana traditions that follow the Brahma's Net Sutra may recommend that the laity fast \"during the six days of fasting each month and the three months of fasting each year\" [Brahma's Net Sutra, minor precept 30]. Members of the Baha'i Faith observe a Nineteen Day Fast from sunrise to sunset during March each year.\n\nNutrition\n\nWeight loss diets that manipulate the proportion of macronutrients (low-fat, low-carbohydrate, etc.) have been shown to be more effective than diets that maintain a typical mix of foods with smaller portions and perhaps some substitutions (e.g. low-fat milk, or less salad dressing). Extreme diets may, in some cases, lead to malnutrition.\n\nNutritionists also agree on the importance of avoiding fats, especially saturated fats, to reduce weight and to be healthier. They also agree on the importance of reducing salt intake because foods including snacks, biscuits, and bread already contain ocean-salt, contributing to an excess of salt daily intake.\n\nMyPyramid Food Guidance System is the result of extensive research performed by the United States Department of Agriculture to revise the original Food Guide Pyramid. It offers a wide array of personalized options to help individuals make healthy food choices. It also provides advice on physical activity.\n\nOne of the most important things to take into consideration when either trying to lose or put on weight is output versus input. It is important to know the amount of energy your body is using every day, so that your intake fits the needs of one's personal weight goal. Someone wanting to lose weight would want a smaller energy intake than what they put out. There is increasing research-based evidence that low-fat vegetarian diets consistently lead to healthy weight loss and management, a decrease in diabetic symptoms as well as improved cardiac health.\n\nHow the body eliminates fat\n\nWhen the body is expending more energy than it is consuming (e.g. when exercising), the body's cells rely on internally stored energy sources, such as complex carbohydrates and fats, for energy. The first source to which the body turns is glycogen (by glycogenolysis). Glycogen is a complex carbohydrate, 65% of which is stored in skeletal muscles and the remainder in the liver (totaling about 2,000 kcal in the whole body). It is created from the excess of ingested macronutrients, mainly carbohydrates. When glycogen is nearly depleted, the body begins lipolysis, the mobilization and catabolism of fat stores for energy. In this process, fats, obtained from adipose tissue, or fat cells, are broken down into glycerol and fatty acids, which can be used to generate energy. The primary by-products of metabolism are carbon dioxide and water; carbon dioxide is expelled through the respiratory system.\n\nWeight loss groups\n\nSome weight loss groups aim to make money, others work as charities. The former include Weight Watchers and Peertrainer. The latter include Overeaters Anonymous and groups run by local organizations.\n\nThese organizations' customs and practices differ widely. Some groups are modelled on twelve-step programs, while others are quite informal. Some groups advocate certain prepared foods or special menus, while others train dieters to make healthy choices from restaurant menus and while grocery-shopping and cooking.\n\nFood diary\n\nA 2008 study published in the American Journal of Preventive Medicine showed that dieters who kept a daily food diary (or diet journal), lost twice as much weight as those who did not keep a food log, suggesting that if you record your eating, you wouldn't eat as many calories.\n\nPossible weight loss effects of drinking water prior to meals\n\nA 2009 review found that existing limited evidence suggested that encouraging water consumption and substituting energy-free beverages for energy-containing beverages (i.e., reducing caloric intake) may facilitate weight management. A 2009 article found that drinking 500 ml of water prior to meals for a 12-week period resulted in increased long-term weight reduction. (References given in main article.)\n\nFasting\n\nLengthy fasting can be dangerous due to the risk of malnutrition and should be carried out only under medical supervision. During prolonged fasting or very low calorie diets the reduction of blood glucose, the preferred energy source of the brain, causes the body to deplete its glycogen stores. Once glycogen is depleted the body begins to fuel the brain using ketones, while also metabolizing body protein (including but not limited to skeletal muscle) to be used to synthesize sugars for use as energy by the rest of the body. Most experts believe that a prolonged fast can lead to muscle wasting, although some dispute this. The use of short-term fasting, or various forms of intermittent fasting have been used as a form of dieting to circumvent this issue.\n\nSide effects\n\nWhile there are studies that show the health and medical benefits of weight loss, a study in 2005 of around 3000 Finns over an 18-year period showed that weight loss from dieting can result in increased mortality, while those who maintained their weight fared the best. Similar conclusion is drawn by other studies, and although other studies suggest that intentional weight loss has a small benefit for individuals classified as unhealthy, it is associated with slightly increased mortality for healthy individuals and the slightly overweight but not obese. This may reflect the loss of subcutaneous fat and beneficial mass from organs and muscle in addition to visceral fat when there is a sudden and dramatic weight loss.\n \nLow carbohydrate versus low fat\n\nMany studies have focused on diets that reduce calories via a low-carbohydrate (Atkins diet, Scarsdale diet, Zone diet) diet versus a low-fat diet (LEARN diet, Ornish diet). The Nurses' Health Study, an observational cohort study, found that low carbohydrate diets based on vegetable sources of fat and protein are associated with less coronary heart disease. The same study also found no correlation (with multivariate adjustment) between animal fat intake and coronary heart disease (table 4). A long term study that monitored 43,396 Swedish women however suggests that a low carbohydrate-high protein diet, used on a regular basis and without consideration of the nature of carbohydrates or the source of proteins, is associated with increased risk of cardiovascular disease.\n\nA meta-analysis of randomized controlled trials by the international Cochrane Collaboration in 2002 concluded that fat-restricted diets are no better than calorie-restricted diets in achieving long term weight loss in overweight or obese people. A more recent meta-analysis that included randomized controlled trials published after the Cochrane review found that low-carbohydrate, non-energy-restricted diets appear to be at least as effective as low-fat, energy-restricted diets in inducing weight loss for up to 1 year. These results can be understood because weight loss is mainly governed by daily caloric deficit and not by the particular foods eaten. However, when low-carbohydrate diets to induce weight loss are considered, potential favorable changes in triglyceride and high-density lipoprotein cholesterol values should be weighed against potential unfavorable changes in low-density lipoprotein cholesterol values.\"\n\nThe Women's Health Initiative Randomized Controlled Dietary Modification Trial found that a diet of total fat to 20% of energy and increasing consumption of vegetables and fruit to at least 5 servings daily and grains to at least 6 servings daily resulted in:\n*no reduction in cardiovascular disease\n*no statistically significant reduction in invasive breast cancer\n*no reductions in colorectal cancer\n\nAdditional randomized controlled trials found that:\n*A comparison of Atkins, Zone diet, Ornish diet, and LEARN diet in premenopausal women found the greatest benefit from the Atkins diet.\n*The choice of diet for a specific person may be influenced by measuring the individual's insulin secretion:\nIn young adults \"Reducing glycemic [carbohydrate] load may be especially important to achieve weight loss among individuals with high insulin secretion.\" This is consistent with prior studies of diabetic patients in which low carbohydrate diets were more beneficial.\n\nThe American Diabetes Association recommended a low carbohydrate diet to reduce weight for those with or at risk of Type 2 diabetes in its January 2008 Clinical Practice Recommendations.\n\nLow glycemic index\n\n\"The glycemic index (GI) factor is a ranking of foods based on their overall effect on blood sugar levels. The diet based around this research is called the Low GI diet. Low glycemic index foods, such as lentils, provide a slower, more consistent source of glucose to the bloodstream, thereby stimulating less insulin release than high glycemic index foods, such as white bread.\"\n\nThe glycemic load is \"the mathematical product of the glycemic index and the carbohydrate amount\".\n\nIn a randomized controlled trial that compared four diets that varied in carbohydrate amount and glycemic index found complicated results:\n*Diet 1 and 2 were high carbohydrate (55% of total energy intake)\n**Diet 1 was high-glycemic index\n**Diet 2 was low-glycemic index\n*Diet 3 and 4 were high protein (25% of total energy intake)\n**Diet 3 was high-glycemic index\n**Diet 4 was low-glycemic index\n\nDiets 2 and 3 lost the most weight and fat mass; however, low density lipoprotein fell in Diet 2 and rose in Diet 3. Thus the authors concluded that the high-carbohydrate, low-glycemic index diet was the most favorable.\n\nA meta-analysis by the Cochrane Collaboration concluded that low glycemic index or low glycemic load diets led to more weight loss and better lipid profiles. However, the Cochrane Collaboration grouped low glycemic index and low glycemic load diets together and did not try to separate the effects of the load versus the index. Dieting. http://en.wikipedia.org/?curid=8460."
  }
}
