{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11884",
  "eid" : "feb194e0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778507054,
  "textBody" : "German () is a West Germanic language that is mainly spoken in Central Europe. It is the most widely spoken and (co-) official language in Germany, Austria, Switzerland, South Tyrol (Italy), the German-speaking Community of Belgium, and Liechtenstein. It is also one of the three official languages of Luxembourg. The languages which are most similar to German are the other members of the West Germanic language branch: Afrikaans, Dutch, English, the Frisian languages, Low German/Low Saxon, Luxembourgish, and Yiddish. German is the second most widely spoken Germanic language, after English.\n\nOne of the major languages of the world, German is the first language of about 95 million people worldwide and the most widely spoken native language in the European Union. German also is the fourth most widely taught non-English language in the USModern Language Association, February 2015, [http://www.mla.org/pdf/2013_enrollment_survey.pdf Enrollments in Languages Other Than English in United States Institutions of Higher Education, Fall 2013]. Retrieved 7 July 2015. (after Spanish, French and American Sign Language) and third in the EU (after English and French; at lower secondary level), the second most commonly used scientific language as well as the fourth most widely used language on websites (after English, Russian and Japanese). The German-speaking countries are ranked fifth in terms of annual publication of new books, with one tenth of all books (including e-books) in the world being published in the German language.\n\nGerman is an inflected language with four cases for nouns, pronouns, and adjectives (nominative, accusative, genitive, dative), three genders (masculine, feminine, neuter), and strong and weak verbs. German derives the majority of its vocabulary from the ancient Germanic branch of the Indo-European language family. A portion of German words are derived from Latin and Greek, and fewer are borrowed from French and English. With slightly different standardized variants (German, Austrian, and Swiss Standard German), German is a pluricentric language. Like English, German is also notable for its broad spectrum of dialects, with many unique varieties existing in Europe and also other parts of the world.Template:German L1 speakers outside Europe Due to the limited intelligibility between certain varieties and Standard German, as well as the lack of an undisputed, scientific difference between a \"dialect\" and a \"language\", some German varieties or dialect groups (e.g. Low German or PlautdietschJan Goossens: ' In: Jan Goossens (Hrsg.): ' Karl Wachholtz, 2. Auflage, Neumünster 1983, S. 27; Willy Sanders: ' Vandenhoeck & Ruprecht, Göttingen 1982, , S. 32 f.; Dieter Stellmacher: ' 2. Auflage, Weidler, Berlin 2000, , S. 92.) are alternatively referred to as \"languages\" and \"dialects\".\n\nClassification \n\nModern Standard German is a West Germanic language descended from the Germanic branch of the Indo-European languages. The Germanic languages are traditionally subdivided into three branches: North Germanic, East Germanic, and West Germanic. The first of these branches survives in modern Danish, Swedish, Norwegian, Faroese, and Icelandic, all of which are descended from Old Norse. The East Germanic languages are now extinct, and the only historical member of this branch from which written texts survive is Gothic. The West Germanic languages, however, have undergone extensive dialectal subdivision and are now represented in modern languages such as English, German, Dutch, Yiddish, Afrikaans, and others.\n\nWithin the West Germanic language dialect continuum, the Benrath and Uerdingen lines (running through Düsseldorf-Benrath and Krefeld-Uerdingen, respectively) serve to distinguish the Germanic dialects that were affected by the High German consonant shift (south of Benrath) from those that were not (north of Uerdingen). The various regional dialects spoken south of these lines are grouped as High German dialects (nos. 29–34 on the map), while those spoken to the north comprise the Low German/Low Saxon (nos. 19–24) and Low Franconian (no. 25) dialects. As members of the West Germanic language family, High German, Low German, and Low Franconian can be further distinguished historically as Irminonic, Ingvaeonic, and Istvaeonic, respectively. This classification indicates their historical descent from dialects spoken by the Irminones (also known as the Elbe group), Ingvaeones (or North Sea Germanic group), and Istvaeones (or Weser-Rhine group).\n\nStandard German is based on Thuringian-Upper Saxon dialects (no. 30 on the map), which are Central German dialects (nos. 29–31), belonging to the Irminonic High German dialect group. German is therefore most closely related to the other languages based on High German dialects, such as Luxembourgish (based on Central Franconian dialects – no. 29), and Yiddish. Also closely related to Standard German are the Upper German dialects spoken in the southern German-speaking countries, such as Swiss German (Alemannic dialects – no. 34), and the various dialects spoken in the French region of Grand Est, such as Alsatian (mainly Alemannic, but also Central- and Upper Franconian (no. 32) dialects) and Lorraine Franconian (Central Franconian – no. 29).\n\nAfter these High German dialects, standard German is (somewhat less closely) related to languages based on Low Franconian dialects (e.g. Dutch and Afrikaans) or Low German/Low Saxon dialects (spoken in northern Germany and southern Denmark), neither of which underwent the High German consonant shift. As has been noted, the former of these dialect types is Istvaeonic and the latter Ingvaeonic, whereas the High German dialects are all Irminonic; the differences between these languages and standard German are therefore considerable. Also related to German are the Frisian languages—North Frisian (spoken in Schleswig-Holstein no. 28), Saterland Frisian (spoken in Lower Saxony – no. 27), and West Frisian (spoken in the Netherlands – no. 26)—as well as the Anglic languages of English and Scots. These Anglo-Frisian dialects are all members of the Ingvaeonic family of West Germanic languages which did not take part in the High German consonant shift.\n\nHistory \n\nOld High German \n\nThe history of the German language begins with the High German consonant shift during the migration period, which separated Old High German (OHG) dialects from Old Saxon. This sound shift involved a drastic change in the pronunciation of both voiced and voiceless stop consonants (b, d, g, and p, t, k, respectively). The primary effects of the shift were the following:\n\n*Voiceless stops became long (geminated) voiceless fricatives following a vowel\n*Voiceless stops became affricates in word-initial position, or following certain consonants\n*Voiced stops became voiceless in certain phonetic settings.\n\nWhile there is written evidence of the Old High German language in several Elder Futhark inscriptions from as early as the 6th century AD (such as the Pforzen buckle), the Old High German period is generally seen as beginning with the Abrogans (written c.765–775), a Latin-German glossary supplying over 3,000 OHG words with their Latin equivalents. Following the Abrogans the first coherent works written in OHG appear in the 9th century, chief among them being the Muspilli, the Merseberg Incantations, and the Hildebrandslied, as well as a number of other religious texts (the Georgslied, the Ludwigslied, the Evangelienbuch, and translated hymns and prayers). The Muspilli is a Christian poem written in a Bavarian dialect offering an account of the soul after the Last Judgment, and the Merseberg Incantations are transcriptions of spells and charms from the pagan Germanic tradition. Of particular interest to scholars, however, has been the Hildebrandslied, a secular epic poem telling the tale of an estranged father and son unknowingly meeting each other in battle. Linguistically this text is highly interesting due to the mixed use of Old Saxon and Old High German dialects in its composition. The written works of this period stem mainly from the Alamanni, Bavarian, and Thuringian groups, all belonging to the Elbe Germanic group (Irminones), which had settled in what is now southern-central Germany and Austria between the 2nd and 6th centuries during the great migration.\n\nIn general, the surviving texts of OHG show a wide range of dialectal diversity with very little written uniformity. The early written tradition of OHG survived mostly through monasteries and scriptoria as local translations of Latin originals; as a result, the surviving texts are written in highly disparate regional dialects and exhibit significant Latin influence, particularly in vocabulary. At this point monasteries, where most written works were produced, were dominated by Latin, and German saw only occasional use in official and ecclesiastical writing.\n\nThe German language through the OHG period was still predominantly a spoken language, with a wide range of dialects and a much more extensive oral tradition than a written one. Having just emerged from the High German consonant shift, OHG was also a relatively new and volatile language still undergoing a number of phonetic, phonological, morphological, and syntactic changes. The scarcity of written work, instability of the language, and widespread illiteracy of the time thus account for the lack of standardization up to the end of the OHG period in 1050.\n\nMiddle High German \n\nWhile there is no complete agreement over the dates of the Middle High German (MHG) period, it is generally seen as lasting from 1050 to 1350. This was a period of significant expansion of the geographical territory occupied by Germanic tribes, and consequently of the number of German speakers. Whereas during the Old High German period the Germanic tribes extended only as far east as the Elbe and Saale rivers, the MHG period saw a number of these tribes expanding beyond this eastern boundary into Slavic territory (this is known as the Ostsiedlung). Along with the increasing wealth and geographic extent of the Germanic groups came greater use of German in the courts of nobles as the standard language of official proceedings and literature. A clear example of this is the mittelhochdeutsche Dichtersprache employed in the Hohenstaufen court in Swabia as a standardized supra-dialectal written language. While these efforts were still regionally bound, German began to be used in place of Latin for certain official purposes, leading to a greater need for regularity in written conventions.\n\nWhile the major changes of the MHG period were socio-cultural, German was still undergoing significant linguistic changes in syntax, phonetics, and morphology as well (e.g. diphthongization of certain vowel sounds: hus (OHG \"house\")→haus (MHG), and weakening of unstressed short vowels to schwa [ə]: taga (OHG \"days\")→tage (MHG)).\n\nA great wealth of texts survives from the MHG period. Significantly, among this repertoire are a number of impressive secular works, such as the Nibelungenlied, an epic poem telling the story of the dragon-slayer Siegfried (c. 13th century), and the Iwein, an Arthurian verse poem by Hartmann von Aue (c. 1203), as well as several lyric poems and courtly romances such as Parzival and Tristan. (Also noteworthy is the Sachsenspiegel, the first book of laws written in Middle Low German (c. 1220)). The abundance and (secular) character of the literature of the MHG period demonstrate the beginnings of a standardized written form of German, as well as the desire of poets and authors to be understood by individuals on supra-dialectal terms.\n\nThe Middle High German period is generally seen as ending with the decimation of the population of Europe in the Black Death of 1346–1353.\n\nEarly New High German \n\nModern German begins with the Early New High German (ENHG) period, which the influential German philologist Wilhelm Scherer dates 1350–1650, terminating with the end of the Thirty Years' War. This period saw the further displacement of Latin by German as the primary language of courtly proceedings and, increasingly, of literature in the German states. While these states were still under the control of the Holy Roman Empire and far from any form of unification, the desire for a cohesive written language that would be understandable across the many German-speaking principalities and kingdoms was stronger than ever. As a spoken language German remained highly fractured through this period with a vast number of often mutually-incomprehensible regional dialects being spoken throughout the German states; the invention of the printing press c.1440 and the publication of Luther's vernacular translation of the Bible in 1534, however, had an immense effect on standardizing German as a supra-dialectal written language.\n\nThe ENHG period saw the rise of several important cross-regional forms of chancery German, one being gemeine tiutsch, used in the court of the Holy Roman Emperor Maximilian I, and the other being Meißner Deutsch, used in the Electorate of Saxony in the Duchy of Saxe-Wittenberg. Alongside these courtly written standards, the invention of the printing press led to the development of a number of printers' languages (Druckersprachen) aimed at making printed material readable and understandable across as many diverse dialects of German as possible. The greater ease of production and increased availability of written texts brought about increased standardization in the written form of the German language.One of the central events in the development of ENHG was the publication of Luther's translation of the Bible into German (the New Testament in 1522 and the Old Testament, published in parts and completed in 1534). Luther based his translation primarily on the Meißner Deutsch of Saxony,Fahlbusch, Erwin and Bromiley, Geoffrey William. The Encyclopedia of Christianity. Grand Rapids, MI: Leiden, Netherlands: Wm. B. Eerdmans; Brill, 1999–2003, 1:244. spending much time among the population of Saxony researching the dialect so as to make the work as natural and accessible to German speakers as possible. Copies of Luther's Bible featured a long list of glosses for each region that translated words which were unknown in the region into the regional dialect. Concerning his translation method Luther says the following:One who would talk German does not ask the Latin how he shall do it; he must ask the mother in the home, the children on the streets, the common man in the market-place and note carefully how they talk, then translate accordingly. They will then understand what is said to them because it is German. When Christ says 'ex abundantia cordis os loquitur,' I would translate, if I followed the papists, aus dem Überflusz des Herzens redet der Mund. But tell me is this talking German? What German understands such stuff? No, the mother in the home and the plain man would say, Wesz das Herz voll ist, des gehet der Mund über.With Luther's rendering of the Bible in the vernacular German asserted itself against the dominance of Latin as a legitimate language for courtly, literary, and now ecclesiastical subject-matter. Further, his Bible was ubiquitous in the German states with nearly every household possessing a copy. Nevertheless, even with the influence of Luther's Bible as an unofficial written standard, it was not until the middle of the 18th century after the ENHG period that a widely accepted standard for written German appeared.Wilhelm Scherer,  [On the history of the German language] (Berlin 1868)\n\nAustrian Empire \n\nGerman was the language of commerce and government in the Habsburg Empire, which encompassed a large area of Central and Eastern Europe. Until the mid-19th century, it was essentially the language of townspeople throughout most of the Empire. Its use indicated that the speaker was a merchant or someone from an urban area, regardless of nationality.\n\nSome cities, such as Prague () and Budapest (Buda, ), were gradually Germanized in the years after their incorporation into the Habsburg domain. Others, such as Pozsony (, now Bratislava), were originally settled during the Habsburg period, and were primarily German at that time. Prague, Budapest and Bratislava as well as cities like Zagreb (), and Ljubljana (), contained significant German minorities.\n\nIn the eastern provinces of Banat and Transylvania (), German was the predominant language not only in the larger towns – such as  (Timișoara),  (Sibiu) and  (Brașov) – but also in many smaller localities in the surrounding areas.Anstalt G. Freytag & Berndt (1911). ' Vienna: . \"Census December 31st 1910\"' (in Hungarian). Budapest: Magyar Kir. Központi Statisztikai Hivatal (KSH). 1912.\n\nStandardization \n\nThe most comprehensive guide to the vocabulary of the German language is found within the '. This dictionary was created by the Brothers Grimm and is composed of 16 parts which were issued between 1852 and 1860.[http://www.bbaw.de/en/research/dwb Synopsis of the Deutsches Wörterbuch]  at the Language Research Centre, Berlin-Brandenburg Academy of Sciences and Humanities, retrieved 27 June 2012. In 1872, grammatical and orthographic rules first appeared in the Duden Handbook.Gerhard Weiss, Up-to-Date and with a Past: The \"Duden\" and Its History, 1995, The Publisher as Teacher, 6 [https://dx.doi.org/10.2307/3531328 DOI], [https://www.jstor.org/stable/3531328 online from jstor]\n\nIn 1901, the 2nd Orthographical Conference ended with a complete standardization of the German language in its written form and the Duden Handbook was declared its standard definition.Dieter Nerius: ' In: Zeitschrift für deutsche Philologie (), 119. Jahrgang 2000, Nr. 1, S. 30–54. The ' (literally, German stage language) had established conventions for German pronunciation in theatre (BühnendeutschTheodor Siebs: ' Hrsg. von Helmut de Boor. 19., umgearbeitete Auflage. VMA, Wiesbaden 2000, )) three years earlier; however, this was an artificial standard that did not correspond to any traditional spoken dialect. Rather, it was based on the pronunciation of Standard German in Northern Germany, although it was subsequently regarded often as a general prescriptive norm, despite differing pronunciation traditions especially in the Upper-German-speaking regions that still characterize the dialect of the area today – especially the pronunciation of the ending ' as [ɪk] instead of [ɪç]. In Northern Germany, Standard German was a foreign language to most inhabitants, whose native dialects were subsets of Low German. It was usually encountered only in writing or formal speech; in fact, most of Standard German was a written language, not identical to any spoken dialect, throughout the German-speaking area until well into the 19th century.\n\nOfficial revisions of some of the rules from 1901 were not issued until the controversial German orthography reform of 1996 was made the official standard by governments of all German-speaking countries. Media and written works are now almost all produced in Standard German (often called ', \"High German\") which is understood in all areas where German is spoken.\n\nGeographic distribution \n\nDue to the German diaspora as well as German being the third most widely taught foreign language in the US and the EU amongst others, the geographical distribution of German speakers (or \"Germanophones\") spans all inhabited continents. As for the number of speakers of any language worldwide, an assessment is always compromised by the lack of sufficient, reliable data. For an exact, global number of native German speakers, this is further complicated by the existence of several varieties whose status as separate \"languages\" or \"dialects\" is disputed for political and/or linguistic reasons, including quantitatively strong varieties like certain forms of Alemannic (e.g., Alsatian) and Low German/Plautdietsch. Mostly depending on the inclusion or exclusion of certain varieties, it is estimated that approximately 90–95 million people speak German as a first language,Sum of Standard German, Swiss German, and all German dialects not listed under \"Standard German\" at Ethnologue (18th ed., 2015) 10-25 million as a second language, and 75–100 million as a foreign language. This would imply approximately 175–220 million German speakers worldwide. It is estimated that also including all persons who are or were taking German classes, i.e., regardless of their actual proficiency, would amount to about 280 million people worldwide with at least some knowledge of German.\n\nEurope and Asia \n\nGerman Sprachraum \n\nThe area in central Europe where the majority of the population speaks German as a first language and has German as a (co-)official language is called the \"German Sprachraum\". It comprises an estimated 88 million native speakers and 10 million who speak German as a second language (e.g. immigrants). Excluding regional minority languages, German is the only official language of\n*Germany (de facto, not specified in the constitution),\n*Austria (de jure),\n*17 cantons of Switzerland (de jure), and\n*Liechtenstein (de jure).\n\nIt is a co-official language of the\n*Italian Autonomous Province of South Tyrol (also majority language),\n*Belgium (as majority language only in the German-speaking Community),\n*four cantons of Switzerland, and\n*Luxembourg.\n\nOutside the Sprachraum \n\nAlthough expulsions and (forced) assimilation after the two World Wars greatly diminished them, minority communities of mostly bilingual German native speakers exist in areas both adjacent to and detached from the Sprachraum.\n\nWithin Europe and Asia, German is a recognized minority language in the following countries:\n* Bosnia and Herzegovina (see also: ')\n* Czech Republic (see also: Germans in the Czech Republic)\n* Denmark (see also: North Schleswig Germans)\n* Hungary (see also: Germans of Hungary)\n* Italy (outside of South Tyrol; see also: Cimbrian, Mòcheno/Fersentalerisch, Walser German)\n* Kazakhstan (see also: Germans of Kazakhstan)\n* Poland (see also German minority in Poland; German is auxiliary language in 31 communes;)\n* Romania (see also: Germans of Romania)\n* Russia (see also: Germans in Russia)\n* Slovakia (see also: Carpathian Germans)\n* Ukraine (see also: Germans in Ukraine)\n\nIn France, the High German varieties of Alsatian and Moselle Franconian are identified as \"regional languages\", but the European Charter for Regional and Minority Languages of 1998 has not yet been ratified by the government. In the Netherlands, the Limburgish, Frisian, and Low German languages are protected regional languages according to the European Charter for Regional and Minority Languages; however, they are widely considered separate languages and neither German nor Dutch dialects.\n\nAfrica \n\nNamibia \n\nNamibia was a colony of the German Empire from 1884 to 1919. Mostly descending from German settlers who immigrated during this time, 25–30,000 people still speak German as a native tongue today. The period of German colonialism in Namibia also led to the evolution of a Standard German-based pidgin language called \"Namibian Black German\", which became a second language for parts of the indigenous population. Although it is nearly extinct today, some older Namibians still have some knowledge of it.\n\nGerman, along with English and Afrikaans was a co-official language of Namibia from 1984 until its independence from South Africa in 1990. At this point, the Namibian government perceived Afrikaans and German as symbols of apartheid and colonialism, and decided English would be the sole official language, claiming that it was a \"neutral\" language as there were virtually no English native speakers in Namibia at that time. German, Afrikaans and several indigenous languages became \"national languages\" by law, identifying them as elements of the cultural heritage of the nation and ensuring that the state acknowledged and supported their presence in the country. Today, German is used in a wide variety of spheres, especially business and tourism, as well as the churches (most notably the German-speaking Evangelical Lutheran Church in Namibia (GELK)), schools (e.g. the ), literature (German-Namibian authors include Giselher W. Hoffmann), radio (the Namibian Broadcasting Corporation produces radio programs in German), and music (e.g. artist EES). The ' is one of the three biggest newspapers in Namibia and the only German-language daily in Africa.\n\nSouth Africa \n\nMostly originating from different waves of immigration during the 19th and 20th centuries, an estimated 12,000 people speak German or a German variety as a first language in South Africa.German L1 speakers outside Europe One of the largest communities consists of the speakers of \"\", a variety of Low German, concentrated in and around Wartburg. The small town of Kroondal in the North-West Province also has a mostly German-speaking population. The South African constitution identifies German as a \"commonly used\" language and the Pan South African Language Board is obligated to promote and ensure respect for it. The community is strong enough that several German International schools are supported such as the Deutsche Schule Pretoria.\n\nNorth America \n\nIn the United States, the states of North Dakota and South Dakota are the only states where German is the most common language spoken at home after English. German geographical names can be found throughout the Midwest region of the country, such as New Ulm and many other towns in Minnesota; Bismarck (North Dakota's state capital), Munich, Karlsruhe, and Strasburg (named after a town near Odessa in Ukraine) in North Dakota; New Braunfels, Fredericksburg, Weimar, and Muenster in Texas; Corn (formerly Korn), Kiefer and Berlin in Oklahoma; and Kiel, Berlin, and Germantown in Wisconsin.\n\nBetween 1843 and 1910, more than 5 million Germans emigrated overseas,Henry Steele Commager (1961). [https://books.google.com/books?id\nCzlg39-Z75kC&pgPA102&dq&hl\nen#vonepage&q\n&f=false Immigration and American history: essays in honor of Theodore C. Blegen]. University of Minnesota Press. p.102.  mostly to the United States.49.2 million German Americans as of 2005 according to the ; the 1990 census gives 57.9 million, or 23.3% of the U.S. population. German remained an important language in churches, schools, newspapers, and even the administration of the United States Brewers' Association through the early 20th century, but was severely repressed during World War I. Over the course of the 20th century, many of the descendants of 18th century and 19th century immigrants ceased speaking German at home, but small populations of speakers are still found in Pennsylvania (Amish, Hutterites, Dunkards and some Mennonites historically spoke Hutterite German and a West Central German variety of German known as Pennsylvania German or Pennsylvania Dutch), Kansas (Mennonites and Volga Germans), North Dakota (Hutterite Germans, Mennonites, Russian Germans, Volga Germans, and Baltic Germans), South Dakota, Montana, Texas (Texas German), Wisconsin, Indiana, Oregon, Oklahoma, and Ohio (72,570). A significant group of German Pietists in Iowa formed the Amana Colonies and continue to practice speaking their heritage language. Early twentieth century immigration was often to St. Louis, Chicago, New York, Milwaukee, Pittsburgh and Cincinnati.\n\nThe dialects of German which are or were primarily spoken in colonies or communities founded by German-speaking people resemble the dialects of the regions the founders came from. For example, Hutterite German resembles dialects of Carinthia. Texas German is a dialect spoken in the areas of Texas settled by the Adelsverein, such as New Braunfels and Fredericksburg. In the Amana Colonies in the state of Iowa, Amana German is spoken. Plautdietsch is a large minority language spoken in Northern Mexico by the Mennonite communities, and is spoken by more than 200,000 people in Mexico. Pennsylvania German is a West Central German dialect spoken by most of the Amish population of Pennsylvania, Ohio, and Indiana and resembles Palatinate German dialects. \n\nHutterite German is an Upper German dialect of the Austro-Bavarian variety of the German language, which is spoken by Hutterite communities in Canada and the United States. Hutterite is spoken in the U.S. states of Washington, Montana, North Dakota, South Dakota, and Minnesota; and in the Canadian provinces of Alberta, Saskatchewan and Manitoba. Its speakers belong to some Schmiedleit, Lehrerleit, and Dariusleit Hutterite groups, but there are also speakers among the older generations of Prairieleit (the descendants of those Hutterites who chose not to settle in colonies). Hutterite children who grow up in the colonies learn to speak Hutterite German before learning English, the standard language of the surrounding areas, in school. Many of these children, though, continue with German Grammar School, in addition to public school, throughout a student's elementary education.\n\nIn Canada, there are 622,650 speakers of German according to the most recent census in 2006, with people of German ancestry (German Canadians) found throughout the country. German-speaking communities are particularly found in British Columbia (118,035) and Ontario (230,330). There is a large and vibrant community in the city of Kitchener, Ontario, which was at one point named Berlin. German immigrants were instrumental in the country's three largest urban areas: Montreal, Toronto, and Vancouver; post-Second World War immigrants managed to preserve a fluency in the German language in their respective neighborhoods and sections. In the first half of the 20th century, over a million German-Canadians made the language Canada's third most spoken after French and English.\n\nIn Mexico there are also large populations of German ancestry, mainly in the cities of: Mexico City,Tools of Progress: A German Merchant Family in Mexico City, 1865–present  pp. ix-8 Puebla, Mazatlán, Tapachula, Ecatepec de Morelos, and larger populations scattered in the states of Chihuahua, Durango, and Zacatecas.[https://www.tripadvisor.co.uk/ShowTopic-g150792-i257-k3377754-How_German_is_Mazatlan-Mazatlan_Pacific_Coast.html How German is Mazatlan?], tripadvisor.co.ukConcise Encyclopedia of Amish, Brethren, Hutterites, and Mennonites  p. 144\n\nSouth America \n\nIn Brazil, the largest concentrations of German speakers are in the states of Rio Grande do Sul (where Riograndenser Hunsrückisch developed), Santa Catarina, Paraná, São Paulo and Espírito Santo. There are also important concentrations of German-speaking descendants in Argentina, Chile, Paraguay, Venezuela, Peru and Bolivia. In the 20th century, over 100,000 German political refugees and invited entrepreneurs settled in Latin America, in countries such as Costa Rica, Panama, Venezuela, and the Dominican Republic, to establish German-speaking enclaves, and reportedly there is a small German immigration to Puerto Rico.  In most locations where German immigrants settled, the vast majority of their descendants no longer speak German, as they have been largely assimilated into the host language and culture of the specific location of settlement; generally Spanish or Portuguese.\n\nCo-official statuses of German or German varieties in Brazil \n\n*Espírito Santo (statewide cultural language)\n**Domingos Martins\n**Laranja da Terra\n**Pancas\n**Santa Maria de Jetibá\n**Vila Pavão\n*Rio Grande do Sul\n**Santa Maria do Herval\n**Canguçu\n*Santa Catarina\n**Antônio Carlos\n**Pomerode\n\nOceania \n\nIn Australia, the state of South Australia experienced a pronounced wave of immigration in the 1840s from Prussia (particularly the Silesia region). With the prolonged isolation from other German speakers and contact with Australian English, a unique dialect known as Barossa German has developed and is spoken predominantly in the Barossa Valley near Adelaide. Usage of German sharply declined with the advent of World War I, due to the prevailing anti-German sentiment in the population and related government action. It continued to be used as a first language into the twentieth century but now its use is limited to a few older speakers.\n\nGerman migration to New Zealand in the 19th century was less pronounced than migration from Britain, Ireland, and perhaps even Scandinavia. Despite this there were significant pockets of German-speaking communities which lasted until the first decades of the 20th century. German-speakers settled principally in Puhoi, Nelson, and Gore. At the last census (2006), 37,500 people in New Zealand spoke German, making it the third most spoken European language after English and French and overall the ninth most spoken language. \n\nThere is also an important German creole being studied and recovered, named , spoken in the former German colony of German New Guinea, across Micronesia and in northern Australia (i.e. coastal parts of Queensland and Western Australia), by a few elderly people. The risk of its extinction is serious and efforts to revive interest in the language are being implemented by scholars.\n\nGerman as a foreign language \n\nLike French and Spanish, German has become a classic second foreign language in the western world, as English (Spanish in the US) is well established as the first foreign language. German ranks second (after English) among the best known foreign languages in the EU (on a par with French) as well as in Russia. In terms of student numbers across all levels of education, German ranks third in the EU (after English and French) as well as in the United States (after Spanish and French). In 2015, approximately 15.4 million people were in the process of learning German across all levels of education worldwide. As this number remained relatively stable since 2005 (± 1 million), roughly 75–100 million people able to communicate in German as foreign language can be inferred assuming an average course duration of three years and other estimated parameters. According to a 2012 survey, 47 million people within the EU (i.e., up to two thirds of the 75–100 million worldwide) claimed to have sufficient German skills to have a conversation. Within the EU, not counting countries where it is an official language, German as a foreign language is most popular in Eastern and Northern Europe, namely the Czech Republic, Croatia, Denmark, the Netherlands, Slovakia, Hungary, Slovenia, Sweden and Poland. German was once and, to some extent, is still, a lingua franca in those parts of Europe.\n\nStandard German \n\nStandard German originated not as a traditional dialect of a specific region but as a written language. However, there are places where the traditional regional dialects have been replaced by new vernaculars based on standard German; that is the case in large stretches of Northern Germany but also in major cities in other parts of the country. It is important to note, however, that the colloquial standard German differs greatly from the formal written language, especially in grammar and syntax, in which it has been influenced by dialectal speech.\n\nStandard German differs regionally between German-speaking countries in vocabulary and some instances of pronunciation and even grammar and orthography. This variation must not be confused with the variation of local dialects. Even though the regional varieties of standard German are only somewhat influenced by the local dialects, they are very distinct. German is thus considered a pluricentric language.\n\nIn most regions, the speakers use a continuum from more dialectal varieties to more standard varieties according to circumstances.\n\nVarieties of Standard German \n\nIn German linguistics, German dialects are distinguished from varieties of standard German.\nThe varieties of standard German refer to the different local varieties of the pluricentric standard German. They differ only slightly in lexicon and phonology. In certain regions, they have replaced the traditional German dialects, especially in Northern Germany.\n*German Standard German\n*Austrian Standard German\n*Swiss Standard German\n\nIn the German-speaking parts of Switzerland, mixtures of dialect and standard are very seldom used, and the use of Standard German is largely restricted to the written language, though about 10% of the Swiss residents speak High German (aka Standard German) at home, but mainly due to German immigrants. This situation has been called a medial diglossia. Swiss Standard German is used in the Swiss education system, whereas Austrian Standard German is officially used in the Austrian education system.\n\nA mixture of dialect and standard does not normally occur in Northern Germany either. The traditional varieties there are Low German, whereas Standard German is a High German \"variety\". Because their linguistic distance to it is greater, they do not mesh with Standard German the way that High German dialects (such as Bavarian, Swabian, Hessian) can.\n\nDialects \n\nGerman is a member of the West Germanic language of the Germanic family of languages, which in turn is part of the Indo-European language family. The German dialects are the traditional local varieties; many of them are hardly understandable to someone who knows only standard German, and they have great differences in lexicon, phonology and syntax. If a narrow definition of language based on mutual intelligibility is used, many German dialects are considered to be separate languages (for instance in the Ethnologue). However, such a point of view is unusual in German linguistics.\n\nThe German dialect continuum is traditionally divided most broadly into High German and Low German, also called Low Saxon. However, historically, High German dialects and Low Saxon/Low German dialects do not belong to the same language. Nevertheless, in today's Germany, Low Saxon/Low German is often perceived as a dialectal variation of Standard German on a functional level even by many native speakers. The same phenomenon is found in the eastern Netherlands, as the traditional dialects are not always identified with their Low Saxon/Low German origins, but with Dutch.:nl:Nederduits\n\nThe variation among the German dialects is considerable, with often only neighbouring dialects being mutually intelligible. Some dialects are not intelligible to people who know only Standard German. However, all German dialects belong to the dialect continuum of High German and Low Saxon.\n\nLow German \n\nMiddle Low German was the lingua franca of the Hanseatic League. It was the predominant language in Northern Germany until the 16th century. In 1534, the Luther Bible was published. The translation is considered to be an important step towards the evolution of the Early New High German. It aimed to be understandable to a broad audience and was based mainly on Central and Upper German varieties. The Early New High German language gained more prestige than Low German and became the language of science and literature. Around the same time, the Hanseatic League, based around northern ports, lost its importance as new trade routes to Asia and the Americas were established, and the most powerful German states of that period were located in Middle and Southern Germany.\n\nThe 18th and 19th centuries were marked by mass education in Standard German in schools. Gradually, Low German came to be politically viewed as a mere dialect spoken by the uneducated. Today, Low Saxon can be divided in two groups: Low Saxon varieties with a reasonable Standard German influx and varieties of Standard German with a Low Saxon influence known as . Sometimes, Low Saxon and Low Franconian varieties are grouped together because both are unaffected by the High German consonant shift. However, the proportion of the population who can understand and speak it has decreased continuously since World War II. The largest cities in the Low German area are Hamburg and Dortmund.\n\nLow Franconian \n\nThe Low Franconian dialects are the dialects that are more closely related to Dutch than to Low German. Most of the Low Franconian dialects are spoken in the Netherlands and in Belgium, where they are considered as dialects of Dutch, which is itself a Low Franconian language. In Germany, Low Franconian dialects are spoken in the northwest of North Rhine-Westphalia, along the Lower Rhine. The Low Franconian dialects spoken in Germany are referred to as Meuse-Rhenish or Low Rhenish. In the north of the German Low Franconian language area, North Low Franconian dialects (also referred to as Cleverlands or as dialects of South Guelderish) are spoken. These dialects are more closely related to Dutch (also North Low Franconian) than the South Low Franconian dialects (also referred to as East Limburgish and, east of the Rhine, Low Bergish), which are spoken in the south of the German Low Franconian language area. The South Low Franconian dialects are more closely related to Limburgish than to Dutch, and are transitional dialects between Low Franconian and Ripuarian (Central Franconian). The East Bergish dialects are the easternmost Low Franconian dialects, and are transitional dialects between North- and South Low Franconian, and Westphalian (Low German), with most of its features however being North Low Franconian. The largest cities in the German Low Franconian area are Düsseldorf and Duisburg.\n\nHigh German \n\nThe High German dialects consist of the Central German, High Franconian, and Upper German dialects. The High Franconian dialects are transitional dialects between Central- and Upper German. The High German varieties spoken by the Ashkenazi Jews have several unique features, and are considered as a separate language, Yiddish, written with the Hebrew alphabet. \n\nCentral German \n\nThe Central German dialects are spoken in Central Germany, from Aachen in the west to Görlitz in the east. They consist of Franconian dialects in the west (West Central German), and non-Franconian dialects in the east (East Central German). Modern Standard German is mostly based on Central German dialects.\n\nThe Franconian, West Central German dialects are the Central Franconian dialects (Ripuarian and Moselle Franconian), and the Rhine Franconian dialects (Hessian and Palatine). These dialects are considered as\n* German in Germany and Belgium\n* Luxembourgish in Luxembourg\n* Lorraine Franconian (spoken in Moselle) and as a Rhine Franconian variant of Alsatian (spoken in Alsace bossue only) in France\n* Limburgish or Kerkrade dialect in the Netherlands.\nLuxembourgish as well as the Transylvanian Saxon dialect spoken in Transylvania are based on Moselle Franconian dialects. The largest cities in the Franconian Central German area are Cologne and Frankfurt.\n\nFurther east, the non-Franconian, East Central German dialects are spoken (Thuringian, Upper Saxon, Ore Mountainian, and Lusatian-New Markish, and earlier, in the then German-speaking parts of Silesia also Silesian, and in then German southern East Prussia also High Prussian). The largest cities in the East Central German area are Berlin and Leipzig.\n\nHigh Franconian \n\nThe High Franconian dialects are transitional dialects between Central- and Upper German. They consist of the East- and South Franconian dialects.\n\nThe East Franconian dialect branch is one of the most spoken dialect branches in Germany. These dialects are spoken in the region of Franconia and in the central parts of Saxon Vogtland. Franconia consists of the Bavarian districts of Upper-, Middle-, and Lower Franconia, the region of South Thuringia (Thuringia), and the eastern parts of the region of Heilbronn-Franken (Tauber Franconia and Hohenlohe) in Baden-Württemberg. The largest cities in the East Franconian area are Nuremberg and Würzburg.\n\nSouth Franconian is mainly spoken in northern Baden-Württemberg in Germany, but also in the northeasternmost part of the region of Alsace in France. While these dialects are considered as dialects of German in Baden-Württemberg, they are considered as dialects of Alsatian in Alsace (most Alsatian dialects are however Low Alemannic). The largest cities in the South Franconian area are Karlsruhe and Heilbronn.\n\nUpper German \n\nThe Upper German dialects are the Alemannic dialects in the west, and the Bavarian dialects in the east.\n\nAlemannic \n\nAlemannic dialects are spoken in Switzerland (High Alemannic in the densely populated Swiss Plateau, in the south also Highest Alemannic, and Low Alemannic in Basel), Baden-Württemberg (Swabian and Low Alemannic, in the southwest also High Alemannic), Bavarian Swabia (Swabian, in the southwesternmost part also Low Alemannic), Vorarlberg (Low-, High-, and Highest Alemannic), Alsace (Low Alemannic, in the southernmost part also High Alemannic), Liechtenstein (High- and Highest Alemannic), and in the Tyrolean district of Reutte (Swabian). The Alemannic dialects are considered as Alsatian in Alsace. The largest cities in the Alemannic area are Stuttgart and Zürich.\n\nBavarian \n\nBavarian dialects are spoken in Austria (Vienna, Lower- and Upper Austria, Styria, Carinthia, Salzburg, Burgenland, and in most parts of Tyrol), Bavaria (Upper- and Lower Bavaria as well as Upper Palatinate), South Tyrol, southwesternmost Saxony (Southern Vogtlandian), and in the Swiss village of Samnaun. The largest cities in the Bavarian area are Vienna and Munich.\n\nGrammar \n\nGerman is a fusional language with a moderate degree of inflection, with three grammatical genders; as such, there can be a large number of words derived from the same root.\n\nNoun inflection \n\nGerman nouns inflect by case, gender and number:\n* four cases: nominative, accusative, genitive and dative.\n* three genders: masculine, feminine and neuter. Word endings sometimes reveal grammatical gender: for instance, nouns ending in ' (-ing), ' (-ship), ' or ' (-hood, -ness) are feminine, and nouns ending in ' or ' (diminutive forms) are neuter and nouns ending in ' (-ism) are masculine. Others are more variable, sometimes depending on the region in which the language is spoken; and some endings are not restricted to one gender, e.g. ' (-er), e.g. ' (feminine), celebration, party, ' (masculine), labourer, and ' (neuter), thunderstorm.\n* two numbers: singular and plural.\n\nThis degree of inflection is considerably less than in Old High German and other old Indo-European languages such as Latin, Ancient Greek, and Sanskrit, and it is also somewhat less than, for instance, Old English, modern Icelandic and Russian. The three genders have collapsed in the plural. With four cases and three genders plus plural, there are 16 permutations of case and gender/number, but there are only six forms of the definite article, which together cover all 16 permutations. In nouns, inflection for case is required in the singular for strong masculine and neuter nouns, in the genitive and sometimes in the dative. Both of these cases are losing ground to substitutes in informal speech. The dative noun ending is considered somewhat old-fashioned in many contexts and is often dropped, but it is still used in proverbs and the like, in formal speech and in written language. Weak masculine nouns share a common case ending for genitive, dative and accusative in the singular. Feminine nouns are not declined in the singular. The plural has an inflection for the dative. In total, seven inflectional endings (not counting plural markers) exist in German: '.\n\nIn German orthography, nouns and most words with the syntactical function of nouns are capitalised to make it easier for readers to determine the function of a word within a sentence (' – \"On Friday I went shopping.\"; ' – \"One day he finally showed up.\") This convention is almost unique to German today (shared perhaps only by the closely related Luxembourgish language and several insular dialects of the North Frisian language), but it was historically common in other languages such as Danish (which abolished the capitalization of nouns in 1948) and English.\n\nLike the other Germanic languages, German forms noun compounds in which the first noun modifies the category given by the second,: ' (\"dog hut\"; specifically: \"dog kennel\"). Unlike English, whose newer compounds or combinations of longer nouns are often written in \"open\" with separating spaces, German (like some other Germanic languages) nearly always uses the \"closed\" form without spaces, for example: ' (\"tree house\"). Like English, German allows arbitrarily long compounds in theory (see also English compounds). The longest German word verified to be actually in (albeit very limited) use is , which, literally translated, is \"beef labelling supervision duty assignment law\" [from ' (cattle), ' (meat), ' (labelling), ' (supervision), ' (duties), ' (assignment), ' (law)]. However, examples like this are perceived by native speakers as excessively bureaucratic, stylistically awkward or even satirical.\n\nVerb inflection \n\nThe inflection of standard German verbs includes:\n* two main conjugation classes: weak and strong (as in English). Additionally, there is a third class, known as mixed verbs, whose conjugation combines features of both the strong and weak patterns.\n* three persons: first, second and third.\n* two numbers: singular and plural.\n* three moods: indicative, imperative and subjunctive (in addition to infinitive)\n* two voices: active and passive. The passive voice uses auxiliary verbs and is divisible into static and dynamic. Static forms show a constant state and use the verb ’’to be’’ (sein). Dynamic forms show an action and use the verb “to become’’ (werden).\n* two tenses without auxiliary verbs (present and preterite) and four tenses constructed with auxiliary verbs (perfect, pluperfect, future and future perfect).\n* the distinction between grammatical aspects is rendered by combined use of subjunctive and/or preterite marking so the plain indicative voice uses neither of those two markers; the subjunctive by itself conveys secondhand information; subjunctive plus preterite marks the conditional state; and the preterite alone shows either plain indicative (in the past), or functions as a (literal) alternative for either second-hand-information or the conditional state of the verb, when necessary for clarity.\n* the distinction between perfect and progressive aspect is and has, at every stage of development, been a productive category of the older language and in nearly all documented dialects, but, strangely enough, it is now rigorously excluded from written usage in its present normalised form.\n* disambiguation of completed vs. uncompleted forms is widely observed and regularly generated by common prefixes (' [to look], ' [to see – unrelated form: ]).\n\nVerb prefixes \n\nThe meaning of basic verbs can be expanded and sometimes radically changed through the use of a number of prefixes. Some prefixes have a specific meaning; the prefix ' refers to destruction, as in ' (to tear apart), ' (to break apart), ' (to cut apart). Other prefixes have only the vaguest meaning in themselves; ' is found in a number of verbs with a large variety of meanings, as in ' (to try) from ' (to seek), ' (to interrogate) from ' (to take), ' (to distribute) from ' (to share), ' (to understand) from ' (to stand).\n\nOther examples include the following:\n' (to stick), ' (to detain); ' (to buy), ' (to sell); ' (to hear), ' (to cease); ' (to drive), ' (to experience).\n\nMany German verbs have a separable prefix, often with an adverbial function. In finite verb forms, it is split off and moved to the end of the clause and is hence considered by some to be a \"resultative particle\". For example, ', meaning \"to go along\", would be split, giving ' (Literal: \"Go you with?\"; Idiomatic: \"Are you going along?\").\n\nIndeed, several parenthetical clauses may occur between the prefix of a finite verb and its complement (ankommen to arrive, er kam an \n he arrived, er ist angekommen = he has arrived):\n'\nA selectively literal translation of this example to illustrate the point might look like this:\nHe \"came\" on Friday evening, after a hard day at work and the usual annoyances that had time and again been troubling him for years now at his workplace, with questionable joy, to a meal which, as he hoped, his wife had already put on the table, finally at home \"on\".\n\nWord order \n\nGerman word order is generally with the V2 word order restriction and also with the SOV word order restriction for main clauses. For polar questions, exclamations and wishes, the finite verb always has the first position. In subordinate clauses, the verb occurs at the very end.\n\nGerman requires for a verbal element (main verb or auxiliary verb) to appear second in the sentence. The verb is preceded by the topic of the sentence. The element in focus appears at the end of the sentence. For a sentence without an auxiliary, these are some possibilities:\n\n' (The old man gave me yesterday the book; normal order)\n' (The book gave [to] me yesterday the old man)\n' (The book gave the old man [to] me yesterday)\n' (The book gave [to] me the old man yesterday)\n\n' (Yesterday gave [to] me the old man the book, normal order)\n' ([To] me gave the old man the book yesterday (entailing: as for you, it was another date))\n\nThe position of a noun in a German sentence has no bearing on its being a subject, an object or another argument. In a declarative sentence in English, if the subject does not occur before the predicate, the sentence could well be misunderstood.\n\nHowever, German's flexibile word order allows one to emphasise specific words:\n\nNormal word order:\n: '\n: The manager entered yesterday at 10 o'clock with an umbrella in the hand his office.\n\nObject in front:\n: '\n: His office entered the manager yesterday at 10 o'clock with an umbrella in the hand.\nThe object ' (his office) is thus highlighted; it could be the topic of the next sentence.\n\nAdverb of time in front:\n: '\n: Yesterday entered the manager at 10 o'clock with an umbrella in the hand his office. (but today without umbrella)\n\nBoth time expressions in front:\n: '.\n: Yesterday at 10 o'clock entered the manager with an umbrella in the hand his office.\nThe full-time specification ' is highlighted.\n\nAnother possibility:\n: '.\n: Yesterday at 10 o'clock the manager entered his office with an umbrella in his hand.\nBoth the time specification and the fact he carried an umbrella are accentuated.\n\nSwapped adverbs:\n: '\n: The manager entered with an umbrella in the hand yesterday at 10 o'clock his office.\nThe phrase ' is highlighted.\n\nSwapped object:\n: '\n: The manager entered yesterday at 10 o'clock his office with an umbrella in his hand.\nThe time specification and the object ' (his office) are lightly accentuated.\n\nThe flexible word order also allows one to use language \"tools\" (such as poetic meter and figures of speech) more freely.\n\nAuxiliary verbs \n\nWhen an auxiliary verb is present, it appears in second position, and the main verb appears at the end. This occurs notably in the creation of the perfect tense. Many word orders are still possible:\n\n' (The old man has me today the book given.)\n' (The book has the old man me today given.)\n' (Today has the old man me the book given.)\n\nThe main verb may appear in first position to put stress on the action itself. The auxiliary verb is still in second position.\n\n' (Given has me the old man the book 'today'.) The bare fact that the book has been given is emphasized, as well as 'today'.\n\nModal verbs \n\nSentences using modal verbs place the infinitive at the end. For example, the English sentence \"Should he go home?\" would be rearranged in German to say \"Should he (to) home go?\" ('). Thus, in sentences with several subordinate or relative clauses, the infinitives are clustered at the end. Compare the similar clustering of prepositions in the following (highly contrived) English sentence: \"What did you bring that book that I do not like to be read to out of up for?\"\n\nMultiple infinitives \n\nGerman subordinate clauses have all verbs clustered at the end. Given that auxiliaries encode future, passive, modality, and the perfect, very long chains of verbs at the end of the sentence can occur. In these constructions, the past participle in ' is often replaced by the infinitive.\n\nV psv perf mod\nOne suspects that the deserter probably shot become be should.\n(\"It is suspected that the deserter probably had been shot\")\n\n: '\n: He knew not that the agent a picklock had make let\n\n: '\n: He knew not that the agent a picklock make let had\n(\"He did not know that the agent had had a picklock made\")\n\nThe order at the end of such strings is subject to variation, but the latter version is unusual.\n\nVocabulary \n\nMost German vocabulary is derived from the Germanic branch of the European language family. However, there is a significant amount of loanwords from other languages, in particular from Latin, Greek, Italian, Frenchsome of which might be reborrowings from Germanic Frankish and most recently English.This phenomenon is known as ' in German or as Germish or Denglish in English. In the early 19th century, Joachim Heinrich Campe estimated that one fifth of the total German vocabulary was of French or Latin origin.Uwe Pörksen, German Academy for Language and Literature’s Jahrbuch [Yearbook] 2007 (Wallstein Verlag, Göttingen 2008, pp. 121–130)\n\nLatin words were already imported into the predecessor of the German language during the Roman Empire and underwent all the characteristic phonetic changes in German. Their origin is thus no longer recognizable for most speakers (e.g. ', ', ', ', ' from Latin ', ', ', ', '). Borrowing from Latin continued after the fall of the Roman Empire during Christianization, mediated by the church and monasteries. Another important influx of Latin words can be observed during Renaissance humanism. In a scholarly context, the borrowings from Latin have continued until today, in the last few decades often indirectly through borrowings from English. During the 15th to 17th centuries, the influence of Italian was great, leading to many Italian loanwords in the fields of architecture, finance, and music. The influence of the French language in the 17th to 19th centuries resulted in an even greater import of French words. The English influence was already present in the 19th century, but it did not become dominant until the second half of the 20th century.\n\nAt the same time, the effectiveness of the German language in forming equivalents for foreign words from its inherited Germanic stem repertory is great. Thus, Notker Labeo was able to translate Aristotelian treatises in pure (Old High) German in the decades after the year 1000. The tradition of loan translation was revitalized in the 18th century, with linguists like Joachim Heinrich Campe, who introduced close to 300 words that are still used in modern German. Even today, there are movements that try to promote the ' (substitution) of foreign words deemed unnecessary with German alternatives. It is claimed that this would also help in spreading modern or scientific notions among the less educated and as well democratise public life.\n\nAs in English, there are many pairs of synonyms due to the enrichment of the Germanic vocabulary with loanwords from Latin and Latinized Greek. These words often have different connotations from their Germanic counterparts and are usually perceived as more scholarly.\n\n* ' – \"historical\", (')\n* ' – \"humaneness\", (')\n* ' – \"millennium\", (')\n* ' – \"perception\", (')\n* ' – \"vocabulary\", (')\n\nThe size of the vocabulary of German is difficult to estimate. The ' (The German Dictionary) initiated by Jacob and Wilhelm Grimm already contained over 330,000 headwords in its first edition. The modern German scientific vocabulary is estimated at nine million words and word groups (based on the analysis of 35 million sentences of a corpus in Leipzig, which as of July 2003 included 500 million words in total).\n\nThe Duden is the de facto official dictionary of the German language, first published by Konrad Duden in 1880. The Duden is updated regularly, with new editions appearing every four or five years.  it is in its 26th edition and in 12 volumes, each covering different aspects such as loanwords, etymology, pronunciation, synonyms, and so forth.The first of these volumes, ' (), has long been the prescriptive source for the spelling of German. The Duden has become the bible of the German language, being the definitive set of rules regarding grammar, spelling and usage of German.\n\nThe ' (\"Austrian Dictionary\"), abbreviated ', is the official dictionary of the German language in the Republic of Austria. It is edited by a group of linguists under the authority of the Austrian Federal Ministry of Education, Arts and Culture (). It is the Austrian counterpart to the German Duden and contains a number of terms unique to Austrian German or more frequently used or differently pronounced there.': Rudolf Muhr, Richard Schrodt, Peter Wiesinger (Hrsg.): [http://www-oedt.kfunigraz.ac.at/OEDTBIB/120-1995-OEDTSBd2.pdf Österreichisches Deutsch – Linguistische, sozialpsychologische und sprachpolitische Aspekte einer nationalen Variante des Deutschen (PDF, 407 Seiten; 1,3 MB)] , Verlag Hölder-Pichler-Tempsky, Wien 1995. Anm.:  A considerable amount of this \"Austrian\" vocabulary is also common in Southern Germany, especially Bavaria, and some of it is used in Switzerland as well. The most recent edition is the 42nd from 2012. Since the 39th edition from 2001 the orthography of the ' was adjusted to the German spelling reform of 1996. The dictionary is also officially used in the Italian province of South Tyrol.\n\nEnglish–German cognates \n\nThis is a selection of cognates in both English and German. Instead of the usual infinitive ending -en German verbs are indicated by a hyphen \"-\" after their stems. Words that are written with capital letters in German are nouns.\n\nOrthography \n\nGerman is written in the Latin alphabet. In addition to the 26 standard letters, German has three vowels with Umlaut, namely ä, ö and ü, as well as the eszett or ' (sharp s): ß. In Switzerland and Liechtenstein, ss is used instead of ß. Since ß can never occur at the beginning of a word, it has no traditional uppercase form.\n\nWritten texts in German are easily recognisable as such by distinguishing features such as umlauts and certain orthographical features – German is the only major language that capitalizes all nouns, a relic of a widespread practice in Northern Europe in the early modern era (including English for a while, in the 1700s) – and the frequent occurrence of long compounds. The longest German word that has been published is ' made of 79 characters. Because legibility and convenience set certain boundaries, compounds consisting of more than three or four nouns are almost exclusively found in humorous contexts. (In contrast, although English can also string nouns together, it usually separates the nouns with spaces. For example, \"toilet bowl cleaner\".)\n\nPresent \n\nBefore the German orthography reform of 1996, ß replaced ss after long vowels and diphthongs and before consonants, word-, or partial-word-endings. In reformed spelling, ß replaces ss only after long vowels and diphthongs.\n\nSince there is no traditional capital form of ß, it was replaced by SS when capitalization was required. For example, ' (tape measure) became ' in capitals. An exception was the use of ß in legal documents and forms when capitalizing names. To avoid confusion with similar names, lower case ß was maintained (so, \"\" instead of \"\"). Capital ß (ẞ) was ultimately adopted into German orthography in 2017, ending a long orthographic debate.\n\nUmlaut vowels (ä, ö, ü) are commonly transcribed with ae, oe, and ue if the umlauts are not available on the keyboard or other medium used. In the same manner ß can be transcribed as ss. Some operating systems use key sequences to extend the set of possible characters to include, amongst other things, umlauts; in Microsoft Windows this is done using Alt codes. German readers understand these transcriptions (although they appear unusual), but they are avoided if the regular umlauts are available because they are a makeshift, not proper spelling. (In Westphalia and Schleswig-Holstein, city and family names exist where the extra e has a vowel lengthening effect, e.g. Raesfeld, Coesfeld and Itzehoe, but this use of the letter e after a/o/u does not occur in the present-day spelling of words other than proper nouns.)\n\nThere is no general agreement on where letters with umlauts occur in the sorting sequence. Telephone directories treat them by replacing them with the base vowel followed by an e. Some dictionaries sort each umlauted vowel as a separate letter after the base vowel, but more commonly words with umlauts are ordered immediately after the same word without umlauts. As an example in a telephone book ' occurs after ' but before ' (because Ä is replaced by Ae). In a dictionary ' comes after ', but in some dictionaries ' and all other words starting with Ä may occur after all words starting with A. In some older dictionaries or indexes, initial Sch and St are treated as separate letters and are listed as separate entries after S, but they are usually treated as S+C+H and S+T.\n\nWritten German also typically uses an alternative opening inverted comma (quotation mark) as in '.\n\nPast \n\nUntil the early 20th century, German was mostly printed in blackletter typefaces (mostly in Fraktur, but also in Schwabacher) and written in corresponding handwriting (for example Kurrent and Sütterlin). These variants of the Latin alphabet are very different from the serif or sans-serif Antiqua typefaces used today, and the handwritten forms in particular are difficult for the untrained to read. The printed forms, however, were claimed by some to be more readable when used for Germanic languages.Adolf Reinecke, ', Leipzig, Hasert, 1910 (Often, foreign names in a text were printed in an Antiqua typeface even though the rest of the text was in Fraktur.) The Nazis initially promoted Fraktur and Schwabacher because they were considered Aryan, but they abolished them in 1941, claiming that these letters were Jewish.[http://www.ligaturix.de/bormann.htm Facsimile of Bormann's Memorandum (in German)]\nThe memorandum itself is typed in Antiqua, but the NSDAP letterhead is printed in Fraktur.\"For general attention, on behalf of the Führer, I make the following announcement:It is wrong to regard or to describe the so-called Gothic script as a German script. In reality, the so-called Gothic script consists of Schwabach Jew letters. Just as they later took control of the newspapers, upon the introduction of printing the Jews residing in Germany took control of the printing presses and thus in Germany the Schwabach Jew letters were forcefully introduced.Today the Führer, talking with Herr Reichsleiter Amann and Herr Book Publisher Adolf Müller, has decided that in the future the Antiqua script is to be described as normal script. All printed materials are to be gradually converted to this normal script. As soon as is feasible in terms of textbooks, only the normal script will be taught in village and state schools.The use of the Schwabach Jew letters by officials will in future cease; appointment certifications for functionaries, street signs, and so forth will in future be produced only in normal script.On behalf of the Führer, Herr Reichsleiter Amann will in future convert those newspapers and periodicals that already have foreign distribution, or whose foreign distribution is desired, to normal script\". It is also believed that the Nazi régime had banned this script as they realized that Fraktur would inhibit communication in the territories occupied during World War II.\n\nThe Fraktur script however remains present in everyday life in pub signs, beer brands and other forms of advertisement, where it is used to convey a certain rusticality and antiquity.\n\nA proper use of the long s, ('), ſ, is essential for writing German text in Fraktur typefaces. Many Antiqua typefaces include the long s also. A specific set of rules applies for the use of long s in German text, but nowadays it is rarely used in Antiqua typesetting. Any lower case \"s\" at the beginning of a syllable would be a long s, as opposed to a terminal s or short s (the more common variation of the letter s), which marks the end of a syllable; for example, in differentiating between the words ' (guard-house) and ' (tube of polish/wax). One can easily decide which \"s\" to use by appropriate hyphenation, (' vs. '). The long s only appears in lower case.\n\nReform of 1996 \n\nThe orthography reform of 1996 led to public controversy and considerable dispute. The states (') of North Rhine-Westphalia and Bavaria would not accept it. The dispute landed at one point in the highest court, which made a short issue of it, claiming that the states had to decide for themselves and that only in schools could the reform be made the official rule – everybody else could continue writing as they had learned it. After 10 years, without any intervention by the federal parliament, a major revision was installed in 2006, just in time for the coming school year. In 2007, some traditional spellings were finally invalidated, whereas in 2008, on the other hand, many of the old comma rules were again put in force.\n\nThe most noticeable change was probably in the use of the letter ß, called ' (Sharp S) or ' (pronounced ess-tsett). Traditionally, this letter was used in three situations:\n\n# After a long vowel or vowel combination,\n# Before a t, and\n# At the end of a syllable\n\nThus ', ', and '. Currently only the first rule is in effect, thus ', ', and '. The word ' 'foot' has the letter ß because it contains a long vowel, even though that letter occurs at the end of a syllable. The logic of this change is that an 'ß' is a single letter whereas 'ss' obviously are two letters, so the same distinction applies as for instance between the words ' and '.\n\nPhonology \n\nVowels \n\nIn German, vowels (excluding diphthongs; see below) are either short or long, as follows:\n\nShort is realized as in stressed syllables (including secondary stress), but as in unstressed syllables. Note that stressed short can be spelled either with e or with ä (for instance, ' \"would have\" and ' \"chain\" rhyme). In general, the short vowels are open and the long vowels are close. The one exception is the open sound of long Ä; in some varieties of standard German, and have merged into, removing this anomaly. In that case, pairs like ' 'bears/berries' or ' 'spike (of wheat)/honour' become homophonous (see: Captain Bluebear).\n\nIn many varieties of standard German, an unstressed is not pronounced, but vocalised to.\n\nWhether any particular vowel letter represents the long or short phoneme is not completely predictable, although the following regularities exist:\n* If a vowel (other than i) is at the end of a syllable or followed by a single consonant, it is usually pronounced long (e.g. ').\n* If a vowel is followed by h or if an i is followed by an e, it is long.\n* If the vowel is followed by a double consonant (e.g. ff, ss or tt), ck, tz or a consonant cluster (e.g. st or nd), it is nearly always short (e.g. '). Double consonants are used only for this function of marking preceding vowels as short; the consonant itself is never pronounced lengthened or doubled, in other words this is not a feeding order of gemination and then vowel shortening.\nBoth of these rules have exceptions (e.g. ' \"has\" is short despite the first rule; ', \"moon\" is long despite the second rule). For an i that is neither in the combination ie (making it long) nor followed by a double consonant or cluster (making it short), there is no general rule. In some cases, there are regional differences: In central Germany (Hessen), the o in the proper name \"Hoffmann\" is pronounced long, whereas most other Germans would pronounce it short; the same applies to the e in the geographical name \"Mecklenburg\" for people in that region. The word ' \"cities\", is pronounced with a short vowel by some (Jan Hofer, ARD Television) and with a long vowel by others (Marietta Slomka, ZDF Television). Finally, a vowel followed by ch can be short (' \"compartment\", ' \"kitchen\") or long (' \"search\", ' \"books\") almost at random. Thus, ' is homographous between ' \"puddle\" and ' \"manner of laughing\" (colloquial) or ' \"laugh!\" (imperative).\n\nGerman vowels can form the following digraphs (in writing) and diphthongs (in pronunciation); note that the pronunciation of some of them (ei, äu, eu) is very different from what one would expect when considering the component letters:\n\nAdditionally, the digraph ie generally represents the phoneme, which is not a diphthong. In many varieties, an at the end of a syllable is vocalised. However, a sequence of a vowel followed by such a vocalised is not a phonemic diphthong: ' \"bear\", ' \"he\", ' \"we\", ' \"gate\", ' \"short\", ' \"words\".\n\nIn most varieties of standard German, syllables that begin with a vowel are preceded by a glottal stop.\n\nConsonants \n\nWith approximately 25 phonemes, the German consonant system exhibits an average number of consonants in comparison with other languages. One of the more noteworthy ones is the unusual affricate. The consonant inventory of the standard language is shown below.\n\n* 1 has two allophones, and, after back and front vowels, respectively.\n* 2 has three allophones in free variation:, and. In the syllable coda, the allophone is found in many varieties.\n* 3 The voiceless stops,, are aspirated except when preceded by a sibilant, exactly as in English.\n* 4 and occur only in words of foreign (usually English or French) origin.\n* Where a stressed syllable has an initial vowel, it is preceded by. As its presence is predictable from context, is not considered a phoneme.\n\nConsonant spellings \n\n* c standing by itself is not a German letter. In borrowed words, it is usually pronounced (before ä, äu, e, i, ö, ü, y) or (before a, o, u, and consonants). The combination ck is, as in English, used to indicate that the preceding vowel is short.\n* ch occurs often and is pronounced either (after ä, ai, äu, e, ei, eu, i, ö, ü and consonants; in the diminutive suffix '; and at the beginning of a word), (after a, au, o, u), or at the beginning of a word before a, o, u and consonants. Ch never occurs at the beginning of an originally German word. In borrowed words with initial Ch before front vowels (' \"chemistry\" etc.), is considered standard. However, Upper Germans and Franconians (in the geographical sense) replace it with, as German as a whole does before darker vowels and consonants such as in ', '. Middle Germans (except Franconians) will borrow a from the French model. Both agree in considering each other's variant, and Upper Germans also the standard in, as particularly awkward and unusual.\n* dsch is pronounced (e.g. ' \"jungle\") but appears in a few loanwords only.\n* f is pronounced as in \"father\".\n* h is pronounced as in \"home\" at the beginning of a syllable. After a vowel it is silent and only lengthens the vowel (e.g. ' = roe deer).\n* j is pronounced in Germanic words (') (like \"y\" in \"year\"). In recent loanwords, it follows more or less the respective languages' pronunciations.\n* l is always pronounced, never (the English \"dark L\").\n* q only exists in combination with u and is pronounced. It appears in both Germanic and Latin words ('; '). But as most words containing q are Latinate, the letter is considerably rarer in German than it is in English.\n* r is usually pronounced in a guttural fashion (a voiced uvular fricative or uvular trill) in front of a vowel or consonant ('; '). In spoken German, however, it is commonly vocalised after a vowel (' being pronounced rather like – '). In some varieties, the r is pronounced as a \"tongue-tip\" r (the alveolar trill).\n* s in German is pronounced (as in \"zebra\") if it forms the syllable onset (e.g. '), otherwise (e.g. '). In Austria and Switzerland and often in Southern Germany, it is always pronounced. A ss indicates that the preceding vowel is short. st and sp at the beginning of words of German origin are pronounced and, respectively.\n* ß (a letter unique to German called ' or ') was a ligature of a double s and of an sz and is always pronounced. Originating in Blackletter typeface, it traditionally replaced ss at the end of a syllable (e.g. ' → '; ' → '); within a word it contrasts with ss in indicating that the preceding vowel is long (compare ' \"with moderation\" and ' \"in loads\"). The use of ß has recently been limited by the latest German spelling reform and is no longer used for ss after a short vowel (e.g. ' and ' were always pronounced with a short U/Ü); Switzerland and Liechtenstein already abolished it in 1934.\n* sch is pronounced (like \"sh\" in \"shine\").\n* tion in Latin loanwords is pronounced.\n* th is found, rarely, in loanwords and is pronounced if the loanword is from Greek, and usually as in the original if the loanword is from English (though some, mostly older, speakers tend to replace the English th-sound with).\n* v is pronounced in a limited number of words of Germanic origin, such as ', ' \"bird\", ' \"from, of\", ' \"before, in front of\", ' \"full\" and the prefix '. It is also used in loanwords, where it is normally pronounced. This pronunciation is common in words like ', ', ', ', ', ', and English loanwords; however, pronunciation is by some people in some in the very south. The only non-German word in which \"v\" is always pronounced \"f\" is ' (Eve).\n* w is pronounced as in \"vacation\" (e.g. ').\n* y is pronounced as when long, and when short (as in ' ; ' or '), except in ay and ey which are both pronounced. It is also often used in loanwords and pronounced like in the original language like in Style or Recycling.\n* z is always pronounced (e.g. '), except in loanwords. A tz indicates that the preceding vowel is short.\n\nConsonant shifts \n\nGerman does not have any dental fricatives (as English th). The th sounds, which the English language still has, disappeared on the continent in German with the consonant shifts between the 8th and the 10th centuries.For a history of the German consonants see Fausto Cercignani, The Consonants of German: Synchrony and Diachrony, Milano, Cisalpino, 1979. It is sometimes possible to find parallels between English and German by replacing the English th with d in German: \"Thank\" → in German ', \"this\" and \"that\" → ' and ', \"thou\" (old 2nd person singular pronoun) → ', \"think\" → ', \"thirsty\" → ' and many other examples.\n\nLikewise, the gh in Germanic English words, pronounced in several different ways in modern English (as an f, or not at all), can often be linked to German ch: \"to laugh\" → ', \"through\" and \"thorough\" → ', \"high\" → ', \"naught\" → ', \"light\" → ' or ', \"sight\" → ', \"daughter\" → ', \"neighbour\" → '.\n\nLiterature \n\nThe German language is used in German literature and can be traced back to the Middle Ages, with the most notable authors of the period being Walther von der Vogelweide and Wolfram von Eschenbach.\nThe ', whose author remains unknown, is also an important work of the epoch. The fairy tales collections collected and published by Jacob and Wilhelm Grimm in the 19th century became famous throughout the world.\n\nReformer and theologian Martin Luther, who was the first to translate the Bible into German, is widely credited for having set the basis for the modern \"High German\" language. Among the most well known poets and authors in German are Lessing, Goethe, Schiller, Kleist, Hoffmann, Brecht, Heine, and Kafka. Thirteen German-speaking people have won the Nobel Prize in literature: Theodor Mommsen, Rudolf Christoph Eucken, Paul von Heyse, Gerhart Hauptmann, Carl Spitteler, Thomas Mann, Nelly Sachs, Hermann Hesse, Heinrich Böll, Elias Canetti, Günter Grass, Elfriede Jelinek and Herta Müller.\n\nGerman loanwords in the English language \n\nEnglish has taken many loanwords from German, often without any change of spelling (aside from, often, the elimination of umlauts and not capitalizing nouns):\n\nOrganisations \n\nThe use and learning of the German language are promoted by a number of organisations.\n\nGoethe-Institut \n\nThe government-backed  (named after the famous German author Johann Wolfgang von Goethe) aims to enhance the knowledge of German culture and language within Europe and the rest of the world. This is done by holding exhibitions and conferences with German-related themes, and providing training and guidance in the learning and use of the German language. For example, the  teaches the  German language qualification.\n\nVerein Deutsche Sprache \n\nThe Dortmund-based , which was founded in 1997, supports the German language and is the largest language association of citizens in the world. The VDS has more than thirty-five thousand members in over seventy countries. Its founder, statistics professor Dr. Walter Krämer, has remained chairperson of the association from its beginnings.\n\nDeutsche Welle \n\nThe German state broadcaster  is the equivalent of the British BBC World Service and provides radio and television broadcasts in German and 30 other languages across the globe. Its German language services are tailored for German language learners by being spoken at slow speed.  also provides an  website to learn German.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "German language" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11884" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "German () is a West Germanic language that is mainly spoken in Central Europe. It is the most widely spoken and (co-) official language in Germany, Austria, Switzerland, South Tyrol (Italy), the German-speaking Community of Belgium, and Liechtenstein. It is also one of the three official languages of Luxembourg. The languages which are most similar to German are the other members of the West Germanic language branch: Afrikaans, Dutch, English, the Frisian languages, Low German/Low Saxon, Luxembourgish, and Yiddish. German is the second most widely spoken Germanic language, after English.\n\nOne of the major languages of the world, German is the first language of about 95 million people worldwide and the most widely spoken native language in the European Union. German also is the fourth most widely taught non-English language in the USModern Language Association, February 2015, [http://www.mla.org/pdf/2013_enrollment_survey.pdf Enrollments in Languages Other Than English in United States Institutions of Higher Education, Fall 2013]. Retrieved 7 July 2015. (after Spanish, French and American Sign Language) and third in the EU (after English and French; at lower secondary level), the second most commonly used scientific language as well as the fourth most widely used language on websites (after English, Russian and Japanese). The German-speaking countries are ranked fifth in terms of annual publication of new books, with one tenth of all books (including e-books) in the world being published in the German language.\n\nGerman is an inflected language with four cases for nouns, pronouns, and adjectives (nominative, accusative, genitive, dative), three genders (masculine, feminine, neuter), and strong and weak verbs. German derives the majority of its vocabulary from the ancient Germanic branch of the Indo-European language family. A portion of German words are derived from Latin and Greek, and fewer are borrowed from French and English. With slightly different standardized variants (German, Austrian, and Swiss Standard German), German is a pluricentric language. Like English, German is also notable for its broad spectrum of dialects, with many unique varieties existing in Europe and also other parts of the world.Template:German L1 speakers outside Europe Due to the limited intelligibility between certain varieties and Standard German, as well as the lack of an undisputed, scientific difference between a \"dialect\" and a \"language\", some German varieties or dialect groups (e.g. Low German or PlautdietschJan Goossens: ' In: Jan Goossens (Hrsg.): ' Karl Wachholtz, 2. Auflage, Neumünster 1983, S. 27; Willy Sanders: ' Vandenhoeck & Ruprecht, Göttingen 1982, , S. 32 f.; Dieter Stellmacher: ' 2. Auflage, Weidler, Berlin 2000, , S. 92.) are alternatively referred to as \"languages\" and \"dialects\".\n\nClassification \n\nModern Standard German is a West Germanic language descended from the Germanic branch of the Indo-European languages. The Germanic languages are traditionally subdivided into three branches: North Germanic, East Germanic, and West Germanic. The first of these branches survives in modern Danish, Swedish, Norwegian, Faroese, and Icelandic, all of which are descended from Old Norse. The East Germanic languages are now extinct, and the only historical member of this branch from which written texts survive is Gothic. The West Germanic languages, however, have undergone extensive dialectal subdivision and are now represented in modern languages such as English, German, Dutch, Yiddish, Afrikaans, and others.\n\nWithin the West Germanic language dialect continuum, the Benrath and Uerdingen lines (running through Düsseldorf-Benrath and Krefeld-Uerdingen, respectively) serve to distinguish the Germanic dialects that were affected by the High German consonant shift (south of Benrath) from those that were not (north of Uerdingen). The various regional dialects spoken south of these lines are grouped as High German dialects (nos. 29–34 on the map), while those spoken to the north comprise the Low German/Low Saxon (nos. 19–24) and Low Franconian (no. 25) dialects. As members of the West Germanic language family, High German, Low German, and Low Franconian can be further distinguished historically as Irminonic, Ingvaeonic, and Istvaeonic, respectively. This classification indicates their historical descent from dialects spoken by the Irminones (also known as the Elbe group), Ingvaeones (or North Sea Germanic group), and Istvaeones (or Weser-Rhine group).\n\nStandard German is based on Thuringian-Upper Saxon dialects (no. 30 on the map), which are Central German dialects (nos. 29–31), belonging to the Irminonic High German dialect group. German is therefore most closely related to the other languages based on High German dialects, such as Luxembourgish (based on Central Franconian dialects – no. 29), and Yiddish. Also closely related to Standard German are the Upper German dialects spoken in the southern German-speaking countries, such as Swiss German (Alemannic dialects – no. 34), and the various dialects spoken in the French region of Grand Est, such as Alsatian (mainly Alemannic, but also Central- and Upper Franconian (no. 32) dialects) and Lorraine Franconian (Central Franconian – no. 29).\n\nAfter these High German dialects, standard German is (somewhat less closely) related to languages based on Low Franconian dialects (e.g. Dutch and Afrikaans) or Low German/Low Saxon dialects (spoken in northern Germany and southern Denmark), neither of which underwent the High German consonant shift. As has been noted, the former of these dialect types is Istvaeonic and the latter Ingvaeonic, whereas the High German dialects are all Irminonic; the differences between these languages and standard German are therefore considerable. Also related to German are the Frisian languages—North Frisian (spoken in Schleswig-Holstein no. 28), Saterland Frisian (spoken in Lower Saxony – no. 27), and West Frisian (spoken in the Netherlands – no. 26)—as well as the Anglic languages of English and Scots. These Anglo-Frisian dialects are all members of the Ingvaeonic family of West Germanic languages which did not take part in the High German consonant shift.\n\nHistory \n\nOld High German \n\nThe history of the German language begins with the High German consonant shift during the migration period, which separated Old High German (OHG) dialects from Old Saxon. This sound shift involved a drastic change in the pronunciation of both voiced and voiceless stop consonants (b, d, g, and p, t, k, respectively). The primary effects of the shift were the following:\n\n*Voiceless stops became long (geminated) voiceless fricatives following a vowel\n*Voiceless stops became affricates in word-initial position, or following certain consonants\n*Voiced stops became voiceless in certain phonetic settings.\n\nWhile there is written evidence of the Old High German language in several Elder Futhark inscriptions from as early as the 6th century AD (such as the Pforzen buckle), the Old High German period is generally seen as beginning with the Abrogans (written c.765–775), a Latin-German glossary supplying over 3,000 OHG words with their Latin equivalents. Following the Abrogans the first coherent works written in OHG appear in the 9th century, chief among them being the Muspilli, the Merseberg Incantations, and the Hildebrandslied, as well as a number of other religious texts (the Georgslied, the Ludwigslied, the Evangelienbuch, and translated hymns and prayers). The Muspilli is a Christian poem written in a Bavarian dialect offering an account of the soul after the Last Judgment, and the Merseberg Incantations are transcriptions of spells and charms from the pagan Germanic tradition. Of particular interest to scholars, however, has been the Hildebrandslied, a secular epic poem telling the tale of an estranged father and son unknowingly meeting each other in battle. Linguistically this text is highly interesting due to the mixed use of Old Saxon and Old High German dialects in its composition. The written works of this period stem mainly from the Alamanni, Bavarian, and Thuringian groups, all belonging to the Elbe Germanic group (Irminones), which had settled in what is now southern-central Germany and Austria between the 2nd and 6th centuries during the great migration.\n\nIn general, the surviving texts of OHG show a wide range of dialectal diversity with very little written uniformity. The early written tradition of OHG survived mostly through monasteries and scriptoria as local translations of Latin originals; as a result, the surviving texts are written in highly disparate regional dialects and exhibit significant Latin influence, particularly in vocabulary. At this point monasteries, where most written works were produced, were dominated by Latin, and German saw only occasional use in official and ecclesiastical writing.\n\nThe German language through the OHG period was still predominantly a spoken language, with a wide range of dialects and a much more extensive oral tradition than a written one. Having just emerged from the High German consonant shift, OHG was also a relatively new and volatile language still undergoing a number of phonetic, phonological, morphological, and syntactic changes. The scarcity of written work, instability of the language, and widespread illiteracy of the time thus account for the lack of standardization up to the end of the OHG period in 1050.\n\nMiddle High German \n\nWhile there is no complete agreement over the dates of the Middle High German (MHG) period, it is generally seen as lasting from 1050 to 1350. This was a period of significant expansion of the geographical territory occupied by Germanic tribes, and consequently of the number of German speakers. Whereas during the Old High German period the Germanic tribes extended only as far east as the Elbe and Saale rivers, the MHG period saw a number of these tribes expanding beyond this eastern boundary into Slavic territory (this is known as the Ostsiedlung). Along with the increasing wealth and geographic extent of the Germanic groups came greater use of German in the courts of nobles as the standard language of official proceedings and literature. A clear example of this is the mittelhochdeutsche Dichtersprache employed in the Hohenstaufen court in Swabia as a standardized supra-dialectal written language. While these efforts were still regionally bound, German began to be used in place of Latin for certain official purposes, leading to a greater need for regularity in written conventions.\n\nWhile the major changes of the MHG period were socio-cultural, German was still undergoing significant linguistic changes in syntax, phonetics, and morphology as well (e.g. diphthongization of certain vowel sounds: hus (OHG \"house\")→haus (MHG), and weakening of unstressed short vowels to schwa [ə]: taga (OHG \"days\")→tage (MHG)).\n\nA great wealth of texts survives from the MHG period. Significantly, among this repertoire are a number of impressive secular works, such as the Nibelungenlied, an epic poem telling the story of the dragon-slayer Siegfried (c. 13th century), and the Iwein, an Arthurian verse poem by Hartmann von Aue (c. 1203), as well as several lyric poems and courtly romances such as Parzival and Tristan. (Also noteworthy is the Sachsenspiegel, the first book of laws written in Middle Low German (c. 1220)). The abundance and (secular) character of the literature of the MHG period demonstrate the beginnings of a standardized written form of German, as well as the desire of poets and authors to be understood by individuals on supra-dialectal terms.\n\nThe Middle High German period is generally seen as ending with the decimation of the population of Europe in the Black Death of 1346–1353.\n\nEarly New High German \n\nModern German begins with the Early New High German (ENHG) period, which the influential German philologist Wilhelm Scherer dates 1350–1650, terminating with the end of the Thirty Years' War. This period saw the further displacement of Latin by German as the primary language of courtly proceedings and, increasingly, of literature in the German states. While these states were still under the control of the Holy Roman Empire and far from any form of unification, the desire for a cohesive written language that would be understandable across the many German-speaking principalities and kingdoms was stronger than ever. As a spoken language German remained highly fractured through this period with a vast number of often mutually-incomprehensible regional dialects being spoken throughout the German states; the invention of the printing press c.1440 and the publication of Luther's vernacular translation of the Bible in 1534, however, had an immense effect on standardizing German as a supra-dialectal written language.\n\nThe ENHG period saw the rise of several important cross-regional forms of chancery German, one being gemeine tiutsch, used in the court of the Holy Roman Emperor Maximilian I, and the other being Meißner Deutsch, used in the Electorate of Saxony in the Duchy of Saxe-Wittenberg. Alongside these courtly written standards, the invention of the printing press led to the development of a number of printers' languages (Druckersprachen) aimed at making printed material readable and understandable across as many diverse dialects of German as possible. The greater ease of production and increased availability of written texts brought about increased standardization in the written form of the German language.One of the central events in the development of ENHG was the publication of Luther's translation of the Bible into German (the New Testament in 1522 and the Old Testament, published in parts and completed in 1534). Luther based his translation primarily on the Meißner Deutsch of Saxony,Fahlbusch, Erwin and Bromiley, Geoffrey William. The Encyclopedia of Christianity. Grand Rapids, MI: Leiden, Netherlands: Wm. B. Eerdmans; Brill, 1999–2003, 1:244. spending much time among the population of Saxony researching the dialect so as to make the work as natural and accessible to German speakers as possible. Copies of Luther's Bible featured a long list of glosses for each region that translated words which were unknown in the region into the regional dialect. Concerning his translation method Luther says the following:One who would talk German does not ask the Latin how he shall do it; he must ask the mother in the home, the children on the streets, the common man in the market-place and note carefully how they talk, then translate accordingly. They will then understand what is said to them because it is German. When Christ says 'ex abundantia cordis os loquitur,' I would translate, if I followed the papists, aus dem Überflusz des Herzens redet der Mund. But tell me is this talking German? What German understands such stuff? No, the mother in the home and the plain man would say, Wesz das Herz voll ist, des gehet der Mund über.With Luther's rendering of the Bible in the vernacular German asserted itself against the dominance of Latin as a legitimate language for courtly, literary, and now ecclesiastical subject-matter. Further, his Bible was ubiquitous in the German states with nearly every household possessing a copy. Nevertheless, even with the influence of Luther's Bible as an unofficial written standard, it was not until the middle of the 18th century after the ENHG period that a widely accepted standard for written German appeared.Wilhelm Scherer,  [On the history of the German language] (Berlin 1868)\n\nAustrian Empire \n\nGerman was the language of commerce and government in the Habsburg Empire, which encompassed a large area of Central and Eastern Europe. Until the mid-19th century, it was essentially the language of townspeople throughout most of the Empire. Its use indicated that the speaker was a merchant or someone from an urban area, regardless of nationality.\n\nSome cities, such as Prague () and Budapest (Buda, ), were gradually Germanized in the years after their incorporation into the Habsburg domain. Others, such as Pozsony (, now Bratislava), were originally settled during the Habsburg period, and were primarily German at that time. Prague, Budapest and Bratislava as well as cities like Zagreb (), and Ljubljana (), contained significant German minorities.\n\nIn the eastern provinces of Banat and Transylvania (), German was the predominant language not only in the larger towns – such as  (Timișoara),  (Sibiu) and  (Brașov) – but also in many smaller localities in the surrounding areas.Anstalt G. Freytag & Berndt (1911). ' Vienna: . \"Census December 31st 1910\"' (in Hungarian). Budapest: Magyar Kir. Központi Statisztikai Hivatal (KSH). 1912.\n\nStandardization \n\nThe most comprehensive guide to the vocabulary of the German language is found within the '. This dictionary was created by the Brothers Grimm and is composed of 16 parts which were issued between 1852 and 1860.[http://www.bbaw.de/en/research/dwb Synopsis of the Deutsches Wörterbuch]  at the Language Research Centre, Berlin-Brandenburg Academy of Sciences and Humanities, retrieved 27 June 2012. In 1872, grammatical and orthographic rules first appeared in the Duden Handbook.Gerhard Weiss, Up-to-Date and with a Past: The \"Duden\" and Its History, 1995, The Publisher as Teacher, 6 [https://dx.doi.org/10.2307/3531328 DOI], [https://www.jstor.org/stable/3531328 online from jstor]\n\nIn 1901, the 2nd Orthographical Conference ended with a complete standardization of the German language in its written form and the Duden Handbook was declared its standard definition.Dieter Nerius: ' In: Zeitschrift für deutsche Philologie (), 119. Jahrgang 2000, Nr. 1, S. 30–54. The ' (literally, German stage language) had established conventions for German pronunciation in theatre (BühnendeutschTheodor Siebs: ' Hrsg. von Helmut de Boor. 19., umgearbeitete Auflage. VMA, Wiesbaden 2000, )) three years earlier; however, this was an artificial standard that did not correspond to any traditional spoken dialect. Rather, it was based on the pronunciation of Standard German in Northern Germany, although it was subsequently regarded often as a general prescriptive norm, despite differing pronunciation traditions especially in the Upper-German-speaking regions that still characterize the dialect of the area today – especially the pronunciation of the ending ' as [ɪk] instead of [ɪç]. In Northern Germany, Standard German was a foreign language to most inhabitants, whose native dialects were subsets of Low German. It was usually encountered only in writing or formal speech; in fact, most of Standard German was a written language, not identical to any spoken dialect, throughout the German-speaking area until well into the 19th century.\n\nOfficial revisions of some of the rules from 1901 were not issued until the controversial German orthography reform of 1996 was made the official standard by governments of all German-speaking countries. Media and written works are now almost all produced in Standard German (often called ', \"High German\") which is understood in all areas where German is spoken.\n\nGeographic distribution \n\nDue to the German diaspora as well as German being the third most widely taught foreign language in the US and the EU amongst others, the geographical distribution of German speakers (or \"Germanophones\") spans all inhabited continents. As for the number of speakers of any language worldwide, an assessment is always compromised by the lack of sufficient, reliable data. For an exact, global number of native German speakers, this is further complicated by the existence of several varieties whose status as separate \"languages\" or \"dialects\" is disputed for political and/or linguistic reasons, including quantitatively strong varieties like certain forms of Alemannic (e.g., Alsatian) and Low German/Plautdietsch. Mostly depending on the inclusion or exclusion of certain varieties, it is estimated that approximately 90–95 million people speak German as a first language,Sum of Standard German, Swiss German, and all German dialects not listed under \"Standard German\" at Ethnologue (18th ed., 2015) 10-25 million as a second language, and 75–100 million as a foreign language. This would imply approximately 175–220 million German speakers worldwide. It is estimated that also including all persons who are or were taking German classes, i.e., regardless of their actual proficiency, would amount to about 280 million people worldwide with at least some knowledge of German.\n\nEurope and Asia \n\nGerman Sprachraum \n\nThe area in central Europe where the majority of the population speaks German as a first language and has German as a (co-)official language is called the \"German Sprachraum\". It comprises an estimated 88 million native speakers and 10 million who speak German as a second language (e.g. immigrants). Excluding regional minority languages, German is the only official language of\n*Germany (de facto, not specified in the constitution),\n*Austria (de jure),\n*17 cantons of Switzerland (de jure), and\n*Liechtenstein (de jure).\n\nIt is a co-official language of the\n*Italian Autonomous Province of South Tyrol (also majority language),\n*Belgium (as majority language only in the German-speaking Community),\n*four cantons of Switzerland, and\n*Luxembourg.\n\nOutside the Sprachraum \n\nAlthough expulsions and (forced) assimilation after the two World Wars greatly diminished them, minority communities of mostly bilingual German native speakers exist in areas both adjacent to and detached from the Sprachraum.\n\nWithin Europe and Asia, German is a recognized minority language in the following countries:\n* Bosnia and Herzegovina (see also: ')\n* Czech Republic (see also: Germans in the Czech Republic)\n* Denmark (see also: North Schleswig Germans)\n* Hungary (see also: Germans of Hungary)\n* Italy (outside of South Tyrol; see also: Cimbrian, Mòcheno/Fersentalerisch, Walser German)\n* Kazakhstan (see also: Germans of Kazakhstan)\n* Poland (see also German minority in Poland; German is auxiliary language in 31 communes;)\n* Romania (see also: Germans of Romania)\n* Russia (see also: Germans in Russia)\n* Slovakia (see also: Carpathian Germans)\n* Ukraine (see also: Germans in Ukraine)\n\nIn France, the High German varieties of Alsatian and Moselle Franconian are identified as \"regional languages\", but the European Charter for Regional and Minority Languages of 1998 has not yet been ratified by the government. In the Netherlands, the Limburgish, Frisian, and Low German languages are protected regional languages according to the European Charter for Regional and Minority Languages; however, they are widely considered separate languages and neither German nor Dutch dialects.\n\nAfrica \n\nNamibia \n\nNamibia was a colony of the German Empire from 1884 to 1919. Mostly descending from German settlers who immigrated during this time, 25–30,000 people still speak German as a native tongue today. The period of German colonialism in Namibia also led to the evolution of a Standard German-based pidgin language called \"Namibian Black German\", which became a second language for parts of the indigenous population. Although it is nearly extinct today, some older Namibians still have some knowledge of it.\n\nGerman, along with English and Afrikaans was a co-official language of Namibia from 1984 until its independence from South Africa in 1990. At this point, the Namibian government perceived Afrikaans and German as symbols of apartheid and colonialism, and decided English would be the sole official language, claiming that it was a \"neutral\" language as there were virtually no English native speakers in Namibia at that time. German, Afrikaans and several indigenous languages became \"national languages\" by law, identifying them as elements of the cultural heritage of the nation and ensuring that the state acknowledged and supported their presence in the country. Today, German is used in a wide variety of spheres, especially business and tourism, as well as the churches (most notably the German-speaking Evangelical Lutheran Church in Namibia (GELK)), schools (e.g. the ), literature (German-Namibian authors include Giselher W. Hoffmann), radio (the Namibian Broadcasting Corporation produces radio programs in German), and music (e.g. artist EES). The ' is one of the three biggest newspapers in Namibia and the only German-language daily in Africa.\n\nSouth Africa \n\nMostly originating from different waves of immigration during the 19th and 20th centuries, an estimated 12,000 people speak German or a German variety as a first language in South Africa.German L1 speakers outside Europe One of the largest communities consists of the speakers of \"\", a variety of Low German, concentrated in and around Wartburg. The small town of Kroondal in the North-West Province also has a mostly German-speaking population. The South African constitution identifies German as a \"commonly used\" language and the Pan South African Language Board is obligated to promote and ensure respect for it. The community is strong enough that several German International schools are supported such as the Deutsche Schule Pretoria.\n\nNorth America \n\nIn the United States, the states of North Dakota and South Dakota are the only states where German is the most common language spoken at home after English. German geographical names can be found throughout the Midwest region of the country, such as New Ulm and many other towns in Minnesota; Bismarck (North Dakota's state capital), Munich, Karlsruhe, and Strasburg (named after a town near Odessa in Ukraine) in North Dakota; New Braunfels, Fredericksburg, Weimar, and Muenster in Texas; Corn (formerly Korn), Kiefer and Berlin in Oklahoma; and Kiel, Berlin, and Germantown in Wisconsin.\n\nBetween 1843 and 1910, more than 5 million Germans emigrated overseas,Henry Steele Commager (1961). [https://books.google.com/books?id\nCzlg39-Z75kC&pgPA102&dq&hl\nen#vonepage&q\n&f=false Immigration and American history: essays in honor of Theodore C. Blegen]. University of Minnesota Press. p.102.  mostly to the United States.49.2 million German Americans as of 2005 according to the ; the 1990 census gives 57.9 million, or 23.3% of the U.S. population. German remained an important language in churches, schools, newspapers, and even the administration of the United States Brewers' Association through the early 20th century, but was severely repressed during World War I. Over the course of the 20th century, many of the descendants of 18th century and 19th century immigrants ceased speaking German at home, but small populations of speakers are still found in Pennsylvania (Amish, Hutterites, Dunkards and some Mennonites historically spoke Hutterite German and a West Central German variety of German known as Pennsylvania German or Pennsylvania Dutch), Kansas (Mennonites and Volga Germans), North Dakota (Hutterite Germans, Mennonites, Russian Germans, Volga Germans, and Baltic Germans), South Dakota, Montana, Texas (Texas German), Wisconsin, Indiana, Oregon, Oklahoma, and Ohio (72,570). A significant group of German Pietists in Iowa formed the Amana Colonies and continue to practice speaking their heritage language. Early twentieth century immigration was often to St. Louis, Chicago, New York, Milwaukee, Pittsburgh and Cincinnati.\n\nThe dialects of German which are or were primarily spoken in colonies or communities founded by German-speaking people resemble the dialects of the regions the founders came from. For example, Hutterite German resembles dialects of Carinthia. Texas German is a dialect spoken in the areas of Texas settled by the Adelsverein, such as New Braunfels and Fredericksburg. In the Amana Colonies in the state of Iowa, Amana German is spoken. Plautdietsch is a large minority language spoken in Northern Mexico by the Mennonite communities, and is spoken by more than 200,000 people in Mexico. Pennsylvania German is a West Central German dialect spoken by most of the Amish population of Pennsylvania, Ohio, and Indiana and resembles Palatinate German dialects. \n\nHutterite German is an Upper German dialect of the Austro-Bavarian variety of the German language, which is spoken by Hutterite communities in Canada and the United States. Hutterite is spoken in the U.S. states of Washington, Montana, North Dakota, South Dakota, and Minnesota; and in the Canadian provinces of Alberta, Saskatchewan and Manitoba. Its speakers belong to some Schmiedleit, Lehrerleit, and Dariusleit Hutterite groups, but there are also speakers among the older generations of Prairieleit (the descendants of those Hutterites who chose not to settle in colonies). Hutterite children who grow up in the colonies learn to speak Hutterite German before learning English, the standard language of the surrounding areas, in school. Many of these children, though, continue with German Grammar School, in addition to public school, throughout a student's elementary education.\n\nIn Canada, there are 622,650 speakers of German according to the most recent census in 2006, with people of German ancestry (German Canadians) found throughout the country. German-speaking communities are particularly found in British Columbia (118,035) and Ontario (230,330). There is a large and vibrant community in the city of Kitchener, Ontario, which was at one point named Berlin. German immigrants were instrumental in the country's three largest urban areas: Montreal, Toronto, and Vancouver; post-Second World War immigrants managed to preserve a fluency in the German language in their respective neighborhoods and sections. In the first half of the 20th century, over a million German-Canadians made the language Canada's third most spoken after French and English.\n\nIn Mexico there are also large populations of German ancestry, mainly in the cities of: Mexico City,Tools of Progress: A German Merchant Family in Mexico City, 1865–present  pp. ix-8 Puebla, Mazatlán, Tapachula, Ecatepec de Morelos, and larger populations scattered in the states of Chihuahua, Durango, and Zacatecas.[https://www.tripadvisor.co.uk/ShowTopic-g150792-i257-k3377754-How_German_is_Mazatlan-Mazatlan_Pacific_Coast.html How German is Mazatlan?], tripadvisor.co.ukConcise Encyclopedia of Amish, Brethren, Hutterites, and Mennonites  p. 144\n\nSouth America \n\nIn Brazil, the largest concentrations of German speakers are in the states of Rio Grande do Sul (where Riograndenser Hunsrückisch developed), Santa Catarina, Paraná, São Paulo and Espírito Santo. There are also important concentrations of German-speaking descendants in Argentina, Chile, Paraguay, Venezuela, Peru and Bolivia. In the 20th century, over 100,000 German political refugees and invited entrepreneurs settled in Latin America, in countries such as Costa Rica, Panama, Venezuela, and the Dominican Republic, to establish German-speaking enclaves, and reportedly there is a small German immigration to Puerto Rico.  In most locations where German immigrants settled, the vast majority of their descendants no longer speak German, as they have been largely assimilated into the host language and culture of the specific location of settlement; generally Spanish or Portuguese.\n\nCo-official statuses of German or German varieties in Brazil \n\n*Espírito Santo (statewide cultural language)\n**Domingos Martins\n**Laranja da Terra\n**Pancas\n**Santa Maria de Jetibá\n**Vila Pavão\n*Rio Grande do Sul\n**Santa Maria do Herval\n**Canguçu\n*Santa Catarina\n**Antônio Carlos\n**Pomerode\n\nOceania \n\nIn Australia, the state of South Australia experienced a pronounced wave of immigration in the 1840s from Prussia (particularly the Silesia region). With the prolonged isolation from other German speakers and contact with Australian English, a unique dialect known as Barossa German has developed and is spoken predominantly in the Barossa Valley near Adelaide. Usage of German sharply declined with the advent of World War I, due to the prevailing anti-German sentiment in the population and related government action. It continued to be used as a first language into the twentieth century but now its use is limited to a few older speakers.\n\nGerman migration to New Zealand in the 19th century was less pronounced than migration from Britain, Ireland, and perhaps even Scandinavia. Despite this there were significant pockets of German-speaking communities which lasted until the first decades of the 20th century. German-speakers settled principally in Puhoi, Nelson, and Gore. At the last census (2006), 37,500 people in New Zealand spoke German, making it the third most spoken European language after English and French and overall the ninth most spoken language. \n\nThere is also an important German creole being studied and recovered, named , spoken in the former German colony of German New Guinea, across Micronesia and in northern Australia (i.e. coastal parts of Queensland and Western Australia), by a few elderly people. The risk of its extinction is serious and efforts to revive interest in the language are being implemented by scholars.\n\nGerman as a foreign language \n\nLike French and Spanish, German has become a classic second foreign language in the western world, as English (Spanish in the US) is well established as the first foreign language. German ranks second (after English) among the best known foreign languages in the EU (on a par with French) as well as in Russia. In terms of student numbers across all levels of education, German ranks third in the EU (after English and French) as well as in the United States (after Spanish and French). In 2015, approximately 15.4 million people were in the process of learning German across all levels of education worldwide. As this number remained relatively stable since 2005 (± 1 million), roughly 75–100 million people able to communicate in German as foreign language can be inferred assuming an average course duration of three years and other estimated parameters. According to a 2012 survey, 47 million people within the EU (i.e., up to two thirds of the 75–100 million worldwide) claimed to have sufficient German skills to have a conversation. Within the EU, not counting countries where it is an official language, German as a foreign language is most popular in Eastern and Northern Europe, namely the Czech Republic, Croatia, Denmark, the Netherlands, Slovakia, Hungary, Slovenia, Sweden and Poland. German was once and, to some extent, is still, a lingua franca in those parts of Europe.\n\nStandard German \n\nStandard German originated not as a traditional dialect of a specific region but as a written language. However, there are places where the traditional regional dialects have been replaced by new vernaculars based on standard German; that is the case in large stretches of Northern Germany but also in major cities in other parts of the country. It is important to note, however, that the colloquial standard German differs greatly from the formal written language, especially in grammar and syntax, in which it has been influenced by dialectal speech.\n\nStandard German differs regionally between German-speaking countries in vocabulary and some instances of pronunciation and even grammar and orthography. This variation must not be confused with the variation of local dialects. Even though the regional varieties of standard German are only somewhat influenced by the local dialects, they are very distinct. German is thus considered a pluricentric language.\n\nIn most regions, the speakers use a continuum from more dialectal varieties to more standard varieties according to circumstances.\n\nVarieties of Standard German \n\nIn German linguistics, German dialects are distinguished from varieties of standard German.\nThe varieties of standard German refer to the different local varieties of the pluricentric standard German. They differ only slightly in lexicon and phonology. In certain regions, they have replaced the traditional German dialects, especially in Northern Germany.\n*German Standard German\n*Austrian Standard German\n*Swiss Standard German\n\nIn the German-speaking parts of Switzerland, mixtures of dialect and standard are very seldom used, and the use of Standard German is largely restricted to the written language, though about 10% of the Swiss residents speak High German (aka Standard German) at home, but mainly due to German immigrants. This situation has been called a medial diglossia. Swiss Standard German is used in the Swiss education system, whereas Austrian Standard German is officially used in the Austrian education system.\n\nA mixture of dialect and standard does not normally occur in Northern Germany either. The traditional varieties there are Low German, whereas Standard German is a High German \"variety\". Because their linguistic distance to it is greater, they do not mesh with Standard German the way that High German dialects (such as Bavarian, Swabian, Hessian) can.\n\nDialects \n\nGerman is a member of the West Germanic language of the Germanic family of languages, which in turn is part of the Indo-European language family. The German dialects are the traditional local varieties; many of them are hardly understandable to someone who knows only standard German, and they have great differences in lexicon, phonology and syntax. If a narrow definition of language based on mutual intelligibility is used, many German dialects are considered to be separate languages (for instance in the Ethnologue). However, such a point of view is unusual in German linguistics.\n\nThe German dialect continuum is traditionally divided most broadly into High German and Low German, also called Low Saxon. However, historically, High German dialects and Low Saxon/Low German dialects do not belong to the same language. Nevertheless, in today's Germany, Low Saxon/Low German is often perceived as a dialectal variation of Standard German on a functional level even by many native speakers. The same phenomenon is found in the eastern Netherlands, as the traditional dialects are not always identified with their Low Saxon/Low German origins, but with Dutch.:nl:Nederduits\n\nThe variation among the German dialects is considerable, with often only neighbouring dialects being mutually intelligible. Some dialects are not intelligible to people who know only Standard German. However, all German dialects belong to the dialect continuum of High German and Low Saxon.\n\nLow German \n\nMiddle Low German was the lingua franca of the Hanseatic League. It was the predominant language in Northern Germany until the 16th century. In 1534, the Luther Bible was published. The translation is considered to be an important step towards the evolution of the Early New High German. It aimed to be understandable to a broad audience and was based mainly on Central and Upper German varieties. The Early New High German language gained more prestige than Low German and became the language of science and literature. Around the same time, the Hanseatic League, based around northern ports, lost its importance as new trade routes to Asia and the Americas were established, and the most powerful German states of that period were located in Middle and Southern Germany.\n\nThe 18th and 19th centuries were marked by mass education in Standard German in schools. Gradually, Low German came to be politically viewed as a mere dialect spoken by the uneducated. Today, Low Saxon can be divided in two groups: Low Saxon varieties with a reasonable Standard German influx and varieties of Standard German with a Low Saxon influence known as . Sometimes, Low Saxon and Low Franconian varieties are grouped together because both are unaffected by the High German consonant shift. However, the proportion of the population who can understand and speak it has decreased continuously since World War II. The largest cities in the Low German area are Hamburg and Dortmund.\n\nLow Franconian \n\nThe Low Franconian dialects are the dialects that are more closely related to Dutch than to Low German. Most of the Low Franconian dialects are spoken in the Netherlands and in Belgium, where they are considered as dialects of Dutch, which is itself a Low Franconian language. In Germany, Low Franconian dialects are spoken in the northwest of North Rhine-Westphalia, along the Lower Rhine. The Low Franconian dialects spoken in Germany are referred to as Meuse-Rhenish or Low Rhenish. In the north of the German Low Franconian language area, North Low Franconian dialects (also referred to as Cleverlands or as dialects of South Guelderish) are spoken. These dialects are more closely related to Dutch (also North Low Franconian) than the South Low Franconian dialects (also referred to as East Limburgish and, east of the Rhine, Low Bergish), which are spoken in the south of the German Low Franconian language area. The South Low Franconian dialects are more closely related to Limburgish than to Dutch, and are transitional dialects between Low Franconian and Ripuarian (Central Franconian). The East Bergish dialects are the easternmost Low Franconian dialects, and are transitional dialects between North- and South Low Franconian, and Westphalian (Low German), with most of its features however being North Low Franconian. The largest cities in the German Low Franconian area are Düsseldorf and Duisburg.\n\nHigh German \n\nThe High German dialects consist of the Central German, High Franconian, and Upper German dialects. The High Franconian dialects are transitional dialects between Central- and Upper German. The High German varieties spoken by the Ashkenazi Jews have several unique features, and are considered as a separate language, Yiddish, written with the Hebrew alphabet. \n\nCentral German \n\nThe Central German dialects are spoken in Central Germany, from Aachen in the west to Görlitz in the east. They consist of Franconian dialects in the west (West Central German), and non-Franconian dialects in the east (East Central German). Modern Standard German is mostly based on Central German dialects.\n\nThe Franconian, West Central German dialects are the Central Franconian dialects (Ripuarian and Moselle Franconian), and the Rhine Franconian dialects (Hessian and Palatine). These dialects are considered as\n* German in Germany and Belgium\n* Luxembourgish in Luxembourg\n* Lorraine Franconian (spoken in Moselle) and as a Rhine Franconian variant of Alsatian (spoken in Alsace bossue only) in France\n* Limburgish or Kerkrade dialect in the Netherlands.\nLuxembourgish as well as the Transylvanian Saxon dialect spoken in Transylvania are based on Moselle Franconian dialects. The largest cities in the Franconian Central German area are Cologne and Frankfurt.\n\nFurther east, the non-Franconian, East Central German dialects are spoken (Thuringian, Upper Saxon, Ore Mountainian, and Lusatian-New Markish, and earlier, in the then German-speaking parts of Silesia also Silesian, and in then German southern East Prussia also High Prussian). The largest cities in the East Central German area are Berlin and Leipzig.\n\nHigh Franconian \n\nThe High Franconian dialects are transitional dialects between Central- and Upper German. They consist of the East- and South Franconian dialects.\n\nThe East Franconian dialect branch is one of the most spoken dialect branches in Germany. These dialects are spoken in the region of Franconia and in the central parts of Saxon Vogtland. Franconia consists of the Bavarian districts of Upper-, Middle-, and Lower Franconia, the region of South Thuringia (Thuringia), and the eastern parts of the region of Heilbronn-Franken (Tauber Franconia and Hohenlohe) in Baden-Württemberg. The largest cities in the East Franconian area are Nuremberg and Würzburg.\n\nSouth Franconian is mainly spoken in northern Baden-Württemberg in Germany, but also in the northeasternmost part of the region of Alsace in France. While these dialects are considered as dialects of German in Baden-Württemberg, they are considered as dialects of Alsatian in Alsace (most Alsatian dialects are however Low Alemannic). The largest cities in the South Franconian area are Karlsruhe and Heilbronn.\n\nUpper German \n\nThe Upper German dialects are the Alemannic dialects in the west, and the Bavarian dialects in the east.\n\nAlemannic \n\nAlemannic dialects are spoken in Switzerland (High Alemannic in the densely populated Swiss Plateau, in the south also Highest Alemannic, and Low Alemannic in Basel), Baden-Württemberg (Swabian and Low Alemannic, in the southwest also High Alemannic), Bavarian Swabia (Swabian, in the southwesternmost part also Low Alemannic), Vorarlberg (Low-, High-, and Highest Alemannic), Alsace (Low Alemannic, in the southernmost part also High Alemannic), Liechtenstein (High- and Highest Alemannic), and in the Tyrolean district of Reutte (Swabian). The Alemannic dialects are considered as Alsatian in Alsace. The largest cities in the Alemannic area are Stuttgart and Zürich.\n\nBavarian \n\nBavarian dialects are spoken in Austria (Vienna, Lower- and Upper Austria, Styria, Carinthia, Salzburg, Burgenland, and in most parts of Tyrol), Bavaria (Upper- and Lower Bavaria as well as Upper Palatinate), South Tyrol, southwesternmost Saxony (Southern Vogtlandian), and in the Swiss village of Samnaun. The largest cities in the Bavarian area are Vienna and Munich.\n\nGrammar \n\nGerman is a fusional language with a moderate degree of inflection, with three grammatical genders; as such, there can be a large number of words derived from the same root.\n\nNoun inflection \n\nGerman nouns inflect by case, gender and number:\n* four cases: nominative, accusative, genitive and dative.\n* three genders: masculine, feminine and neuter. Word endings sometimes reveal grammatical gender: for instance, nouns ending in ' (-ing), ' (-ship), ' or ' (-hood, -ness) are feminine, and nouns ending in ' or ' (diminutive forms) are neuter and nouns ending in ' (-ism) are masculine. Others are more variable, sometimes depending on the region in which the language is spoken; and some endings are not restricted to one gender, e.g. ' (-er), e.g. ' (feminine), celebration, party, ' (masculine), labourer, and ' (neuter), thunderstorm.\n* two numbers: singular and plural.\n\nThis degree of inflection is considerably less than in Old High German and other old Indo-European languages such as Latin, Ancient Greek, and Sanskrit, and it is also somewhat less than, for instance, Old English, modern Icelandic and Russian. The three genders have collapsed in the plural. With four cases and three genders plus plural, there are 16 permutations of case and gender/number, but there are only six forms of the definite article, which together cover all 16 permutations. In nouns, inflection for case is required in the singular for strong masculine and neuter nouns, in the genitive and sometimes in the dative. Both of these cases are losing ground to substitutes in informal speech. The dative noun ending is considered somewhat old-fashioned in many contexts and is often dropped, but it is still used in proverbs and the like, in formal speech and in written language. Weak masculine nouns share a common case ending for genitive, dative and accusative in the singular. Feminine nouns are not declined in the singular. The plural has an inflection for the dative. In total, seven inflectional endings (not counting plural markers) exist in German: '.\n\nIn German orthography, nouns and most words with the syntactical function of nouns are capitalised to make it easier for readers to determine the function of a word within a sentence (' – \"On Friday I went shopping.\"; ' – \"One day he finally showed up.\") This convention is almost unique to German today (shared perhaps only by the closely related Luxembourgish language and several insular dialects of the North Frisian language), but it was historically common in other languages such as Danish (which abolished the capitalization of nouns in 1948) and English.\n\nLike the other Germanic languages, German forms noun compounds in which the first noun modifies the category given by the second,: ' (\"dog hut\"; specifically: \"dog kennel\"). Unlike English, whose newer compounds or combinations of longer nouns are often written in \"open\" with separating spaces, German (like some other Germanic languages) nearly always uses the \"closed\" form without spaces, for example: ' (\"tree house\"). Like English, German allows arbitrarily long compounds in theory (see also English compounds). The longest German word verified to be actually in (albeit very limited) use is , which, literally translated, is \"beef labelling supervision duty assignment law\" [from ' (cattle), ' (meat), ' (labelling), ' (supervision), ' (duties), ' (assignment), ' (law)]. However, examples like this are perceived by native speakers as excessively bureaucratic, stylistically awkward or even satirical.\n\nVerb inflection \n\nThe inflection of standard German verbs includes:\n* two main conjugation classes: weak and strong (as in English). Additionally, there is a third class, known as mixed verbs, whose conjugation combines features of both the strong and weak patterns.\n* three persons: first, second and third.\n* two numbers: singular and plural.\n* three moods: indicative, imperative and subjunctive (in addition to infinitive)\n* two voices: active and passive. The passive voice uses auxiliary verbs and is divisible into static and dynamic. Static forms show a constant state and use the verb ’’to be’’ (sein). Dynamic forms show an action and use the verb “to become’’ (werden).\n* two tenses without auxiliary verbs (present and preterite) and four tenses constructed with auxiliary verbs (perfect, pluperfect, future and future perfect).\n* the distinction between grammatical aspects is rendered by combined use of subjunctive and/or preterite marking so the plain indicative voice uses neither of those two markers; the subjunctive by itself conveys secondhand information; subjunctive plus preterite marks the conditional state; and the preterite alone shows either plain indicative (in the past), or functions as a (literal) alternative for either second-hand-information or the conditional state of the verb, when necessary for clarity.\n* the distinction between perfect and progressive aspect is and has, at every stage of development, been a productive category of the older language and in nearly all documented dialects, but, strangely enough, it is now rigorously excluded from written usage in its present normalised form.\n* disambiguation of completed vs. uncompleted forms is widely observed and regularly generated by common prefixes (' [to look], ' [to see – unrelated form: ]).\n\nVerb prefixes \n\nThe meaning of basic verbs can be expanded and sometimes radically changed through the use of a number of prefixes. Some prefixes have a specific meaning; the prefix ' refers to destruction, as in ' (to tear apart), ' (to break apart), ' (to cut apart). Other prefixes have only the vaguest meaning in themselves; ' is found in a number of verbs with a large variety of meanings, as in ' (to try) from ' (to seek), ' (to interrogate) from ' (to take), ' (to distribute) from ' (to share), ' (to understand) from ' (to stand).\n\nOther examples include the following:\n' (to stick), ' (to detain); ' (to buy), ' (to sell); ' (to hear), ' (to cease); ' (to drive), ' (to experience).\n\nMany German verbs have a separable prefix, often with an adverbial function. In finite verb forms, it is split off and moved to the end of the clause and is hence considered by some to be a \"resultative particle\". For example, ', meaning \"to go along\", would be split, giving ' (Literal: \"Go you with?\"; Idiomatic: \"Are you going along?\").\n\nIndeed, several parenthetical clauses may occur between the prefix of a finite verb and its complement (ankommen to arrive, er kam an \n he arrived, er ist angekommen = he has arrived):\n'\nA selectively literal translation of this example to illustrate the point might look like this:\nHe \"came\" on Friday evening, after a hard day at work and the usual annoyances that had time and again been troubling him for years now at his workplace, with questionable joy, to a meal which, as he hoped, his wife had already put on the table, finally at home \"on\".\n\nWord order \n\nGerman word order is generally with the V2 word order restriction and also with the SOV word order restriction for main clauses. For polar questions, exclamations and wishes, the finite verb always has the first position. In subordinate clauses, the verb occurs at the very end.\n\nGerman requires for a verbal element (main verb or auxiliary verb) to appear second in the sentence. The verb is preceded by the topic of the sentence. The element in focus appears at the end of the sentence. For a sentence without an auxiliary, these are some possibilities:\n\n' (The old man gave me yesterday the book; normal order)\n' (The book gave [to] me yesterday the old man)\n' (The book gave the old man [to] me yesterday)\n' (The book gave [to] me the old man yesterday)\n\n' (Yesterday gave [to] me the old man the book, normal order)\n' ([To] me gave the old man the book yesterday (entailing: as for you, it was another date))\n\nThe position of a noun in a German sentence has no bearing on its being a subject, an object or another argument. In a declarative sentence in English, if the subject does not occur before the predicate, the sentence could well be misunderstood.\n\nHowever, German's flexibile word order allows one to emphasise specific words:\n\nNormal word order:\n: '\n: The manager entered yesterday at 10 o'clock with an umbrella in the hand his office.\n\nObject in front:\n: '\n: His office entered the manager yesterday at 10 o'clock with an umbrella in the hand.\nThe object ' (his office) is thus highlighted; it could be the topic of the next sentence.\n\nAdverb of time in front:\n: '\n: Yesterday entered the manager at 10 o'clock with an umbrella in the hand his office. (but today without umbrella)\n\nBoth time expressions in front:\n: '.\n: Yesterday at 10 o'clock entered the manager with an umbrella in the hand his office.\nThe full-time specification ' is highlighted.\n\nAnother possibility:\n: '.\n: Yesterday at 10 o'clock the manager entered his office with an umbrella in his hand.\nBoth the time specification and the fact he carried an umbrella are accentuated.\n\nSwapped adverbs:\n: '\n: The manager entered with an umbrella in the hand yesterday at 10 o'clock his office.\nThe phrase ' is highlighted.\n\nSwapped object:\n: '\n: The manager entered yesterday at 10 o'clock his office with an umbrella in his hand.\nThe time specification and the object ' (his office) are lightly accentuated.\n\nThe flexible word order also allows one to use language \"tools\" (such as poetic meter and figures of speech) more freely.\n\nAuxiliary verbs \n\nWhen an auxiliary verb is present, it appears in second position, and the main verb appears at the end. This occurs notably in the creation of the perfect tense. Many word orders are still possible:\n\n' (The old man has me today the book given.)\n' (The book has the old man me today given.)\n' (Today has the old man me the book given.)\n\nThe main verb may appear in first position to put stress on the action itself. The auxiliary verb is still in second position.\n\n' (Given has me the old man the book 'today'.) The bare fact that the book has been given is emphasized, as well as 'today'.\n\nModal verbs \n\nSentences using modal verbs place the infinitive at the end. For example, the English sentence \"Should he go home?\" would be rearranged in German to say \"Should he (to) home go?\" ('). Thus, in sentences with several subordinate or relative clauses, the infinitives are clustered at the end. Compare the similar clustering of prepositions in the following (highly contrived) English sentence: \"What did you bring that book that I do not like to be read to out of up for?\"\n\nMultiple infinitives \n\nGerman subordinate clauses have all verbs clustered at the end. Given that auxiliaries encode future, passive, modality, and the perfect, very long chains of verbs at the end of the sentence can occur. In these constructions, the past participle in ' is often replaced by the infinitive.\n\nV psv perf mod\nOne suspects that the deserter probably shot become be should.\n(\"It is suspected that the deserter probably had been shot\")\n\n: '\n: He knew not that the agent a picklock had make let\n\n: '\n: He knew not that the agent a picklock make let had\n(\"He did not know that the agent had had a picklock made\")\n\nThe order at the end of such strings is subject to variation, but the latter version is unusual.\n\nVocabulary \n\nMost German vocabulary is derived from the Germanic branch of the European language family. However, there is a significant amount of loanwords from other languages, in particular from Latin, Greek, Italian, Frenchsome of which might be reborrowings from Germanic Frankish and most recently English.This phenomenon is known as ' in German or as Germish or Denglish in English. In the early 19th century, Joachim Heinrich Campe estimated that one fifth of the total German vocabulary was of French or Latin origin.Uwe Pörksen, German Academy for Language and Literature’s Jahrbuch [Yearbook] 2007 (Wallstein Verlag, Göttingen 2008, pp. 121–130)\n\nLatin words were already imported into the predecessor of the German language during the Roman Empire and underwent all the characteristic phonetic changes in German. Their origin is thus no longer recognizable for most speakers (e.g. ', ', ', ', ' from Latin ', ', ', ', '). Borrowing from Latin continued after the fall of the Roman Empire during Christianization, mediated by the church and monasteries. Another important influx of Latin words can be observed during Renaissance humanism. In a scholarly context, the borrowings from Latin have continued until today, in the last few decades often indirectly through borrowings from English. During the 15th to 17th centuries, the influence of Italian was great, leading to many Italian loanwords in the fields of architecture, finance, and music. The influence of the French language in the 17th to 19th centuries resulted in an even greater import of French words. The English influence was already present in the 19th century, but it did not become dominant until the second half of the 20th century.\n\nAt the same time, the effectiveness of the German language in forming equivalents for foreign words from its inherited Germanic stem repertory is great. Thus, Notker Labeo was able to translate Aristotelian treatises in pure (Old High) German in the decades after the year 1000. The tradition of loan translation was revitalized in the 18th century, with linguists like Joachim Heinrich Campe, who introduced close to 300 words that are still used in modern German. Even today, there are movements that try to promote the ' (substitution) of foreign words deemed unnecessary with German alternatives. It is claimed that this would also help in spreading modern or scientific notions among the less educated and as well democratise public life.\n\nAs in English, there are many pairs of synonyms due to the enrichment of the Germanic vocabulary with loanwords from Latin and Latinized Greek. These words often have different connotations from their Germanic counterparts and are usually perceived as more scholarly.\n\n* ' – \"historical\", (')\n* ' – \"humaneness\", (')\n* ' – \"millennium\", (')\n* ' – \"perception\", (')\n* ' – \"vocabulary\", (')\n\nThe size of the vocabulary of German is difficult to estimate. The ' (The German Dictionary) initiated by Jacob and Wilhelm Grimm already contained over 330,000 headwords in its first edition. The modern German scientific vocabulary is estimated at nine million words and word groups (based on the analysis of 35 million sentences of a corpus in Leipzig, which as of July 2003 included 500 million words in total).\n\nThe Duden is the de facto official dictionary of the German language, first published by Konrad Duden in 1880. The Duden is updated regularly, with new editions appearing every four or five years.  it is in its 26th edition and in 12 volumes, each covering different aspects such as loanwords, etymology, pronunciation, synonyms, and so forth.The first of these volumes, ' (), has long been the prescriptive source for the spelling of German. The Duden has become the bible of the German language, being the definitive set of rules regarding grammar, spelling and usage of German.\n\nThe ' (\"Austrian Dictionary\"), abbreviated ', is the official dictionary of the German language in the Republic of Austria. It is edited by a group of linguists under the authority of the Austrian Federal Ministry of Education, Arts and Culture (). It is the Austrian counterpart to the German Duden and contains a number of terms unique to Austrian German or more frequently used or differently pronounced there.': Rudolf Muhr, Richard Schrodt, Peter Wiesinger (Hrsg.): [http://www-oedt.kfunigraz.ac.at/OEDTBIB/120-1995-OEDTSBd2.pdf Österreichisches Deutsch – Linguistische, sozialpsychologische und sprachpolitische Aspekte einer nationalen Variante des Deutschen (PDF, 407 Seiten; 1,3 MB)] , Verlag Hölder-Pichler-Tempsky, Wien 1995. Anm.:  A considerable amount of this \"Austrian\" vocabulary is also common in Southern Germany, especially Bavaria, and some of it is used in Switzerland as well. The most recent edition is the 42nd from 2012. Since the 39th edition from 2001 the orthography of the ' was adjusted to the German spelling reform of 1996. The dictionary is also officially used in the Italian province of South Tyrol.\n\nEnglish–German cognates \n\nThis is a selection of cognates in both English and German. Instead of the usual infinitive ending -en German verbs are indicated by a hyphen \"-\" after their stems. Words that are written with capital letters in German are nouns.\n\nOrthography \n\nGerman is written in the Latin alphabet. In addition to the 26 standard letters, German has three vowels with Umlaut, namely ä, ö and ü, as well as the eszett or ' (sharp s): ß. In Switzerland and Liechtenstein, ss is used instead of ß. Since ß can never occur at the beginning of a word, it has no traditional uppercase form.\n\nWritten texts in German are easily recognisable as such by distinguishing features such as umlauts and certain orthographical features – German is the only major language that capitalizes all nouns, a relic of a widespread practice in Northern Europe in the early modern era (including English for a while, in the 1700s) – and the frequent occurrence of long compounds. The longest German word that has been published is ' made of 79 characters. Because legibility and convenience set certain boundaries, compounds consisting of more than three or four nouns are almost exclusively found in humorous contexts. (In contrast, although English can also string nouns together, it usually separates the nouns with spaces. For example, \"toilet bowl cleaner\".)\n\nPresent \n\nBefore the German orthography reform of 1996, ß replaced ss after long vowels and diphthongs and before consonants, word-, or partial-word-endings. In reformed spelling, ß replaces ss only after long vowels and diphthongs.\n\nSince there is no traditional capital form of ß, it was replaced by SS when capitalization was required. For example, ' (tape measure) became ' in capitals. An exception was the use of ß in legal documents and forms when capitalizing names. To avoid confusion with similar names, lower case ß was maintained (so, \"\" instead of \"\"). Capital ß (ẞ) was ultimately adopted into German orthography in 2017, ending a long orthographic debate.\n\nUmlaut vowels (ä, ö, ü) are commonly transcribed with ae, oe, and ue if the umlauts are not available on the keyboard or other medium used. In the same manner ß can be transcribed as ss. Some operating systems use key sequences to extend the set of possible characters to include, amongst other things, umlauts; in Microsoft Windows this is done using Alt codes. German readers understand these transcriptions (although they appear unusual), but they are avoided if the regular umlauts are available because they are a makeshift, not proper spelling. (In Westphalia and Schleswig-Holstein, city and family names exist where the extra e has a vowel lengthening effect, e.g. Raesfeld, Coesfeld and Itzehoe, but this use of the letter e after a/o/u does not occur in the present-day spelling of words other than proper nouns.)\n\nThere is no general agreement on where letters with umlauts occur in the sorting sequence. Telephone directories treat them by replacing them with the base vowel followed by an e. Some dictionaries sort each umlauted vowel as a separate letter after the base vowel, but more commonly words with umlauts are ordered immediately after the same word without umlauts. As an example in a telephone book ' occurs after ' but before ' (because Ä is replaced by Ae). In a dictionary ' comes after ', but in some dictionaries ' and all other words starting with Ä may occur after all words starting with A. In some older dictionaries or indexes, initial Sch and St are treated as separate letters and are listed as separate entries after S, but they are usually treated as S+C+H and S+T.\n\nWritten German also typically uses an alternative opening inverted comma (quotation mark) as in '.\n\nPast \n\nUntil the early 20th century, German was mostly printed in blackletter typefaces (mostly in Fraktur, but also in Schwabacher) and written in corresponding handwriting (for example Kurrent and Sütterlin). These variants of the Latin alphabet are very different from the serif or sans-serif Antiqua typefaces used today, and the handwritten forms in particular are difficult for the untrained to read. The printed forms, however, were claimed by some to be more readable when used for Germanic languages.Adolf Reinecke, ', Leipzig, Hasert, 1910 (Often, foreign names in a text were printed in an Antiqua typeface even though the rest of the text was in Fraktur.) The Nazis initially promoted Fraktur and Schwabacher because they were considered Aryan, but they abolished them in 1941, claiming that these letters were Jewish.[http://www.ligaturix.de/bormann.htm Facsimile of Bormann's Memorandum (in German)]\nThe memorandum itself is typed in Antiqua, but the NSDAP letterhead is printed in Fraktur.\"For general attention, on behalf of the Führer, I make the following announcement:It is wrong to regard or to describe the so-called Gothic script as a German script. In reality, the so-called Gothic script consists of Schwabach Jew letters. Just as they later took control of the newspapers, upon the introduction of printing the Jews residing in Germany took control of the printing presses and thus in Germany the Schwabach Jew letters were forcefully introduced.Today the Führer, talking with Herr Reichsleiter Amann and Herr Book Publisher Adolf Müller, has decided that in the future the Antiqua script is to be described as normal script. All printed materials are to be gradually converted to this normal script. As soon as is feasible in terms of textbooks, only the normal script will be taught in village and state schools.The use of the Schwabach Jew letters by officials will in future cease; appointment certifications for functionaries, street signs, and so forth will in future be produced only in normal script.On behalf of the Führer, Herr Reichsleiter Amann will in future convert those newspapers and periodicals that already have foreign distribution, or whose foreign distribution is desired, to normal script\". It is also believed that the Nazi régime had banned this script as they realized that Fraktur would inhibit communication in the territories occupied during World War II.\n\nThe Fraktur script however remains present in everyday life in pub signs, beer brands and other forms of advertisement, where it is used to convey a certain rusticality and antiquity.\n\nA proper use of the long s, ('), ſ, is essential for writing German text in Fraktur typefaces. Many Antiqua typefaces include the long s also. A specific set of rules applies for the use of long s in German text, but nowadays it is rarely used in Antiqua typesetting. Any lower case \"s\" at the beginning of a syllable would be a long s, as opposed to a terminal s or short s (the more common variation of the letter s), which marks the end of a syllable; for example, in differentiating between the words ' (guard-house) and ' (tube of polish/wax). One can easily decide which \"s\" to use by appropriate hyphenation, (' vs. '). The long s only appears in lower case.\n\nReform of 1996 \n\nThe orthography reform of 1996 led to public controversy and considerable dispute. The states (') of North Rhine-Westphalia and Bavaria would not accept it. The dispute landed at one point in the highest court, which made a short issue of it, claiming that the states had to decide for themselves and that only in schools could the reform be made the official rule – everybody else could continue writing as they had learned it. After 10 years, without any intervention by the federal parliament, a major revision was installed in 2006, just in time for the coming school year. In 2007, some traditional spellings were finally invalidated, whereas in 2008, on the other hand, many of the old comma rules were again put in force.\n\nThe most noticeable change was probably in the use of the letter ß, called ' (Sharp S) or ' (pronounced ess-tsett). Traditionally, this letter was used in three situations:\n\n# After a long vowel or vowel combination,\n# Before a t, and\n# At the end of a syllable\n\nThus ', ', and '. Currently only the first rule is in effect, thus ', ', and '. The word ' 'foot' has the letter ß because it contains a long vowel, even though that letter occurs at the end of a syllable. The logic of this change is that an 'ß' is a single letter whereas 'ss' obviously are two letters, so the same distinction applies as for instance between the words ' and '.\n\nPhonology \n\nVowels \n\nIn German, vowels (excluding diphthongs; see below) are either short or long, as follows:\n\nShort is realized as in stressed syllables (including secondary stress), but as in unstressed syllables. Note that stressed short can be spelled either with e or with ä (for instance, ' \"would have\" and ' \"chain\" rhyme). In general, the short vowels are open and the long vowels are close. The one exception is the open sound of long Ä; in some varieties of standard German, and have merged into, removing this anomaly. In that case, pairs like ' 'bears/berries' or ' 'spike (of wheat)/honour' become homophonous (see: Captain Bluebear).\n\nIn many varieties of standard German, an unstressed is not pronounced, but vocalised to.\n\nWhether any particular vowel letter represents the long or short phoneme is not completely predictable, although the following regularities exist:\n* If a vowel (other than i) is at the end of a syllable or followed by a single consonant, it is usually pronounced long (e.g. ').\n* If a vowel is followed by h or if an i is followed by an e, it is long.\n* If the vowel is followed by a double consonant (e.g. ff, ss or tt), ck, tz or a consonant cluster (e.g. st or nd), it is nearly always short (e.g. '). Double consonants are used only for this function of marking preceding vowels as short; the consonant itself is never pronounced lengthened or doubled, in other words this is not a feeding order of gemination and then vowel shortening.\nBoth of these rules have exceptions (e.g. ' \"has\" is short despite the first rule; ', \"moon\" is long despite the second rule). For an i that is neither in the combination ie (making it long) nor followed by a double consonant or cluster (making it short), there is no general rule. In some cases, there are regional differences: In central Germany (Hessen), the o in the proper name \"Hoffmann\" is pronounced long, whereas most other Germans would pronounce it short; the same applies to the e in the geographical name \"Mecklenburg\" for people in that region. The word ' \"cities\", is pronounced with a short vowel by some (Jan Hofer, ARD Television) and with a long vowel by others (Marietta Slomka, ZDF Television). Finally, a vowel followed by ch can be short (' \"compartment\", ' \"kitchen\") or long (' \"search\", ' \"books\") almost at random. Thus, ' is homographous between ' \"puddle\" and ' \"manner of laughing\" (colloquial) or ' \"laugh!\" (imperative).\n\nGerman vowels can form the following digraphs (in writing) and diphthongs (in pronunciation); note that the pronunciation of some of them (ei, äu, eu) is very different from what one would expect when considering the component letters:\n\nAdditionally, the digraph ie generally represents the phoneme, which is not a diphthong. In many varieties, an at the end of a syllable is vocalised. However, a sequence of a vowel followed by such a vocalised is not a phonemic diphthong: ' \"bear\", ' \"he\", ' \"we\", ' \"gate\", ' \"short\", ' \"words\".\n\nIn most varieties of standard German, syllables that begin with a vowel are preceded by a glottal stop.\n\nConsonants \n\nWith approximately 25 phonemes, the German consonant system exhibits an average number of consonants in comparison with other languages. One of the more noteworthy ones is the unusual affricate. The consonant inventory of the standard language is shown below.\n\n* 1 has two allophones, and, after back and front vowels, respectively.\n* 2 has three allophones in free variation:, and. In the syllable coda, the allophone is found in many varieties.\n* 3 The voiceless stops,, are aspirated except when preceded by a sibilant, exactly as in English.\n* 4 and occur only in words of foreign (usually English or French) origin.\n* Where a stressed syllable has an initial vowel, it is preceded by. As its presence is predictable from context, is not considered a phoneme.\n\nConsonant spellings \n\n* c standing by itself is not a German letter. In borrowed words, it is usually pronounced (before ä, äu, e, i, ö, ü, y) or (before a, o, u, and consonants). The combination ck is, as in English, used to indicate that the preceding vowel is short.\n* ch occurs often and is pronounced either (after ä, ai, äu, e, ei, eu, i, ö, ü and consonants; in the diminutive suffix '; and at the beginning of a word), (after a, au, o, u), or at the beginning of a word before a, o, u and consonants. Ch never occurs at the beginning of an originally German word. In borrowed words with initial Ch before front vowels (' \"chemistry\" etc.), is considered standard. However, Upper Germans and Franconians (in the geographical sense) replace it with, as German as a whole does before darker vowels and consonants such as in ', '. Middle Germans (except Franconians) will borrow a from the French model. Both agree in considering each other's variant, and Upper Germans also the standard in, as particularly awkward and unusual.\n* dsch is pronounced (e.g. ' \"jungle\") but appears in a few loanwords only.\n* f is pronounced as in \"father\".\n* h is pronounced as in \"home\" at the beginning of a syllable. After a vowel it is silent and only lengthens the vowel (e.g. ' = roe deer).\n* j is pronounced in Germanic words (') (like \"y\" in \"year\"). In recent loanwords, it follows more or less the respective languages' pronunciations.\n* l is always pronounced, never (the English \"dark L\").\n* q only exists in combination with u and is pronounced. It appears in both Germanic and Latin words ('; '). But as most words containing q are Latinate, the letter is considerably rarer in German than it is in English.\n* r is usually pronounced in a guttural fashion (a voiced uvular fricative or uvular trill) in front of a vowel or consonant ('; '). In spoken German, however, it is commonly vocalised after a vowel (' being pronounced rather like – '). In some varieties, the r is pronounced as a \"tongue-tip\" r (the alveolar trill).\n* s in German is pronounced (as in \"zebra\") if it forms the syllable onset (e.g. '), otherwise (e.g. '). In Austria and Switzerland and often in Southern Germany, it is always pronounced. A ss indicates that the preceding vowel is short. st and sp at the beginning of words of German origin are pronounced and, respectively.\n* ß (a letter unique to German called ' or ') was a ligature of a double s and of an sz and is always pronounced. Originating in Blackletter typeface, it traditionally replaced ss at the end of a syllable (e.g. ' → '; ' → '); within a word it contrasts with ss in indicating that the preceding vowel is long (compare ' \"with moderation\" and ' \"in loads\"). The use of ß has recently been limited by the latest German spelling reform and is no longer used for ss after a short vowel (e.g. ' and ' were always pronounced with a short U/Ü); Switzerland and Liechtenstein already abolished it in 1934.\n* sch is pronounced (like \"sh\" in \"shine\").\n* tion in Latin loanwords is pronounced.\n* th is found, rarely, in loanwords and is pronounced if the loanword is from Greek, and usually as in the original if the loanword is from English (though some, mostly older, speakers tend to replace the English th-sound with).\n* v is pronounced in a limited number of words of Germanic origin, such as ', ' \"bird\", ' \"from, of\", ' \"before, in front of\", ' \"full\" and the prefix '. It is also used in loanwords, where it is normally pronounced. This pronunciation is common in words like ', ', ', ', ', ', and English loanwords; however, pronunciation is by some people in some in the very south. The only non-German word in which \"v\" is always pronounced \"f\" is ' (Eve).\n* w is pronounced as in \"vacation\" (e.g. ').\n* y is pronounced as when long, and when short (as in ' ; ' or '), except in ay and ey which are both pronounced. It is also often used in loanwords and pronounced like in the original language like in Style or Recycling.\n* z is always pronounced (e.g. '), except in loanwords. A tz indicates that the preceding vowel is short.\n\nConsonant shifts \n\nGerman does not have any dental fricatives (as English th). The th sounds, which the English language still has, disappeared on the continent in German with the consonant shifts between the 8th and the 10th centuries.For a history of the German consonants see Fausto Cercignani, The Consonants of German: Synchrony and Diachrony, Milano, Cisalpino, 1979. It is sometimes possible to find parallels between English and German by replacing the English th with d in German: \"Thank\" → in German ', \"this\" and \"that\" → ' and ', \"thou\" (old 2nd person singular pronoun) → ', \"think\" → ', \"thirsty\" → ' and many other examples.\n\nLikewise, the gh in Germanic English words, pronounced in several different ways in modern English (as an f, or not at all), can often be linked to German ch: \"to laugh\" → ', \"through\" and \"thorough\" → ', \"high\" → ', \"naught\" → ', \"light\" → ' or ', \"sight\" → ', \"daughter\" → ', \"neighbour\" → '.\n\nLiterature \n\nThe German language is used in German literature and can be traced back to the Middle Ages, with the most notable authors of the period being Walther von der Vogelweide and Wolfram von Eschenbach.\nThe ', whose author remains unknown, is also an important work of the epoch. The fairy tales collections collected and published by Jacob and Wilhelm Grimm in the 19th century became famous throughout the world.\n\nReformer and theologian Martin Luther, who was the first to translate the Bible into German, is widely credited for having set the basis for the modern \"High German\" language. Among the most well known poets and authors in German are Lessing, Goethe, Schiller, Kleist, Hoffmann, Brecht, Heine, and Kafka. Thirteen German-speaking people have won the Nobel Prize in literature: Theodor Mommsen, Rudolf Christoph Eucken, Paul von Heyse, Gerhart Hauptmann, Carl Spitteler, Thomas Mann, Nelly Sachs, Hermann Hesse, Heinrich Böll, Elias Canetti, Günter Grass, Elfriede Jelinek and Herta Müller.\n\nGerman loanwords in the English language \n\nEnglish has taken many loanwords from German, often without any change of spelling (aside from, often, the elimination of umlauts and not capitalizing nouns):\n\nOrganisations \n\nThe use and learning of the German language are promoted by a number of organisations.\n\nGoethe-Institut \n\nThe government-backed  (named after the famous German author Johann Wolfgang von Goethe) aims to enhance the knowledge of German culture and language within Europe and the rest of the world. This is done by holding exhibitions and conferences with German-related themes, and providing training and guidance in the learning and use of the German language. For example, the  teaches the  German language qualification.\n\nVerein Deutsche Sprache \n\nThe Dortmund-based , which was founded in 1997, supports the German language and is the largest language association of citizens in the world. The VDS has more than thirty-five thousand members in over seventy countries. Its founder, statistics professor Dr. Walter Krämer, has remained chairperson of the association from its beginnings.\n\nDeutsche Welle \n\nThe German state broadcaster  is the equivalent of the British BBC World Service and provides radio and television broadcasts in German and 30 other languages across the globe. Its German language services are tailored for German language learners by being spoken at slow speed.  also provides an  website to learn German. German language. http://en.wikipedia.org/?curid=11884."
  }
}
