{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=4124",
  "eid" : "cb665350-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778420997,
  "textBody" : "The Bantu languages\"Bantu\". Random House Webster's Unabridged Dictionary. (technically the Narrow Bantu languages, as opposed to \"Wide Bantu\", a loosely defined categorization which includes other Bantoid languages) constitute a traditional branch of the Niger–Congo languages. There are about 250 Bantu languages by the criterion of mutual intelligibility,Derek Nurse, 2006, \"Bantu Languages\", in the Encyclopedia of Language and Linguistics though the distinction between language and dialect is often unclear, and Ethnologue counts 535 languages.[http://www.ethnologue.com/show_family.asp?subid=73-16 Ethnologue report for Southern Bantoid]. The figure of 535 includes the 13 Mbam languages considered Bantu in Guthrie's classification and thus counted by Nurse (2006) Bantu languages are largely spoken east and south of present-day Cameroon, that is, in the regions commonly known as Central Africa, Southeast Africa and Southern Africa. Parts of the Bantu area include languages from other language families (see map).\n\nEstimates of number of speakers of most languages vary widely, due both to the lack of accurate statistics in most developing countries and the difficulty in defining exactly where the boundaries of certain languages lie, particularly in the presence of a dialect continuum.\n\nThe Bantu language with the largest total number of speakers is Swahili; however, the majority of its speakers use it as a second language. According to Ethnologue, there are over 180 million second-language (L2) speakers of Swahili but only about 2 million native speakers.\n\nOther major Bantu languages include Zulu, with 27 million speakers (15.7 million L2), and Shona, with about 11 million speakers (if Manyika and Ndau are included). Ethnologue separates the largely mutually intelligible Kinyarwanda and Kirundi, which, if grouped together, have 12.4 million speakers.\n\nOrigin\n\nThe Bantu languages descend from a common Proto-Bantu language, which is believed to have been spoken in what is now Cameroon in Central Africa.Philip J. Adler, Randall L. Pouwels, World Civilizations: To 1700 Volume 1 of World Civilizations, (Cengage Learning: 2007), p.169. \nAn estimated 2,500–3,000 years ago (1000 BC to 500 BC), although other sources put the start of the Bantu Expansion closer to 3000 BC,Gemma Berniell-Lee et al [http://mbe.oxfordjournals.org/content/26/7/1581.abstract Genetic and Demographic Implications of the Bantu Expansion: Insights from Human Paternal Lineages.] Oxfordjournals.com speakers of the Proto-Bantu language began a series of migrations eastward and southward, carrying agriculture with them. This Bantu expansion came to dominate Sub-Saharan Africa east of Cameroon, an area where Bantu peoples now constitute nearly the entire population.Toyin Falola, Aribidesi Adisa Usman, Movements, borders, and identities in Africa, (University Rochester Press: 2009), p.4.\n\nThe technical term Bantu, meaning \"human beings\" or simply \"people\", was first used by Wilhelm Bleek (1827–1875), as this is reflected in many of the languages of this group. A common characteristic of Bantu languages is that they use words such as muntu or mutu for \"human being\" or in simplistic terms \"person\", and the plural prefix for human nouns starting with mu- (class 1) in most languages is ba- (class 2), thus giving bantu for \"people\". Bleek, and later Carl Meinhof, pursued extensive studies comparing the grammatical structures of Bantu languages.\n\nClassification\n\nThe most widely used classification is an alphanumeric coding system developed by Malcolm Guthrie in his 1948 classification of the Bantu languages. is mainly geographic. The term 'narrow Bantu' was coined by the Benue–Congo Working Group to distinguish Bantu as recognized by Guthrie, from the Bantoid languages not recognized as Bantu by Guthrie.\n\nIn recent times, the distinctiveness of Narrow Bantu as opposed to the other Southern Bantoid languages has been called into doubt (cf. Piron 1995, Williamson & Blench 2000, Blench 2011), but the term is still widely used. \nA coherent classification of Narrow Bantu will likely need to exclude many of the Zone A and perhaps Zone B languages.\n\nThere is no true genealogical classification of the (Narrow) Bantu languages. Until recently most attempted classifications only considered languages that happen to fall within traditional Narrow Bantu, but there seems to be a continuum with the related languages of South Bantoid.\n\nAt a broader level, the family is commonly split in two depending on the reflexes of proto-Bantu tone patterns:  Many Bantuists group together parts of zones A through D (the extent depending on the author) as Northwest Bantu or Forest Bantu, and the remainder as Central Bantu or Savanna Bantu. The two groups have been described as having mirror-image tone systems: where Northwest Bantu has a high tone in a cognate, Central Bantu languages generally have a low tone, and vice versa.\n\nNorthwest Bantu is more divergent internally than Central Bantu, and perhaps less conservative due to contact with non-Bantu Niger–Congo languages; Central Bantu is likely the innovative line cladistically. Northwest Bantu is clearly not a coherent family, but even for Central Bantu the evidence is lexical, with little evidence that it is a historically valid group.\n\nAnother attempt at a detailed genetic classification to replace the Guthrie system is the 1999 \"Tervuren\" proposal of Bastin, Coupez, and Mann.The Guthrie, Tervuren, and SIL lists are compared side by side in [https://web.archive.org/web/20090325021837/http://www.african.gu.se/maho/downloads/bantulineup.pdf Maho 2002]. However, it relies on lexicostatistics, which, because of its reliance on similarity rather than shared innovations, may predict spurious groups of conservative languages that are not closely related. Meanwhile, Ethnologue has added languages to the Guthrie classification which Guthrie overlooked, while removing the Mbam languages (much of zone A), and shifting some languages between groups (much of zones D and E to a new zone J, for example, and part of zone L to K, and part of M to F) in an apparent effort at a semi-genetic, or at least semi-areal, classification. This has been criticized for sowing confusion in one of the few unambiguous ways to distinguish Bantu languages. Nurse & Philippson (2006) evaluate many proposals for low-level groups of Bantu languages, but the result is not a complete portrayal of the family. Glottolog has incorporated many of these into their classification.\n\nThe languages that share Dahl's law may also form a valid group, Northeast Bantu. The infobox at right lists these together with various low-level groups that are fairly uncontroversial, though they continue to be revised. The development of a rigorous genealogical classification of many branches of Niger–Congo, not just Bantu, is hampered by insufficient data.\n\nLanguage structure\n\nGuthrie reconstructed both the phonemic inventory and the vocabulary of Proto-Bantu.\n\nThe most prominent grammatical characteristic of Bantu languages is the extensive use of affixes (see Sotho grammar and Ganda noun classes for detailed discussions of these affixes). Each noun belongs to a class, and each language may have several numbered classes, somewhat like grammatical gender in European languages. The class is indicated by a prefix that is part of the noun, as well as agreement markers on verb and qualificative roots connected with the noun. Plural is indicated by a change of class, with a resulting change of prefix.\n\nThe verb has a number of prefixes, though in the western languages these are often treated as independent words.Derek Nurse, 2008. Tense and aspect in Bantu, p 70 (fn). In many of the Zone A, including Mbam, the verbs are clearly analytic. In Swahili, for example, Mtoto mdogo amekisoma (for comparison, Kamwana kadoko karikuverenga in Shona language) means 'The small child has read it [a book]'. Mtoto 'child' governs the adjective prefix m- and the verb subject prefix a-. Then comes perfect tense -me- and an object marker -ki- agreeing with implicit kitabu 'book' (from Arabic kitab). Pluralizing to 'children' gives Watoto wadogo wamekisoma (Vana vadoko varikuverenga in Shona), and pluralizing to 'books' (vitabu) gives Watoto wadogo wamevisoma.\n\nBantu words are typically made up of open syllables of the type CV (consonant-vowel) with most languages having syllables exclusively of this type. The Bushong language recorded by Vansina, however, has final consonants,Vansina, J. Esquisse de Grammaire Bushong. Commission de Linguistique Africaine, Tervuren, Belgique, 1959. while slurring of the final syllable (though written) is reported as common among the Tonga of Malawi.Turner, Rev. Wm. Y., Tumbuka–Tonga$1–$2 $3ictionEnglish Dictionary  Hetherwick Press, Blantyre, Malawi 1952. pages i–ii. The morphological shape of Bantu words is typically CV, VCV, CVCV, VCVCV, etc.; that is, any combination of CV (with possibly a V- syllable at the start). In other words, a strong claim for this language family is that almost all words end in a vowel, precisely because closed syllables (CVC) are not permissible in most of the documented languages, as far as is understood.\n\nThis tendency to avoid consonant clusters in some positions is important when words are imported from English or other non-Bantu languages. An example from Chewa: the word \"school\", borrowed from English, and then transformed to fit the sound patterns of this language, is sukulu. That is, sk- has been broken up by inserting an epenthetic -u-; -u has also been added at the end of the word. Another example is buledi for \"bread\". Similar effects are seen in loanwords for other non-African CV languages like Japanese. However, a clustering of sounds at the beginning of a syllable can be readily observed in such languages as Shona,Doke, Clement M., A Comparative Study in Shona Phonetics University of Witwatersrand, Johannesberg, 1931. and the Makua languages.Relatório do I Seminário sobre a Padronização da Ortografia de Línguas Moçambicanas  NELIMO, Universidade Eduardo Mondlane. 1989.\n\nReduplication\n\nReduplication is a common morphological phenomenon in Bantu languages and is usually used to indicate frequency or intensity of the action signalled by the (unreduplicated) verb stem.Abdulaziz Lodhi, \"[https://web.archive.org/web/20090325021837/http://www.african.gu.se/aa/pdfs/aa02004.pdf Verbal extensions in Bantu (the case of Swahili and Nyamwezi)]\". Africa & Asia, 2002, 2:4–26, Göteborg University\n\n*Example: in Swahili piga means \"strike\", pigapiga means \"strike repeatedly\".\n\nWell-known words and names that have reduplication include\n*Bafana Bafana, a football team\n*Chipolopolo, a football team\n*Eric Djemba-Djemba, a footballer\n*Lomana LuaLua, a footballer\n*Ngorongoro, a conservation area\nRepetition emphasizes the repeated word in the context that it is used. For instance, \"Mwenda pole hajikwai,\" while, \"Pole pole ndio mwendo,\" has two to emphasize the consistency of slowness of the pace. The meaning of the former in translation is, \"He who goes slowly doesn't trip,\" and that of the latter is, \"A slow but steady pace wins the race.\" Haraka haraka would mean hurrying just for the sake of hurrying, reckless hurry, as in \"Njoo! Haraka haraka\" [come here! Hurry, hurry].\n\nIn contrast, there are some words in some of the languages in which reduplication has the opposite meaning. It usually denotes short durations, and or lower intensity of the action and also means a few repetitions or a little bit more.\n\n*Example 1: In Xitsonga and Shona, famba means \"walk\" while famba-famba means \"walk around\".\n*Example 2: in isiZulu and SiSwati hamba means \"go\", hambahamba means \"go a little bit, but not much\".\n*Example 3: in both of the above languages shaya means \"strike\", shayashaya means \"strike a few more times lightly, but not heavy strikes and not too many times\".\n*Example 4: In Shona kwenya means \"scratch\", Kwenyakwenya means \"scratch excessively or a lot\".\n\nNoun class\n\nThe following is a list of nominal classes in Bantu:\n\nBy country\n\nFollowing is an incomplete list of the principal Bantu languages of each country. Included are those languages that constitute at least 1% of the population and have at least 10% the number of speakers of the largest Bantu language in the country.\nAn attempt at a full list of Bantu languages (with various conflations and a puzzlingly diverse nomenclature) can be found in The Bantu Languages of Africa, 1959.Bryan, M.A.(compiled by), The Bantu Languages of Africa. Published for the International African Institute, Oxford University Press, 1959.\n\nMost languages are best known in English without the class prefix (Swahili, Tswana, Ndebele), but are sometimes seen with the (language-specific) prefix (Kiswahili, Setswana, Sindebele). In a few cases prefixes are used to distinguish languages with the same root in their name, such as Tshiluba and Kiluba (both Luba), Umbundu and Kimbundu (both Mbundu). The bare (prefixless) form typically does not occur in the language itself, but is the basis for other words based on the ethnicity. So, in the country of Botswana the people are the Batswana, one person is a Motswana, and the language is Setswana; and in Uganda, centred on the kingdom of Buganda, the dominant ethnicity are the Baganda (sg. Muganda), whose language is Luganda.\n\nLingua franca\n*Swahili (Kiswahili) (350,000; tens of millions as L2)\n\nAngola\n*South Mbundu (Umbundu) (4 million)\n*North Mbundu (Kimbundu) (3 million)\n*Ovambo (Ambo) (Oshiwambo) (500,000)\n*Luvale (Chiluvale) (500,000)\n*Chokwe (Chichokwe) (500,000)\n\nBotswana\n*Tswana (Setswana) (1.6 million)\n*Kalanga (Ikalanga) (150,000)\n\nBurundi\n*Kirundi (8.5 - 10.5 million)\n\nCameroon\n*Beti (1.7 million: 900,000 Bulu, 600,000 Ewondo, 120,000 Fang, 60,000 Eton, 30,000 Bebele)\n*Basaa (230,000)\n*Duala (350,000)\n\nCentral African Republic\n*Mbati (60,000)\n\nDemocratic Republic of the Congo\n*Lingala (Ngala) (2 million; 7 million with L2 speakers)\n*Luba-Kasai (Tshiluba) (6.5 million)\n*Kituba (4.5 million), a Bantu creole\n*Kongo (Kikongo) (3.5 million)\n*Luba-Katanga (Kiluba) (1.5+ million)\n*Songe (Lusonge) (1+ million)\n*Nande (Orundandi) (1 million)\n*Tetela (Otetela) (800,000)\n*Yaka (Iyaka) (700,000+)\n*Shi (700,000)\n*Yombe (Kiyombe) (670,000)\n\nEquatorial Guinea\n*Beti (Fang) (300,000)\n*Bube (40,000)\n\nGabon\n*Baka\n*Barama\n*Bekwel\n*Benga\n*Bubi\n*Bwisi\n*Duma\n*Fang (500,000)\n*Kendell\n*Kanin\n*Sake\n*Sangu\n*Seki\n*Sighu\n*Simba\n*Sira\n*Northern Teke\n*Western Teke\n*Tsaangi\n*Tsogo\n*Vili (3,600)\n*Vumbu\n*Wandji\n*Wumbvu\n*Yangho\n*Yasa\n\nKenya\nSwahili and English are national languages\n*Gikuyu (7 million)\n*Luhya (5.4 million)\n*Kamba (4 million)\n*Meru (Kimeru) (2.7 million)\n*Gusii (2 million)\n*Mijikenda\n*Taita\n\nLesotho\n*Sotho (Sesotho) (1.8 million)\n*Zulu (Isizulu) (300,000)\n\nMalawi\n*Chewa (Nyanja) (Chichewa) (7 million)\n*Tumbuka (1 million)\n*Yao (1 million)\n\nMozambique\n*Makhuwa (3 million; 5.5 million all Makua)\n*Tsonga (Xitsonga) (3.1 million)\n*Shona (Ndau) (1.6 million)\n*Lomwe (1.5 million)\n*Sena (1.3 million)\n*Tswa (1.2 million)\n*Chuwabu (1.0 million)\n*Chopi (800,000)\n*Ronga (700,000)\n*Chewa (Nyanja) (Chichewa) (600,000)\n*Yao (Chiyao) (500,000)\n*Nyungwe (Cinyungwe/Nhungue)(400,000)\n*Tonga (400,000)\n*Makonde (400,000)\n\nNamibia\n*Ovambo (Ambo, Oshiwambo) (1 500,000)\n*Herero (200,000)\n\nRepublic of the Congo (Congo-Brazzaville)\n*Kituba (1.2+ million) [a Bantu creole]\n*Kongo (Kikongo) (1.0 million)\n*Teke languages (500,000)\n*Yombe (350,000)\n*Suundi (120,000)\n*Mbosi (110,000)\n*Lingala (100,000; ? L2 speakers)\n\nRwanda\n*Kinyarwanda (Kinyarwanda) (10 - 12 million)\n\nSouth Africa\nAccording to the South African National Census of 2011South African National Census of 2011\n*Zulu (Isizulu) (11,587,374)\n*Xhosa (Isixhosa) (8,154,258)\n*Northern Sotho (Sesotho sa Leboa) (4,618,576)\n*Tswana (Setswana) (4,067,248)\n*Sotho (Sesotho) (3,849,563)\n*Tsonga (Xitsonga) (2,277,148)\n*Swazi (Siswati) (1,297,046)\n*Venda (Tshivenda) (1,209,388)\n*Ndebele (Isindebele) (1,090,223)\nTOTAL Nguni: 22,406,O49 (61.98%)\nTOTAL Sotho-Tswana: 13,744,775 (38.02%)\nTOTAL OFFICIAL INDIGENOUS LANGUAGE SPEAKERS: 36,150,824 (69.83%)\n\nSwaziland\n*Swazi (Siswati) (1 million)\n\nTanzania\nSwahili is the national language\n*Sukuma (5.5 million)\n*Gogo (1.5 million)\n*Haya (Kihaya) (1.3 million)\n*Chaga (Kichaga) (1.2+ million : 600,000 Mochi, 300,000+ Machame, 300,000+ Vunjo)\n*Nyamwezi (1.0 million)\n*Makonde (1.0 million)\n*Ha (1.0 million)\n*Nyakyusa (800,000)\n*Hehe (800,000)\n*Luguru (700,000)\n*Bena (600,000)\n*Shambala (650,000)\n*Nyaturu (600,000)\n\nUganda\n*Ganda (Luganda) (7.5 million)\n*Nkore-Kiga (3.5 million : 2.3 million Nyankore, 1.2 million Kiga (Chiga))\n*Soga (Lusoga) (2 million)\n*Masaba (Lumasaba) (1.1 million)\n*Nyoro-Tooro (1.1 million)\n*Kinyarwanda (Kinyarwanda) (750,000)\n*Konjo (600,000)\n*Gwere (400,000)\n\nZambia\n*Bemba (3.3 million)\n*Tonga (1.0 million)\n*Chewa (Nyanja) (Chichewa) (800,000)\n*Kaonde (240,000)\n*Lozi (Silozi) (600,000)\n*Lala-Bisa (600,000)\n*Nsenga (550,000)\n*Tumbuka (Chitumbuka) (500,000)\n*Lunda (450,000)\n*Nyiha (400,000+)\n*Mambwe-Lungu (400,000)\n\nZimbabwe\n*Shona languages (12 million incl. Karanga, Zezuru, Korekore, Ndau, Manyika)\n*Ndebele (2 million)\n*Tonga\n*Venda\n*Kalanga\n\nGeographic areas\n\nMap 1 shows Bantu languages in Africa and map 2 a magnification of the Benin, Nigeria and Cameroon area, as of July 2017.\n\nBantu words popularised in western cultures\n\nA case has been made out for borrowings of many place-names and even misremembered rhymes – chiefly from one of the Luba varieties – in the USA.\n\nSome words from various Bantu languages have been borrowed into western languages. These include: \n\n*Bomba\n*Bongos\n*Bwana\n*Candombe\n*Chimpanzee\n*Gumbo\n*Hakuna matata\n*Impala\n*Indaba\n*Jenga\n*Jumbo\n*Kalimba\n*Kwanzaa\n*Mamba\n*Mambo\n*Mbira\n*Marimba\n*Rumba\n*Safari\n*Samba\n*Simba\n*Ubuntu\n\nWriting systems\n\nAlong with the Latin script and Arabic script orthographies, there are also some modern indigenous writing systems used for Bantu languages:\n*The Mwangwego alphabet is an abugida that is used to write the Chewa language and other languages of Malawi.\n*The Mandombe script is an abugida that is used to write the Bantu languages of the Democratic Republic of the Congo, mainly by the Kimbanguist movement.\n*The Isibheqe Sohlamvu or Ditema tsa Dinoko script is a featural syllabary used to write the siNtu or Southern Bantu languages.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Bantu languages" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=4124" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Bantu languages\"Bantu\". Random House Webster's Unabridged Dictionary. (technically the Narrow Bantu languages, as opposed to \"Wide Bantu\", a loosely defined categorization which includes other Bantoid languages) constitute a traditional branch of the Niger–Congo languages. There are about 250 Bantu languages by the criterion of mutual intelligibility,Derek Nurse, 2006, \"Bantu Languages\", in the Encyclopedia of Language and Linguistics though the distinction between language and dialect is often unclear, and Ethnologue counts 535 languages.[http://www.ethnologue.com/show_family.asp?subid=73-16 Ethnologue report for Southern Bantoid]. The figure of 535 includes the 13 Mbam languages considered Bantu in Guthrie's classification and thus counted by Nurse (2006) Bantu languages are largely spoken east and south of present-day Cameroon, that is, in the regions commonly known as Central Africa, Southeast Africa and Southern Africa. Parts of the Bantu area include languages from other language families (see map).\n\nEstimates of number of speakers of most languages vary widely, due both to the lack of accurate statistics in most developing countries and the difficulty in defining exactly where the boundaries of certain languages lie, particularly in the presence of a dialect continuum.\n\nThe Bantu language with the largest total number of speakers is Swahili; however, the majority of its speakers use it as a second language. According to Ethnologue, there are over 180 million second-language (L2) speakers of Swahili but only about 2 million native speakers.\n\nOther major Bantu languages include Zulu, with 27 million speakers (15.7 million L2), and Shona, with about 11 million speakers (if Manyika and Ndau are included). Ethnologue separates the largely mutually intelligible Kinyarwanda and Kirundi, which, if grouped together, have 12.4 million speakers.\n\nOrigin\n\nThe Bantu languages descend from a common Proto-Bantu language, which is believed to have been spoken in what is now Cameroon in Central Africa.Philip J. Adler, Randall L. Pouwels, World Civilizations: To 1700 Volume 1 of World Civilizations, (Cengage Learning: 2007), p.169. \nAn estimated 2,500–3,000 years ago (1000 BC to 500 BC), although other sources put the start of the Bantu Expansion closer to 3000 BC,Gemma Berniell-Lee et al [http://mbe.oxfordjournals.org/content/26/7/1581.abstract Genetic and Demographic Implications of the Bantu Expansion: Insights from Human Paternal Lineages.] Oxfordjournals.com speakers of the Proto-Bantu language began a series of migrations eastward and southward, carrying agriculture with them. This Bantu expansion came to dominate Sub-Saharan Africa east of Cameroon, an area where Bantu peoples now constitute nearly the entire population.Toyin Falola, Aribidesi Adisa Usman, Movements, borders, and identities in Africa, (University Rochester Press: 2009), p.4.\n\nThe technical term Bantu, meaning \"human beings\" or simply \"people\", was first used by Wilhelm Bleek (1827–1875), as this is reflected in many of the languages of this group. A common characteristic of Bantu languages is that they use words such as muntu or mutu for \"human being\" or in simplistic terms \"person\", and the plural prefix for human nouns starting with mu- (class 1) in most languages is ba- (class 2), thus giving bantu for \"people\". Bleek, and later Carl Meinhof, pursued extensive studies comparing the grammatical structures of Bantu languages.\n\nClassification\n\nThe most widely used classification is an alphanumeric coding system developed by Malcolm Guthrie in his 1948 classification of the Bantu languages. is mainly geographic. The term 'narrow Bantu' was coined by the Benue–Congo Working Group to distinguish Bantu as recognized by Guthrie, from the Bantoid languages not recognized as Bantu by Guthrie.\n\nIn recent times, the distinctiveness of Narrow Bantu as opposed to the other Southern Bantoid languages has been called into doubt (cf. Piron 1995, Williamson & Blench 2000, Blench 2011), but the term is still widely used. \nA coherent classification of Narrow Bantu will likely need to exclude many of the Zone A and perhaps Zone B languages.\n\nThere is no true genealogical classification of the (Narrow) Bantu languages. Until recently most attempted classifications only considered languages that happen to fall within traditional Narrow Bantu, but there seems to be a continuum with the related languages of South Bantoid.\n\nAt a broader level, the family is commonly split in two depending on the reflexes of proto-Bantu tone patterns:  Many Bantuists group together parts of zones A through D (the extent depending on the author) as Northwest Bantu or Forest Bantu, and the remainder as Central Bantu or Savanna Bantu. The two groups have been described as having mirror-image tone systems: where Northwest Bantu has a high tone in a cognate, Central Bantu languages generally have a low tone, and vice versa.\n\nNorthwest Bantu is more divergent internally than Central Bantu, and perhaps less conservative due to contact with non-Bantu Niger–Congo languages; Central Bantu is likely the innovative line cladistically. Northwest Bantu is clearly not a coherent family, but even for Central Bantu the evidence is lexical, with little evidence that it is a historically valid group.\n\nAnother attempt at a detailed genetic classification to replace the Guthrie system is the 1999 \"Tervuren\" proposal of Bastin, Coupez, and Mann.The Guthrie, Tervuren, and SIL lists are compared side by side in [https://web.archive.org/web/20090325021837/http://www.african.gu.se/maho/downloads/bantulineup.pdf Maho 2002]. However, it relies on lexicostatistics, which, because of its reliance on similarity rather than shared innovations, may predict spurious groups of conservative languages that are not closely related. Meanwhile, Ethnologue has added languages to the Guthrie classification which Guthrie overlooked, while removing the Mbam languages (much of zone A), and shifting some languages between groups (much of zones D and E to a new zone J, for example, and part of zone L to K, and part of M to F) in an apparent effort at a semi-genetic, or at least semi-areal, classification. This has been criticized for sowing confusion in one of the few unambiguous ways to distinguish Bantu languages. Nurse & Philippson (2006) evaluate many proposals for low-level groups of Bantu languages, but the result is not a complete portrayal of the family. Glottolog has incorporated many of these into their classification.\n\nThe languages that share Dahl's law may also form a valid group, Northeast Bantu. The infobox at right lists these together with various low-level groups that are fairly uncontroversial, though they continue to be revised. The development of a rigorous genealogical classification of many branches of Niger–Congo, not just Bantu, is hampered by insufficient data.\n\nLanguage structure\n\nGuthrie reconstructed both the phonemic inventory and the vocabulary of Proto-Bantu.\n\nThe most prominent grammatical characteristic of Bantu languages is the extensive use of affixes (see Sotho grammar and Ganda noun classes for detailed discussions of these affixes). Each noun belongs to a class, and each language may have several numbered classes, somewhat like grammatical gender in European languages. The class is indicated by a prefix that is part of the noun, as well as agreement markers on verb and qualificative roots connected with the noun. Plural is indicated by a change of class, with a resulting change of prefix.\n\nThe verb has a number of prefixes, though in the western languages these are often treated as independent words.Derek Nurse, 2008. Tense and aspect in Bantu, p 70 (fn). In many of the Zone A, including Mbam, the verbs are clearly analytic. In Swahili, for example, Mtoto mdogo amekisoma (for comparison, Kamwana kadoko karikuverenga in Shona language) means 'The small child has read it [a book]'. Mtoto 'child' governs the adjective prefix m- and the verb subject prefix a-. Then comes perfect tense -me- and an object marker -ki- agreeing with implicit kitabu 'book' (from Arabic kitab). Pluralizing to 'children' gives Watoto wadogo wamekisoma (Vana vadoko varikuverenga in Shona), and pluralizing to 'books' (vitabu) gives Watoto wadogo wamevisoma.\n\nBantu words are typically made up of open syllables of the type CV (consonant-vowel) with most languages having syllables exclusively of this type. The Bushong language recorded by Vansina, however, has final consonants,Vansina, J. Esquisse de Grammaire Bushong. Commission de Linguistique Africaine, Tervuren, Belgique, 1959. while slurring of the final syllable (though written) is reported as common among the Tonga of Malawi.Turner, Rev. Wm. Y., Tumbuka–Tonga$1–$2 $3ictionEnglish Dictionary  Hetherwick Press, Blantyre, Malawi 1952. pages i–ii. The morphological shape of Bantu words is typically CV, VCV, CVCV, VCVCV, etc.; that is, any combination of CV (with possibly a V- syllable at the start). In other words, a strong claim for this language family is that almost all words end in a vowel, precisely because closed syllables (CVC) are not permissible in most of the documented languages, as far as is understood.\n\nThis tendency to avoid consonant clusters in some positions is important when words are imported from English or other non-Bantu languages. An example from Chewa: the word \"school\", borrowed from English, and then transformed to fit the sound patterns of this language, is sukulu. That is, sk- has been broken up by inserting an epenthetic -u-; -u has also been added at the end of the word. Another example is buledi for \"bread\". Similar effects are seen in loanwords for other non-African CV languages like Japanese. However, a clustering of sounds at the beginning of a syllable can be readily observed in such languages as Shona,Doke, Clement M., A Comparative Study in Shona Phonetics University of Witwatersrand, Johannesberg, 1931. and the Makua languages.Relatório do I Seminário sobre a Padronização da Ortografia de Línguas Moçambicanas  NELIMO, Universidade Eduardo Mondlane. 1989.\n\nReduplication\n\nReduplication is a common morphological phenomenon in Bantu languages and is usually used to indicate frequency or intensity of the action signalled by the (unreduplicated) verb stem.Abdulaziz Lodhi, \"[https://web.archive.org/web/20090325021837/http://www.african.gu.se/aa/pdfs/aa02004.pdf Verbal extensions in Bantu (the case of Swahili and Nyamwezi)]\". Africa & Asia, 2002, 2:4–26, Göteborg University\n\n*Example: in Swahili piga means \"strike\", pigapiga means \"strike repeatedly\".\n\nWell-known words and names that have reduplication include\n*Bafana Bafana, a football team\n*Chipolopolo, a football team\n*Eric Djemba-Djemba, a footballer\n*Lomana LuaLua, a footballer\n*Ngorongoro, a conservation area\nRepetition emphasizes the repeated word in the context that it is used. For instance, \"Mwenda pole hajikwai,\" while, \"Pole pole ndio mwendo,\" has two to emphasize the consistency of slowness of the pace. The meaning of the former in translation is, \"He who goes slowly doesn't trip,\" and that of the latter is, \"A slow but steady pace wins the race.\" Haraka haraka would mean hurrying just for the sake of hurrying, reckless hurry, as in \"Njoo! Haraka haraka\" [come here! Hurry, hurry].\n\nIn contrast, there are some words in some of the languages in which reduplication has the opposite meaning. It usually denotes short durations, and or lower intensity of the action and also means a few repetitions or a little bit more.\n\n*Example 1: In Xitsonga and Shona, famba means \"walk\" while famba-famba means \"walk around\".\n*Example 2: in isiZulu and SiSwati hamba means \"go\", hambahamba means \"go a little bit, but not much\".\n*Example 3: in both of the above languages shaya means \"strike\", shayashaya means \"strike a few more times lightly, but not heavy strikes and not too many times\".\n*Example 4: In Shona kwenya means \"scratch\", Kwenyakwenya means \"scratch excessively or a lot\".\n\nNoun class\n\nThe following is a list of nominal classes in Bantu:\n\nBy country\n\nFollowing is an incomplete list of the principal Bantu languages of each country. Included are those languages that constitute at least 1% of the population and have at least 10% the number of speakers of the largest Bantu language in the country.\nAn attempt at a full list of Bantu languages (with various conflations and a puzzlingly diverse nomenclature) can be found in The Bantu Languages of Africa, 1959.Bryan, M.A.(compiled by), The Bantu Languages of Africa. Published for the International African Institute, Oxford University Press, 1959.\n\nMost languages are best known in English without the class prefix (Swahili, Tswana, Ndebele), but are sometimes seen with the (language-specific) prefix (Kiswahili, Setswana, Sindebele). In a few cases prefixes are used to distinguish languages with the same root in their name, such as Tshiluba and Kiluba (both Luba), Umbundu and Kimbundu (both Mbundu). The bare (prefixless) form typically does not occur in the language itself, but is the basis for other words based on the ethnicity. So, in the country of Botswana the people are the Batswana, one person is a Motswana, and the language is Setswana; and in Uganda, centred on the kingdom of Buganda, the dominant ethnicity are the Baganda (sg. Muganda), whose language is Luganda.\n\nLingua franca\n*Swahili (Kiswahili) (350,000; tens of millions as L2)\n\nAngola\n*South Mbundu (Umbundu) (4 million)\n*North Mbundu (Kimbundu) (3 million)\n*Ovambo (Ambo) (Oshiwambo) (500,000)\n*Luvale (Chiluvale) (500,000)\n*Chokwe (Chichokwe) (500,000)\n\nBotswana\n*Tswana (Setswana) (1.6 million)\n*Kalanga (Ikalanga) (150,000)\n\nBurundi\n*Kirundi (8.5 - 10.5 million)\n\nCameroon\n*Beti (1.7 million: 900,000 Bulu, 600,000 Ewondo, 120,000 Fang, 60,000 Eton, 30,000 Bebele)\n*Basaa (230,000)\n*Duala (350,000)\n\nCentral African Republic\n*Mbati (60,000)\n\nDemocratic Republic of the Congo\n*Lingala (Ngala) (2 million; 7 million with L2 speakers)\n*Luba-Kasai (Tshiluba) (6.5 million)\n*Kituba (4.5 million), a Bantu creole\n*Kongo (Kikongo) (3.5 million)\n*Luba-Katanga (Kiluba) (1.5+ million)\n*Songe (Lusonge) (1+ million)\n*Nande (Orundandi) (1 million)\n*Tetela (Otetela) (800,000)\n*Yaka (Iyaka) (700,000+)\n*Shi (700,000)\n*Yombe (Kiyombe) (670,000)\n\nEquatorial Guinea\n*Beti (Fang) (300,000)\n*Bube (40,000)\n\nGabon\n*Baka\n*Barama\n*Bekwel\n*Benga\n*Bubi\n*Bwisi\n*Duma\n*Fang (500,000)\n*Kendell\n*Kanin\n*Sake\n*Sangu\n*Seki\n*Sighu\n*Simba\n*Sira\n*Northern Teke\n*Western Teke\n*Tsaangi\n*Tsogo\n*Vili (3,600)\n*Vumbu\n*Wandji\n*Wumbvu\n*Yangho\n*Yasa\n\nKenya\nSwahili and English are national languages\n*Gikuyu (7 million)\n*Luhya (5.4 million)\n*Kamba (4 million)\n*Meru (Kimeru) (2.7 million)\n*Gusii (2 million)\n*Mijikenda\n*Taita\n\nLesotho\n*Sotho (Sesotho) (1.8 million)\n*Zulu (Isizulu) (300,000)\n\nMalawi\n*Chewa (Nyanja) (Chichewa) (7 million)\n*Tumbuka (1 million)\n*Yao (1 million)\n\nMozambique\n*Makhuwa (3 million; 5.5 million all Makua)\n*Tsonga (Xitsonga) (3.1 million)\n*Shona (Ndau) (1.6 million)\n*Lomwe (1.5 million)\n*Sena (1.3 million)\n*Tswa (1.2 million)\n*Chuwabu (1.0 million)\n*Chopi (800,000)\n*Ronga (700,000)\n*Chewa (Nyanja) (Chichewa) (600,000)\n*Yao (Chiyao) (500,000)\n*Nyungwe (Cinyungwe/Nhungue)(400,000)\n*Tonga (400,000)\n*Makonde (400,000)\n\nNamibia\n*Ovambo (Ambo, Oshiwambo) (1 500,000)\n*Herero (200,000)\n\nRepublic of the Congo (Congo-Brazzaville)\n*Kituba (1.2+ million) [a Bantu creole]\n*Kongo (Kikongo) (1.0 million)\n*Teke languages (500,000)\n*Yombe (350,000)\n*Suundi (120,000)\n*Mbosi (110,000)\n*Lingala (100,000; ? L2 speakers)\n\nRwanda\n*Kinyarwanda (Kinyarwanda) (10 - 12 million)\n\nSouth Africa\nAccording to the South African National Census of 2011South African National Census of 2011\n*Zulu (Isizulu) (11,587,374)\n*Xhosa (Isixhosa) (8,154,258)\n*Northern Sotho (Sesotho sa Leboa) (4,618,576)\n*Tswana (Setswana) (4,067,248)\n*Sotho (Sesotho) (3,849,563)\n*Tsonga (Xitsonga) (2,277,148)\n*Swazi (Siswati) (1,297,046)\n*Venda (Tshivenda) (1,209,388)\n*Ndebele (Isindebele) (1,090,223)\nTOTAL Nguni: 22,406,O49 (61.98%)\nTOTAL Sotho-Tswana: 13,744,775 (38.02%)\nTOTAL OFFICIAL INDIGENOUS LANGUAGE SPEAKERS: 36,150,824 (69.83%)\n\nSwaziland\n*Swazi (Siswati) (1 million)\n\nTanzania\nSwahili is the national language\n*Sukuma (5.5 million)\n*Gogo (1.5 million)\n*Haya (Kihaya) (1.3 million)\n*Chaga (Kichaga) (1.2+ million : 600,000 Mochi, 300,000+ Machame, 300,000+ Vunjo)\n*Nyamwezi (1.0 million)\n*Makonde (1.0 million)\n*Ha (1.0 million)\n*Nyakyusa (800,000)\n*Hehe (800,000)\n*Luguru (700,000)\n*Bena (600,000)\n*Shambala (650,000)\n*Nyaturu (600,000)\n\nUganda\n*Ganda (Luganda) (7.5 million)\n*Nkore-Kiga (3.5 million : 2.3 million Nyankore, 1.2 million Kiga (Chiga))\n*Soga (Lusoga) (2 million)\n*Masaba (Lumasaba) (1.1 million)\n*Nyoro-Tooro (1.1 million)\n*Kinyarwanda (Kinyarwanda) (750,000)\n*Konjo (600,000)\n*Gwere (400,000)\n\nZambia\n*Bemba (3.3 million)\n*Tonga (1.0 million)\n*Chewa (Nyanja) (Chichewa) (800,000)\n*Kaonde (240,000)\n*Lozi (Silozi) (600,000)\n*Lala-Bisa (600,000)\n*Nsenga (550,000)\n*Tumbuka (Chitumbuka) (500,000)\n*Lunda (450,000)\n*Nyiha (400,000+)\n*Mambwe-Lungu (400,000)\n\nZimbabwe\n*Shona languages (12 million incl. Karanga, Zezuru, Korekore, Ndau, Manyika)\n*Ndebele (2 million)\n*Tonga\n*Venda\n*Kalanga\n\nGeographic areas\n\nMap 1 shows Bantu languages in Africa and map 2 a magnification of the Benin, Nigeria and Cameroon area, as of July 2017.\n\nBantu words popularised in western cultures\n\nA case has been made out for borrowings of many place-names and even misremembered rhymes – chiefly from one of the Luba varieties – in the USA.\n\nSome words from various Bantu languages have been borrowed into western languages. These include: \n\n*Bomba\n*Bongos\n*Bwana\n*Candombe\n*Chimpanzee\n*Gumbo\n*Hakuna matata\n*Impala\n*Indaba\n*Jenga\n*Jumbo\n*Kalimba\n*Kwanzaa\n*Mamba\n*Mambo\n*Mbira\n*Marimba\n*Rumba\n*Safari\n*Samba\n*Simba\n*Ubuntu\n\nWriting systems\n\nAlong with the Latin script and Arabic script orthographies, there are also some modern indigenous writing systems used for Bantu languages:\n*The Mwangwego alphabet is an abugida that is used to write the Chewa language and other languages of Malawi.\n*The Mandombe script is an abugida that is used to write the Bantu languages of the Democratic Republic of the Congo, mainly by the Kimbanguist movement.\n*The Isibheqe Sohlamvu or Ditema tsa Dinoko script is a featural syllabary used to write the siNtu or Southern Bantu languages. Bantu languages. http://en.wikipedia.org/?curid=4124."
  }
}
