{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15878",
  "eid" : "1f869490-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778562137,
  "textBody" : "Events\n\n* 587 BC – Babylon's siege of Jerusalem ends following the destruction of Solomon's Temple.\n*1174 – William I of Scotland, a key rebel in the Revolt of 1173–74, is captured at Alnwick by forces loyal to Henry II of England.\n*1249 – Coronation of Alexander III as King of Scots.\n*1260 – The Livonian Order suffers its greatest defeat in the 13th century in the Battle of Durbe against the Grand Duchy of Lithuania\n*1558 – Battle of Gravelines: In France, Spanish forces led by Count Lamoral of Egmont defeat the French forces of Marshal Paul de Thermes at Gravelines.\n*1573 – Eighty Years' War: The Siege of Haarlem ends after seven months.\n*1643 – English Civil War: Battle of Roundway Down: In England, Henry Wilmot, 1st Earl of Rochester, commanding the Royalist forces, heavily defeats the Parliamentarian forces led by Sir William Waller.\n*1787 – The Continental Congress enacts the Northwest Ordinance establishing governing rules for the Northwest Territory. It also establishes procedures for the admission of new states and limits the expansion of slavery.\n*1793 – Journalist and French revolutionary Jean-Paul Marat is assassinated in his bathtub by Charlotte Corday, a member of the opposing political faction.  \n*1794 – The Battle of the Vosges is fought between French forces and those of Prussia and Austria.\n*1814 – The Carabinieri, the national gendarmerie of Italy, is established.\n*1830 – The General Assembly's Institution, now the Scottish Church College, one of the pioneering institutions that ushered the Bengali renaissance, is founded by Alexander Duff and Raja Ram Mohan Roy, in Calcutta, India.\n*1854 – In the Battle of Guaymas, Mexico, General José María Yáñez stops the French invasion led by Count Gaston de Raousset-Boulbon.\n*1863 – New York City draft riots: In New York City, opponents of conscription begin three days of rioting which will be later regarded as the worst in United States history.\n*1878 – Treaty of Berlin: The European powers redraw the map of the Balkans. Serbia, Montenegro and Romania become completely independent of the Ottoman Empire.\n*1919 – The British airship R34 lands in Norfolk, England, completing the first airship return journey across the Atlantic in 182 hours of flight.\n*1923 – The Hollywood Sign is dedicated in the Hollywood Hills, Los Angeles. It originally reads \"Hollywoodland,\" but the four last letters are dropped after renovation in 1949.\n*1941 – World War II: Montenegrins begin a popular uprising against the Axis powers (Trinaestojulski ustanak).\n*1956 – John McCarthy(Dartmouth College), Marvin Minsky(MIT), Claude Shannon (Bell Labs), and Nathaniel Rochester (IBM) assemble the first coordinated research meeting on the topic of \"Artificial Intelligence\" at Dartmouth College in Hanover, NH. USA.\n*1962 – In an unprecedented action, British Prime Minister Harold Macmillan dismisses seven members of his Cabinet, marking the effective end of the National Liberals as a distinct force within British politics.\n*1973 – Alexander Butterfield reveals the existence of the \"Nixon tapes\" to the special Senate committee investigating the Watergate break-in.\n*1977 – Somalia declares war on Ethiopia, starting the Ogaden War.\n*  1977   – New York City: Amidst a period of financial and social turmoil experiences an electrical blackout lasting nearly 24 hours that leads to widespread fires and looting.\n*1985 – The Live Aid benefit concert takes place in London and Philadelphia, as well as other venues such as Moscow and Sydney.\n*  1985   – Vice President George H. W. Bush becomes the Acting President for the day when President Ronald Reagan undergoes surgery to remove polyps from his colon.\n*2003 – French DGSE personnel abort an operation to rescue Íngrid Betancourt from FARC rebels in Colombia, causing a political scandal when details are leaked to the press.\n*2008 – Battle of Wanat begins when Taliban and al-Qaeda guerrillas attack US Army and Afghan National Army troops in Afghanistan. The U.S. deaths were, at that time, the most in a single battle since the beginning of operations in 2001.\n*2011 – Mumbai is rocked by three bomb blasts during the evening rush hour, killing 26 and injuring 130.\n*  2011   – United Nations Security Council Resolution 1999 is adopted, which admits South Sudan to member status of United Nations.\n*2013 – Typhoon Soulik kills at least nine people and affects more than 160 million in East China and Taiwan.\n*2016 – Prime Minister of the United Kingdom David Cameron resigns, and is succeeded by Theresa May.\n\nBirths\n\n* 100 BC – Julius Caesar, Roman general and statesman (d. 44 BC)\n*1426 – Anne Neville, Countess of Warwick (d. 1492)\n*1478 – Giulio d'Este, illegitimate son of Italian noble (d. 1561)\n*1470 – Francesco Armellini Pantalassi de' Medici, Catholic cardinal (d. 1528)\n*1527 – John Dee, English-Welsh mathematician, astronomer, and astrologer (d. 1609)\n*1579 – Arthur Dee, English physician and chemist (d. 1651)\n*1590 – Pope Clement X (d. 1676)\n*1606 – Roland Fréart de Chambray (d. 1676)\n*1607 – Wenceslaus Hollar, Czech-English painter and illustrator (d. 1677)\n*1608 – Ferdinand III, Holy Roman Emperor (d. 1657)\n*1745 – Robert Calder, Scottish-English admiral (d. 1818)\n*1756 – Thomas Rowlandson, English artist and caricaturist (d. 1827)\n*1760 – István Pauli, Hungarian-Slovene priest and poet (d. 1829)\n*1770 – Alexander Balashov, Russian general and politician, Russian Minister of Police (d. 1837)\n*1793 – John Clare, English poet and author (d. 1864)\n*1821 – Nathan Bedford Forrest, American general and first Grand Wizard of the Ku Klux Klan (d. 1877)\n*1831 – Arthur Böttcher, German pathologist and anatomist (d. 1889)\n*1841 – Otto Wagner, Austrian architect, designed the Austrian Postal Savings Bank and Karlsplatz Stadtbahn Station (d. 1918)\n*1858 – Stewart Culin, American ethnographer and author (d. 1929)\n*1859 – Sidney Webb, 1st Baron Passfield, English economist and politician, Secretary of State for the Colonies (d. 1947)\n*1863 – Margaret Murray, British archaeologist, anthropologist, historian, and folklorist (d. 1963)\n*1864 – John Jacob Astor IV, American colonel and businessman (d. 1912)\n*1877 – Robert Henry Mathews, Australian linguist and missionary (d. 1970)\n*1884 – Yrjö Saarela, Finnish wrestler and coach (d. 1951)\n*1889 – Emma Asson, Estonian educator and politician (d. 1965)\n*  1889   – Stan Coveleski, American baseball player (d. 1984)\n*1892 – Léo-Pol Morin, Canadian pianist, composer, and educator (d. 1941)\n*  1892   – Jonni Myyrä, Finnish-American discus and javelin thrower (d. 1955)\n*1894 – Isaac Babel, Russian short story writer, journalist, and playwright (d. 1940)\n*1895 – Sidney Blackmer, American actor (d. 1973)\n*1896 – Mordecai Ardon, Israeli painter and educator (d. 1992)\n*1898 – Julius Schreck, German commander (d. 1936)\n*1900 – George Lewis, American clarinet player and songwriter (d. 1969)\n*1901 – Eric Portman, English actor (d. 1969)\n*1903 – Kenneth Clark, English historian and author (d. 1983)\n*1905 – Alfredo M. Santos, Filipino general (d. 1990)\n*  1905   – Eugenio Pagnini, Italian modern pentathlete (d. 1993)\n*  1905   – Magda Foy, American child actress (d. 2000)\n*1907 – George Weller, American author, playwright, and journalist (d. 2002)\n*1908 – Dorothy Round, English tennis player (d. 1982)\n*  1908   – Tim Spencer, American country & western singer-songwriter and actor (d. 1974)\n*1910 – Lien Gisolf, Dutch high jumper (d. 1993)\n*  1910   – Loren Pope, American journalist and author (d. 2008)\n*1913 – Dave Garroway, American journalist and television personality (d. 1982)\n*  1913   – Mærsk Mc-Kinney Møller, Danish businessman (d. 2012)\n*  1913   – Kay Linaker, American actress and screenwriter (d. 2008)\n*1915 – Kaoru Ishikawa, Japanese author and educator (d. 1989)\n*1918 – Alberto Ascari, Italian race car driver (d. 1955)\n*  1918   – Ronald Bladen, American painter and sculptor (d. 1988)\n*  1918   – Marcia Brown, American author and illustrator (d. 2015)\n*1919 – Hau Pei-tsun, 13th Premier of the Republic of China\n*  1919   – William F. Quinn, American lawyer (d. 2006)\n*1921 – Ernest Gold, Austrian-American composer and conductor (d. 1999)\n*1922 – Leslie Brooks, American actress (d. 2011)\n*  1922   – Anker Jørgensen, Danish trade union leader and politician, 16th Prime Minister of Denmark (d. 2016)\n*  1922   – Ken Mosdell, Canadian ice hockey player (d. 2006)\n*1923 – Ashley Bryan, American children's book writer & illustrator\n*1924 – Johnny Gilbert, American game show host and announcer\n*1925 – Suzanne Zimmerman, American competition swimmer and Olympic medalist\n*1926 – Robert H. Justman, American director, producer, and production manager (d. 2008)\n*  1926   – T. Loren Christianson, American politician\n*  1926   – Thomas Clark, American politician\n*1927 – Simone Veil, French lawyer and politician, 12th President of the European Parliament (d. 2017)\n*  1927   – Ian Reed, Australian discus thrower\n*1928 – Bob Crane, American actor (d. 1978)\n*  1928   – Sven Davidson, Swedish-American tennis player (d. 2008)\n*1929 – Sofia Muratova, Russian gymnast (d. 2006)\n*1930 – Sam Greenlee, American author and poet (d. 2014)\n*  1930   – Naomi Shemer, Israeli singer-songwriter (d. 2004)\n*1931 – Frank Ramsey, American basketball player and coach \n*1932 – Hubert Reeves, Canadian-French astrophysicist and author\n*1933 – David Storey, English author, playwright, and screenwriter (d. 2017)\n*  1933   – Piero Manzoni, Italian artist (d. 1963)\n*1934 – Peter Gzowski, Canadian journalist and academic (d. 2002)\n*  1934   – Gordon Lee, English footballer and manager\n*  1934   – Wole Soyinka, Nigerian author, poet, and playwright, Nobel Prize laureate\n*  1934   – Aleksei Yeliseyev, Russian engineer and astronaut\n*1935 – Jack Kemp, American football player and politician, 9th United States Secretary of Housing and Urban Development (d. 2009)\n*  1935   – Earl Lovelace, Trinidadian journalist, author, and playwright\n*  1935   – Kurt Westergaard, Danish cartoonist\n*1936 – Albert Ayler, American saxophonist and composer (d. 1970)\n*1937 – Ghillean Prance, English botanist and ecologist\n*1939 – Lambert Jackson Woodburne, South African admiral (d. 2013)\n*1940 – Tom Lichtenberg, American football player and coach (d. 2013)\n*  1940   – Paul Prudhomme, American chef and author (d. 2015)\n*  1940   – Patrick Stewart, English actor, director, and producer\n*1941 – Grahame Corling, Australian cricketer \n*  1941   – Robert Forster, American actor and producer\n*  1941   – Ehud Manor, Israeli songwriter and translator (d. 2005)\n*  1941   – Jacques Perrin, French actor, director, and producer\n*1942 – Harrison Ford, American actor and producer\n*  1942   – Roger McGuinn, American singer-songwriter and guitarist \n*1943 – Chris Serle, English journalist and actor\n*1944 – Eric Freeman, Australian cricketer \n*  1944   – Cyril Knowles, English footballer and manager (d. 1991)\n*  1944   – Erno Rubik, Hungarian game designer, architect, and educator, invented the Rubik's Cube\n*1945 – Ashley Mallett, Australian cricketer and author \n*1946 – Bob Kauffman, American basketball player and coach (d. 2015)\n*  1946   – Cheech Marin, American actor and comedian\n*1948 – Catherine Breillat, French director and screenwriter\n*1950 – George Nelson, American astronomer and astronaut\n*  1950   – Ma Ying-jeou, Hong Kong-Taiwanese commander and politician, 12th President of the Republic of China\n*  1950   – Jurelang Zedkaia, Marshallese politician, 5th President of the Marshall Islands (d. 2015)\n*1951 – Rob Bishop, American educator and politician\n*  1951   – Didi Conn, American actress and singer\n*1954 – Ray Bright, Australian cricketer \n*  1954   – Louise Mandrell, American singer-songwriter and actress\n*1955 – Mark Mendoza, American bass player and songwriter \n*1956 – Michael Spinks, American boxer\n*1957 – Thierry Boutsen, Belgian race car driver and businessman\n*  1957   – Cameron Crowe, American director, producer, and screenwriter\n*1959 – Richard Leman, English field hockey player\n*1960 – Robert Abraham, American football player\n*  1960   – Ian Hislop, Welsh-English journalist and screenwriter\n*  1960   – Curtis Rouse, American football player (d. 2013)\n*1961 – Tahira Asif, Pakistani politician (d. 2014)\n*  1961   – Anders Jarryd, Swedish tennis player \n*  1961   – Khalid Mahmood, Pakistani-English engineer and politician\n*  1961   – Stelios Manolas, Greek footballer and manager\n*  1961   – Tim Watson, Australian footballer, coach, and journalist\n*1962 – Tom Kenny, American voice actor and screenwriter\n*  1962   – Rhonda Vincent, American singer-songwriter and mandolin player\n*1963 – Neal Foulds, English snooker player and sportscaster\n*1964 – Charlie Hides, American drag queen and comedian\n*  1964   – Paul Thorn, American singer-songwriter and guitarist\n*1965 – Eileen Ivers, American fiddler \n*  1965   – Colin van der Voort, Australian rugby league player \n*1966 – Gerald Levert, American R&B singer-songwriter, producer, and actor (d. 2006)\n*  1966   – Natalia Luis-Bassa, Venezuelan-English conductor and educator\n*1967 – Richard Marles, Australian lawyer and politician, 50th Australian Minister for Trade and Investment\n*  1967   – Mark McGowan, Australian politician, 30th Premier of Western Australia\n*1969 – Brad Godden, Australian rugby league player\n*  1969   – Ken Jeong, American actor, comedian, and physician\n*  1969   – Oleg Serebrian, Moldovan political scientist and politician \n*1970 – Andrei Tivontchik, German pole vaulter and trainer\n*1971 – Mark Neeld, Australian footballer and coach\n*1972 – Justin Edwards, English actor and writer\n*1974 – Deborah Cox, Canadian singer-songwriter and actress\n*  1974   – Jarno Trulli, Italian race car driver\n*  1975   – Mariada Pieridi, Cypriot singer-songwriter\n*1976 – Sheldon Souray, Canadian ice hockey player\n*1977 – Chris Horn, American football player\n*1978 – Ryan Ludwick, American baseball player\n*  1978   – Prodromos Nikolaidis, Greek basketball player\n*1979 – Craig Bellamy, Welsh footballer\n*  1979   – Daniel Díaz, Argentinian footballer\n*  1979   – Libuše Průšová, Czech tennis player\n*  1979   – Lucinda Ruh, Swiss figure skater and coach\n*1981 – Ágnes Kovács, Hungarian swimmer\n*  1981   – Mirco Lorenzetto, Italian cyclist\n*1982 – Shin-Soo Choo, South Korean baseball player\n*  1982   – Simon Clist, English footballer\n*  1982   – Dominic Isaacs, South African footballer\n*  1982   – Nick Kenny, Australian rugby league player\n*  1982   – Yadier Molina, Puerto Rican-American baseball player\n*1983 – Kristof Beyens, Belgian sprinter\n*  1983   – Marco Pomante, Italian footballer\n*  1983   – Liu Xiang, Chinese hurdler\n*1984 – Ida Maria, Norwegian singer-songwriter and guitarist\n*1985 – Trell Kimmons, American sprinter\n*  1985   – Guillermo Ochoa, Mexican footballer\n*  1985   – Charlotte Dujardin, English equestrian\n*1988 – Marcos Paulo Gelmini Gomes, Brazilian-Italian footballer\n*  1988   – Colton Haynes, American actor, model and singer\n*  1988   – Raúl Spank, German high jumper\n*1989 – Justin Chua, Filipino basketball player\n*  1989   – Charis Giannopoulos, Greek basketball player\n*1990 – Kieran Foran, New Zealand rugby league player\n*  1990   – Eduardo Salvio, Argentinian footballer\n*1992 – Elise Matthysen, Belgian swimmer\n*1993 – Daniel Bentley, English footballer\n*1995 – Cody Bellinger, American baseball player\n\nDeaths\n\n* 574 – Pope John III \n* 716 – Emperor Ruizong of Tang (b. 662)\n* 815 – Wu Yuanheng, Chinese poet and politician (b. 758)\n* 884 – Huang Chao, Chinese rebel leader (b. 835)\n* 939 – Pope Leo VII \n* 982 – Pandulf II of Salerno\n*   982   – Landulf IV of Benevento\n*1024 – Henry II, Holy Roman Emperor (b. 973)\n*1105 – Rashi, Jewish commentator on the Tanakh and Talmud (b. 1040)\n*1205 – Hubert Walter, English archbishop and politician, Lord Chancellor of The United Kingdom (b. 1160)\n*1357 – Bartolus de Saxoferrato Italian academic and jurist (b. 1313)\n*1380 – Bertrand du Guesclin, Constable of France (b. c. 1320)\n*1399 – Peter Parler, German architect, designed St. Vitus Cathedral and Charles Bridge (b. 1330)\n*  1399   – Elizabeth Bonifacia of Poland, Heiress presumptive of Poland (b. 1399)\n*1402 – Jianwen Emperor of China (b. 1377)\n*1491 – Afonso, Prince of Portugal (b. 1475)\n*1551 – John Wallop, English soldier and diplomat (b. 1490)\n*1617 – Adam Wenceslaus, Duke of Cieszyn (b. 1574)\n*1621 – Albert VII, Archduke of Austria (b. 1559)\n*1626 – Robert Sidney, 1st Earl of Leicester, English politician (b. 1563)\n*1628 – Robert Shirley, English soldier and diplomat (b. 1581)\n*1629 – Caspar Bartholin the Elder, Swedish physician and theologian (b. 1585)\n*1683 – Arthur Capell, 1st Earl of Essex, English politician, Lord Lieutenant of Ireland (b. 1631)\n*1755 – Edward Braddock, Scottish general (b. 1695)\n*1762 – James Bradley, English priest and astronomer (b. 1693)\n*1789 – Victor de Riqueti, marquis de Mirabeau, French economist and academic (b. 1715)\n*1793 – Jean-Paul Marat, French physician and theorist (b. 1743)\n*1807 – Henry Benedict Stuart, Italian cardinal (b. 1725)\n*1881 – John C. Pemberton, American general (b. 1814)\n*1889 – Robert Hamerling, Austrian author, poet, and playwright (b. 1830)\n*1890 – John C. Frémont, American general and politician, 5th Territorial Governor of Arizona (b. 1813)\n*  1890   – Johann Voldemar Jannsen, Estonian journalist and poet (b. 1819)\n*1893 – Young Man Afraid of His Horses, American tribal chief (b. 1836)\n*1896 – August Kekulé, German chemist and academic (b. 1829)\n*1907 – Henrik Sillem, Dutch target shooter and jurist (b. 1866)\n*1911 – Allan McLean, Scottish-Australian politician, 19th Premier of Victoria (b. 1840)\n*1921 – Gabriel Lippmann, Luxembourger physicist and academic, Nobel Prize laureate (b. 1845)\n*1922 – Martin Dies, Sr., American journalist and politician (b. 1870)\n*1927 – Mimar Kemaleddin Bey, Turkish architect and academic, designed the Tayyare Apartments (b. 1870)\n*1934 – Mary E. Byrd, American astronomer and academic (b. 1849)\n*1936 – Kojo Tovalou Houénou, Beninese lawyer and politician (b. 1887)\n*1941 – Ilmar Raud, Estonian chess player (b. 1913)\n*1945 – Alla Nazimova, Russian-American actress, producer, and screenwriter (b. 1879)\n*1946 – Alfred Stieglitz, American photographer and curator (b. 1864)\n*1949 – Walt Kuhn, American painter and academic (b. 1877)\n*1951 – Arnold Schoenberg, Austrian-American composer and painter (b. 1874)\n*1954 – Frida Kahlo, Mexican painter and educator (b. 1907)\n*1960 – Joy Davidman, American-English poet and author (b. 1915)\n*1965 – Photis Kontoglou, Greek painter and illustrator (b. 1895)\n*1967 – Tom Simpson, English cyclist (b. 1937)\n*1970 – Leslie Groves, American general and engineer (b. 1896)\n*  1970   – Sheng Shicai, Chinese warlord (b. 1895)\n*1973 – Willy Fritsch, German actor and screenwriter (b. 1901)\n*1974 – Patrick Blackett, Baron Blackett, English physicist and academic, Nobel Prize laureate (b. 1897)\n*1976 – Frederick Hawksworth, English engineer (b. 1884)\n*  1976   – Joachim Peiper, German SS officer (b. 1915)\n*1979 – Ludwig Merwart, Austrian painter and illustrator (b. 1913)\n*1980 – Seretse Khama, Botswana lawyer and politician, 1st President of Botswana (b. 1921)\n*1983 – Gabrielle Roy, Canadian engineer and author (b. 1909)\n*1993 – Davey Allison, American race car driver (b. 1961)\n*1995 – Godtfred Kirk Christiansen, Danish businessman (b. 1920)\n*1996 – Pandro S. Berman, American director, producer, and production manager (b. 1905)\n*1997 – Miguel Ángel Blanco, Spanish politician (b. 1968)\n*1999 – Konstantinos Kollias, Greek general and politician, 168th Prime Minister of Greece (b. 1901)\n*2000 – Jan Karski, Polish-American activist and academic (b. 1914)\n*2003 – Compay Segundo, Cuban singer-songwriter and guitarist (b. 1907)\n*2005 – Robert E. Ogren, American zoologist (b. 1922)\n*2006 – Red Buttons, American actor (b. 1919)\n*2007 – Michael Reardon, American mountaineer (b. 1965)\n*2008 – Bronisław Geremek, Polish historian and politician, Polish Minister of Foreign Affairs (b. 1932)\n*2010 – Manohari Singh, Indian saxophonist and composer (b. 1931)\n*  2010   – George Steinbrenner, American businessman (b. 1930)\n*2011 – Allan Jeans, Australian footballer and coach (b. 1933)\n*2012 – Warren Jabali, American basketball player (b. 1946)\n*  2012   – Jerzy Kulej, Polish boxer and politician (b. 1940)\n*  2012   – Richard D. Zanuck, American film producer (b. 1934)\n*2013 – Leonard Garment,  American lawyer and public servant, 14th White House Counsel (b. 1924)\n*  2013   – Henri Julien, French race car driver (b. 1927)\n*  2013   – Cory Monteith, Canadian actor and singer (b. 1982)\n*  2013   – Ottavio Quattrocchi, Italian businessman (b. 1938)\n*  2013   – Vernon B. Romney, American lawyer and politician, 14th Attorney General of Utah (b. 1924)\n*  2013   – Marc Simont, French-American author and illustrator (b. 1915)\n*2014 – Thomas Berger, American author and playwright (b. 1924)\n*  2014   – Alfred de Grazia, American political scientist, author, and academic (b. 1919)\n*  2014   – Nadine Gordimer, South African novelist, short story writer, and activist, Nobel Prize laureate (b. 1923)\n*  2014   – Jeff Leiding, American football player (b. 1961)\n*  2014   – Lorin Maazel, French-American violinist, composer, and conductor (b. 1930)\n*2015 – Philipp Mißfelder, German historian and politician (b. 1979)\n*  2015   – Martin Litchfield West, English scholar, author, and academic (b. 1927)\n*2017 – Liu Xiaobo, Chinese literary critic, human rights activist (b. 1955)\n\nHolidays and observances\n\n*Christian feast day:\n**Abd-al-Masih\n**Abel of Tacla Haimonot (Coptic Church)\n**Clelia Barbieri\n**Conrad Weiser (Episcopal Church (USA))\n**Eugenius of Carthage\n**Henry II, Holy Roman Emperor\n**Mildrith of Thanet\n**Silas (Catholic Church)\n**Teresa of the Andes\n**July 13 (Eastern Orthodox liturgics)\n*Feast of Kalimát, first day of the seventh month of the Bahá'í calendar. (Bahá'í Faith)\n*Statehood Day (Montenegro)\n*The last day of Naadam (Mongolia)\n*Kashmir Martyrs' Day (Pakistan)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "July 13" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15878" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* 587 BC – Babylon's siege of Jerusalem ends following the destruction of Solomon's Temple.\n*1174 – William I of Scotland, a key rebel in the Revolt of 1173–74, is captured at Alnwick by forces loyal to Henry II of England.\n*1249 – Coronation of Alexander III as King of Scots.\n*1260 – The Livonian Order suffers its greatest defeat in the 13th century in the Battle of Durbe against the Grand Duchy of Lithuania\n*1558 – Battle of Gravelines: In France, Spanish forces led by Count Lamoral of Egmont defeat the French forces of Marshal Paul de Thermes at Gravelines.\n*1573 – Eighty Years' War: The Siege of Haarlem ends after seven months.\n*1643 – English Civil War: Battle of Roundway Down: In England, Henry Wilmot, 1st Earl of Rochester, commanding the Royalist forces, heavily defeats the Parliamentarian forces led by Sir William Waller.\n*1787 – The Continental Congress enacts the Northwest Ordinance establishing governing rules for the Northwest Territory. It also establishes procedures for the admission of new states and limits the expansion of slavery.\n*1793 – Journalist and French revolutionary Jean-Paul Marat is assassinated in his bathtub by Charlotte Corday, a member of the opposing political faction.  \n*1794 – The Battle of the Vosges is fought between French forces and those of Prussia and Austria.\n*1814 – The Carabinieri, the national gendarmerie of Italy, is established.\n*1830 – The General Assembly's Institution, now the Scottish Church College, one of the pioneering institutions that ushered the Bengali renaissance, is founded by Alexander Duff and Raja Ram Mohan Roy, in Calcutta, India.\n*1854 – In the Battle of Guaymas, Mexico, General José María Yáñez stops the French invasion led by Count Gaston de Raousset-Boulbon.\n*1863 – New York City draft riots: In New York City, opponents of conscription begin three days of rioting which will be later regarded as the worst in United States history.\n*1878 – Treaty of Berlin: The European powers redraw the map of the Balkans. Serbia, Montenegro and Romania become completely independent of the Ottoman Empire.\n*1919 – The British airship R34 lands in Norfolk, England, completing the first airship return journey across the Atlantic in 182 hours of flight.\n*1923 – The Hollywood Sign is dedicated in the Hollywood Hills, Los Angeles. It originally reads \"Hollywoodland,\" but the four last letters are dropped after renovation in 1949.\n*1941 – World War II: Montenegrins begin a popular uprising against the Axis powers (Trinaestojulski ustanak).\n*1956 – John McCarthy(Dartmouth College), Marvin Minsky(MIT), Claude Shannon (Bell Labs), and Nathaniel Rochester (IBM) assemble the first coordinated research meeting on the topic of \"Artificial Intelligence\" at Dartmouth College in Hanover, NH. USA.\n*1962 – In an unprecedented action, British Prime Minister Harold Macmillan dismisses seven members of his Cabinet, marking the effective end of the National Liberals as a distinct force within British politics.\n*1973 – Alexander Butterfield reveals the existence of the \"Nixon tapes\" to the special Senate committee investigating the Watergate break-in.\n*1977 – Somalia declares war on Ethiopia, starting the Ogaden War.\n*  1977   – New York City: Amidst a period of financial and social turmoil experiences an electrical blackout lasting nearly 24 hours that leads to widespread fires and looting.\n*1985 – The Live Aid benefit concert takes place in London and Philadelphia, as well as other venues such as Moscow and Sydney.\n*  1985   – Vice President George H. W. Bush becomes the Acting President for the day when President Ronald Reagan undergoes surgery to remove polyps from his colon.\n*2003 – French DGSE personnel abort an operation to rescue Íngrid Betancourt from FARC rebels in Colombia, causing a political scandal when details are leaked to the press.\n*2008 – Battle of Wanat begins when Taliban and al-Qaeda guerrillas attack US Army and Afghan National Army troops in Afghanistan. The U.S. deaths were, at that time, the most in a single battle since the beginning of operations in 2001.\n*2011 – Mumbai is rocked by three bomb blasts during the evening rush hour, killing 26 and injuring 130.\n*  2011   – United Nations Security Council Resolution 1999 is adopted, which admits South Sudan to member status of United Nations.\n*2013 – Typhoon Soulik kills at least nine people and affects more than 160 million in East China and Taiwan.\n*2016 – Prime Minister of the United Kingdom David Cameron resigns, and is succeeded by Theresa May.\n\nBirths\n\n* 100 BC – Julius Caesar, Roman general and statesman (d. 44 BC)\n*1426 – Anne Neville, Countess of Warwick (d. 1492)\n*1478 – Giulio d'Este, illegitimate son of Italian noble (d. 1561)\n*1470 – Francesco Armellini Pantalassi de' Medici, Catholic cardinal (d. 1528)\n*1527 – John Dee, English-Welsh mathematician, astronomer, and astrologer (d. 1609)\n*1579 – Arthur Dee, English physician and chemist (d. 1651)\n*1590 – Pope Clement X (d. 1676)\n*1606 – Roland Fréart de Chambray (d. 1676)\n*1607 – Wenceslaus Hollar, Czech-English painter and illustrator (d. 1677)\n*1608 – Ferdinand III, Holy Roman Emperor (d. 1657)\n*1745 – Robert Calder, Scottish-English admiral (d. 1818)\n*1756 – Thomas Rowlandson, English artist and caricaturist (d. 1827)\n*1760 – István Pauli, Hungarian-Slovene priest and poet (d. 1829)\n*1770 – Alexander Balashov, Russian general and politician, Russian Minister of Police (d. 1837)\n*1793 – John Clare, English poet and author (d. 1864)\n*1821 – Nathan Bedford Forrest, American general and first Grand Wizard of the Ku Klux Klan (d. 1877)\n*1831 – Arthur Böttcher, German pathologist and anatomist (d. 1889)\n*1841 – Otto Wagner, Austrian architect, designed the Austrian Postal Savings Bank and Karlsplatz Stadtbahn Station (d. 1918)\n*1858 – Stewart Culin, American ethnographer and author (d. 1929)\n*1859 – Sidney Webb, 1st Baron Passfield, English economist and politician, Secretary of State for the Colonies (d. 1947)\n*1863 – Margaret Murray, British archaeologist, anthropologist, historian, and folklorist (d. 1963)\n*1864 – John Jacob Astor IV, American colonel and businessman (d. 1912)\n*1877 – Robert Henry Mathews, Australian linguist and missionary (d. 1970)\n*1884 – Yrjö Saarela, Finnish wrestler and coach (d. 1951)\n*1889 – Emma Asson, Estonian educator and politician (d. 1965)\n*  1889   – Stan Coveleski, American baseball player (d. 1984)\n*1892 – Léo-Pol Morin, Canadian pianist, composer, and educator (d. 1941)\n*  1892   – Jonni Myyrä, Finnish-American discus and javelin thrower (d. 1955)\n*1894 – Isaac Babel, Russian short story writer, journalist, and playwright (d. 1940)\n*1895 – Sidney Blackmer, American actor (d. 1973)\n*1896 – Mordecai Ardon, Israeli painter and educator (d. 1992)\n*1898 – Julius Schreck, German commander (d. 1936)\n*1900 – George Lewis, American clarinet player and songwriter (d. 1969)\n*1901 – Eric Portman, English actor (d. 1969)\n*1903 – Kenneth Clark, English historian and author (d. 1983)\n*1905 – Alfredo M. Santos, Filipino general (d. 1990)\n*  1905   – Eugenio Pagnini, Italian modern pentathlete (d. 1993)\n*  1905   – Magda Foy, American child actress (d. 2000)\n*1907 – George Weller, American author, playwright, and journalist (d. 2002)\n*1908 – Dorothy Round, English tennis player (d. 1982)\n*  1908   – Tim Spencer, American country & western singer-songwriter and actor (d. 1974)\n*1910 – Lien Gisolf, Dutch high jumper (d. 1993)\n*  1910   – Loren Pope, American journalist and author (d. 2008)\n*1913 – Dave Garroway, American journalist and television personality (d. 1982)\n*  1913   – Mærsk Mc-Kinney Møller, Danish businessman (d. 2012)\n*  1913   – Kay Linaker, American actress and screenwriter (d. 2008)\n*1915 – Kaoru Ishikawa, Japanese author and educator (d. 1989)\n*1918 – Alberto Ascari, Italian race car driver (d. 1955)\n*  1918   – Ronald Bladen, American painter and sculptor (d. 1988)\n*  1918   – Marcia Brown, American author and illustrator (d. 2015)\n*1919 – Hau Pei-tsun, 13th Premier of the Republic of China\n*  1919   – William F. Quinn, American lawyer (d. 2006)\n*1921 – Ernest Gold, Austrian-American composer and conductor (d. 1999)\n*1922 – Leslie Brooks, American actress (d. 2011)\n*  1922   – Anker Jørgensen, Danish trade union leader and politician, 16th Prime Minister of Denmark (d. 2016)\n*  1922   – Ken Mosdell, Canadian ice hockey player (d. 2006)\n*1923 – Ashley Bryan, American children's book writer & illustrator\n*1924 – Johnny Gilbert, American game show host and announcer\n*1925 – Suzanne Zimmerman, American competition swimmer and Olympic medalist\n*1926 – Robert H. Justman, American director, producer, and production manager (d. 2008)\n*  1926   – T. Loren Christianson, American politician\n*  1926   – Thomas Clark, American politician\n*1927 – Simone Veil, French lawyer and politician, 12th President of the European Parliament (d. 2017)\n*  1927   – Ian Reed, Australian discus thrower\n*1928 – Bob Crane, American actor (d. 1978)\n*  1928   – Sven Davidson, Swedish-American tennis player (d. 2008)\n*1929 – Sofia Muratova, Russian gymnast (d. 2006)\n*1930 – Sam Greenlee, American author and poet (d. 2014)\n*  1930   – Naomi Shemer, Israeli singer-songwriter (d. 2004)\n*1931 – Frank Ramsey, American basketball player and coach \n*1932 – Hubert Reeves, Canadian-French astrophysicist and author\n*1933 – David Storey, English author, playwright, and screenwriter (d. 2017)\n*  1933   – Piero Manzoni, Italian artist (d. 1963)\n*1934 – Peter Gzowski, Canadian journalist and academic (d. 2002)\n*  1934   – Gordon Lee, English footballer and manager\n*  1934   – Wole Soyinka, Nigerian author, poet, and playwright, Nobel Prize laureate\n*  1934   – Aleksei Yeliseyev, Russian engineer and astronaut\n*1935 – Jack Kemp, American football player and politician, 9th United States Secretary of Housing and Urban Development (d. 2009)\n*  1935   – Earl Lovelace, Trinidadian journalist, author, and playwright\n*  1935   – Kurt Westergaard, Danish cartoonist\n*1936 – Albert Ayler, American saxophonist and composer (d. 1970)\n*1937 – Ghillean Prance, English botanist and ecologist\n*1939 – Lambert Jackson Woodburne, South African admiral (d. 2013)\n*1940 – Tom Lichtenberg, American football player and coach (d. 2013)\n*  1940   – Paul Prudhomme, American chef and author (d. 2015)\n*  1940   – Patrick Stewart, English actor, director, and producer\n*1941 – Grahame Corling, Australian cricketer \n*  1941   – Robert Forster, American actor and producer\n*  1941   – Ehud Manor, Israeli songwriter and translator (d. 2005)\n*  1941   – Jacques Perrin, French actor, director, and producer\n*1942 – Harrison Ford, American actor and producer\n*  1942   – Roger McGuinn, American singer-songwriter and guitarist \n*1943 – Chris Serle, English journalist and actor\n*1944 – Eric Freeman, Australian cricketer \n*  1944   – Cyril Knowles, English footballer and manager (d. 1991)\n*  1944   – Erno Rubik, Hungarian game designer, architect, and educator, invented the Rubik's Cube\n*1945 – Ashley Mallett, Australian cricketer and author \n*1946 – Bob Kauffman, American basketball player and coach (d. 2015)\n*  1946   – Cheech Marin, American actor and comedian\n*1948 – Catherine Breillat, French director and screenwriter\n*1950 – George Nelson, American astronomer and astronaut\n*  1950   – Ma Ying-jeou, Hong Kong-Taiwanese commander and politician, 12th President of the Republic of China\n*  1950   – Jurelang Zedkaia, Marshallese politician, 5th President of the Marshall Islands (d. 2015)\n*1951 – Rob Bishop, American educator and politician\n*  1951   – Didi Conn, American actress and singer\n*1954 – Ray Bright, Australian cricketer \n*  1954   – Louise Mandrell, American singer-songwriter and actress\n*1955 – Mark Mendoza, American bass player and songwriter \n*1956 – Michael Spinks, American boxer\n*1957 – Thierry Boutsen, Belgian race car driver and businessman\n*  1957   – Cameron Crowe, American director, producer, and screenwriter\n*1959 – Richard Leman, English field hockey player\n*1960 – Robert Abraham, American football player\n*  1960   – Ian Hislop, Welsh-English journalist and screenwriter\n*  1960   – Curtis Rouse, American football player (d. 2013)\n*1961 – Tahira Asif, Pakistani politician (d. 2014)\n*  1961   – Anders Jarryd, Swedish tennis player \n*  1961   – Khalid Mahmood, Pakistani-English engineer and politician\n*  1961   – Stelios Manolas, Greek footballer and manager\n*  1961   – Tim Watson, Australian footballer, coach, and journalist\n*1962 – Tom Kenny, American voice actor and screenwriter\n*  1962   – Rhonda Vincent, American singer-songwriter and mandolin player\n*1963 – Neal Foulds, English snooker player and sportscaster\n*1964 – Charlie Hides, American drag queen and comedian\n*  1964   – Paul Thorn, American singer-songwriter and guitarist\n*1965 – Eileen Ivers, American fiddler \n*  1965   – Colin van der Voort, Australian rugby league player \n*1966 – Gerald Levert, American R&B singer-songwriter, producer, and actor (d. 2006)\n*  1966   – Natalia Luis-Bassa, Venezuelan-English conductor and educator\n*1967 – Richard Marles, Australian lawyer and politician, 50th Australian Minister for Trade and Investment\n*  1967   – Mark McGowan, Australian politician, 30th Premier of Western Australia\n*1969 – Brad Godden, Australian rugby league player\n*  1969   – Ken Jeong, American actor, comedian, and physician\n*  1969   – Oleg Serebrian, Moldovan political scientist and politician \n*1970 – Andrei Tivontchik, German pole vaulter and trainer\n*1971 – Mark Neeld, Australian footballer and coach\n*1972 – Justin Edwards, English actor and writer\n*1974 – Deborah Cox, Canadian singer-songwriter and actress\n*  1974   – Jarno Trulli, Italian race car driver\n*  1975   – Mariada Pieridi, Cypriot singer-songwriter\n*1976 – Sheldon Souray, Canadian ice hockey player\n*1977 – Chris Horn, American football player\n*1978 – Ryan Ludwick, American baseball player\n*  1978   – Prodromos Nikolaidis, Greek basketball player\n*1979 – Craig Bellamy, Welsh footballer\n*  1979   – Daniel Díaz, Argentinian footballer\n*  1979   – Libuše Průšová, Czech tennis player\n*  1979   – Lucinda Ruh, Swiss figure skater and coach\n*1981 – Ágnes Kovács, Hungarian swimmer\n*  1981   – Mirco Lorenzetto, Italian cyclist\n*1982 – Shin-Soo Choo, South Korean baseball player\n*  1982   – Simon Clist, English footballer\n*  1982   – Dominic Isaacs, South African footballer\n*  1982   – Nick Kenny, Australian rugby league player\n*  1982   – Yadier Molina, Puerto Rican-American baseball player\n*1983 – Kristof Beyens, Belgian sprinter\n*  1983   – Marco Pomante, Italian footballer\n*  1983   – Liu Xiang, Chinese hurdler\n*1984 – Ida Maria, Norwegian singer-songwriter and guitarist\n*1985 – Trell Kimmons, American sprinter\n*  1985   – Guillermo Ochoa, Mexican footballer\n*  1985   – Charlotte Dujardin, English equestrian\n*1988 – Marcos Paulo Gelmini Gomes, Brazilian-Italian footballer\n*  1988   – Colton Haynes, American actor, model and singer\n*  1988   – Raúl Spank, German high jumper\n*1989 – Justin Chua, Filipino basketball player\n*  1989   – Charis Giannopoulos, Greek basketball player\n*1990 – Kieran Foran, New Zealand rugby league player\n*  1990   – Eduardo Salvio, Argentinian footballer\n*1992 – Elise Matthysen, Belgian swimmer\n*1993 – Daniel Bentley, English footballer\n*1995 – Cody Bellinger, American baseball player\n\nDeaths\n\n* 574 – Pope John III \n* 716 – Emperor Ruizong of Tang (b. 662)\n* 815 – Wu Yuanheng, Chinese poet and politician (b. 758)\n* 884 – Huang Chao, Chinese rebel leader (b. 835)\n* 939 – Pope Leo VII \n* 982 – Pandulf II of Salerno\n*   982   – Landulf IV of Benevento\n*1024 – Henry II, Holy Roman Emperor (b. 973)\n*1105 – Rashi, Jewish commentator on the Tanakh and Talmud (b. 1040)\n*1205 – Hubert Walter, English archbishop and politician, Lord Chancellor of The United Kingdom (b. 1160)\n*1357 – Bartolus de Saxoferrato Italian academic and jurist (b. 1313)\n*1380 – Bertrand du Guesclin, Constable of France (b. c. 1320)\n*1399 – Peter Parler, German architect, designed St. Vitus Cathedral and Charles Bridge (b. 1330)\n*  1399   – Elizabeth Bonifacia of Poland, Heiress presumptive of Poland (b. 1399)\n*1402 – Jianwen Emperor of China (b. 1377)\n*1491 – Afonso, Prince of Portugal (b. 1475)\n*1551 – John Wallop, English soldier and diplomat (b. 1490)\n*1617 – Adam Wenceslaus, Duke of Cieszyn (b. 1574)\n*1621 – Albert VII, Archduke of Austria (b. 1559)\n*1626 – Robert Sidney, 1st Earl of Leicester, English politician (b. 1563)\n*1628 – Robert Shirley, English soldier and diplomat (b. 1581)\n*1629 – Caspar Bartholin the Elder, Swedish physician and theologian (b. 1585)\n*1683 – Arthur Capell, 1st Earl of Essex, English politician, Lord Lieutenant of Ireland (b. 1631)\n*1755 – Edward Braddock, Scottish general (b. 1695)\n*1762 – James Bradley, English priest and astronomer (b. 1693)\n*1789 – Victor de Riqueti, marquis de Mirabeau, French economist and academic (b. 1715)\n*1793 – Jean-Paul Marat, French physician and theorist (b. 1743)\n*1807 – Henry Benedict Stuart, Italian cardinal (b. 1725)\n*1881 – John C. Pemberton, American general (b. 1814)\n*1889 – Robert Hamerling, Austrian author, poet, and playwright (b. 1830)\n*1890 – John C. Frémont, American general and politician, 5th Territorial Governor of Arizona (b. 1813)\n*  1890   – Johann Voldemar Jannsen, Estonian journalist and poet (b. 1819)\n*1893 – Young Man Afraid of His Horses, American tribal chief (b. 1836)\n*1896 – August Kekulé, German chemist and academic (b. 1829)\n*1907 – Henrik Sillem, Dutch target shooter and jurist (b. 1866)\n*1911 – Allan McLean, Scottish-Australian politician, 19th Premier of Victoria (b. 1840)\n*1921 – Gabriel Lippmann, Luxembourger physicist and academic, Nobel Prize laureate (b. 1845)\n*1922 – Martin Dies, Sr., American journalist and politician (b. 1870)\n*1927 – Mimar Kemaleddin Bey, Turkish architect and academic, designed the Tayyare Apartments (b. 1870)\n*1934 – Mary E. Byrd, American astronomer and academic (b. 1849)\n*1936 – Kojo Tovalou Houénou, Beninese lawyer and politician (b. 1887)\n*1941 – Ilmar Raud, Estonian chess player (b. 1913)\n*1945 – Alla Nazimova, Russian-American actress, producer, and screenwriter (b. 1879)\n*1946 – Alfred Stieglitz, American photographer and curator (b. 1864)\n*1949 – Walt Kuhn, American painter and academic (b. 1877)\n*1951 – Arnold Schoenberg, Austrian-American composer and painter (b. 1874)\n*1954 – Frida Kahlo, Mexican painter and educator (b. 1907)\n*1960 – Joy Davidman, American-English poet and author (b. 1915)\n*1965 – Photis Kontoglou, Greek painter and illustrator (b. 1895)\n*1967 – Tom Simpson, English cyclist (b. 1937)\n*1970 – Leslie Groves, American general and engineer (b. 1896)\n*  1970   – Sheng Shicai, Chinese warlord (b. 1895)\n*1973 – Willy Fritsch, German actor and screenwriter (b. 1901)\n*1974 – Patrick Blackett, Baron Blackett, English physicist and academic, Nobel Prize laureate (b. 1897)\n*1976 – Frederick Hawksworth, English engineer (b. 1884)\n*  1976   – Joachim Peiper, German SS officer (b. 1915)\n*1979 – Ludwig Merwart, Austrian painter and illustrator (b. 1913)\n*1980 – Seretse Khama, Botswana lawyer and politician, 1st President of Botswana (b. 1921)\n*1983 – Gabrielle Roy, Canadian engineer and author (b. 1909)\n*1993 – Davey Allison, American race car driver (b. 1961)\n*1995 – Godtfred Kirk Christiansen, Danish businessman (b. 1920)\n*1996 – Pandro S. Berman, American director, producer, and production manager (b. 1905)\n*1997 – Miguel Ángel Blanco, Spanish politician (b. 1968)\n*1999 – Konstantinos Kollias, Greek general and politician, 168th Prime Minister of Greece (b. 1901)\n*2000 – Jan Karski, Polish-American activist and academic (b. 1914)\n*2003 – Compay Segundo, Cuban singer-songwriter and guitarist (b. 1907)\n*2005 – Robert E. Ogren, American zoologist (b. 1922)\n*2006 – Red Buttons, American actor (b. 1919)\n*2007 – Michael Reardon, American mountaineer (b. 1965)\n*2008 – Bronisław Geremek, Polish historian and politician, Polish Minister of Foreign Affairs (b. 1932)\n*2010 – Manohari Singh, Indian saxophonist and composer (b. 1931)\n*  2010   – George Steinbrenner, American businessman (b. 1930)\n*2011 – Allan Jeans, Australian footballer and coach (b. 1933)\n*2012 – Warren Jabali, American basketball player (b. 1946)\n*  2012   – Jerzy Kulej, Polish boxer and politician (b. 1940)\n*  2012   – Richard D. Zanuck, American film producer (b. 1934)\n*2013 – Leonard Garment,  American lawyer and public servant, 14th White House Counsel (b. 1924)\n*  2013   – Henri Julien, French race car driver (b. 1927)\n*  2013   – Cory Monteith, Canadian actor and singer (b. 1982)\n*  2013   – Ottavio Quattrocchi, Italian businessman (b. 1938)\n*  2013   – Vernon B. Romney, American lawyer and politician, 14th Attorney General of Utah (b. 1924)\n*  2013   – Marc Simont, French-American author and illustrator (b. 1915)\n*2014 – Thomas Berger, American author and playwright (b. 1924)\n*  2014   – Alfred de Grazia, American political scientist, author, and academic (b. 1919)\n*  2014   – Nadine Gordimer, South African novelist, short story writer, and activist, Nobel Prize laureate (b. 1923)\n*  2014   – Jeff Leiding, American football player (b. 1961)\n*  2014   – Lorin Maazel, French-American violinist, composer, and conductor (b. 1930)\n*2015 – Philipp Mißfelder, German historian and politician (b. 1979)\n*  2015   – Martin Litchfield West, English scholar, author, and academic (b. 1927)\n*2017 – Liu Xiaobo, Chinese literary critic, human rights activist (b. 1955)\n\nHolidays and observances\n\n*Christian feast day:\n**Abd-al-Masih\n**Abel of Tacla Haimonot (Coptic Church)\n**Clelia Barbieri\n**Conrad Weiser (Episcopal Church (USA))\n**Eugenius of Carthage\n**Henry II, Holy Roman Emperor\n**Mildrith of Thanet\n**Silas (Catholic Church)\n**Teresa of the Andes\n**July 13 (Eastern Orthodox liturgics)\n*Feast of Kalimát, first day of the seventh month of the Bahá'í calendar. (Bahá'í Faith)\n*Statehood Day (Montenegro)\n*The last day of Naadam (Mongolia)\n*Kashmir Martyrs' Day (Pakistan). July 13. http://en.wikipedia.org/?curid=15878."
  }
}
