{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12509",
  "eid" : "03100d00-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778514384,
  "textBody" : "Gloria Gaynor (born September 7, 1949) is an American singer, best known for the disco era hits \"I Will Survive\" (Hot 100 number 1, 1979), \"Never Can Say Goodbye\" (Hot 100 number 9, 1974), \"Let Me Know (I Have a Right)\" (Hot 100 number 42, 1980) and \"I Am What I Am\" (R&B number 82, 1983).\n\nEarly life\n\nGloria Fowles was born in Newark, New Jersey,Rosenfeld, Stacy (2012)Gaynor recalls how she ‘survived’ her lifestyle [http://www.northjersey.com/arts-and-entertainment/gaynor-recalls-how-she-survived-her-lifestyle-1.385374 NorthJersey.com] to Daniel Fowles and Queenie May Proctor. Her grandmother lived nearby and was involved in her upbringing. \"There was always music in our house\", Gaynor wrote in her autobiography, I Will Survive. She enjoyed listening to the radio, and to records by Nat King Cole and Sarah Vaughan. Her father played the ukulele and guitar and sang professionally in nightclubs with a group called Step 'n' Fetchit. Her brothers sang gospel and formed a quartet with a friend. Gaynor was not allowed to sing with the all-male group, nor was her younger brother, Arthur, because he was too young. Arthur later acted as a tour manager for Gaynor. The family was relatively poor, but Gaynor recalls the house being filled with laughter and happiness, and the dinner table being open to neighborhood friends. They moved to a housing project in 1960 and Gloria grew up as a tomboy. \"All through my young life I wanted to sing, although nobody in my family knew it\", Gaynor wrote in her autobiography.\n\nEarly career\n\nGaynor was a singer with the Soul Satisfiers, a jazz/R&B music band, in the 1960s. She recorded \"She'll Be Sorry/Let Me Go Baby\" (for the first time as Gloria Gaynor) in 1966, for Johnny Nash's Jocida label. Her first real success came in 1975 when she was signed to Columbia Records by Clive Davis. The fruit of that was the release of her album Never Can Say Goodbye on Columbia Records. The first side of the album consisted of three songs (\"Honey Bee\", \"Never Can Say Goodbye\" and \"Reach Out, I'll Be There\") with no break between the songs. This 19-minute dance marathon proved to be enormously popular, especially at dance clubs. All three songs were released as singles via radio edits and all of them became hits. The album was instrumental in introducing disco music to the public, \"Never Can Say Goodbye\" becoming the first song to top Billboard magazine's dance chart. The original version by The Jackson 5 was also successful on the mainstream Pop Charts, peaking at #9, and on the R&B Charts, reaching #34. It also marked her first significant chart success internationally, making it into the Top 5 in Australia, Canada, Germany and the UK. The song would go on to be certified silver by the British Phonographic Industry, and subsequently gold in the US.  Capitalizing on the success of her first album, she quickly released her second album, Experience Gloria Gaynor, later that same year. Some of her lesser-known singles, due to lack of recurrent airplay — including \"Honey Bee\" (1974), \"Casanova Brown\" (1975), and \"Let's Make A Deal\" (1976), as well as her cover of The Four Tops' \"Reach Out, I'll Be There\" (which also became a #14 hit on the UK Singles Chart) — became hits in the clubs and reached the Top 5 on Billboards disco charts. Many charted on the Hot 100 and R&B charts as well, with songs like \"(If You Want It) Do It Yourself\" - a #1 disco hit - peaking at #98 on the Pop Charts and #24 on the R&B Charts. Her cover of \"How High The Moon\" topped the US Dance Charts, and made the lower parts of both the Pop and R&B charts, as well as achieving some international chart success. After her 1976 album, I've Got You, she shifted from her hit production team, to work with other productions. Since then, Gloria Gaynor had recorded some 16 albums including one in England, One in Germany,  and 2 in Italy.\n\nMajor mainstream breakthrough\n\nIn the next few years, Gaynor released the albums Glorious and Gloria Gaynor's Park Avenue Sound, but would only enjoy a few more moderate hits. However, in late 1978, with the release of her album Love Tracks, she climbed the pop charts again with her smash hit single \"I Will Survive\". The lyrics of this song are written from the point of view of a woman, recently dumped, telling her former lover that she can cope without him and does not want anything more to do with him. The song has become something of an anthem of female emancipation. Interestingly, the song \"I Will Survive\"  was originally the B-side when Polydor Records released it in late 1978. The A-side, a song called \"Substitute\", then a recent worldwide hit for South African girl-group Clout, was considered more \"radio friendly\". Boston Disco Radio DJ Jack King, turned the record over and recalls being stunned by what he heard. \"I couldn't believe they were burying this monster hit on the B-side\", says King. \"I played it and played it and my listeners went nuts!\" This massive audience response forced the record company to flip the songs, so that subsequent copies of the single listed the more popular song on the A-side.  King was honored at New York's \"Disco Masters Awards Show\" for 3 consecutive years (1979–1981) in recognition of his relentless push of the song. The song received the Grammy Award for Best Disco Recording in 1980, the only year the award was given. It is ranked #492 on Rolling Stone magazine's list of \"the 500 Greatest Songs of All Time\", and ranked at #97 on Billboard magazine's \"All-Time Hot 100\".[1] In 2000, the song was ranked #1 in VH1's list of the 100 greatest dance songs of all time.\n\nAs a disco number, the song was unique for its time by virtue of Gaynor's having no background singers or lush production. And, unlike her first disco hits, the track was not pitched up to make it faster and to render Gaynor's recorded voice in a higher register than that in which she actually sang. Most disco hits at the time were heavily produced, with multiple voices, overdubs, and adjustments to pitch and speed. \"I Will Survive\" had a much more spare and \"clean\" sound. Had it been originally planned and released as an A-side, it would almost certainly have undergone a substantially more heavy-handed remix. In late 1979, she released the album I Have a Right which contained her next disco hit, \"Let Me Know (I Have a Right)\",  which featured Doc Severinsen of The Tonight Show fame, on trumpet solo. Gaynor also recorded a disco song called \"Love Is Just a Heartbeat Away\" in 1979 for the vampire movie Nocturna: Granddaughter of Dracula which featured a number of Disco songs.\n\nStateside career\n\nIn 1980 and again in 1981, Gaynor released two disco albums which were virtually ignored in the United States due to the backlash against disco, which began late in 1979. The album's singles barely registered on Urban contemporary radio, where disco music remained popular. In 1982, having looked into a wide variety of faiths and religious movements, she became a Christian and began to distance herself from a past she considered to be sinful. She would not release an album in 1982. In 1983, she released an album entitled Gloria Gaynor, in which she rejected disco for mid-tempo R&B and Pop style songs. The album contained a patriotic song called \"America\" as well as a new version of \"I Will Survive\". In this new version of \"I Will Survive\", she changed the lyrics of the song in order to advertise her recent conversion to Christianity. The words \"It took all the strength I had not to fall apart\" were changed to \"Only the Lord could give me strength not to fall apart\". \n\nGaynor would achieve her final success in the 1980s with the release of her album I Am Gloria Gaynor in 1984. This was mainly due to the song \"I Am What I Am\", which became a hit at dance clubs, and then on the Club Play chart in late 1983/early 1984. \"I Am What I Am\" made Gaynor a gay icon. Her 1986 album, The Power of Gloria Gaynor, was almost entirely composed of cover versions of other songs that were popular at the time. \n\nCareer revival\n\nGaynor's career received a revitalizing spark in the early and mid 1990s with the worldwide disco revival movement. During the late 1990s, she dabbled in acting for a while, guest starring on The Wayans Bros, That '70s Show (singing \"I Will Survive\"), and Ally McBeal, before doing a limited engagement performance in Broadway's Smokey Joe's Cafe. In 2001 Gaynor performed \"I Will Survive\" at the 30th Anniversary Concert for Michael Jackson.\n\nGloria Gaynor returned to the recording studio in 2002, releasing her first album in over 15 years, entitled, I Wish You Love. The two singles released from the album, \"Just Keep Thinking About You\" and \"I Never Knew\", both topped Billboard's Hot Dance Music/Club Play. Both singles also secured moderate to heavy Dance format radio airplay. The latter song also charted #30 on Billboard's Adult Contemporary chart. In 2004, Gaynor re-released her 1997 album The Answer (also released under the title What a Life) as a follow up to her successful album I Wish You Love. The album includes her popular club hit \"Oh, What a Life\".\n\nIn late 2002, Gaynor appeared with many R&B stars on the \"Rhythm, Love, and Soul\" edition of the PBS series American Soundtrack. Her performance of the Disco hit \"I Will Survive\" and new single \"I Never Knew\" was included on the accompanying live album that was released in 2004.\n\nOn September 19, 2005, Gaynor was honored twice when she and her music were inducted into the Dance Music Hall of Fame, in the \"Artist\" category along with fellow disco legends Chic and Sylvester. Her classic anthem \"I Will Survive\" was inducted under the \"Records\" category. In January 2008, The American Diabetes Association named Gaynor the Honorary Spokesperson of the 2008 NYC Step Out To Fight Diabetes Walk.\n\nMore television appearances followed in the late 2000s with 2009 appearances on  The John Kerwin Show, The Wendy Williams Show, and The View to promote the 30th anniversary of \"I Will Survive\".\nIn 2010, she appeared on Last Comic Standing and The Tonight Show.\n\nAfter almost 30 years of its release, Gaynor continues to ride the success of \"I Will Survive\", touring the country and the world over and performing her signature song on dozens of TV shows. A few successful remixes of the song during the 1990s and 2000s along with new versions of the song by Lonnie Gordon, Diana Ross, Chantay Savage, rock group Cake and others as well as constant recurrent airplay on nearly all Soft AC and Rhythmic format radio stations have helped to keep the song in the mainstream. Said Gaynor of her biggest hit in a 2012 interview \"It feels great to have such a song like that because I get kids five and six years old telling me they like the song, and then people seventy-five and eighty. It's quite an honor.\"Ask American Profile. Published in American Profile newsmagazine. January 29, 2012 edition. Page 2. The song was revived yet again in 2015 for the movie The Martian, where the sound track is used at the end as the credits roll.\n\nGaynor is a Christian and has released a Contemporary Christian album in late 2013.\n\nOn May 16, 2015, Gloria Gaynor was awarded the honorary degree of Doctor of Music by Dowling College.\nIn 2017 Gloria made a cameo appearance as a flight attendant in a Capital One commercial, while Samuel L Jackson, Charles Barkley, and Spike Lee sang \"I Will Survive\".\n\nIn 2016, Gloria Gaynor's \"I Will Survive\" was selected for induction into the Library of Congress' National Recording Registry.\n\nOn May 6, 2017, Gloria Gaynor performed with her band at the Library of Congress' celebration of disco music at Bibliodiscotheque, a disco dance party in the Great Hall of the Thomas Jefferson building.\n\nDue to the devastation wreaked by hurricane Harvey on the state of Texas in August 2017, Gaynor rewrote the lyrics to \"I Will Survive,\" changing the title to \"Texas Will Survive,\" and posted video of herself singing the song on Twitter August 30, 2017.\n\nDiscography\n\n*Never Can Say Goodbye (1975)\n*Experience Gloria Gaynor (1975)\n*I've Got You (1976)\n*Glorious (1977)\n*Gloria Gaynor's Park Avenue Sound (1978)\n*Love Tracks (1978)\n*I Have a Right (1979)\n*Stories (1980)\n*I Kinda Like Me (1981)\n*Gloria Gaynor (1982)\n*I Am Gloria Gaynor (1984)\n*The Power of Gloria Gaynor (1986)\n*The Answer (1997)\n*I Wish You Love (2002)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Gloria Gaynor" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12509" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Gloria Gaynor (born September 7, 1949) is an American singer, best known for the disco era hits \"I Will Survive\" (Hot 100 number 1, 1979), \"Never Can Say Goodbye\" (Hot 100 number 9, 1974), \"Let Me Know (I Have a Right)\" (Hot 100 number 42, 1980) and \"I Am What I Am\" (R&B number 82, 1983).\n\nEarly life\n\nGloria Fowles was born in Newark, New Jersey,Rosenfeld, Stacy (2012)Gaynor recalls how she ‘survived’ her lifestyle [http://www.northjersey.com/arts-and-entertainment/gaynor-recalls-how-she-survived-her-lifestyle-1.385374 NorthJersey.com] to Daniel Fowles and Queenie May Proctor. Her grandmother lived nearby and was involved in her upbringing. \"There was always music in our house\", Gaynor wrote in her autobiography, I Will Survive. She enjoyed listening to the radio, and to records by Nat King Cole and Sarah Vaughan. Her father played the ukulele and guitar and sang professionally in nightclubs with a group called Step 'n' Fetchit. Her brothers sang gospel and formed a quartet with a friend. Gaynor was not allowed to sing with the all-male group, nor was her younger brother, Arthur, because he was too young. Arthur later acted as a tour manager for Gaynor. The family was relatively poor, but Gaynor recalls the house being filled with laughter and happiness, and the dinner table being open to neighborhood friends. They moved to a housing project in 1960 and Gloria grew up as a tomboy. \"All through my young life I wanted to sing, although nobody in my family knew it\", Gaynor wrote in her autobiography.\n\nEarly career\n\nGaynor was a singer with the Soul Satisfiers, a jazz/R&B music band, in the 1960s. She recorded \"She'll Be Sorry/Let Me Go Baby\" (for the first time as Gloria Gaynor) in 1966, for Johnny Nash's Jocida label. Her first real success came in 1975 when she was signed to Columbia Records by Clive Davis. The fruit of that was the release of her album Never Can Say Goodbye on Columbia Records. The first side of the album consisted of three songs (\"Honey Bee\", \"Never Can Say Goodbye\" and \"Reach Out, I'll Be There\") with no break between the songs. This 19-minute dance marathon proved to be enormously popular, especially at dance clubs. All three songs were released as singles via radio edits and all of them became hits. The album was instrumental in introducing disco music to the public, \"Never Can Say Goodbye\" becoming the first song to top Billboard magazine's dance chart. The original version by The Jackson 5 was also successful on the mainstream Pop Charts, peaking at #9, and on the R&B Charts, reaching #34. It also marked her first significant chart success internationally, making it into the Top 5 in Australia, Canada, Germany and the UK. The song would go on to be certified silver by the British Phonographic Industry, and subsequently gold in the US.  Capitalizing on the success of her first album, she quickly released her second album, Experience Gloria Gaynor, later that same year. Some of her lesser-known singles, due to lack of recurrent airplay — including \"Honey Bee\" (1974), \"Casanova Brown\" (1975), and \"Let's Make A Deal\" (1976), as well as her cover of The Four Tops' \"Reach Out, I'll Be There\" (which also became a #14 hit on the UK Singles Chart) — became hits in the clubs and reached the Top 5 on Billboards disco charts. Many charted on the Hot 100 and R&B charts as well, with songs like \"(If You Want It) Do It Yourself\" - a #1 disco hit - peaking at #98 on the Pop Charts and #24 on the R&B Charts. Her cover of \"How High The Moon\" topped the US Dance Charts, and made the lower parts of both the Pop and R&B charts, as well as achieving some international chart success. After her 1976 album, I've Got You, she shifted from her hit production team, to work with other productions. Since then, Gloria Gaynor had recorded some 16 albums including one in England, One in Germany,  and 2 in Italy.\n\nMajor mainstream breakthrough\n\nIn the next few years, Gaynor released the albums Glorious and Gloria Gaynor's Park Avenue Sound, but would only enjoy a few more moderate hits. However, in late 1978, with the release of her album Love Tracks, she climbed the pop charts again with her smash hit single \"I Will Survive\". The lyrics of this song are written from the point of view of a woman, recently dumped, telling her former lover that she can cope without him and does not want anything more to do with him. The song has become something of an anthem of female emancipation. Interestingly, the song \"I Will Survive\"  was originally the B-side when Polydor Records released it in late 1978. The A-side, a song called \"Substitute\", then a recent worldwide hit for South African girl-group Clout, was considered more \"radio friendly\". Boston Disco Radio DJ Jack King, turned the record over and recalls being stunned by what he heard. \"I couldn't believe they were burying this monster hit on the B-side\", says King. \"I played it and played it and my listeners went nuts!\" This massive audience response forced the record company to flip the songs, so that subsequent copies of the single listed the more popular song on the A-side.  King was honored at New York's \"Disco Masters Awards Show\" for 3 consecutive years (1979–1981) in recognition of his relentless push of the song. The song received the Grammy Award for Best Disco Recording in 1980, the only year the award was given. It is ranked #492 on Rolling Stone magazine's list of \"the 500 Greatest Songs of All Time\", and ranked at #97 on Billboard magazine's \"All-Time Hot 100\".[1] In 2000, the song was ranked #1 in VH1's list of the 100 greatest dance songs of all time.\n\nAs a disco number, the song was unique for its time by virtue of Gaynor's having no background singers or lush production. And, unlike her first disco hits, the track was not pitched up to make it faster and to render Gaynor's recorded voice in a higher register than that in which she actually sang. Most disco hits at the time were heavily produced, with multiple voices, overdubs, and adjustments to pitch and speed. \"I Will Survive\" had a much more spare and \"clean\" sound. Had it been originally planned and released as an A-side, it would almost certainly have undergone a substantially more heavy-handed remix. In late 1979, she released the album I Have a Right which contained her next disco hit, \"Let Me Know (I Have a Right)\",  which featured Doc Severinsen of The Tonight Show fame, on trumpet solo. Gaynor also recorded a disco song called \"Love Is Just a Heartbeat Away\" in 1979 for the vampire movie Nocturna: Granddaughter of Dracula which featured a number of Disco songs.\n\nStateside career\n\nIn 1980 and again in 1981, Gaynor released two disco albums which were virtually ignored in the United States due to the backlash against disco, which began late in 1979. The album's singles barely registered on Urban contemporary radio, where disco music remained popular. In 1982, having looked into a wide variety of faiths and religious movements, she became a Christian and began to distance herself from a past she considered to be sinful. She would not release an album in 1982. In 1983, she released an album entitled Gloria Gaynor, in which she rejected disco for mid-tempo R&B and Pop style songs. The album contained a patriotic song called \"America\" as well as a new version of \"I Will Survive\". In this new version of \"I Will Survive\", she changed the lyrics of the song in order to advertise her recent conversion to Christianity. The words \"It took all the strength I had not to fall apart\" were changed to \"Only the Lord could give me strength not to fall apart\". \n\nGaynor would achieve her final success in the 1980s with the release of her album I Am Gloria Gaynor in 1984. This was mainly due to the song \"I Am What I Am\", which became a hit at dance clubs, and then on the Club Play chart in late 1983/early 1984. \"I Am What I Am\" made Gaynor a gay icon. Her 1986 album, The Power of Gloria Gaynor, was almost entirely composed of cover versions of other songs that were popular at the time. \n\nCareer revival\n\nGaynor's career received a revitalizing spark in the early and mid 1990s with the worldwide disco revival movement. During the late 1990s, she dabbled in acting for a while, guest starring on The Wayans Bros, That '70s Show (singing \"I Will Survive\"), and Ally McBeal, before doing a limited engagement performance in Broadway's Smokey Joe's Cafe. In 2001 Gaynor performed \"I Will Survive\" at the 30th Anniversary Concert for Michael Jackson.\n\nGloria Gaynor returned to the recording studio in 2002, releasing her first album in over 15 years, entitled, I Wish You Love. The two singles released from the album, \"Just Keep Thinking About You\" and \"I Never Knew\", both topped Billboard's Hot Dance Music/Club Play. Both singles also secured moderate to heavy Dance format radio airplay. The latter song also charted #30 on Billboard's Adult Contemporary chart. In 2004, Gaynor re-released her 1997 album The Answer (also released under the title What a Life) as a follow up to her successful album I Wish You Love. The album includes her popular club hit \"Oh, What a Life\".\n\nIn late 2002, Gaynor appeared with many R&B stars on the \"Rhythm, Love, and Soul\" edition of the PBS series American Soundtrack. Her performance of the Disco hit \"I Will Survive\" and new single \"I Never Knew\" was included on the accompanying live album that was released in 2004.\n\nOn September 19, 2005, Gaynor was honored twice when she and her music were inducted into the Dance Music Hall of Fame, in the \"Artist\" category along with fellow disco legends Chic and Sylvester. Her classic anthem \"I Will Survive\" was inducted under the \"Records\" category. In January 2008, The American Diabetes Association named Gaynor the Honorary Spokesperson of the 2008 NYC Step Out To Fight Diabetes Walk.\n\nMore television appearances followed in the late 2000s with 2009 appearances on  The John Kerwin Show, The Wendy Williams Show, and The View to promote the 30th anniversary of \"I Will Survive\".\nIn 2010, she appeared on Last Comic Standing and The Tonight Show.\n\nAfter almost 30 years of its release, Gaynor continues to ride the success of \"I Will Survive\", touring the country and the world over and performing her signature song on dozens of TV shows. A few successful remixes of the song during the 1990s and 2000s along with new versions of the song by Lonnie Gordon, Diana Ross, Chantay Savage, rock group Cake and others as well as constant recurrent airplay on nearly all Soft AC and Rhythmic format radio stations have helped to keep the song in the mainstream. Said Gaynor of her biggest hit in a 2012 interview \"It feels great to have such a song like that because I get kids five and six years old telling me they like the song, and then people seventy-five and eighty. It's quite an honor.\"Ask American Profile. Published in American Profile newsmagazine. January 29, 2012 edition. Page 2. The song was revived yet again in 2015 for the movie The Martian, where the sound track is used at the end as the credits roll.\n\nGaynor is a Christian and has released a Contemporary Christian album in late 2013.\n\nOn May 16, 2015, Gloria Gaynor was awarded the honorary degree of Doctor of Music by Dowling College.\nIn 2017 Gloria made a cameo appearance as a flight attendant in a Capital One commercial, while Samuel L Jackson, Charles Barkley, and Spike Lee sang \"I Will Survive\".\n\nIn 2016, Gloria Gaynor's \"I Will Survive\" was selected for induction into the Library of Congress' National Recording Registry.\n\nOn May 6, 2017, Gloria Gaynor performed with her band at the Library of Congress' celebration of disco music at Bibliodiscotheque, a disco dance party in the Great Hall of the Thomas Jefferson building.\n\nDue to the devastation wreaked by hurricane Harvey on the state of Texas in August 2017, Gaynor rewrote the lyrics to \"I Will Survive,\" changing the title to \"Texas Will Survive,\" and posted video of herself singing the song on Twitter August 30, 2017.\n\nDiscography\n\n*Never Can Say Goodbye (1975)\n*Experience Gloria Gaynor (1975)\n*I've Got You (1976)\n*Glorious (1977)\n*Gloria Gaynor's Park Avenue Sound (1978)\n*Love Tracks (1978)\n*I Have a Right (1979)\n*Stories (1980)\n*I Kinda Like Me (1981)\n*Gloria Gaynor (1982)\n*I Am Gloria Gaynor (1984)\n*The Power of Gloria Gaynor (1986)\n*The Answer (1997)\n*I Wish You Love (2002). Gloria Gaynor. http://en.wikipedia.org/?curid=12509."
  }
}
