{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7294",
  "eid" : "e0dfea20-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778457026,
  "textBody" : "Cartography (from Greek χάρτης khartēs, \"papyrus, sheet of paper, map\"; and γράφειν graphein, \"write\") is the study and practice of making maps. Combining science, aesthetics, and technique, cartography builds on the premise that reality can be modeled in ways that communicate spatial information effectively.\n\nThe fundamental problems of traditional cartography are to:\n* Set the map's agenda and select traits of the object to be mapped. This is the concern of map editing. Traits may be physical, such as roads or land masses, or may be abstract, such as toponyms or political boundaries.\n* Represent the terrain of the mapped object on flat media. This is the concern of map projections.\n* Eliminate characteristics of the mapped object that are not relevant to the map's purpose. This is the concern of generalization.\n* Reduce the complexity of the characteristics that will be mapped. This is also the concern of generalization.\n* Orchestrate the elements of the map to best convey its message to its audience. This is the concern of map design.\n\nModern cartography constitutes many theoretical and practical foundations of geographic information systems.\n\nHistory\n\nThe earliest known map is a matter of some debate, both because the term \"map\" isn't well-defined and because some artifacts that might be maps might actually be something else. A wall painting that might depict the ancient Anatolian city of Çatalhöyük (previously known as Catal Huyuk or Çatal Hüyük) has been dated to the late 7th millennium BCE. Among the prehistoric alpine rock carvings of Mount Bego (F) and Valcamonica (I), dated to the 4th millennium BCE, geometric patterns consisting of dotted rectangles and lines are widely interpretedBicknell, Clarence (1913). A Guide to the prehistoric Engravings in the Italian Maritime Alps, Bordighera.Delano Smith, Catherine (1987). Cartography in the Prehistoric Period in the Old World: Europe, the Middle East, and North Africa. In: Harley J.B., Woodward D. (eds.), The History of Cartography: Cartography in Prehistoric, Ancient and Mediaeval Europe and the Mediterranean v. 1, Chicago: 54-101 [http://www.press.uchicago.edu/books/HOC/HOC_V1/HOC_VOLUME1_chapter4.pdf online], retrieved December 2, 2014. in archaeological literature as a depiction of cultivated plots.Arcà, Andrea (2004). The topographic engravings of the Alpine rock-art: fields, settlements and agricultural landscapes. In Chippindale C., Nash G. (eds.) The figured landscapes of Rock-Art, Cambridge University Press, pp. 318-349; [https://www.academia.edu/1154206/Arc%C3%A0_Andrea_2004._The_topographic_engravings_of_the_alpine_rock-art_fields_settlements_and_agricultural_landscapes online academia.edu], retrieved December 2, 2014. Other known maps of the ancient world include the Minoan \"House of the Admiral\" wall painting from c. 1600 BCE, showing a seaside community in an oblique perspective and an engraved map of the holy Babylonian city of Nippur, from the Kassite period (14th12th centuries BCE).[https://oi.uchicago.edu/research/projects/nippur-expedition Uchicago.edu]  The Nippur Expedition The oldest surviving world maps are from 9th century BCE Babylonia. One shows Babylon on the Euphrates, surrounded by Assyria, Urartu and several cities, all, in turn, surrounded by a \"bitter river\" (Oceanus). Another depicts Babylon as being north of the world center.\n\nThe ancient Greeks and Romans created maps since  Anaximander in the 6th century BCE. In the 2nd century AD, Ptolemy wrote his treatise on cartography, Geographia.J. L. Berggren, Alexander Jones; Ptolemy's Geography By Ptolemy, Princeton University Press, 2001  This contained Ptolemy's world map – the world then known to Western society (Ecumene). As early as the 8th century, Arab scholars were translating the works of the Greek geographers into Arabic.\n\nIn ancient China, geographical literature dates to the 5th century BCE. The oldest extant Chinese maps come from the State of Qin, dated back to the 4th century BCE, during the Warring States period. In the book of the Xin Yi Xiang Fa Yao, published in 1092 by the Chinese scientist Su Song, a star map on the equidistant cylindrical projection. Although this method of charting seems to have existed in China even prior to this publication and scientist, the greatest significance of the star maps by Su Song is that they represent the oldest existent star maps in printed form.\n\nEarly forms of cartography of India included depictions of the pole star and surrounding constellations. These charts may have been used for navigation.\n\nMappa mundi are the Medieval European maps of the world. Approximately 1,100 mappae mundi are known to have survived from the Middle Ages. Of these, some 900 are found illustrating manuscripts and the remainder exist as stand-alone documents.Woodward, p. 286 \n\nThe Arab geographer Muhammad al-Idrisi produced his medieval atlas Tabula Rogeriana in 1154. He incorporated the knowledge of Africa, the Indian Ocean and the Far East, gathered by Arab merchants and explorers with the information inherited from the classical geographers to create the most accurate map of the world up until his time. It remained the most accurate world map for the next three centuries.S. P. Scott (1904), History of the Moorish Empire, pp. 461–462.\n\nIn the Age of Exploration, from the 15th century to the 17th century, European cartographers both copied earlier maps (some of which had been passed down for centuries) and drew their own based on explorers' observations and new surveying techniques. The invention of the magnetic compass, telescope and sextant enabled increasing accuracy. In 1492, Martin Behaim, a German cartographer, made the oldest extant globe of the Earth.[https://www.loc.gov/rr/geogmap/guide/gmillgtm.html Globes and Terrain Models – Geography and Maps: An Illustrated Guide], Library of Congress\n\nJohannes Werner refined and promoted the Werner projection. In 1507, Martin Waldseemüller produced a globular world map and a large 12-panel world wall map (Universalis Cosmographia) bearing the first use of the name \"America\". Portuguese cartographer Diego Ribero was the author of the first known planisphere with a graduated Equator (1527). Italian cartographer Battista Agnese produced at least 71 manuscript atlases of sea charts.\n\nDue to the sheer physical difficulties inherent in cartography, map-makers frequently lifted material from earlier works without giving credit to the original cartographer. For example, one of the most famous early maps of North America is unofficially known as the \"Beaver Map\", published in 1715 by Herman Moll. This map is an exact reproduction of a 1698 work by Nicolas de Fer. De Fer in turn had copied images that were first printed in books by Louis Hennepin, published in 1697, and François Du Creux, in 1664. By the 18th century, map-makers started to give credit to the original engraver by printing the phrase \"After [the original cartographer]\" on the work.\"Map Imitation\" in [http://www.collectionscanada.gc.ca/forgery/002035-3000-e.html Detecting the Truth: Fakes, Forgeries and Trickery], a virtual museum exhibition at Library and Archives Canada\n\nTechnological changes\n\nIn cartography, technology has continually changed in order to meet the demands of new generations of mapmakers and map users. The first maps were manually constructed with brushes and parchment; therefore, varied in quality and were limited in distribution. The advent of magnetic devices, such as the compass and much later, magnetic storage devices, allowed for the creation of far more accurate maps and the ability to store and manipulate them digitally.\n\nAdvances in mechanical devices such as the printing press, quadrant and vernier, allowed for the mass production of maps and the ability to make accurate reproductions from more accurate data. Optical technology, such as the telescope, sextant and other devices that use telescopes, allowed for accurate surveying of land and the ability of mapmakers and navigators to find their latitude by measuring angles to the North Star at night or the sun at noon.\n\nAdvances in photochemical technology, such as the lithographic and photochemical processes, have allowed for the creation of maps that have fine details, do not distort in shape and resist moisture and wear. This also eliminated the need for engraving, which further shortened the time it takes to make and reproduce maps.\n\nIn the 20th century, aerial photography, satellite imagery, and remote sensing provided efficient, precise methods for mapping physical features, such as coastlines, roads, buildings, watersheds, and topography. Advancements in electronic technology ushered in another revolution in cartography. Ready availability of computers and peripherals such as monitors, plotters, printers, scanners (remote and document) and analytic stereo plotters, along with computer programs for visualization, image processing, spatial analysis, and database management, democratized and greatly expanded the making of maps. The ability to superimpose spatially located variables onto existing maps created new uses for maps and new industries to explore and exploit these potentials. See also digital raster graphic.\n\nThese days most commercial-quality maps are made using software that falls into one of three main types: CAD, GIS and specialized illustration software. Spatial information can be stored in a database, from which it can be extracted on demand. These tools lead to increasingly dynamic, interactive maps that can be manipulated digitally.\n\nField-rugged computers, GPS, and laser rangefinders make it possible to create maps directly from measurements made on site.\n\nDeconstruction\n\nThere are technical and cultural aspects to the producing maps. In this sense, maps are biased. The study of bias, influence, and agenda in making a map is what comprise a map's deconstruction. A central tenet of deconstructionism is that maps have power. Other assertions are that maps are inherently biased and that we search for metaphor and rhetoric in maps.\n\nIt was the Europeans who promoted an epistemological understanding of the map as early as the 17th century.[http://quod.lib.umich.edu/p/passages/4761530.0003.008/--deconstructing-the-map?rgn\nmain;viewfulltext Harley, J. B. (1989). \"Deconstructing the Map\". Cartographica, Vol. 26, No. 2. pp 1-5] An example of this understanding is that, \"[European reproduction of terrain on maps] reality can be expressed in mathematical terms; that systematic observation and measurement offer the only route to cartographic truth…\". 17th century map-makers were careful and precise in their strategic approaches to maps based on a scientific model of knowledge. Popular belief at the time was that this scientific approach to cartography was immune to the social atmosphere.\n\nA common belief is that science heads in a direction of progress, and thus leads to more accurate representations of maps. In this belief European maps must be superior to others, which necessarily employed different map-making skills. \"There was a 'not cartography' land where lurked an army of inaccurate, heretical, subjective, valuative, and ideologically distorted images. Cartographers developed a 'sense of the other' in relation to nonconforming maps.\"\n\nThough cartography has been a target of much criticism in recent decades, a cartographer's 'black box' always seemed to be naturally defended to the point where it overcame the criticism. However, to later scholars in the field, it was evident that cultural influences dominate map-making. For instance, certain abstracts on maps and the map-making society itself describe the social influences on the production of maps. This social play on cartographic knowledge \"…produces the 'order' of [maps'] features and the 'hierarchies of its practices.'\"Michel Foucault, The Order of Things: An Archaeology of the Human Sciences. A Translation of Les mots et les choses. New York: Vintage Books, 1973.\n\nDepictions of Africa are a common target of deconstructionism.Stone, Jeffrey C. (1988). \"Imperialism, Colonialism and Cartography\". Transactions of the Institute of British Geographers, N.S. 13. Pp 57. According to deconstructionist models, cartography was used for strategic purposes associated with imperialism and as instruments and representations of powerBassett, J. T. (1994). \"Cartography and Empire Building in the Nineteenth-Century West Africa\". Geographical Review, Vol. 84, No. 3. Pp 316. during the conquest of Africa. The depiction of Africa and the low latitudes in general on the Mercator projection has been interpreted as imperialistic and as symbolic of subjugation due to the diminished proportions of those regions compared to higher latitudes where the European powers were concentrated.Monmonier, Mark (2004). Rhumb Lines and Map Wars: A Social History of the Mercator Projection p. 152. Chicago: The University of Chicago Press. (Thorough treatment of the social history of the Mercator projection and Gall–Peters projections.)\n\nMaps furthered imperialism and colonization of Africa through practical ways such as showing basic information like roads, terrain, natural resources, settlements, and communities. Through this, maps made European commerce in Africa possible by showing potential commercial routes, and made natural resource extraction possible by depicting locations of resources. Such maps also enabled military conquests and made them more efficient, and imperial nations further used them to put their conquests on display. These same maps were then used to cement territorial claims, such as at the Berlin Conference of 1884–1885.\n\nBefore 1749, maps of the African continent had African kingdoms drawn with assumed or contrived boundaries, with unknown or unexplored areas having drawings of animals, imaginary physical geographic features, and descriptive texts. In 1748 Jean B. B. d'Anville created the first map of the African continent that had blank spaces to represent the unknown territory. This was revolutionary in cartography and the representation of power associated with map making.\n\nMap types\n\nGeneral vs. thematic cartography\n\nIn understanding basic maps, the field of cartography can be divided into two general categories: general cartography and thematic cartography. General cartography involves those maps that are constructed for a general audience and thus contain a variety of features. General maps exhibit many reference and location systems and often are produced in a series. For example, the 1:24,000 scale topographic maps of the United States Geological Survey (USGS) are a standard as compared to the 1:50,000 scale Canadian maps. The government of the UK produces the classic 1:50,000 (replacing the older 1 inch to 1 mile) \"Ordnance Survey\" maps of the entire UK and with a range of correlated larger- and smaller-scale maps of great detail. Many private mapping companies have also produce thematic map series.\n\nThematic cartography involves maps of specific geographic themes, oriented toward specific audiences. A couple of examples might be a dot map showing corn production in Indiana or a shaded area map of Ohio counties, divided into numerical choropleth classes. As the volume of geographic data has exploded over the last century, thematic cartography has become increasingly useful and necessary to interpret spatial, cultural and social data.\n\nAn orienteering map combines both general and thematic cartography, designed for a very specific user community. The most prominent thematic element is shading, that indicates degrees of difficulty of travel due to vegetation. The vegetation itself is not identified, merely classified by the difficulty (\"fight\") that it presents.\n\nTopographic vs. topological\n\nA topographic map is primarily concerned with the topographic description of a place, including (especially in the 20th and 21st centuries) the use of contour lines showing elevation. Terrain or relief can be shown in a variety of ways (see Cartographic relief depiction).\n\nA topological map is a very general type of map, the kind one might sketch on a napkin. It often disregards scale and detail in the interest of clarity of communicating specific route or relational information. Beck's London Underground map is an iconic example. Though the most widely used map of \"The Tube,\" it preserves little of reality: it varies scale constantly and abruptly, it straightens curved tracks, and it contorts directions. The only topography on it is the River Thames, letting the reader know whether a station is north or south of the river. That and the topology of station order and interchanges between train lines are all that is left of the geographic space. Yet those are all a typical passenger wishes to know, so the map fulfils its purpose.\n\nMap design\n\nMap purpose and selection of information\n\nArthur H. Robinson, an American cartographer influential in thematic cartography, stated that a map not properly designed \"will be a cartographic failure.\" He also claimed, when considering all aspects of cartography, that \"map design is perhaps the most complex.\" Robinson codified the mapmaker's understanding that a map must be designed foremost with consideration to the audience and its needs.\n\nFrom the very beginning of mapmaking, maps \"have been made for some particular purpose or set of purposes\". The intent of the map should be illustrated in a manner in which the percipient acknowledges its purpose in a timely fashion. The term percipient refers to the person receiving information and was coined by Robinson. The principle of figure-ground refers to this notion of engaging the user by presenting a clear presentation, leaving no confusion concerning the purpose of the map. This will enhance the user's experience and keep his attention. If the user is unable to identify what is being demonstrated in a reasonable fashion, the map may be regarded as useless.\n\nMaking a meaningful map is the ultimate goal. Alan MacEachren explains that a well designed map \"is convincing because it implies authenticity\" (1994, pp. 9). An interesting map will no doubt engage a reader. Information richness or a map that is multivariate shows relationships within the map. Showing several variables allows comparison, which adds to the meaningfulness of the map. This also generates hypothesis and stimulates ideas and perhaps further research. In order to convey the message of the map, the creator must design it in a manner which will aid the reader in the overall understanding of its purpose. The title of a map may provide the \"needed link\" necessary for communicating that message, but the overall design of the map fosters the manner in which the reader interprets it (Monmonier, 1993, pp. 93).\n\nIn the 21st century it is possible to find a map of virtually anything from the inner workings of the human body to the virtual worlds of cyberspace. Therefore, there are now a huge variety of different styles and types of map – for example, one area which has evolved a specific and recognisable variation are those used by public transport organisations to guide passengers, namely urban rail and metro maps, many of which are loosely based on 45 degree angles as originally perfected by Harry Beck and George Dow.\n\nNaming conventions\n\nMost maps use text to label places and for such things as the map title, legend and other information. Although maps are often made in one specific language, place names often differ between languages. So a map made in English may use the name Germany for that country, while a German map would use Deutschland and a French map Allemagne. A non-native term for a place is referred to as an exonym.\n\nIn some cases the correct name is not clear. For example, the nation of Burma officially changed its name to Myanmar, but many nations do not recognize the ruling junta and continue to use Burma. Sometimes an official name change is resisted in other languages and the older name may remain in common use. Examples include the use of Saigon for Ho Chi Minh City, Bangkok for Krung Thep and Ivory Coast for Côte d'Ivoire.\n\nDifficulties arise when transliteration or transcription between writing systems is required. Some well-known places have well-established names in other languages and writing systems, such as Russia or Rußland for Росси́я, but in other cases a system of transliteration or transcription is required. Even in the former case, the exclusive use of an exonym may be unhelpful for the map user. It will not be much use for an English user of a map of Italy to show Livorno only as \"Leghorn\" when road signs and railway timetables show it as \"Livorno\". In transliteration, the characters in one script are represented by characters in another. For example, the Cyrillic letter Р is usually written as R in the Latin script, although in many cases it is not as simple as a one-for-one equivalence. Systems exist for transliteration of Arabic, but the results may vary. For example, the Yemeni city of Mocha is written variously in English as Mocha, Al Mukha, al-Mukhā, Mocca and Moka. Transliteration systems are based on relating written symbols to one another, while transcription is the attempt to spell in one language the phonetic sounds of another. Chinese writing is now usually converted to the Latin alphabet through the Pinyin phonetic transcription systems. Other systems were used in the past, such as Wade-Giles, resulting in the city being spelled Beijing on newer English maps and Peking on older ones.\n\nFurther difficulties arise when countries, especially former colonies, do not have a strong national geographic naming standard. In such cases, cartographers may have to choose between various phonetic spellings of local names versus older imposed, sometimes resented, colonial names. Some countries have multiple official languages, resulting in multiple official placenames. For example, the capital of Belgium is both Brussel and Bruxelles. In Canada, English and French are official languages and places have names in both languages. British Columbia is also officially named la Colombie-Britannique. English maps rarely show the French names outside of Quebec, which itself is spelled Québec in French.\n\nThe study of placenames is called toponymy, while that of the origin and historical usage of placenames as words is etymology.\n\nIn order to improve legibility or to aid the illiterate, some maps have been produced using pictograms to represent places. The iconic example of this practice is Lance Wyman's early plans for the Mexico City Metro, on which stations were shown simply as stylized logos. Wyman also prototyped such a map for the Washington Metro, though ultimately the idea was rejected. Other cities experimenting with such maps are Fukuoka, Guadalajara and Monterrey.\n\nMap symbology\n\nCartographic symbology encodes information on the map in ways intended to convey information to the map reader efficiently, taking into consideration the limited space on the map, models of human understanding through visual means, and the likely cultural background and education of the map reader. Symbology may be implicit, using universal elements of design, or may be more specific to cartography or even to the map.\n\nA map may have any of many kinds of symbolization. Some examples are:\n* A legend, or key, explains the map's pictorial language.\n* A title indicates the region and perhaps the theme that the map portrays.\n* A neatline frames the entire map image.\n* A compass rose or north arrow provides orientation.\n* An overview map gives global context for the primary map.\n* A bar scale translates between map measurements and real distances.\n* A map projection provides a way to represent the curved surface on the plane of the map.\n\nThe map may declare its sources, accuracy, publication date and authorship, and so forth. The map image itself portrays the region.\n\nMap coloring is another form of symbology, one whose importance can reach beyond aesthetic. In complex thematic maps, for example, the color scheme's structure can critically affect the reader's ability to understand the map's information. Modern computer displays and print technologies can reproduce much of the gamut that humans can perceive, allowing for intricate exploitation of human visual discrimination in order to convey detailed information.\n\nQuantitative symbols give a visual indication of the magnitude of the phenomenon that the symbol represents. Two major classes of symbols are used to portray quantity. Proportional symbols change size according to phenomenon’s magnitude, making them appropriate for representing statistics. Choropleth maps portray data collection areas, such as counties or census tracts, with color. Using color this way, the darkness and intensity (or value) of the color is evaluated by the eye as a measure of intensity or concentration.\n\nMap key or legend\n\nThe map key, or legend, describes how to interpret the map's symbols and may give details of publication and authorship.\n\nExamples of point symbols\n\nMap generalization\n\nA good map has to compromise between portraying the items of interest (or themes) in the right place on the map, and the need to show that item using text or a symbol, which take up space on the map and might displace some other item of information. The cartographer is thus constantly making judgements about what to include, what to leave out and what to show in a slightly incorrect place. This issue assumes more importance as the scale of the map gets smaller (i.e. the map shows a larger area) because the information shown on the map takes up more space on the ground. A good example from the late 1980s was the Ordnance Survey's first digital maps, where the absolute positions of major roads were sometimes a scale distance of hundreds of metres away from ground truth, when shown on digital maps at scales of 1:250,000 and 1:625,000, because of the overriding need to annotate the features.\n\nMap projections\n\nThe Earth being spherical, any flat representation generates distortions such that shapes and areas cannot both be conserved simultaneously, and distances can never all be preserved. The mapmaker must choose a suitable map projection according to the space to be mapped and the purpose of the map.\n\nCartographic errors\n\nSome maps contain deliberate errors or distortions, either as propaganda or as a \"watermark\" to help the copyright owner identify infringement if the error appears in competitors' maps. The latter often come in the form of nonexistent, misnamed, or misspelled \"trap streets\". Other names and forms for this are paper townsites, fictitious entries, and copyright easter eggs.[http://wiki.openstreetmap.org/wiki/Copyright_Easter_Eggs Openstreetmap.org Copyright Easter Eggs]\n\nAnother motive for deliberate errors is cartographic \"vandalism\": a mapmaker wishing to leave his or her mark on the work. Mount Richard, for example, was a fictitious peak on the Rocky Mountains' continental divide that appeared on a Boulder County, Colorado map in the early 1970s. It is believed to be the work of draftsman Richard Ciacci. The fiction was not discovered until two years later.\n\nSandy Island (New Caledonia) is an example of a fictitious location that stubbornly survives, reappearing on new maps copied from older maps while being deleted from other new editions.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Cartography" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7294" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Cartography (from Greek χάρτης khartēs, \"papyrus, sheet of paper, map\"; and γράφειν graphein, \"write\") is the study and practice of making maps. Combining science, aesthetics, and technique, cartography builds on the premise that reality can be modeled in ways that communicate spatial information effectively.\n\nThe fundamental problems of traditional cartography are to:\n* Set the map's agenda and select traits of the object to be mapped. This is the concern of map editing. Traits may be physical, such as roads or land masses, or may be abstract, such as toponyms or political boundaries.\n* Represent the terrain of the mapped object on flat media. This is the concern of map projections.\n* Eliminate characteristics of the mapped object that are not relevant to the map's purpose. This is the concern of generalization.\n* Reduce the complexity of the characteristics that will be mapped. This is also the concern of generalization.\n* Orchestrate the elements of the map to best convey its message to its audience. This is the concern of map design.\n\nModern cartography constitutes many theoretical and practical foundations of geographic information systems.\n\nHistory\n\nThe earliest known map is a matter of some debate, both because the term \"map\" isn't well-defined and because some artifacts that might be maps might actually be something else. A wall painting that might depict the ancient Anatolian city of Çatalhöyük (previously known as Catal Huyuk or Çatal Hüyük) has been dated to the late 7th millennium BCE. Among the prehistoric alpine rock carvings of Mount Bego (F) and Valcamonica (I), dated to the 4th millennium BCE, geometric patterns consisting of dotted rectangles and lines are widely interpretedBicknell, Clarence (1913). A Guide to the prehistoric Engravings in the Italian Maritime Alps, Bordighera.Delano Smith, Catherine (1987). Cartography in the Prehistoric Period in the Old World: Europe, the Middle East, and North Africa. In: Harley J.B., Woodward D. (eds.), The History of Cartography: Cartography in Prehistoric, Ancient and Mediaeval Europe and the Mediterranean v. 1, Chicago: 54-101 [http://www.press.uchicago.edu/books/HOC/HOC_V1/HOC_VOLUME1_chapter4.pdf online], retrieved December 2, 2014. in archaeological literature as a depiction of cultivated plots.Arcà, Andrea (2004). The topographic engravings of the Alpine rock-art: fields, settlements and agricultural landscapes. In Chippindale C., Nash G. (eds.) The figured landscapes of Rock-Art, Cambridge University Press, pp. 318-349; [https://www.academia.edu/1154206/Arc%C3%A0_Andrea_2004._The_topographic_engravings_of_the_alpine_rock-art_fields_settlements_and_agricultural_landscapes online academia.edu], retrieved December 2, 2014. Other known maps of the ancient world include the Minoan \"House of the Admiral\" wall painting from c. 1600 BCE, showing a seaside community in an oblique perspective and an engraved map of the holy Babylonian city of Nippur, from the Kassite period (14th12th centuries BCE).[https://oi.uchicago.edu/research/projects/nippur-expedition Uchicago.edu]  The Nippur Expedition The oldest surviving world maps are from 9th century BCE Babylonia. One shows Babylon on the Euphrates, surrounded by Assyria, Urartu and several cities, all, in turn, surrounded by a \"bitter river\" (Oceanus). Another depicts Babylon as being north of the world center.\n\nThe ancient Greeks and Romans created maps since  Anaximander in the 6th century BCE. In the 2nd century AD, Ptolemy wrote his treatise on cartography, Geographia.J. L. Berggren, Alexander Jones; Ptolemy's Geography By Ptolemy, Princeton University Press, 2001  This contained Ptolemy's world map – the world then known to Western society (Ecumene). As early as the 8th century, Arab scholars were translating the works of the Greek geographers into Arabic.\n\nIn ancient China, geographical literature dates to the 5th century BCE. The oldest extant Chinese maps come from the State of Qin, dated back to the 4th century BCE, during the Warring States period. In the book of the Xin Yi Xiang Fa Yao, published in 1092 by the Chinese scientist Su Song, a star map on the equidistant cylindrical projection. Although this method of charting seems to have existed in China even prior to this publication and scientist, the greatest significance of the star maps by Su Song is that they represent the oldest existent star maps in printed form.\n\nEarly forms of cartography of India included depictions of the pole star and surrounding constellations. These charts may have been used for navigation.\n\nMappa mundi are the Medieval European maps of the world. Approximately 1,100 mappae mundi are known to have survived from the Middle Ages. Of these, some 900 are found illustrating manuscripts and the remainder exist as stand-alone documents.Woodward, p. 286 \n\nThe Arab geographer Muhammad al-Idrisi produced his medieval atlas Tabula Rogeriana in 1154. He incorporated the knowledge of Africa, the Indian Ocean and the Far East, gathered by Arab merchants and explorers with the information inherited from the classical geographers to create the most accurate map of the world up until his time. It remained the most accurate world map for the next three centuries.S. P. Scott (1904), History of the Moorish Empire, pp. 461–462.\n\nIn the Age of Exploration, from the 15th century to the 17th century, European cartographers both copied earlier maps (some of which had been passed down for centuries) and drew their own based on explorers' observations and new surveying techniques. The invention of the magnetic compass, telescope and sextant enabled increasing accuracy. In 1492, Martin Behaim, a German cartographer, made the oldest extant globe of the Earth.[https://www.loc.gov/rr/geogmap/guide/gmillgtm.html Globes and Terrain Models – Geography and Maps: An Illustrated Guide], Library of Congress\n\nJohannes Werner refined and promoted the Werner projection. In 1507, Martin Waldseemüller produced a globular world map and a large 12-panel world wall map (Universalis Cosmographia) bearing the first use of the name \"America\". Portuguese cartographer Diego Ribero was the author of the first known planisphere with a graduated Equator (1527). Italian cartographer Battista Agnese produced at least 71 manuscript atlases of sea charts.\n\nDue to the sheer physical difficulties inherent in cartography, map-makers frequently lifted material from earlier works without giving credit to the original cartographer. For example, one of the most famous early maps of North America is unofficially known as the \"Beaver Map\", published in 1715 by Herman Moll. This map is an exact reproduction of a 1698 work by Nicolas de Fer. De Fer in turn had copied images that were first printed in books by Louis Hennepin, published in 1697, and François Du Creux, in 1664. By the 18th century, map-makers started to give credit to the original engraver by printing the phrase \"After [the original cartographer]\" on the work.\"Map Imitation\" in [http://www.collectionscanada.gc.ca/forgery/002035-3000-e.html Detecting the Truth: Fakes, Forgeries and Trickery], a virtual museum exhibition at Library and Archives Canada\n\nTechnological changes\n\nIn cartography, technology has continually changed in order to meet the demands of new generations of mapmakers and map users. The first maps were manually constructed with brushes and parchment; therefore, varied in quality and were limited in distribution. The advent of magnetic devices, such as the compass and much later, magnetic storage devices, allowed for the creation of far more accurate maps and the ability to store and manipulate them digitally.\n\nAdvances in mechanical devices such as the printing press, quadrant and vernier, allowed for the mass production of maps and the ability to make accurate reproductions from more accurate data. Optical technology, such as the telescope, sextant and other devices that use telescopes, allowed for accurate surveying of land and the ability of mapmakers and navigators to find their latitude by measuring angles to the North Star at night or the sun at noon.\n\nAdvances in photochemical technology, such as the lithographic and photochemical processes, have allowed for the creation of maps that have fine details, do not distort in shape and resist moisture and wear. This also eliminated the need for engraving, which further shortened the time it takes to make and reproduce maps.\n\nIn the 20th century, aerial photography, satellite imagery, and remote sensing provided efficient, precise methods for mapping physical features, such as coastlines, roads, buildings, watersheds, and topography. Advancements in electronic technology ushered in another revolution in cartography. Ready availability of computers and peripherals such as monitors, plotters, printers, scanners (remote and document) and analytic stereo plotters, along with computer programs for visualization, image processing, spatial analysis, and database management, democratized and greatly expanded the making of maps. The ability to superimpose spatially located variables onto existing maps created new uses for maps and new industries to explore and exploit these potentials. See also digital raster graphic.\n\nThese days most commercial-quality maps are made using software that falls into one of three main types: CAD, GIS and specialized illustration software. Spatial information can be stored in a database, from which it can be extracted on demand. These tools lead to increasingly dynamic, interactive maps that can be manipulated digitally.\n\nField-rugged computers, GPS, and laser rangefinders make it possible to create maps directly from measurements made on site.\n\nDeconstruction\n\nThere are technical and cultural aspects to the producing maps. In this sense, maps are biased. The study of bias, influence, and agenda in making a map is what comprise a map's deconstruction. A central tenet of deconstructionism is that maps have power. Other assertions are that maps are inherently biased and that we search for metaphor and rhetoric in maps.\n\nIt was the Europeans who promoted an epistemological understanding of the map as early as the 17th century.[http://quod.lib.umich.edu/p/passages/4761530.0003.008/--deconstructing-the-map?rgn\nmain;viewfulltext Harley, J. B. (1989). \"Deconstructing the Map\". Cartographica, Vol. 26, No. 2. pp 1-5] An example of this understanding is that, \"[European reproduction of terrain on maps] reality can be expressed in mathematical terms; that systematic observation and measurement offer the only route to cartographic truth…\". 17th century map-makers were careful and precise in their strategic approaches to maps based on a scientific model of knowledge. Popular belief at the time was that this scientific approach to cartography was immune to the social atmosphere.\n\nA common belief is that science heads in a direction of progress, and thus leads to more accurate representations of maps. In this belief European maps must be superior to others, which necessarily employed different map-making skills. \"There was a 'not cartography' land where lurked an army of inaccurate, heretical, subjective, valuative, and ideologically distorted images. Cartographers developed a 'sense of the other' in relation to nonconforming maps.\"\n\nThough cartography has been a target of much criticism in recent decades, a cartographer's 'black box' always seemed to be naturally defended to the point where it overcame the criticism. However, to later scholars in the field, it was evident that cultural influences dominate map-making. For instance, certain abstracts on maps and the map-making society itself describe the social influences on the production of maps. This social play on cartographic knowledge \"…produces the 'order' of [maps'] features and the 'hierarchies of its practices.'\"Michel Foucault, The Order of Things: An Archaeology of the Human Sciences. A Translation of Les mots et les choses. New York: Vintage Books, 1973.\n\nDepictions of Africa are a common target of deconstructionism.Stone, Jeffrey C. (1988). \"Imperialism, Colonialism and Cartography\". Transactions of the Institute of British Geographers, N.S. 13. Pp 57. According to deconstructionist models, cartography was used for strategic purposes associated with imperialism and as instruments and representations of powerBassett, J. T. (1994). \"Cartography and Empire Building in the Nineteenth-Century West Africa\". Geographical Review, Vol. 84, No. 3. Pp 316. during the conquest of Africa. The depiction of Africa and the low latitudes in general on the Mercator projection has been interpreted as imperialistic and as symbolic of subjugation due to the diminished proportions of those regions compared to higher latitudes where the European powers were concentrated.Monmonier, Mark (2004). Rhumb Lines and Map Wars: A Social History of the Mercator Projection p. 152. Chicago: The University of Chicago Press. (Thorough treatment of the social history of the Mercator projection and Gall–Peters projections.)\n\nMaps furthered imperialism and colonization of Africa through practical ways such as showing basic information like roads, terrain, natural resources, settlements, and communities. Through this, maps made European commerce in Africa possible by showing potential commercial routes, and made natural resource extraction possible by depicting locations of resources. Such maps also enabled military conquests and made them more efficient, and imperial nations further used them to put their conquests on display. These same maps were then used to cement territorial claims, such as at the Berlin Conference of 1884–1885.\n\nBefore 1749, maps of the African continent had African kingdoms drawn with assumed or contrived boundaries, with unknown or unexplored areas having drawings of animals, imaginary physical geographic features, and descriptive texts. In 1748 Jean B. B. d'Anville created the first map of the African continent that had blank spaces to represent the unknown territory. This was revolutionary in cartography and the representation of power associated with map making.\n\nMap types\n\nGeneral vs. thematic cartography\n\nIn understanding basic maps, the field of cartography can be divided into two general categories: general cartography and thematic cartography. General cartography involves those maps that are constructed for a general audience and thus contain a variety of features. General maps exhibit many reference and location systems and often are produced in a series. For example, the 1:24,000 scale topographic maps of the United States Geological Survey (USGS) are a standard as compared to the 1:50,000 scale Canadian maps. The government of the UK produces the classic 1:50,000 (replacing the older 1 inch to 1 mile) \"Ordnance Survey\" maps of the entire UK and with a range of correlated larger- and smaller-scale maps of great detail. Many private mapping companies have also produce thematic map series.\n\nThematic cartography involves maps of specific geographic themes, oriented toward specific audiences. A couple of examples might be a dot map showing corn production in Indiana or a shaded area map of Ohio counties, divided into numerical choropleth classes. As the volume of geographic data has exploded over the last century, thematic cartography has become increasingly useful and necessary to interpret spatial, cultural and social data.\n\nAn orienteering map combines both general and thematic cartography, designed for a very specific user community. The most prominent thematic element is shading, that indicates degrees of difficulty of travel due to vegetation. The vegetation itself is not identified, merely classified by the difficulty (\"fight\") that it presents.\n\nTopographic vs. topological\n\nA topographic map is primarily concerned with the topographic description of a place, including (especially in the 20th and 21st centuries) the use of contour lines showing elevation. Terrain or relief can be shown in a variety of ways (see Cartographic relief depiction).\n\nA topological map is a very general type of map, the kind one might sketch on a napkin. It often disregards scale and detail in the interest of clarity of communicating specific route or relational information. Beck's London Underground map is an iconic example. Though the most widely used map of \"The Tube,\" it preserves little of reality: it varies scale constantly and abruptly, it straightens curved tracks, and it contorts directions. The only topography on it is the River Thames, letting the reader know whether a station is north or south of the river. That and the topology of station order and interchanges between train lines are all that is left of the geographic space. Yet those are all a typical passenger wishes to know, so the map fulfils its purpose.\n\nMap design\n\nMap purpose and selection of information\n\nArthur H. Robinson, an American cartographer influential in thematic cartography, stated that a map not properly designed \"will be a cartographic failure.\" He also claimed, when considering all aspects of cartography, that \"map design is perhaps the most complex.\" Robinson codified the mapmaker's understanding that a map must be designed foremost with consideration to the audience and its needs.\n\nFrom the very beginning of mapmaking, maps \"have been made for some particular purpose or set of purposes\". The intent of the map should be illustrated in a manner in which the percipient acknowledges its purpose in a timely fashion. The term percipient refers to the person receiving information and was coined by Robinson. The principle of figure-ground refers to this notion of engaging the user by presenting a clear presentation, leaving no confusion concerning the purpose of the map. This will enhance the user's experience and keep his attention. If the user is unable to identify what is being demonstrated in a reasonable fashion, the map may be regarded as useless.\n\nMaking a meaningful map is the ultimate goal. Alan MacEachren explains that a well designed map \"is convincing because it implies authenticity\" (1994, pp. 9). An interesting map will no doubt engage a reader. Information richness or a map that is multivariate shows relationships within the map. Showing several variables allows comparison, which adds to the meaningfulness of the map. This also generates hypothesis and stimulates ideas and perhaps further research. In order to convey the message of the map, the creator must design it in a manner which will aid the reader in the overall understanding of its purpose. The title of a map may provide the \"needed link\" necessary for communicating that message, but the overall design of the map fosters the manner in which the reader interprets it (Monmonier, 1993, pp. 93).\n\nIn the 21st century it is possible to find a map of virtually anything from the inner workings of the human body to the virtual worlds of cyberspace. Therefore, there are now a huge variety of different styles and types of map – for example, one area which has evolved a specific and recognisable variation are those used by public transport organisations to guide passengers, namely urban rail and metro maps, many of which are loosely based on 45 degree angles as originally perfected by Harry Beck and George Dow.\n\nNaming conventions\n\nMost maps use text to label places and for such things as the map title, legend and other information. Although maps are often made in one specific language, place names often differ between languages. So a map made in English may use the name Germany for that country, while a German map would use Deutschland and a French map Allemagne. A non-native term for a place is referred to as an exonym.\n\nIn some cases the correct name is not clear. For example, the nation of Burma officially changed its name to Myanmar, but many nations do not recognize the ruling junta and continue to use Burma. Sometimes an official name change is resisted in other languages and the older name may remain in common use. Examples include the use of Saigon for Ho Chi Minh City, Bangkok for Krung Thep and Ivory Coast for Côte d'Ivoire.\n\nDifficulties arise when transliteration or transcription between writing systems is required. Some well-known places have well-established names in other languages and writing systems, such as Russia or Rußland for Росси́я, but in other cases a system of transliteration or transcription is required. Even in the former case, the exclusive use of an exonym may be unhelpful for the map user. It will not be much use for an English user of a map of Italy to show Livorno only as \"Leghorn\" when road signs and railway timetables show it as \"Livorno\". In transliteration, the characters in one script are represented by characters in another. For example, the Cyrillic letter Р is usually written as R in the Latin script, although in many cases it is not as simple as a one-for-one equivalence. Systems exist for transliteration of Arabic, but the results may vary. For example, the Yemeni city of Mocha is written variously in English as Mocha, Al Mukha, al-Mukhā, Mocca and Moka. Transliteration systems are based on relating written symbols to one another, while transcription is the attempt to spell in one language the phonetic sounds of another. Chinese writing is now usually converted to the Latin alphabet through the Pinyin phonetic transcription systems. Other systems were used in the past, such as Wade-Giles, resulting in the city being spelled Beijing on newer English maps and Peking on older ones.\n\nFurther difficulties arise when countries, especially former colonies, do not have a strong national geographic naming standard. In such cases, cartographers may have to choose between various phonetic spellings of local names versus older imposed, sometimes resented, colonial names. Some countries have multiple official languages, resulting in multiple official placenames. For example, the capital of Belgium is both Brussel and Bruxelles. In Canada, English and French are official languages and places have names in both languages. British Columbia is also officially named la Colombie-Britannique. English maps rarely show the French names outside of Quebec, which itself is spelled Québec in French.\n\nThe study of placenames is called toponymy, while that of the origin and historical usage of placenames as words is etymology.\n\nIn order to improve legibility or to aid the illiterate, some maps have been produced using pictograms to represent places. The iconic example of this practice is Lance Wyman's early plans for the Mexico City Metro, on which stations were shown simply as stylized logos. Wyman also prototyped such a map for the Washington Metro, though ultimately the idea was rejected. Other cities experimenting with such maps are Fukuoka, Guadalajara and Monterrey.\n\nMap symbology\n\nCartographic symbology encodes information on the map in ways intended to convey information to the map reader efficiently, taking into consideration the limited space on the map, models of human understanding through visual means, and the likely cultural background and education of the map reader. Symbology may be implicit, using universal elements of design, or may be more specific to cartography or even to the map.\n\nA map may have any of many kinds of symbolization. Some examples are:\n* A legend, or key, explains the map's pictorial language.\n* A title indicates the region and perhaps the theme that the map portrays.\n* A neatline frames the entire map image.\n* A compass rose or north arrow provides orientation.\n* An overview map gives global context for the primary map.\n* A bar scale translates between map measurements and real distances.\n* A map projection provides a way to represent the curved surface on the plane of the map.\n\nThe map may declare its sources, accuracy, publication date and authorship, and so forth. The map image itself portrays the region.\n\nMap coloring is another form of symbology, one whose importance can reach beyond aesthetic. In complex thematic maps, for example, the color scheme's structure can critically affect the reader's ability to understand the map's information. Modern computer displays and print technologies can reproduce much of the gamut that humans can perceive, allowing for intricate exploitation of human visual discrimination in order to convey detailed information.\n\nQuantitative symbols give a visual indication of the magnitude of the phenomenon that the symbol represents. Two major classes of symbols are used to portray quantity. Proportional symbols change size according to phenomenon’s magnitude, making them appropriate for representing statistics. Choropleth maps portray data collection areas, such as counties or census tracts, with color. Using color this way, the darkness and intensity (or value) of the color is evaluated by the eye as a measure of intensity or concentration.\n\nMap key or legend\n\nThe map key, or legend, describes how to interpret the map's symbols and may give details of publication and authorship.\n\nExamples of point symbols\n\nMap generalization\n\nA good map has to compromise between portraying the items of interest (or themes) in the right place on the map, and the need to show that item using text or a symbol, which take up space on the map and might displace some other item of information. The cartographer is thus constantly making judgements about what to include, what to leave out and what to show in a slightly incorrect place. This issue assumes more importance as the scale of the map gets smaller (i.e. the map shows a larger area) because the information shown on the map takes up more space on the ground. A good example from the late 1980s was the Ordnance Survey's first digital maps, where the absolute positions of major roads were sometimes a scale distance of hundreds of metres away from ground truth, when shown on digital maps at scales of 1:250,000 and 1:625,000, because of the overriding need to annotate the features.\n\nMap projections\n\nThe Earth being spherical, any flat representation generates distortions such that shapes and areas cannot both be conserved simultaneously, and distances can never all be preserved. The mapmaker must choose a suitable map projection according to the space to be mapped and the purpose of the map.\n\nCartographic errors\n\nSome maps contain deliberate errors or distortions, either as propaganda or as a \"watermark\" to help the copyright owner identify infringement if the error appears in competitors' maps. The latter often come in the form of nonexistent, misnamed, or misspelled \"trap streets\". Other names and forms for this are paper townsites, fictitious entries, and copyright easter eggs.[http://wiki.openstreetmap.org/wiki/Copyright_Easter_Eggs Openstreetmap.org Copyright Easter Eggs]\n\nAnother motive for deliberate errors is cartographic \"vandalism\": a mapmaker wishing to leave his or her mark on the work. Mount Richard, for example, was a fictitious peak on the Rocky Mountains' continental divide that appeared on a Boulder County, Colorado map in the early 1970s. It is believed to be the work of draftsman Richard Ciacci. The fiction was not discovered until two years later.\n\nSandy Island (New Caledonia) is an example of a fictitious location that stubbornly survives, reappearing on new maps copied from older maps while being deleted from other new editions. Cartography. http://en.wikipedia.org/?curid=7294."
  }
}
